Reference Library
Degree Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2dFitData »Degree
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Degree { get; }
Public ReadOnly Property Degree As Integer
	Get
public:
property int Degree {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)