Reference Library
Font Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TextStyleTableRecord »Font
 Declaration Syntax
C# | Visual Basic | Visual C++
public FontDescriptor Font { get; set; }
Public Property Font As FontDescriptor
	Get
	Set
public:
property FontDescriptor Font {
	FontDescriptor get ();
	void set (FontDescriptor value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)