Reference Library
Variable Property
Namespaces »ZwSoft.ZwCAD.LayerManager »RelationalExpression »Variable
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Variable { get; }
Public ReadOnly Property Variable As String
	Get
public:
property String^ Variable {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)