Reference Library
StartRoundCap Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MlineStyle »StartRoundCap
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool StartRoundCap { get; set; }
Public Property StartRoundCap As Boolean
	Get
	Set
public:
property bool StartRoundCap {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)