Reference Library
WritePrivateSection Method (sectionName, data)
Namespaces »ZwSoft.ZwCAD.Publishing »AboutToBeginBackgroundPublishingEventArgs »WritePrivateSection(String, IDictionaryEnumerator)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void WritePrivateSection(
	string sectionName,
	IDictionaryEnumerator data
)
Public Sub WritePrivateSection ( _
	sectionName As String, _
	data As IDictionaryEnumerator _
)
public:
void WritePrivateSection(
	String^ sectionName,
	IDictionaryEnumerator^ data
)
 Parameters
sectionName(String)
data(IDictionaryEnumerator)
Assembly: ZwManaged (Module: ZwManaged)