Reference Library
Vertex Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Vertex
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbVertex")]
public class Vertex : Entity
<WrapperAttribute("AcDbVertex")> _
Public Class Vertex _
	Inherits Entity
[WrapperAttribute(L"AcDbVertex")]
public ref class Vertex : public Entity
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Vertex(IntPtr, Boolean)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Vertex
|  |  |  |  |  |  | FaceRecord
|  |  |  |  |  |  | PolyFaceMeshVertex
|  |  |  |  |  |  | PolygonMeshVertex
|  |  |  |  |  |  | PolylineVertex3d
|  |  |  |  |  |  | Vertex2d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)