Reference Library
MediaBounds Structure
Namespaces »ZwSoft.ZwCAD.PlottingServices »MediaBounds
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct MediaBounds
Public Structure MediaBounds
public value class MediaBounds
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
MediaBounds(Point2d, Point2d, Point2d)
Equality(MediaBounds, MediaBounds)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
Inequality(MediaBounds, MediaBounds)
IsEqualTo(MediaBounds, Tolerance)
IsEqualTo(MediaBounds)
LowerLeftPrintableArea
PageSize
ToString(IFormatProvider)
ToString() |  (Overrides ValueType.ToString().)
UpperRightPrintableArea
Assembly: ZwManaged (Module: ZwManaged)