Reference Library
SetAlignment Method (align, rowTypes)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetAlignment(CellAlignment, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetAlignment(
	CellAlignment align,
	int rowTypes
)
Public Overridable Sub SetAlignment ( _
	align As CellAlignment, _
	rowTypes As Integer _
)
public:
virtual void SetAlignment(
	CellAlignment align,
	int rowTypes
)
 Parameters
align(CellAlignment)
rowTypes(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)