Reference Library
TrueColor Property
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor »TrueColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public int TrueColor { get; }
Public ReadOnly Property TrueColor As Integer
	Get
public:
property int TrueColor {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)