Reference Library
UnderlayLayerState Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayLayerState
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("OdUnderlayLayer::State")]
public enum UnderlayLayerState
<WrapperAttribute("OdUnderlayLayer::State")> _
Public Enumeration UnderlayLayerState
[WrapperAttribute(L"OdUnderlayLayer::State")]
public enum class UnderlayLayerState
 Members
Member | Description
Off
On
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)