Reference Library
IsColinearTo Method (line)
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity2d »IsColinearTo(LinearEntity2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsColinearTo(
	LinearEntity2d line
)
Public Function IsColinearTo ( _
	line As LinearEntity2d _
) As Boolean
public:
bool IsColinearTo(
	LinearEntity2d^ line
)
 Parameters
line(LinearEntity2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)