Reference Library
PromptIntegerOptionsEventArgs Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptIntegerOptionsEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PromptIntegerOptionsEventArgs : EventArgs
Public NotInheritable Class PromptIntegerOptionsEventArgs _
	Inherits EventArgs
public ref class PromptIntegerOptionsEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Options
 Inheritance Hierarchy
Object
EventArgs
| PromptIntegerOptionsEventArgs
Assembly: ZwManaged (Module: ZwManaged)