Reference Library
Set Method (min, max)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Extents3d »Set(Point3d, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	Point3d min,
	Point3d max
)
Public Sub Set ( _
	min As Point3d, _
	max As Point3d _
)
public:
void Set(
	Point3d min,
	Point3d max
)
 Parameters
min(Point3d)
max(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)