Reference Library
PlotInfo Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »BeginPageEventArgs »PlotInfo
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlotInfo PlotInfo { get; }
Public ReadOnly Property PlotInfo As PlotInfo
	Get
public:
property PlotInfo^ PlotInfo {
	PlotInfo^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)