Reference Library
FromRgb Method (red, green, blue)
Namespaces »ZwSoft.ZwCAD.Colors »Color »FromRgb(Byte, Byte, Byte)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Color FromRgb(
	byte red,
	byte green,
	byte blue
)
Public Shared Function FromRgb ( _
	red As Byte, _
	green As Byte, _
	blue As Byte _
) As Color
public:
static Color^ FromRgb(
	unsigned char red,
	unsigned char green,
	unsigned char blue
)
 Parameters
red(Byte)
green(Byte)
blue(Byte)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)