Reference Library
ContentType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ContentType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbMLeaderStyle::ContentType")]
public enum ContentType
<WrapperAttribute("ZcDbMLeaderStyle::ContentType")> _
Public Enumeration ContentType
[WrapperAttribute(L"ZcDbMLeaderStyle::ContentType")]
public enum class ContentType
 Members
Member | Description
ToleranceContent
MTextContent
BlockContent
NoneContent
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)