Reference Library
SetFitPointAt Method (index, point)
Namespaces »ZwSoft.ZwCAD.Geometry »CubicSplineCurve2d »SetFitPointAt(Int32, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFitPointAt(
	int index,
	Point2d point
)
Public Sub SetFitPointAt ( _
	index As Integer, _
	point As Point2d _
)
public:
void SetFitPointAt(
	int index,
	Point2d point
)
 Parameters
index(Int32)
point(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)