Reference Library
ViewDirection Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Viewport »ViewDirection
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Vector3d ViewDirection { get; }
Public Overridable ReadOnly Property ViewDirection As Vector3d
	Get
public:
virtual property Vector3d ViewDirection {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)