Reference Library
IsCancelled Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishEntityEventArgs »IsCancelled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsCancelled { get; }
Public ReadOnly Property IsCancelled As Boolean
	Get
public:
property bool IsCancelled {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)