Reference Library
DoDragDrop Method (control, data, allowedEffects, target)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »DoDragDrop(Control, Object, DragDropEffects, DropTarget)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static void DoDragDrop(
	Control control,
	Object data,
	DragDropEffects allowedEffects,
	DropTarget target
)
Public Shared Sub DoDragDrop ( _
	control As Control, _
	data As Object, _
	allowedEffects As DragDropEffects, _
	target As DropTarget _
)
public:
static void DoDragDrop(
	Control^ control,
	Object^ data,
	DragDropEffects allowedEffects,
	DropTarget^ target
)
 Parameters
control(Control)
data(Object)
allowedEffects(DragDropEffects)
target(DropTarget)
Assembly: ZwManaged (Module: ZwManaged)