Reference Library
GetTangent Method (pointValue, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc3d »GetTangent(Point3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Line3d GetTangent(
	Point3d pointValue,
	Tolerance tolerance
)
Public Function GetTangent ( _
	pointValue As Point3d, _
	tolerance As Tolerance _
) As Line3d
public:
Line3d^ GetTangent(
	Point3d pointValue,
	Tolerance tolerance
)
 Parameters
pointValue(Point3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)