Reference Library
LayoutRenamed Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »LayoutRenamed
 Declaration Syntax
C# | Visual Basic | Visual C++
public event LayoutRenamedEventHandler LayoutRenamed
Public Event LayoutRenamed As LayoutRenamedEventHandler
public:
 event LayoutRenamedEventHandler^ LayoutRenamed {
	void add (LayoutRenamedEventHandler^ value);
	void remove (LayoutRenamedEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)