Reference Library
DsdEntryCollection Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdEntryCollection »DsdEntryCollection(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DsdEntryCollection(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Public Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
public:
DsdEntryCollection(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwManaged (Module: ZwManaged)