Reference Library
IntegerCollection Class
Namespaces »ZwSoft.ZwCAD.Geometry »IntegerCollection
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeIntArray")]
public class IntegerCollection : DisposableWrapper,
	IList
<WrapperAttribute("ZcGeIntArray")> _
Public Class IntegerCollection _
	Inherits DisposableWrapper _
	Implements IList
[WrapperAttribute(L"ZcGeIntArray")]
public ref class IntegerCollection : public DisposableWrapper,
	IList
 Members
All Members | Constructors | Methods | Properties | Fields
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
IntegerCollection(Int32)
IntegerCollection(Int32[])
IntegerCollection()
Add(Int32)
AddRange(Int32[])
Capacity
Clear()
Contains(Int32)
CopyTo(Int32[], Int32)
Count
DefaultSize
DeleteUnmanagedObject() |  (Overrides DisposableWrapper.DeleteUnmanagedObject().)
GetEnumerator()
ICollection.CopyTo(Array, Int32)
IEnumerable.GetEnumerator()
IList.Add(Object)
IList.Contains(Object)
IList.IndexOf(Object)
IList.Insert(Int32, Object)
IList.Item[Int32]
IList.Remove(Object)
IndexOf(Int32)
Insert(Int32, Int32)
IsFixedSize
IsReadOnly
IsSynchronized
Item[Int32]
Remove(Int32)
RemoveAt(Int32)
SyncRoot
ToArray()
TrimToSize()
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | IntegerCollection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)