Reference Library
TypeCode Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TypedValue »TypeCode
 Declaration Syntax
C# | Visual Basic | Visual C++
public short TypeCode { get; }
Public ReadOnly Property TypeCode As Short
	Get
public:
property short TypeCode {
	short get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)