Reference Library
Section Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Section »Section()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Section()
Public Sub New
public:
Section()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)