Reference Library
FullDwgVersion Structure
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FullDwgVersion
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct FullDwgVersion
Public Structure FullDwgVersion
public value class FullDwgVersion
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
FullDwgVersion(DwgVersion, MaintenanceReleaseVersion)
Equality(FullDwgVersion, FullDwgVersion)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
Inequality(FullDwgVersion, FullDwgVersion)
MajorVersion
MinorVersion
ToString() |  (Overrides ValueType.ToString().)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)