Reference Library
BoundBlock Property
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »BoundBlock
 Declaration Syntax
C# | Visual Basic | Visual C++
public BoundBlock2d BoundBlock { get; }
Public ReadOnly Property BoundBlock As BoundBlock2d
	Get
public:
property BoundBlock2d^ BoundBlock {
	BoundBlock2d^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)