Reference Library
Ray3d Class
Namespaces »ZwSoft.ZwCAD.Geometry »Ray3d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeRay3d")]
public sealed class Ray3d : LinearEntity3d
<WrapperAttribute("ZcGeRay3d")> _
Public NotInheritable Class Ray3d _
	Inherits LinearEntity3d
[WrapperAttribute(L"ZcGeRay3d")]
public ref class Ray3d sealed : public LinearEntity3d
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Ray3d(Point3d, Vector3d)
Ray3d(Point3d, Point3d)
Ray3d()
Create(IntPtr, Boolean)
Set(Point3d, Vector3d)
Set(Point3d, Point3d)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity3d
|  |  | Curve3d
|  |  |  | LinearEntity3d
|  |  |  |  | Ray3d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)