Reference Library
MapChannel Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MapChannel
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiVertexData::MapChannel")]
public enum MapChannel
<WrapperAttribute("ZcGiVertexData::MapChannel")> _
Public Enumeration MapChannel
[WrapperAttribute(L"ZcGiVertexData::MapChannel")]
public enum class MapChannel
 Members
Member | Description
MapChannels
AllChannels
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)