Reference Library
Scale2d Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Scale2d »Scale2d()
 Members
Icon | Member | Description
Scale2d(Double, Double)
Scale2d(Double)
Scale2d(Double[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)