Reference Library
MapFilter Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MapFilter
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiMaterialMap::Filter")]
public enum MapFilter
<WrapperAttribute("ZcGiMaterialMap::Filter")> _
Public Enumeration MapFilter
[WrapperAttribute(L"ZcGiMaterialMap::Filter")]
public enum class MapFilter
 Members
Member | Description
Default
None
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)