Reference Library
ScaleFactor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweepOptions »ScaleFactor
 Declaration Syntax
C# | Visual Basic | Visual C++
public double ScaleFactor { get; }
Public ReadOnly Property ScaleFactor As Double
	Get
public:
property double ScaleFactor {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)