Reference Library
NameAt Method (objId)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »NameAt(ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string NameAt(
	ObjectId objId
)
Public Overridable Function NameAt ( _
	objId As ObjectId _
) As String
public:
virtual String^ NameAt(
	ObjectId objId
)
 Parameters
objId(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)