Reference Library
SetColors Method (colors)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeData »SetColors(Int16[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetColors(
	short[] colors
)
Public Sub SetColors ( _
	colors As Short() _
)
public:
void SetColors(
	array<short>^ colors
)
 Parameters
colors(Int16[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)