Reference Library
Erase Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »Erase()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Erase()
Public Sub Erase
public:
void Erase()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)