Reference Library
FinalGatheringEnabled Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraits »FinalGatheringEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool FinalGatheringEnabled { get; set; }
Public MustOverride Property FinalGatheringEnabled As Boolean
	Get
	Set
public:
virtual property bool FinalGatheringEnabled {
	bool get () abstract;
	void set (bool value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)