Reference Library
PromptingForString Event
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »PromptingForString
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PromptStringOptionsEventHandler PromptingForString
Public Event PromptingForString As PromptStringOptionsEventHandler
public:
 event PromptStringOptionsEventHandler^ PromptingForString {
	void add (PromptStringOptionsEventHandler^ value);
	void remove (PromptStringOptionsEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)