Reference Library
ExtrudedSurface Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ExtrudedSurface »ExtrudedSurface()
 Members
Icon | Member | Description
ExtrudedSurface()
ExtrudedSurface(IntPtr, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)