Reference Library
DynamicDimensionData Constructor (dimension, editable)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicDimensionData »DynamicDimensionData(Dimension, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DynamicDimensionData(
	Dimension dimension,
	bool editable
)
Public Sub New ( _
	dimension As Dimension, _
	editable As Boolean _
)
public:
DynamicDimensionData(
	Dimension^ dimension,
	bool editable
)
 Parameters
dimension(Dimension)
editable(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)