Reference Library
PromptNestedEntityOptions Constructor (messageAndKeywords, globalKeywords)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptNestedEntityOptions »PromptNestedEntityOptions(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptNestedEntityOptions(
	string messageAndKeywords,
	string globalKeywords
)
Public Sub New ( _
	messageAndKeywords As String, _
	globalKeywords As String _
)
public:
PromptNestedEntityOptions(
	String^ messageAndKeywords,
	String^ globalKeywords
)
 Parameters
messageAndKeywords(String)
globalKeywords(String)
Assembly: ZwManaged (Module: ZwManaged)