Reference Library
PromptDoubleResultEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDoubleResultEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void PromptDoubleResultEventHandler(
	Object sender,
	PromptDoubleResultEventArgs e
)
Public Delegate Sub PromptDoubleResultEventHandler ( _
	sender As Object, _
	e As PromptDoubleResultEventArgs _
)
public delegate void PromptDoubleResultEventHandler(
	Object^ sender,
	PromptDoubleResultEventArgs^ e
)
 Parameters
sender(Object)
e(PromptDoubleResultEventArgs)
Assembly: ZwManaged (Module: ZwManaged)