Reference Library
ImageOrg Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ImageOrg
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum ImageOrg
Public Enumeration ImageOrg
public enum class ImageOrg
 Members
Member | Description
RGB
BGR
ABGR
ARGB
BGRA
RGBA
Palette
Bitonal
Gray
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)