Reference Library
FilingOption Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Field »FilingOption
 Declaration Syntax
C# | Visual Basic | Visual C++
public FieldFilingOptions FilingOption { get; set; }
Public Property FilingOption As FieldFilingOptions
	Get
	Set
public:
property FieldFilingOptions FilingOption {
	FieldFilingOptions get ();
	void set (FieldFilingOptions value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)