Reference Library
BlockReference Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockReference
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbBlockReference")]
public class BlockReference : Entity
<WrapperAttribute("AcDbBlockReference")> _
Public Class BlockReference _
	Inherits Entity
[WrapperAttribute(L"AcDbBlockReference")]
public ref class BlockReference : public Entity
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
BlockReference(Point3d, ObjectId)
AnonymousBlockTableRecord
AttributeCollection
BlockTableRecord
BlockTransform
BlockUnit
ConvertToStaticBlock(String)
ConvertToStaticBlock()
Dispose(Boolean) |  (Overrides DBObject.Dispose(Boolean).)
DynamicBlockReferencePropertyCollection
DynamicBlockTableRecord
ExplodeToOwnerSpace()
GeometryExtentsBestFit(Matrix3d)
GeometryExtentsBestFit()
IsDynamicBlock
Name
Normal
Position
ResetBlock()
Rotation
ScaleFactors
TreatAsBlockRefForExplode
UnitFactor
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | BlockReference
|  |  |  |  |  |  | MInsertBlock
|  |  |  |  |  |  | Table
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)