Reference Library
Layout Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdEntry »Layout
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Layout { get; set; }
Public Property Layout As String
	Get
	Set
public:
property String^ Layout {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwManaged (Module: ZwManaged)