Reference Library
MinimumRowHeight Method (row)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »MinimumRowHeight(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double MinimumRowHeight(
	int row
)
Public Overridable Function MinimumRowHeight ( _
	row As Integer _
) As Double
public:
virtual double MinimumRowHeight(
	int row
)
 Parameters
row(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)