Reference Library
InsertAt Method (index, id)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »InsertAt(Int32, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void InsertAt(
	int index,
	ObjectId id
)
Public Sub InsertAt ( _
	index As Integer, _
	id As ObjectId _
)
public:
void InsertAt(
	int index,
	ObjectId id
)
 Parameters
index(Int32)
id(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)