Reference Library
SpatialFilterDefinition Structure
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »SpatialFilterDefinition
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct SpatialFilterDefinition
Public Structure SpatialFilterDefinition
public value class SpatialFilterDefinition
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
SpatialFilterDefinition(Point2dCollection, Vector3d, Double, Double, Double, Boolean)
BackClip
Elevation
Enabled
FrontClip
GetPoints()
Normal
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)