Reference Library
DeepCloneAborted Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »DeepCloneAborted
 Declaration Syntax
C# | Visual Basic | Visual C++
public event EventHandler DeepCloneAborted
Public Event DeepCloneAborted As EventHandler
public:
 event EventHandler^ DeepCloneAborted {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)