Reference Library
IsTextStyleStandardName Method (name)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »IsTextStyleStandardName(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool IsTextStyleStandardName(
	string name
)
Public Shared Function IsTextStyleStandardName ( _
	name As String _
) As Boolean
public:
static bool IsTextStyleStandardName(
	String^ name
)
 Parameters
name(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)