Reference Library
Add Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GraphNodeCollection »Add(GraphNode)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Add(
	GraphNode value
)
Public Function Add ( _
	value As GraphNode _
) As Integer
public:
int Add(
	GraphNode^ value
)
 Parameters
value(GraphNode)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)