Reference Library
LayerStateManager Constructor (database)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »LayerStateManager(Database)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerStateManager(
	Database database
)
Public Sub New ( _
	database As Database _
)
public:
LayerStateManager(
	Database^ database
)
 Parameters
database(Database)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)