Reference Library
Current Property
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2dCollectionEnumerator »Current
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Vector2d Current { get; }
Public Overridable ReadOnly Property Current As Vector2d
	Get
public:
virtual property Vector2d Current {
	Vector2d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)