Reference Library
BasePoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweepOptions »BasePoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d BasePoint { get; }
Public ReadOnly Property BasePoint As Point3d
	Get
public:
property Point3d BasePoint {
	Point3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)