Reference Library
SelectEverythingInAperture Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionOptions »SelectEverythingInAperture
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool SelectEverythingInAperture { get; set; }
Public Property SelectEverythingInAperture As Boolean
	Get
	Set
public:
property bool SelectEverythingInAperture {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)