Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayItemCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public UnderlayItem this[
	int index
] { get; }
Public ReadOnly Default Property Item ( _
	index As Integer _
) As UnderlayItem
	Get
public:
property UnderlayItem^ default[int index] {
	UnderlayItem^ get (int index);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)