Reference Library
StartDraftDist Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweepOptionsBuilder »StartDraftDist
 Declaration Syntax
C# | Visual Basic | Visual C++
public double StartDraftDist { get; set; }
Public Property StartDraftDist As Double
	Get
	Set
public:
property double StartDraftDist {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)