Reference Library
Polyline2d Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline2d »Polyline2d()
 Members
Icon | Member | Description
Polyline2d(Poly2dType, Point3dCollection, Double, Boolean, Double, Double, DoubleCollection)
Polyline2d()
Polyline2d(IntPtr, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)