Reference Library
Dimdli Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimdli
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public virtual double Dimdli { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Overridable Property Dimdli As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
virtual property double Dimdli {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)