Reference Library
Status Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »EndPageEventArgs »Status
 Declaration Syntax
C# | Visual Basic | Visual C++
public SheetCancelStatus Status { get; }
Public ReadOnly Property Status As SheetCancelStatus
	Get
public:
property SheetCancelStatus Status {
	SheetCancelStatus get ();
}
Assembly: ZwManaged (Module: ZwManaged)