Reference Library
TabbedDialogAction Delegate
Namespaces »ZwSoft.ZwCAD.ApplicationServices »TabbedDialogAction
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void TabbedDialogAction()
Public Delegate Sub TabbedDialogAction
public delegate void TabbedDialogAction()
Assembly: ZwManaged (Module: ZwManaged)