Reference Library
GetControlPointAt Method (index)
Namespaces »ZwSoft.ZwCAD.Geometry »SplineEntity2d »GetControlPointAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d GetControlPointAt(
	int index
)
Public Function GetControlPointAt ( _
	index As Integer _
) As Point2d
public:
Point2d GetControlPointAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)