Reference Library
GetBlockPaperSpaceId Method (databasePointer)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »GetBlockPaperSpaceId(Database)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static ObjectId GetBlockPaperSpaceId(
	Database databasePointer
)
Public Shared Function GetBlockPaperSpaceId ( _
	databasePointer As Database _
) As ObjectId
public:
static ObjectId GetBlockPaperSpaceId(
	Database^ databasePointer
)
 Parameters
databasePointer(Database)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)