Reference Library
Dimfrac Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimfrac
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Dimfrac { get; set; }
Public Overridable Property Dimfrac As Integer
	Get
	Set
public:
virtual property int Dimfrac {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)