Reference Library
Dispose Method
Namespaces »ZwSoft.ZwCAD.EditorInput »EditorUserInteraction »Dispose()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Dispose()
Public Sub Dispose
public:
virtual void Dispose() sealed
Assembly: ZwManaged (Module: ZwManaged)