Reference Library
ProxyResurrectionCompletedEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ProxyResurrectionCompletedEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void ProxyResurrectionCompletedEventHandler(
	Object sender,
	ProxyResurrectionCompletedEventArgs e
)
Public Delegate Sub ProxyResurrectionCompletedEventHandler ( _
	sender As Object, _
	e As ProxyResurrectionCompletedEventArgs _
)
public delegate void ProxyResurrectionCompletedEventHandler(
	Object^ sender,
	ProxyResurrectionCompletedEventArgs^ e
)
 Parameters
sender(Object)
e(ProxyResurrectionCompletedEventArgs)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)