Reference Library
CurveCurveIntersector3d Constructor (curve1, curve2, range1, range2, planeNormal, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »CurveCurveIntersector3d »CurveCurveIntersector3d(Curve3d, Curve3d, Interval, Interval, Vector3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CurveCurveIntersector3d(
	Curve3d curve1,
	Curve3d curve2,
	Interval range1,
	Interval range2,
	Vector3d planeNormal,
	Tolerance tolerance
)
Public Sub New ( _
	curve1 As Curve3d, _
	curve2 As Curve3d, _
	range1 As Interval, _
	range2 As Interval, _
	planeNormal As Vector3d, _
	tolerance As Tolerance _
)
public:
CurveCurveIntersector3d(
	Curve3d^ curve1,
	Curve3d^ curve2,
	Interval^ range1,
	Interval^ range2,
	Vector3d planeNormal,
	Tolerance tolerance
)
 Parameters
curve1(Curve3d)
curve2(Curve3d)
range1(Interval)
range2(Interval)
planeNormal(Vector3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)