Reference Library
Options Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptAngleOptionsEventArgs »Options
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptAngleOptions Options { get; }
Public ReadOnly Property Options As PromptAngleOptions
	Get
public:
property PromptAngleOptions^ Options {
	PromptAngleOptions^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)