Reference Library
ShadowsEnabled Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »RenderSettingsTraits »ShadowsEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool ShadowsEnabled { get; set; }
Public MustOverride Property ShadowsEnabled As Boolean
	Get
	Set
public:
virtual property bool ShadowsEnabled {
	bool get () abstract;
	void set (bool value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)