Reference Library
Origin Property
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »Origin
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Point3d Origin { get; }
Public Shared ReadOnly Property Origin As Point3d
	Get
public:
static property Point3d Origin {
	Point3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)