Reference Library
SheetMediaGroupWeight Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotInfoValidator »SheetMediaGroupWeight
 Declaration Syntax
C# | Visual Basic | Visual C++
public int SheetMediaGroupWeight { get; set; }
Public Property SheetMediaGroupWeight As Integer
	Get
	Set
public:
property int SheetMediaGroupWeight {
	int get ();
	void set (int value);
}
Assembly: ZwManaged (Module: ZwManaged)