Reference Library
Dimdle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimdle
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public virtual double Dimdle { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Overridable Property Dimdle As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
virtual property double Dimdle {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)