Reference Library
IsErased Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectId »IsErased
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsErased { get; }
Public ReadOnly Property IsErased As Boolean
	Get
public:
property bool IsErased {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)