Reference Library
GetKnots Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »NurbsData »GetKnots()
 Declaration Syntax
C# | Visual Basic | Visual C++
public DoubleCollection GetKnots()
Public Function GetKnots As DoubleCollection
public:
DoubleCollection^ GetKnots()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)