Reference Library
DeviceOverride Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotInfo »DeviceOverride
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlotConfig DeviceOverride { get; set; }
Public Property DeviceOverride As PlotConfig
	Get
	Set
public:
property PlotConfig^ DeviceOverride {
	PlotConfig^ get ();
	void set (PlotConfig^ value);
}
Assembly: ZwManaged (Module: ZwManaged)