Reference Library
IsObjectIdsInFlux Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »IsObjectIdsInFlux
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsObjectIdsInFlux { get; }
Public ReadOnly Property IsObjectIdsInFlux As Boolean
	Get
public:
property bool IsObjectIdsInFlux {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)