Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.Colors »EntityColorCollection »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public EntityColorCollectionEnumerator GetEnumerator()
Public Function GetEnumerator As EntityColorCollectionEnumerator
public:
virtual EntityColorCollectionEnumerator^ GetEnumerator() sealed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)