Reference Library
FingerprintGuid Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »FingerprintGuid
 Declaration Syntax
C# | Visual Basic | Visual C++
public string FingerprintGuid { get; set; }
Public Property FingerprintGuid As String
	Get
	Set
public:
property String^ FingerprintGuid {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)