Reference Library
FromZcadObject Method (zcadObj)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »FromZcadObject(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static ObjectId FromZcadObject(
	Object zcadObj
)
Public Shared Function FromZcadObject ( _
	zcadObj As Object _
) As ObjectId
public:
static ObjectId FromZcadObject(
	Object^ zcadObj
)
 Parameters
zcadObj(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)