Reference Library
Units Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockTableRecord »Units
 Declaration Syntax
C# | Visual Basic | Visual C++
public UnitsValue Units { get; set; }
Public Property Units As UnitsValue
	Get
	Set
public:
property UnitsValue Units {
	UnitsValue get ();
	void set (UnitsValue value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)