Reference Library
IsSynchronized Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GraphNodeCollection »IsSynchronized
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual bool IsSynchronized { get; }
Protected Overridable ReadOnly Property IsSynchronized As Boolean
	Get
protected:
virtual property bool IsSynchronized {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)