Reference Library
LinetypeScale Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »LinetypeScale
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LinetypeScale { get; set; }
Public Property LinetypeScale As Double
	Get
	Set
public:
property double LinetypeScale {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)