Reference Library
ExternalSurface Class
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalSurface
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeExternalSurface")]
public sealed class ExternalSurface : Surface
<WrapperAttribute("ZcGeExternalSurface")> _
Public NotInheritable Class ExternalSurface _
	Inherits Surface
[WrapperAttribute(L"ZcGeExternalSurface")]
public ref class ExternalSurface sealed : public Surface
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
ExternalSurface(IntPtr, ExternalEntityKind)
ExternalSurface()
Create(IntPtr, Boolean)
ExternalSurfaceDefiniton
ExternalSurfaceKind
IsCone
IsCylinder
IsDefined
IsNativeSurface
IsNurbSurface
IsOwnerOfSurface
IsPlane
IsSphere
IsTorus
nativeSurface
Set(IntPtr, ExternalEntityKind)
SetToOwnSurface()
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity3d
|  |  | Surface
|  |  |  | ExternalSurface
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)