Reference Library
UpdateDataLink Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »UpdateDataLink()
 Members
Icon | Member | Description
UpdateDataLink(Int32, Int32, UpdateDirection, UpdateOption)
UpdateDataLink(UpdateDirection, UpdateOption)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)