Reference Library
ModelToEyeTransform Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Viewport »ModelToEyeTransform
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Matrix3d ModelToEyeTransform { get; }
Public MustOverride ReadOnly Property ModelToEyeTransform As Matrix3d
	Get
public:
virtual property Matrix3d ModelToEyeTransform {
	Matrix3d get () abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)