Reference Library
PolyFaceMeshVertex Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolyFaceMeshVertex
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbPolyFaceMeshVertex")]
public class PolyFaceMeshVertex : Vertex
<WrapperAttribute("AcDbPolyFaceMeshVertex")> _
Public Class PolyFaceMeshVertex _
	Inherits Vertex
[WrapperAttribute(L"AcDbPolyFaceMeshVertex")]
public ref class PolyFaceMeshVertex : public Vertex
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PolyFaceMeshVertex(Point3d)
PolyFaceMeshVertex()
Position
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Vertex
|  |  |  |  |  |  | PolyFaceMeshVertex
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)