Reference Library
OriginalInverseBlockTransform Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »SpatialFilter »OriginalInverseBlockTransform
 Declaration Syntax
C# | Visual Basic | Visual C++
public Matrix3d OriginalInverseBlockTransform { get; }
Public ReadOnly Property OriginalInverseBlockTransform As Matrix3d
	Get
public:
property Matrix3d OriginalInverseBlockTransform {
	Matrix3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)