Reference Library
Surface1Left Property
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersectorConfigurations »Surface1Left
 Declaration Syntax
C# | Visual Basic | Visual C++
public SurfaceSurfaceIntersectorConfiguration Surface1Left { get; }
Public ReadOnly Property Surface1Left As SurfaceSurfaceIntersectorConfiguration
	Get
public:
property SurfaceSurfaceIntersectorConfiguration Surface1Left {
	SurfaceSurfaceIntersectorConfiguration get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)