Reference Library
BeginDxfOut Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »BeginDxfOut
 Declaration Syntax
C# | Visual Basic | Visual C++
public event EventHandler BeginDxfOut
Public Event BeginDxfOut As EventHandler
public:
 event EventHandler^ BeginDxfOut {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)