Reference Library
GetTrueColors Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeData »GetTrueColors()
 Declaration Syntax
C# | Visual Basic | Visual C++
public EntityColor[] GetTrueColors()
Public Function GetTrueColors As EntityColor()
public:
array<EntityColor>^ GetTrueColors()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)