Reference Library
AcquireString Method (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »JigPrompts »AcquireString(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptResult AcquireString(
	string message
)
Public Function AcquireString ( _
	message As String _
) As PromptResult
public:
PromptResult^ AcquireString(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)