Reference Library
Feature Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FileDependencyInfo »Feature
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Feature { get; }
Public ReadOnly Property Feature As String
	Get
public:
property String^ Feature {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)