Reference Library
Dispose Method ()
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockReference »Dispose(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
[HandleProcessCorruptedStateExceptionsAttribute]
protected override void Dispose(
	bool
)
<HandleProcessCorruptedStateExceptionsAttribute> _
Protected Overrides Sub Dispose ( _
	 As Boolean _
)
[HandleProcessCorruptedStateExceptionsAttribute]
protected:
virtual void Dispose(
	bool
) override
 Parameters
(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)