Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.Colors »EntityColorCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual EntityColor this[
	int index
] { get; set; }
Public Overridable Default Property Item ( _
	index As Integer _
) As EntityColor
	Get
	Set
public:
virtual property EntityColor default[int index] {
	EntityColor get (int index);
	void set (int index, EntityColor value);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)