Reference Library
TrueColor Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »SubEntityTraits »TrueColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract EntityColor TrueColor { get; set; }
Public MustOverride Property TrueColor As EntityColor
	Get
	Set
public:
virtual property EntityColor TrueColor {
	EntityColor get () abstract;
	void set (EntityColor value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)