Reference Library
snapshotId Field
Namespaces »ZwSoft.ZwCAD.ApplicationServices »MgdUndoCommandInfo »snapshotId
 Declaration Syntax
C# | Visual Basic | Visual C++
public int snapshotId
Public snapshotId As Integer
public:
int snapshotId
Assembly: ZwManaged (Module: ZwManaged)