Reference Library
LayoutMarginMaxY Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »LayoutMarginMaxY
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LayoutMarginMaxY { get; }
Public ReadOnly Property LayoutMarginMaxY As Double
	Get
public:
property double LayoutMarginMaxY {
	double get ();
}
Assembly: ZwManaged (Module: ZwManaged)