Reference Library
PolylineCurve3d Constructor (knots, controlPoints)
Namespaces »ZwSoft.ZwCAD.Geometry »PolylineCurve3d »PolylineCurve3d(KnotCollection, Point3dCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PolylineCurve3d(
	KnotCollection knots,
	Point3dCollection controlPoints
)
Public Sub New ( _
	knots As KnotCollection, _
	controlPoints As Point3dCollection _
)
public:
PolylineCurve3d(
	KnotCollection^ knots,
	Point3dCollection^ controlPoints
)
 Parameters
knots(KnotCollection)
controlPoints(Point3dCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)