Reference Library
SetShadePlot Method (type, shadePlotId)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »SetShadePlot(ShadePlotType, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetShadePlot(
	ShadePlotType type,
	ObjectId shadePlotId
)
Public Sub SetShadePlot ( _
	type As ShadePlotType, _
	shadePlotId As ObjectId _
)
public:
void SetShadePlot(
	ShadePlotType type,
	ObjectId shadePlotId
)
 Parameters
type(ShadePlotType)
shadePlotId(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)