Reference Library
MentalRayRenderSettingsTraitsDoubleRangeParameter Constructor (a, b)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraitsDoubleRangeParameter »MentalRayRenderSettingsTraitsDoubleRangeParameter(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public MentalRayRenderSettingsTraitsDoubleRangeParameter(
	double a,
	double b
)
Public Sub New ( _
	a As Double, _
	b As Double _
)
public:
MentalRayRenderSettingsTraitsDoubleRangeParameter(
	double a,
	double b
)
 Parameters
a(Double)
b(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)