Reference Library
PlotStyleNameId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »PlotStyleNameId
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlotStyleDescriptor PlotStyleNameId { get; set; }
Public Property PlotStyleNameId As PlotStyleDescriptor
	Get
	Set
public:
property PlotStyleDescriptor PlotStyleNameId {
	PlotStyleDescriptor get ();
	void set (PlotStyleDescriptor value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)