Reference Library
TextStyleStandardName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »TextStyleStandardName
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string TextStyleStandardName { get; }
Public Shared ReadOnly Property TextStyleStandardName As String
	Get
public:
static property String^ TextStyleStandardName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)