Reference Library
LightAttenuation Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »LightAttenuation
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiLightAttenuation")]
public sealed class LightAttenuation : RXObject
<WrapperAttribute("ZcGiLightAttenuation")> _
Public NotInheritable Class LightAttenuation _
	Inherits RXObject
[WrapperAttribute(L"ZcGiLightAttenuation")]
public ref class LightAttenuation sealed : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
LightAttenuation()
AttenuationType
EndLimit
Equals(Object) |  (Overrides DisposableWrapper.Equals(Object).)
GetHashCode() |  (Overrides DisposableWrapper.GetHashCode().)
SetLimits(Double, Double)
StartLimit
UseLimits
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | LightAttenuation
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)