Reference Library
TableFillOptions Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableFillOptions
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum TableFillOptions
Public Enumeration TableFillOptions
public enum class TableFillOptions
 Members
Member | Description
OverwriteReadOnlyFormat
OverwriteReadOnlyContent
CopyFormat
CopyContent
GenerateSeries
Reverse
Row
None
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)