Reference Library
Dispose Method ()
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionSet »Dispose(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual void Dispose(
	bool
)
Protected Overridable Sub Dispose ( _
	 As Boolean _
)
protected:
virtual void Dispose(
	bool
)
 Parameters
(Boolean)
Assembly: ZwManaged (Module: ZwManaged)