Reference Library
EndPageEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.PlottingServices »EndPageEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void EndPageEventHandler(
	Object sender,
	EndPageEventArgs e
)
Public Delegate Sub EndPageEventHandler ( _
	sender As Object, _
	e As EndPageEventArgs _
)
public delegate void EndPageEventHandler(
	Object^ sender,
	EndPageEventArgs^ e
)
 Parameters
sender(Object)
e(EndPageEventArgs)
Assembly: ZwManaged (Module: ZwManaged)