Reference Library
Row Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Row
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class Row : CellRange
Public NotInheritable Class Row _
	Inherits CellRange
public ref class Row sealed : public CellRange
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Height
MinimumHeight
 Inheritance Hierarchy
Object
CellRange
| Row
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)