Reference Library
WorldGeometry Constructor
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »WorldGeometry »WorldGeometry()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected WorldGeometry()
Protected Sub New
protected:
WorldGeometry()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)