Reference Library
NegativeHalfSurface Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SurfaceSliceResults »NegativeHalfSurface
 Declaration Syntax
C# | Visual Basic | Visual C++
public Surface NegativeHalfSurface { get; set; }
Public Property NegativeHalfSurface As Surface
	Get
	Set
public:
property Surface^ NegativeHalfSurface {
	Surface^ get ();
	void set (Surface^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)