Reference Library
AddLeader Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »AddLeader()
 Declaration Syntax
C# | Visual Basic | Visual C++
public int AddLeader()
Public Function AddLeader As Integer
public:
int AddLeader()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)