Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2dData »Inequality(NurbCurve2dData, NurbCurve2dData)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	NurbCurve2dData a,
	NurbCurve2dData b
)
Public Shared Operator <> ( _
	a As NurbCurve2dData, _
	b As NurbCurve2dData _
) As Boolean
public:
static bool operator !=(
	NurbCurve2dData a,
	NurbCurve2dData b
)
 Parameters
a(NurbCurve2dData)
b(NurbCurve2dData)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)