Reference Library
FieldEvaluator Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldEvaluator
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("OdFdFieldEvaluator")]
public abstract class FieldEvaluator : RXObject
<WrapperAttribute("OdFdFieldEvaluator")> _
Public MustInherit Class FieldEvaluator _
	Inherits RXObject
[WrapperAttribute(L"OdFdFieldEvaluator")]
public ref class FieldEvaluator abstract : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
FieldEvaluator()
Compile(Field, Database, FieldResult)
Evaluate(Field, Int32, Database, FieldResult)
EvaluatorId(Field)
EvaluatorId()
Format(Field)
Initialize(Field)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | FieldEvaluator
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)