Reference Library
GetArea Method (startParameter, endParameter)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »GetArea(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetArea(
	double startParameter,
	double endParameter
)
Public Function GetArea ( _
	startParameter As Double, _
	endParameter As Double _
) As Double
public:
double GetArea(
	double startParameter,
	double endParameter
)
 Parameters
startParameter(Double)
endParameter(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)