Reference Library
NurbCurve3dFitData Structure
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3dFitData
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct NurbCurve3dFitData
Public Structure NurbCurve3dFitData
public value class NurbCurve3dFitData
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Degree
EndTangent
Equality(NurbCurve3dFitData, NurbCurve3dFitData)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
FitPoints
FitTolerance
GetHashCode() |  (Overrides ValueType.GetHashCode().)
Inequality(NurbCurve3dFitData, NurbCurve3dFitData)
IsEqualTo(NurbCurve3dFitData)
KnotParam
StartTangent
TangentsExist
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)