Reference Library
IncludeByBlockByLayer Property
Namespaces »ZwSoft.ZwCAD.Windows »LineWeightDialog »IncludeByBlockByLayer
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IncludeByBlockByLayer { get; set; }
Public Property IncludeByBlockByLayer As Boolean
	Get
	Set
public:
property bool IncludeByBlockByLayer {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)