Reference Library
SetBlockRotation Method (row, col, rotationalAngle)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetBlockRotation(Int32, Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetBlockRotation(
	int row,
	int col,
	double rotationalAngle
)
Public Overridable Sub SetBlockRotation ( _
	row As Integer, _
	col As Integer, _
	rotationalAngle As Double _
)
public:
virtual void SetBlockRotation(
	int row,
	int col,
	double rotationalAngle
)
 Parameters
row(Int32)
col(Int32)
rotationalAngle(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)