Reference Library
DictionaryWithDefaultDictionary Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DictionaryWithDefaultDictionary
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbDictionaryWithDefault")]
public class DictionaryWithDefaultDictionary : DBDictionary
<WrapperAttribute("AcDbDictionaryWithDefault")> _
Public Class DictionaryWithDefaultDictionary _
	Inherits DBDictionary
[WrapperAttribute(L"AcDbDictionaryWithDefault")]
public ref class DictionaryWithDefaultDictionary : public DBDictionary
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DictionaryWithDefaultDictionary()
DictionaryWithDefaultDictionary(IntPtr, Boolean)
DefaultId
ObjectBirthVersion |  (Overrides DBObject.ObjectBirthVersion.)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | DBDictionary
|  |  |  |  |  | DictionaryWithDefaultDictionary
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)