Reference Library
SouthPole Property
Namespaces »ZwSoft.ZwCAD.Geometry »Sphere »SouthPole
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d SouthPole { get; }
Public ReadOnly Property SouthPole As Point3d
	Get
public:
property Point3d SouthPole {
	Point3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)