Reference Library
Activated Property
Namespaces »ZwSoft.ZwCAD.Windows »PaletteActivatedEventArgs »Activated
 Declaration Syntax
C# | Visual Basic | Visual C++
public Palette Activated { get; }
Public ReadOnly Property Activated As Palette
	Get
public:
property Palette^ Activated {
	Palette^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)