Reference Library
SetTrackKerning Method (trackPercent)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »TextStyle »SetTrackKerning(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetTrackKerning(
	double trackPercent
)
Public Sub SetTrackKerning ( _
	trackPercent As Double _
)
public:
void SetTrackKerning(
	double trackPercent
)
 Parameters
trackPercent(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)