Reference Library
Capacity Property
Namespaces »ZwSoft.ZwCAD.Geometry »IntPtrCollection »Capacity
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Capacity { get; set; }
Public Property Capacity As Integer
	Get
	Set
public:
property int Capacity {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)