Reference Library
GetFieldCode Method (flags)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Field »GetFieldCode(FieldCodeFlags)
 Declaration Syntax
C# | Visual Basic | Visual C++
public string GetFieldCode(
	FieldCodeFlags flags
)
Public Function GetFieldCode ( _
	flags As FieldCodeFlags _
) As String
public:
String^ GetFieldCode(
	FieldCodeFlags flags
)
 Parameters
flags(FieldCodeFlags)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)