Reference Library
Invalidate Method
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »Invalidate()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Invalidate()
Public Sub Invalidate
public:
void Invalidate()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)