Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3dFitData »Inequality(NurbCurve3dFitData, NurbCurve3dFitData)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	NurbCurve3dFitData a,
	NurbCurve3dFitData b
)
Public Shared Operator <> ( _
	a As NurbCurve3dFitData, _
	b As NurbCurve3dFitData _
) As Boolean
public:
static bool operator !=(
	NurbCurve3dFitData a,
	NurbCurve3dFitData b
)
 Parameters
a(NurbCurve3dFitData)
b(NurbCurve3dFitData)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)