Reference Library
DefaultSize Field
Namespaces »ZwSoft.ZwCAD.Geometry »IntegerCollection »DefaultSize
 Declaration Syntax
C# | Visual Basic | Visual C++
public const int DefaultSize
Public Const DefaultSize As Integer
public:
literal int DefaultSize
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)