Reference Library
EffectivePlotOffsetX Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »EffectivePlotOffsetX
 Declaration Syntax
C# | Visual Basic | Visual C++
public double EffectivePlotOffsetX { get; }
Public ReadOnly Property EffectivePlotOffsetX As Double
	Get
public:
property double EffectivePlotOffsetX {
	double get ();
}
Assembly: ZwManaged (Module: ZwManaged)