Reference Library
ShowModalWindow Method (formToShow)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »ShowModalWindow(Window)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Nullable<bool> ShowModalWindow(
	Window formToShow
)
Public Shared Function ShowModalWindow ( _
	formToShow As Window _
) As Nullable(Of Boolean)
public:
static Nullable<bool> ShowModalWindow(
	Window^ formToShow
)
 Parameters
formToShow(Window)
Assembly: ZwManaged (Module: ZwManaged)