Reference Library
ZwSoft.ZwCAD.PlottingServices Namespace
Namespaces »ZwSoft.ZwCAD.PlottingServices
 Declaration Syntax
C# | Visual Basic | Visual C++
namespace ZwSoft.ZwCAD.PlottingServices
Namespace ZwSoft.ZwCAD.PlottingServices
namespace ZwSoft.ZwCAD.PlottingServices
 Types
All Types | Classes | Structures | Enumerations | Delegates
Icon | Type | Description
AppPlotStatus
BeginDocumentEventArgs
BeginDocumentEventHandler
BeginPageEventArgs
BeginPageEventHandler
BeginPlotEventArgs
BeginPlotEventHandler
CustomSizeResults
DeviceType
DsdData
DsdEntry
DsdEntryCollection
DsdEntryCollectionEnumerator
EndDocumentEventArgs
EndDocumentEventHandler
EndPageEventArgs
EndPageEventHandler
EndPlotEventArgs
EndPlotEventHandler
HostAppServices
MatchingPolicy
MediaBounds
MergeStatus
PageCancelledEventHandler
PlotCancelledEventHandler
PlotCancelStatus
PlotConfig
PlotConfigManager
PlotEngine
PlotFactory
PlotInfo
PlotInfoValidator
PlotLogger
PlotMessageIndex
PlotPageInfo
PlotProgress
PlotProgressDialog
PlotReactorManager
PlotToFileCapability
PlotType
PreviewEndPlotInfo
PreviewEndPlotStatus
PreviewEngineFlags
ProcessPlotState
RefreshCode
SheetCancelStatus
SheetType
StdConfiguration