Reference Library
Spline Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Spline »Spline()
 Members
Icon | Member | Description
Spline(Int32, Boolean, Boolean, Boolean, Point3dCollection, DoubleCollection, DoubleCollection, Double, Double)
Spline(Point3d, Vector3d, Vector3d, Double, Double, Double)
Spline(Point3dCollection, Vector3d, Vector3d, Int32, Double)
Spline(Point3dCollection, Int32, Double)
Spline()
Spline(IntPtr, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)