Reference Library
TrimToSize Method
Namespaces »ZwSoft.ZwCAD.Geometry »IntegerCollection »TrimToSize()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void TrimToSize()
Public Overridable Sub TrimToSize
public:
virtual void TrimToSize()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)