Reference Library
SetFitPointAt Method (index, point)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »SetFitPointAt(Int32, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool SetFitPointAt(
	int index,
	Point2d point
)
Public Function SetFitPointAt ( _
	index As Integer, _
	point As Point2d _
) As Boolean
public:
bool SetFitPointAt(
	int index,
	Point2d point
)
 Parameters
index(Int32)
point(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)