Reference Library
Focal Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicDimensionData »Focal
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Focal { get; set; }
Public Property Focal As Boolean
	Get
	Set
public:
property bool Focal {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)