Reference Library
GetFitPoints Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FitData »GetFitPoints()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3dCollection GetFitPoints()
Public Function GetFitPoints As Point3dCollection
public:
Point3dCollection^ GetFitPoints()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)