Reference Library
AddDBObject Method (appendIt)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »AddDBObject(DBObject)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId AddDBObject(
	DBObject appendIt
)
Public Function AddDBObject ( _
	appendIt As DBObject _
) As ObjectId
public:
ObjectId AddDBObject(
	DBObject^ appendIt
)
 Parameters
appendIt(DBObject)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)