Reference Library
PaletteSetShowDockBarEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSetShowDockBarEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void PaletteSetShowDockBarEventHandler(
	Object sender,
	PaletteShowDockBarEventArgs e
)
Public Delegate Sub PaletteSetShowDockBarEventHandler ( _
	sender As Object, _
	e As PaletteShowDockBarEventArgs _
)
public delegate void PaletteSetShowDockBarEventHandler(
	Object^ sender,
	PaletteShowDockBarEventArgs^ e
)
 Parameters
sender(Object)
e(PaletteShowDockBarEventArgs)
Assembly: ZwManaged (Module: ZwManaged)