Reference Library
DictionaryKeyLength Property
Namespaces »ZwSoft.ZwCAD.Colors »Color »DictionaryKeyLength
 Declaration Syntax
C# | Visual Basic | Visual C++
public int DictionaryKeyLength { get; }
Public ReadOnly Property DictionaryKeyLength As Integer
	Get
public:
property int DictionaryKeyLength {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)