Reference Library
Position2d Class
Namespaces »ZwSoft.ZwCAD.Geometry »Position2d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGePosition2d")]
public sealed class Position2d : PointEntity2d
<WrapperAttribute("ZcGePosition2d")> _
Public NotInheritable Class Position2d _
	Inherits PointEntity2d
[WrapperAttribute(L"ZcGePosition2d")]
public ref class Position2d sealed : public PointEntity2d
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Position2d(Double, Double)
Position2d(Point2d)
Position2d()
Create(IntPtr, Boolean)
Set(Double, Double)
Set(Point2d)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity2d
|  |  | PointEntity2d
|  |  |  | Position2d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)