Reference Library
BeginPlotEventArgs Constructor (progress, plotType)
Namespaces »ZwSoft.ZwCAD.PlottingServices »BeginPlotEventArgs »BeginPlotEventArgs(PlotProgress, PlotType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public BeginPlotEventArgs(
	PlotProgress progress,
	PlotType plotType
)
Public Sub New ( _
	progress As PlotProgress, _
	plotType As PlotType _
)
public:
BeginPlotEventArgs(
	PlotProgress^ progress,
	PlotType plotType
)
 Parameters
progress(PlotProgress)
plotType(PlotType)
Assembly: ZwManaged (Module: ZwManaged)