Reference Library
ImpDevice Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ImpDevice »ImpDevice(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal ImpDevice(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
protected public:
ImpDevice(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)