Reference Library
HatchAngle Method (nSecType, nGeometry)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »HatchAngle(SectionType, SectionGeometry)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double HatchAngle(
	SectionType nSecType,
	SectionGeometry nGeometry
)
Public Function HatchAngle ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry _
) As Double
public:
double HatchAngle(
	SectionType nSecType,
	SectionGeometry nGeometry
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)