Reference Library
TableStyleOverrides Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »TableStyleOverrides()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual TableStyleOverride[] TableStyleOverrides()
Public Overridable Function TableStyleOverrides As TableStyleOverride()
public:
virtual array<TableStyleOverride>^ TableStyleOverrides()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)