Reference Library
Equals Method (obj)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3dData »Equals(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed bool Equals(
	Object obj
)
Public Overrides NotOverridable Function Equals ( _
	obj As Object _
) As Boolean
public:
virtual bool Equals(
	Object^ obj
) override sealed
 Parameters
obj(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)