Reference Library
ObjectOpenedForModify Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »ObjectOpenedForModify
 Declaration Syntax
C# | Visual Basic | Visual C++
public event ObjectEventHandler ObjectOpenedForModify
Public Event ObjectOpenedForModify As ObjectEventHandler
public:
 event ObjectEventHandler^ ObjectOpenedForModify {
	void add (ObjectEventHandler^ value);
	void remove (ObjectEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)