Reference Library
LayerFilter Class
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerFilter
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("OdLyLayerFilter")]
public class LayerFilter : RXObject
<WrapperAttribute("OdLyLayerFilter")> _
Public Class LayerFilter _
	Inherits RXObject
[WrapperAttribute(L"OdLyLayerFilter")]
public ref class LayerFilter : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
LayerFilter()
AllowDelete
AllowNested
AllowRename
CompareTo(LayerFilter)
DynamicallyGenerated
Filter(LayerTableRecord)
FilterExpression
GenerateNested()
GetFilterExpressionTree()
IsIdFilter
IsProxy
Name
NestedFilters
Parent
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | LayerFilter
|  |  |  | LayerGroup
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)