Reference Library
TaperFaces Method (subentityIds, basePoint, draftVector, draftAngle)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »TaperFaces(SubentityId[], Point3d, Vector3d, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void TaperFaces(
	SubentityId[] subentityIds,
	Point3d basePoint,
	Vector3d draftVector,
	double draftAngle
)
Public Overridable Sub TaperFaces ( _
	subentityIds As SubentityId(), _
	basePoint As Point3d, _
	draftVector As Vector3d, _
	draftAngle As Double _
)
public:
virtual void TaperFaces(
	array<SubentityId>^ subentityIds,
	Point3d basePoint,
	Vector3d draftVector,
	double draftAngle
)
 Parameters
subentityIds(SubentityId[])
basePoint(Point3d)
draftVector(Vector3d)
draftAngle(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)