Reference Library
DeletesObjects Property
Namespaces »ZwSoft.ZwCAD.Runtime »Dictionary »DeletesObjects
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool DeletesObjects { get; }
Public Overridable ReadOnly Property DeletesObjects As Boolean
	Get
public:
virtual property bool DeletesObjects {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)