Reference Library
IndexOf Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BulgeVertexCollection »IndexOf(BulgeVertex)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int IndexOf(
	BulgeVertex value
)
Public Function IndexOf ( _
	value As BulgeVertex _
) As Integer
public:
int IndexOf(
	BulgeVertex^ value
)
 Parameters
value(BulgeVertex)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)