Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3dCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Vector3d this[
	int index
] { get; set; }
Public Overridable Default Property Item ( _
	index As Integer _
) As Vector3d
	Get
	Set
public:
virtual property Vector3d default[int index] {
	Vector3d get (int index);
	void set (int index, Vector3d value);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)