Reference Library
DatabaseSummaryInfoBuilder Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DatabaseSummaryInfoBuilder »DatabaseSummaryInfoBuilder()
 Members
Icon | Member | Description
DatabaseSummaryInfoBuilder(DatabaseSummaryInfo)
DatabaseSummaryInfoBuilder()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)