Reference Library
Dimalt Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimalt
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Dimalt { get; set; }
Public Property Dimalt As Boolean
	Get
	Set
public:
property bool Dimalt {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)