Reference Library
GetXDataForApplication Method (applicationName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »GetXDataForApplication(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ResultBuffer GetXDataForApplication(
	string applicationName
)
Public Function GetXDataForApplication ( _
	applicationName As String _
) As ResultBuffer
public:
ResultBuffer^ GetXDataForApplication(
	String^ applicationName
)
 Parameters
applicationName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)