Reference Library
TextHeight Method (row, col)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »TextHeight(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double TextHeight(
	int row,
	int col
)
Public Overridable Function TextHeight ( _
	row As Integer, _
	col As Integer _
) As Double
public:
virtual double TextHeight(
	int row,
	int col
)
 Parameters
row(Int32)
col(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)