Reference Library
PromptAngleOptionsEventArgs Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptAngleOptionsEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PromptAngleOptionsEventArgs : EventArgs
Public NotInheritable Class PromptAngleOptionsEventArgs _
	Inherits EventArgs
public ref class PromptAngleOptionsEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Options
 Inheritance Hierarchy
Object
EventArgs
| PromptAngleOptionsEventArgs
Assembly: ZwManaged (Module: ZwManaged)