Reference Library
WarningHasHappenedInJob Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotLogger »WarningHasHappenedInJob
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool WarningHasHappenedInJob { get; }
Public ReadOnly Property WarningHasHappenedInJob As Boolean
	Get
public:
property bool WarningHasHappenedInJob {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)