Reference Library
SetUcs Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AbstractViewTableRecord »SetUcs()
 Members
Icon | Member | Description
SetUcs(Point3d, Vector3d, Vector3d)
SetUcs(OrthographicView)
SetUcs(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)