Reference Library
NumRowsPhysicalSize Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataTable »NumRowsPhysicalSize
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumRowsPhysicalSize { get; set; }
Public Property NumRowsPhysicalSize As Integer
	Get
	Set
public:
property int NumRowsPhysicalSize {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)