Reference Library
DiametricDimension Constructor (chordPoint, farChordPoint, leaderLength, dimensionText, dimensionStyle)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DiametricDimension »DiametricDimension(Point3d, Point3d, Double, String, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DiametricDimension(
	Point3d chordPoint,
	Point3d farChordPoint,
	double leaderLength,
	string dimensionText,
	ObjectId dimensionStyle
)
Public Sub New ( _
	chordPoint As Point3d, _
	farChordPoint As Point3d, _
	leaderLength As Double, _
	dimensionText As String, _
	dimensionStyle As ObjectId _
)
public:
DiametricDimension(
	Point3d chordPoint,
	Point3d farChordPoint,
	double leaderLength,
	String^ dimensionText,
	ObjectId dimensionStyle
)
 Parameters
chordPoint(Point3d)
farChordPoint(Point3d)
leaderLength(Double)
dimensionText(String)
dimensionStyle(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)