Reference Library
Negate Method
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »Negate()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d Negate()
Public Function Negate As Vector3d
public:
Vector3d Negate()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)