Reference Library
AtPut Method (id, value)
Namespaces »ZwSoft.ZwCAD.Runtime »Dictionary »AtPut(Int32, RXObject)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual RXObject AtPut(
	int id,
	RXObject value
)
Public Overridable Function AtPut ( _
	id As Integer, _
	value As RXObject _
) As RXObject
public:
virtual RXObject^ AtPut(
	int id,
	RXObject^ value
)
 Parameters
id(Int32)
value(RXObject)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)