Reference Library
BeginQuit Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »BeginQuit
 Declaration Syntax
C# | Visual Basic | Visual C++
public static event EventHandler BeginQuit
Public Shared Event BeginQuit As EventHandler
public:
static  event EventHandler^ BeginQuit {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)