Reference Library
IsEqualTo Method (a)
Namespaces »ZwSoft.ZwCAD.Geometry »Scale2d »IsEqualTo(Scale2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	Scale2d a
)
Public Function IsEqualTo ( _
	a As Scale2d _
) As Boolean
public:
bool IsEqualTo(
	Scale2d a
)
 Parameters
a(Scale2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)