Reference Library
Pinsbase Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Pinsbase
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d Pinsbase { get; set; }
Public Property Pinsbase As Point3d
	Get
	Set
public:
property Point3d Pinsbase {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)