Reference Library
GetMinimumPoint Method
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock3d »GetMinimumPoint()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d GetMinimumPoint()
Public Function GetMinimumPoint As Point3d
public:
Point3d GetMinimumPoint()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)