Reference Library
IsVortex Property
Namespaces »ZwSoft.ZwCAD.Geometry »Torus »IsVortex
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsVortex { get; }
Public ReadOnly Property IsVortex As Boolean
	Get
public:
property bool IsVortex {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)