Reference Library
GetTangent Method (point)
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc2d »GetTangent(Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Line2d GetTangent(
	Point2d point
)
Public Function GetTangent ( _
	point As Point2d _
) As Line2d
public:
Line2d^ GetTangent(
	Point2d point
)
 Parameters
point(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)