Reference Library
Kind Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PickPointDescriptor »Kind
 Declaration Syntax
C# | Visual Basic | Visual C++
public PickPointKind Kind { get; }
Public ReadOnly Property Kind As PickPointKind
	Get
public:
property PickPointKind Kind {
	PickPointKind get ();
}
Assembly: ZwManaged (Module: ZwManaged)