Reference Library
StringToDistance Method (value)
Namespaces »ZwSoft.ZwCAD.Runtime »Converter »StringToDistance(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static double StringToDistance(
	string value
)
Public Shared Function StringToDistance ( _
	value As String _
) As Double
public:
static double StringToDistance(
	String^ value
)
 Parameters
value(String)
Assembly: ZwManaged (Module: ZwManaged)