Reference Library
Options Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDistanceOptionsEventArgs »Options
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDistanceOptions Options { get; }
Public ReadOnly Property Options As PromptDistanceOptions
	Get
public:
property PromptDistanceOptions^ Options {
	PromptDistanceOptions^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)