Reference Library
ViewChanged Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »ViewChanged
 Declaration Syntax
C# | Visual Basic | Visual C++
public event EventHandler ViewChanged
Public Event ViewChanged As EventHandler
public:
 event EventHandler^ ViewChanged {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)