Reference Library
GetSegmentLength Method (fromParameter, toParameter)
Namespaces »ZwSoft.ZwCAD.Geometry »LineSegment2d »GetSegmentLength(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetSegmentLength(
	double fromParameter,
	double toParameter
)
Public Function GetSegmentLength ( _
	fromParameter As Double, _
	toParameter As Double _
) As Double
public:
double GetSegmentLength(
	double fromParameter,
	double toParameter
)
 Parameters
fromParameter(Double)
toParameter(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)