Reference Library
DataColumn Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataColumn »DataColumn()
 Declaration Syntax
C# | Visual Basic | Visual C++
public DataColumn()
Public Sub New
public:
DataColumn()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)