Reference Library
Longitude Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Longitude
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Longitude { get; set; }
Public Property Longitude As Double
	Get
	Set
public:
property double Longitude {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)