Reference Library
Dispose Method
Namespaces »ZwSoft.ZwCAD.Geometry »CompositeCurve2d »Dispose()
 Members
Icon | Member | Description
Dispose(Boolean)
Dispose()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)