Reference Library
IsEqualTo Method (a)
Namespaces »ZwSoft.ZwCAD.Geometry »ClipBoundary2dData »IsEqualTo(ClipBoundary2dData)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	ClipBoundary2dData a
)
Public Function IsEqualTo ( _
	a As ClipBoundary2dData _
) As Boolean
public:
bool IsEqualTo(
	ClipBoundary2dData a
)
 Parameters
a(ClipBoundary2dData)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)