Reference Library
SetField Method (propertyName, field)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »SetField(String, Field)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId SetField(
	string propertyName,
	Field field
)
Public Function SetField ( _
	propertyName As String, _
	field As Field _
) As ObjectId
public:
ObjectId SetField(
	String^ propertyName,
	Field^ field
)
 Parameters
propertyName(String)
field(Field)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)