Reference Library
WriteHandle Method (opCode, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DxfFiler »WriteHandle(DxfCode, Handle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void WriteHandle(
	DxfCode opCode,
	Handle value
)
Public MustOverride Sub WriteHandle ( _
	opCode As DxfCode, _
	value As Handle _
)
public:
virtual void WriteHandle(
	DxfCode opCode,
	Handle value
) abstract
 Parameters
opCode(DxfCode)
value(Handle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)