Reference Library
LeaderLineType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »LeaderLineType
 Declaration Syntax
C# | Visual Basic | Visual C++
public LeaderType LeaderLineType { get; set; }
Public Property LeaderLineType As LeaderType
	Get
	Set
public:
property LeaderType LeaderLineType {
	LeaderType get ();
	void set (LeaderType value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)