Reference Library
ViewWasCreated Event
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Manager »ViewWasCreated
 Declaration Syntax
C# | Visual Basic | Visual C++
public event ViewWasCreatedEventHandler ViewWasCreated
Public Event ViewWasCreated As ViewWasCreatedEventHandler
public:
 event ViewWasCreatedEventHandler^ ViewWasCreated {
	void add (ViewWasCreatedEventHandler^ value);
	void remove (ViewWasCreatedEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)