Reference Library
VisualStyleDictionaryId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »VisualStyleDictionaryId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId VisualStyleDictionaryId { get; }
Public ReadOnly Property VisualStyleDictionaryId As ObjectId
	Get
public:
property ObjectId VisualStyleDictionaryId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)