Reference Library
ReadHardPointerId Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »ReadHardPointerId()
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract ObjectId ReadHardPointerId()
Public MustOverride Function ReadHardPointerId As ObjectId
public:
virtual ObjectId ReadHardPointerId() abstract
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)