Reference Library
Add Method (p)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3dCollection »Add(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Add(
	Point3d p
)
Public Function Add ( _
	p As Point3d _
) As Integer
public:
int Add(
	Point3d p
)
 Parameters
p(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)