Reference Library
JoinWith Method (curve)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »JoinWith(NurbCurve2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void JoinWith(
	NurbCurve2d curve
)
Public Sub JoinWith ( _
	curve As NurbCurve2d _
)
public:
void JoinWith(
	NurbCurve2d^ curve
)
 Parameters
curve(NurbCurve2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)