Reference Library
CreateSweptSolid Method (sweepEntity, pathEntity, sweepOptions)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »CreateSweptSolid(Entity, Entity, SweepOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void CreateSweptSolid(
	Entity sweepEntity,
	Entity pathEntity,
	SweepOptions sweepOptions
)
Public Overridable Sub CreateSweptSolid ( _
	sweepEntity As Entity, _
	pathEntity As Entity, _
	sweepOptions As SweepOptions _
)
public:
virtual void CreateSweptSolid(
	Entity^ sweepEntity,
	Entity^ pathEntity,
	SweepOptions^ sweepOptions
)
 Parameters
sweepEntity(Entity)
pathEntity(Entity)
sweepOptions(SweepOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)