Reference Library
PublishExecute Method (dsdData, plotConfig)
Namespaces »ZwSoft.ZwCAD.Publishing »Publisher »PublishExecute(DsdData, PlotConfig)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void PublishExecute(
	DsdData dsdData,
	PlotConfig plotConfig
)
Public Sub PublishExecute ( _
	dsdData As DsdData, _
	plotConfig As PlotConfig _
)
public:
void PublishExecute(
	DsdData^ dsdData,
	PlotConfig^ plotConfig
)
 Parameters
dsdData(DsdData)
plotConfig(PlotConfig)
Assembly: ZwManaged (Module: ZwManaged)