Reference Library
NurbCurve3d Constructor (fitPoints, fitTolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »NurbCurve3d(Point3dCollection, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public NurbCurve3d(
	Point3dCollection fitPoints,
	Tolerance fitTolerance
)
Public Sub New ( _
	fitPoints As Point3dCollection, _
	fitTolerance As Tolerance _
)
public:
NurbCurve3d(
	Point3dCollection^ fitPoints,
	Tolerance fitTolerance
)
 Parameters
fitPoints(Point3dCollection)
fitTolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)