Reference Library
Cmlscale Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Cmlscale
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Cmlscale { get; set; }
Public Property Cmlscale As Double
	Get
	Set
public:
property double Cmlscale {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)