Reference Library
DwfDefinition Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwfDefinition
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbDwfDefinition")]
public class DwfDefinition : UnderlayDefinition
<WrapperAttribute("AcDbDwfDefinition")> _
Public Class DwfDefinition _
	Inherits UnderlayDefinition
[WrapperAttribute(L"AcDbDwfDefinition")]
public ref class DwfDefinition : public UnderlayDefinition
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DwfDefinition()
DwfDefinition(IntPtr, Boolean)
isDWFx
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | UnderlayDefinition
|  |  |  |  |  | DwfDefinition
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)