Reference Library
WblockNoticeEventArgs Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »WblockNoticeEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class WblockNoticeEventArgs : EventArgs
Public NotInheritable Class WblockNoticeEventArgs _
	Inherits EventArgs
public ref class WblockNoticeEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
To
 Inheritance Hierarchy
Object
EventArgs
| WblockNoticeEventArgs
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)