Reference Library
Plinewid Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Plinewid
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Plinewid { get; set; }
Public Property Plinewid As Double
	Get
	Set
public:
property double Plinewid {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)