Reference Library
GetFile Method (path, password)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayHost »GetFile(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public UnderlayFile GetFile(
	string path,
	string password
)
Public Function GetFile ( _
	path As String, _
	password As String _
) As UnderlayFile
public:
UnderlayFile^ GetFile(
	String^ path,
	String^ password
)
 Parameters
path(String)
password(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)