Reference Library
MakeEdgeInvisibleAt Method (faceIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FaceRecord »MakeEdgeInvisibleAt(Int16)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void MakeEdgeInvisibleAt(
	short faceIndex
)
Public Sub MakeEdgeInvisibleAt ( _
	faceIndex As Short _
)
public:
void MakeEdgeInvisibleAt(
	short faceIndex
)
 Parameters
faceIndex(Int16)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)