Reference Library
GetParametersOfG1Discontinuity Method
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »GetParametersOfG1Discontinuity()
 Declaration Syntax
C# | Visual Basic | Visual C++
public DoubleCollection GetParametersOfG1Discontinuity()
Public Function GetParametersOfG1Discontinuity As DoubleCollection
public:
DoubleCollection^ GetParametersOfG1Discontinuity()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)