Reference Library
ExtensionApplicationAttribute Class
Namespaces »ZwSoft.ZwCAD.Runtime »ExtensionApplicationAttribute
 Declaration Syntax
C# | Visual Basic | Visual C++
[AttributeUsageAttribute(AttributeTargets.Assembly, AllowMultiple = false,
	Inherited = false)]
public sealed class ExtensionApplicationAttribute : Attribute
<AttributeUsageAttribute(AttributeTargets.Assembly, AllowMultiple := False,  _
	Inherited := False)> _
Public NotInheritable Class ExtensionApplicationAttribute _
	Inherits Attribute
[AttributeUsageAttribute(AttributeTargets::Assembly, AllowMultiple = false,
	Inherited = false)]
public ref class ExtensionApplicationAttribute sealed : public Attribute
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
ExtensionApplicationAttribute(Type)
Type
 Inheritance Hierarchy
Object
Attribute
| ExtensionApplicationAttribute
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)