Reference Library
GetUpdateStatus Method (pDir, pTime, errMessage)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataLink »GetUpdateStatus(UpdateDirection, DateTime, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ErrorStatus GetUpdateStatus(
	ref UpdateDirection pDir,
	ref DateTime pTime,
	string errMessage
)
Public Function GetUpdateStatus ( _
	ByRef pDir As UpdateDirection, _
	ByRef pTime As DateTime, _
	errMessage As String _
) As ErrorStatus
public:
ErrorStatus GetUpdateStatus(
	UpdateDirection% pDir,
	DateTime% pTime,
	String^ errMessage
)
 Parameters
pDir(UpdateDirection%)
pTime(DateTime%)
errMessage(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)