Reference Library
Geometry Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »Geometry(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected Geometry(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Protected Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
protected:
Geometry(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)