Reference Library
ColorIndex Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »ColorIndex
 Declaration Syntax
C# | Visual Basic | Visual C++
public int ColorIndex { get; set; }
Public Property ColorIndex As Integer
	Get
	Set
public:
property int ColorIndex {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)