Reference Library
DrawLeaderOrderType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DrawLeaderOrderType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbMLeaderStyle::DrawLeaderOrderType")]
public enum DrawLeaderOrderType
<WrapperAttribute("ZcDbMLeaderStyle::DrawLeaderOrderType")> _
Public Enumeration DrawLeaderOrderType
[WrapperAttribute(L"ZcDbMLeaderStyle::DrawLeaderOrderType")]
public enum class DrawLeaderOrderType
 Members
Member | Description
DrawLeaderTailFirst
DrawLeaderHeadFirst
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)