Reference Library
CurrentContext Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectContextCollection »CurrentContext
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectContext CurrentContext { get; set; }
Public Overridable Property CurrentContext As ObjectContext
	Get
	Set
public:
virtual property ObjectContext^ CurrentContext {
	ObjectContext^ get ();
	void set (ObjectContext^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)