Reference Library
AddLight Method (lightId)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »NonEntityTraits »AddLight(ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed void AddLight(
	ObjectId lightId
)
Public Overrides NotOverridable Sub AddLight ( _
	lightId As ObjectId _
)
public:
virtual void AddLight(
	ObjectId lightId
) override sealed
 Parameters
lightId(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)