Reference Library
Invalidate Method
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »Invalidate()
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void Invalidate()
Public MustOverride Sub Invalidate
public:
virtual void Invalidate() abstract
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)