Reference Library
Shape Constructor (position, size, rotation, widthFactor)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Shape »Shape(Point3d, Double, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Shape(
	Point3d position,
	double size,
	double rotation,
	double widthFactor
)
Public Sub New ( _
	position As Point3d, _
	size As Double, _
	rotation As Double, _
	widthFactor As Double _
)
public:
Shape(
	Point3d position,
	double size,
	double rotation,
	double widthFactor
)
 Parameters
position(Point3d)
size(Double)
rotation(Double)
widthFactor(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)