Reference Library
BeginAggregationEventArgs Class
Namespaces »ZwSoft.ZwCAD.Publishing »BeginAggregationEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public class BeginAggregationEventArgs : EventArgs
Public Class BeginAggregationEventArgs _
	Inherits EventArgs
public ref class BeginAggregationEventArgs : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
AddGlobalPropertyRange(EPlotProperty[])
AddGlobalResourceRange(EPlotResource[])
DwfFileName
DwfPassword
PlotLogger
 Inheritance Hierarchy
Object
EventArgs
| BeginAggregationEventArgs
Assembly: ZwManaged (Module: ZwManaged)