Reference Library
MoveNext Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectIterator »MoveNext()
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool MoveNext()
Public Function MoveNext As Boolean
public:
virtual bool MoveNext() sealed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)