Reference Library
ICollectionCopyTo Method (arr, index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCellCollection »ICollection.CopyTo(Array, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
void ICollection.CopyTo(
	Array arr,
	int index
)
Private Sub ICollectionCopyTo ( _
	arr As Array, _
	index As Integer _
) Implements ICollection.CopyTo
private:
virtual void ICollectionCopyTo(
	Array^ arr,
	int index
) sealed = ICollection::CopyTo
 Parameters
arr(Array)
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)