Reference Library
MyNewMode Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentLockModeWillChangeEventArgs »MyNewMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public DocumentLockMode MyNewMode { get; }
Public ReadOnly Property MyNewMode As DocumentLockMode
	Get
public:
property DocumentLockMode MyNewMode {
	DocumentLockMode get ();
}
Assembly: ZwManaged (Module: ZwManaged)