Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FullDwgVersion »Equality(FullDwgVersion, FullDwgVersion)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	FullDwgVersion ver1,
	FullDwgVersion ver2
)
Public Shared Operator = ( _
	ver1 As FullDwgVersion, _
	ver2 As FullDwgVersion _
) As Boolean
public:
static bool operator ==(
	FullDwgVersion ver1,
	FullDwgVersion ver2
)
 Parameters
ver1(FullDwgVersion)
ver2(FullDwgVersion)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)