Reference Library
LayerGroup Class
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerGroup
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcLyLayerGroup")]
public class LayerGroup : LayerFilter
<WrapperAttribute("AcLyLayerGroup")> _
Public Class LayerGroup _
	Inherits LayerFilter
[WrapperAttribute(L"AcLyLayerGroup")]
public ref class LayerGroup : public LayerFilter
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
LayerGroup()
LayerIds
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | LayerFilter
|  |  |  | LayerGroup
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)