Reference Library
SinglePickInSpace Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionOptions »SinglePickInSpace
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool SinglePickInSpace { get; set; }
Public Property SinglePickInSpace As Boolean
	Get
	Set
public:
property bool SinglePickInSpace {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)