Reference Library
ControlPoints Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3dData »ControlPoints
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3dCollection ControlPoints { get; }
Public ReadOnly Property ControlPoints As Point3dCollection
	Get
public:
property Point3dCollection^ ControlPoints {
	Point3dCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)