Reference Library
BeginWblockBlock Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »BeginWblockBlock
 Declaration Syntax
C# | Visual Basic | Visual C++
public event BeginWblockBlockEventHandler BeginWblockBlock
Public Event BeginWblockBlock As BeginWblockBlockEventHandler
public:
 event BeginWblockBlockEventHandler^ BeginWblockBlock {
	void add (BeginWblockBlockEventHandler^ value);
	void remove (BeginWblockBlockEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)