Reference Library
IsCylinder Property
Namespaces »ZwSoft.ZwCAD.Geometry »OffsetSurface »IsCylinder
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsCylinder { get; }
Public ReadOnly Property IsCylinder As Boolean
	Get
public:
property bool IsCylinder {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)