Reference Library
GetPoint2dAt Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline »GetPoint2dAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d GetPoint2dAt(
	int index
)
Public Function GetPoint2dAt ( _
	index As Integer _
) As Point2d
public:
Point2d GetPoint2dAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)