Reference Library
OldId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefRedirectedEventArgs »OldId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId OldId { get; }
Public ReadOnly Property OldId As ObjectId
	Get
public:
property ObjectId OldId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)