Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CustomScale »Inequality(CustomScale, CustomScale)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	CustomScale a,
	CustomScale b
)
Public Shared Operator <> ( _
	a As CustomScale, _
	b As CustomScale _
) As Boolean
public:
static bool operator !=(
	CustomScale a,
	CustomScale b
)
 Parameters
a(CustomScale)
b(CustomScale)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)