Reference Library
PublishEntityEventArgs Class
Namespaces »ZwSoft.ZwCAD.Publishing »PublishEntityEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public class PublishEntityEventArgs : EventArgs
Public Class PublishEntityEventArgs _
	Inherits EventArgs
public ref class PublishEntityEventArgs : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Add3DDwfProperty(String, String, String)
AddNodeToMap(ObjectId, ObjectIdCollection, Int32)
AddPropertiesIds(EPlotPropertyBag, DwfNode)
AddPropertyBag(EPlotPropertyBag)
Cancel()
EffectiveBlockLayerId
Entity
Flush()
GetCurrentEntityNode(ObjectIdCollection)
getEntityBlockRefPath()
GetEntityNode(ObjectId, ObjectIdCollection)
GetGraphicIDs()
GetNextAvailableNode()
GetNode(Int32)
IsCancelled
PlotLogger
SetCurrentNode(Int32, ObjectIdCollection)
SetNodeName(Int32, String)
UniqueEntityId
 Inheritance Hierarchy
Object
EventArgs
| PublishEntityEventArgs
Assembly: ZwManaged (Module: ZwManaged)