Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2dInfo »Inequality(Matrix2dInfo, Matrix2dInfo)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	Matrix2dInfo a,
	Matrix2dInfo b
)
Public Shared Operator <> ( _
	a As Matrix2dInfo, _
	b As Matrix2dInfo _
) As Boolean
public:
static bool operator !=(
	Matrix2dInfo a,
	Matrix2dInfo b
)
 Parameters
a(Matrix2dInfo)
b(Matrix2dInfo)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)