Reference Library
HorizontalCellMargin Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »HorizontalCellMargin
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double HorizontalCellMargin { get; set; }
Public Overridable Property HorizontalCellMargin As Double
	Get
	Set
public:
virtual property double HorizontalCellMargin {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)