Reference Library
StatusBar Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »StatusBar
 Declaration Syntax
C# | Visual Basic | Visual C++
public StatusBar StatusBar { get; }
Public ReadOnly Property StatusBar As StatusBar
	Get
public:
property StatusBar^ StatusBar {
	StatusBar^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)