Reference Library
GetAngle Method (options)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »GetAngle(PromptAngleOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDoubleResult GetAngle(
	PromptAngleOptions options
)
Public Function GetAngle ( _
	options As PromptAngleOptions _
) As PromptDoubleResult
public:
PromptDoubleResult^ GetAngle(
	PromptAngleOptions^ options
)
 Parameters
options(PromptAngleOptions)
Assembly: ZwManaged (Module: ZwManaged)