Reference Library
Unitmode Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Unitmode
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Unitmode { get; set; }
Public Property Unitmode As Integer
	Get
	Set
public:
property int Unitmode {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)