Reference Library
PromptSelectionOptionsEventArgs Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionOptionsEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PromptSelectionOptionsEventArgs : EventArgs
Public NotInheritable Class PromptSelectionOptionsEventArgs _
	Inherits EventArgs
public ref class PromptSelectionOptionsEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Filter
GetPoints()
Options
 Inheritance Hierarchy
Object
EventArgs
| PromptSelectionOptionsEventArgs
Assembly: ZwManaged (Module: ZwManaged)