Reference Library
ViewportBorderVisibility Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »ViewportBorderVisibility
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool ViewportBorderVisibility { get; set; }
Public Property ViewportBorderVisibility As Boolean
	Get
	Set
public:
property bool ViewportBorderVisibility {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)