Reference Library
Remove Method (id)
Namespaces »ZwSoft.ZwCAD.Runtime »Dictionary »Remove(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual RXObject Remove(
	int id
)
Public Overridable Function Remove ( _
	id As Integer _
) As RXObject
public:
virtual RXObject^ Remove(
	int id
)
 Parameters
id(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)