Reference Library
Extend Method (extendStart, toPoint)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »Extend(Boolean, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void Extend(
	bool extendStart,
	Point3d toPoint
)
Public Overridable Sub Extend ( _
	extendStart As Boolean, _
	toPoint As Point3d _
)
public:
virtual void Extend(
	bool extendStart,
	Point3d toPoint
)
 Parameters
extendStart(Boolean)
toPoint(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)