Reference Library
LayoutToBeCopied Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »LayoutToBeCopied
 Declaration Syntax
C# | Visual Basic | Visual C++
public event LayoutEventHandler LayoutToBeCopied
Public Event LayoutToBeCopied As LayoutEventHandler
public:
 event LayoutEventHandler^ LayoutToBeCopied {
	void add (LayoutEventHandler^ value);
	void remove (LayoutEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)