Reference Library
SetMergeAllEnabled Method (row, column, enable)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetMergeAllEnabled(Int32, Int32, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetMergeAllEnabled(
	int row,
	int column,
	bool enable
)
Public Overridable Sub SetMergeAllEnabled ( _
	row As Integer, _
	column As Integer, _
	enable As Boolean _
)
public:
virtual void SetMergeAllEnabled(
	int row,
	int column,
	bool enable
)
 Parameters
row(Int32)
column(Int32)
enable(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)