Reference Library
InitializeFloatingPosition Method (value)
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »InitializeFloatingPosition(Rect)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void InitializeFloatingPosition(
	Rect value
)
Public Sub InitializeFloatingPosition ( _
	value As Rect _
)
public:
void InitializeFloatingPosition(
	Rect value
)
 Parameters
value(Rect)
Assembly: ZwManaged (Module: ZwManaged)