Reference Library
BaseRadius Property
Namespaces »ZwSoft.ZwCAD.Geometry »Cone »BaseRadius
 Declaration Syntax
C# | Visual Basic | Visual C++
public double BaseRadius { get; set; }
Public Property BaseRadius As Double
	Get
	Set
public:
property double BaseRadius {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)