Reference Library
UpdateSubentPath Method (idMap)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »OsnapPointRef »UpdateSubentPath(IdMapping)
 Declaration Syntax
C# | Visual Basic | Visual C++
public override void UpdateSubentPath(
	IdMapping idMap
)
Public Overrides Sub UpdateSubentPath ( _
	idMap As IdMapping _
)
public:
virtual void UpdateSubentPath(
	IdMapping^ idMap
) override
 Parameters
idMap(IdMapping)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)