Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.Geometry »UInt32Collection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public uint this[
	int index
] { get; set; }
Public Default Property Item ( _
	index As Integer _
) As UInteger
	Get
	Set
public:
property unsigned int default[int index] {
	unsigned int get (int index);
	void set (int index, unsigned int value);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)