Reference Library
PromptOptions Constructor (messageAndKeywords, globalKeywords)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptOptions »PromptOptions(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal PromptOptions(
	string messageAndKeywords,
	string globalKeywords
)
Protected Friend Sub New ( _
	messageAndKeywords As String, _
	globalKeywords As String _
)
protected public:
PromptOptions(
	String^ messageAndKeywords,
	String^ globalKeywords
)
 Parameters
messageAndKeywords(String)
globalKeywords(String)
Assembly: ZwManaged (Module: ZwManaged)