Reference Library
ConvertFrom Method (context, culture, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LineWeightConverter »ConvertFrom(ITypeDescriptorContext, CultureInfo, Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
public override Object ConvertFrom(
	ITypeDescriptorContext context,
	CultureInfo culture,
	Object value
)
Public Overrides Function ConvertFrom ( _
	context As ITypeDescriptorContext, _
	culture As CultureInfo, _
	value As Object _
) As Object
public:
virtual Object^ ConvertFrom(
	ITypeDescriptorContext^ context,
	CultureInfo^ culture,
	Object^ value
) override
 Parameters
context(ITypeDescriptorContext)
culture(CultureInfo)
value(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)