Reference Library
ViewingDirection Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Section »ViewingDirection
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d ViewingDirection { get; set; }
Public Property ViewingDirection As Vector3d
	Get
	Set
public:
property Vector3d ViewingDirection {
	Vector3d get ();
	void set (Vector3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)