Reference Library
Embed Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImageDef »Embed()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void Embed()
Public Overridable Sub Embed
public:
virtual void Embed()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)