Reference Library
Count Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayLayerCollection »Count
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Count { get; }
Public ReadOnly Property Count As Integer
	Get
public:
virtual property int Count {
	int get () sealed;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)