Reference Library
IsClosed Method
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »IsClosed()
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsClosed()
Public Function IsClosed As Boolean
public:
bool IsClosed()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)