Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolyFaceMesh »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual IEnumerator GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator
public:
virtual IEnumerator^ GetEnumerator()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)