Reference Library
Transform Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Model »Transform
 Declaration Syntax
C# | Visual Basic | Visual C++
public Matrix3d Transform { get; set; }
Public Property Transform As Matrix3d
	Get
	Set
public:
property Matrix3d Transform {
	Matrix3d get ();
	void set (Matrix3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)