Reference Library
OrdinateDimension Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »OrdinateDimension »OrdinateDimension()
 Declaration Syntax
C# | Visual Basic | Visual C++
public OrdinateDimension()
Public Sub New
public:
OrdinateDimension()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)