Reference Library
SolidBackground Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SolidBackground
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbSolidBackground")]
public class SolidBackground : Background
<WrapperAttribute("AcDbSolidBackground")> _
Public Class SolidBackground _
	Inherits Background
[WrapperAttribute(L"AcDbSolidBackground")]
public ref class SolidBackground : public Background
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
SolidBackground()
SolidBackground(IntPtr, Boolean)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Background
|  |  |  |  |  | SolidBackground
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)