Reference Library
XrefGraphNode Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefGraphNode
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbXrefGraphNode")]
public class XrefGraphNode : GraphNode
<WrapperAttribute("ZcDbXrefGraphNode")> _
Public Class XrefGraphNode _
	Inherits GraphNode
[WrapperAttribute(L"ZcDbXrefGraphNode")]
public ref class XrefGraphNode : public GraphNode
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
BlockTableRecordId
Database
IsNested
Name
XrefNotificationStatus
XrefStatus
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | GraphNode
|  |  | XrefGraphNode
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)