Reference Library
Polyline Method (polylineObj)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »Polyline(Polyline)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool Polyline(
	Polyline polylineObj
)
Public MustOverride Function Polyline ( _
	polylineObj As Polyline _
) As Boolean
public:
virtual bool Polyline(
	Polyline^ polylineObj
) abstract
 Parameters
polylineObj(Polyline)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)