Reference Library
Z Property
Namespaces »ZwSoft.ZwCAD.Geometry »Scale3d »Z
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Z { get; }
Public ReadOnly Property Z As Double
	Get
public:
property double Z {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)