Reference Library
CurrentConfig Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfigManager »CurrentConfig
 Declaration Syntax
C# | Visual Basic | Visual C++
public static PlotConfig CurrentConfig { get; }
Public Shared ReadOnly Property CurrentConfig As PlotConfig
	Get
public:
static property PlotConfig^ CurrentConfig {
	PlotConfig^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)