Reference Library
PlotPlotStyles Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettings »PlotPlotStyles
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool PlotPlotStyles { get; set; }
Public Property PlotPlotStyles As Boolean
	Get
	Set
public:
property bool PlotPlotStyles {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)