Reference Library
Remove Method (value)
Namespaces »ZwSoft.ZwCAD.Colors »TransparencyCollection »Remove(Transparency)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Remove(
	Transparency value
)
Public Sub Remove ( _
	value As Transparency _
)
public:
virtual void Remove(
	Transparency value
) sealed
 Parameters
value(Transparency)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)