Reference Library
TextStyleTableRecord Constructor (obj, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TextStyleTableRecord »TextStyleTableRecord(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal TextStyleTableRecord(
	IntPtr obj,
	bool autoDelete
)
Protected Friend Sub New ( _
	obj As IntPtr, _
	autoDelete As Boolean _
)
protected public:
TextStyleTableRecord(
	IntPtr obj,
	bool autoDelete
)
 Parameters
obj(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)