Reference Library
Thickness Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBText »Thickness
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public double Thickness { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Property Thickness As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
property double Thickness {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)