Reference Library
SetFirstDerivativeAt Method (i, derivative)
Namespaces »ZwSoft.ZwCAD.Geometry »CubicSplineCurve3d »SetFirstDerivativeAt(Int32, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFirstDerivativeAt(
	int i,
	Vector3d derivative
)
Public Sub SetFirstDerivativeAt ( _
	i As Integer, _
	derivative As Vector3d _
)
public:
void SetFirstDerivativeAt(
	int i,
	Vector3d derivative
)
 Parameters
i(Int32)
derivative(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)