Reference Library
Brightness Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »Brightness
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Unitless)]
public double Brightness { get; set; }
<UnitTypeAttribute(UnitType.Unitless)> _
Public Property Brightness As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Unitless)]
public:
property double Brightness {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)