Reference Library
PixelBGRA32 Constructor (blue, green, red, alpha)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PixelBGRA32 »PixelBGRA32(Byte, Byte, Byte, Byte)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PixelBGRA32(
	byte blue,
	byte green,
	byte red,
	byte alpha
)
Public Sub New ( _
	blue As Byte, _
	green As Byte, _
	red As Byte, _
	alpha As Byte _
)
public:
PixelBGRA32(
	unsigned char blue,
	unsigned char green,
	unsigned char red,
	unsigned char alpha
)
 Parameters
blue(Byte)
green(Byte)
red(Byte)
alpha(Byte)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)