Reference Library
LineSpacingStyle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »LineSpacingStyle
 Declaration Syntax
C# | Visual Basic | Visual C++
public LineSpacingStyle LineSpacingStyle { get; set; }
Public Property LineSpacingStyle As LineSpacingStyle
	Get
	Set
public:
property LineSpacingStyle LineSpacingStyle {
	LineSpacingStyle get ();
	void set (LineSpacingStyle value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)