Reference Library
SetGridLineWeight Method (lineWeight, gridLineTypes, rowTypes)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableStyle »SetGridLineWeight(LineWeight, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetGridLineWeight(
	LineWeight lineWeight,
	int gridLineTypes,
	int rowTypes
)
Public Overridable Sub SetGridLineWeight ( _
	lineWeight As LineWeight, _
	gridLineTypes As Integer, _
	rowTypes As Integer _
)
public:
virtual void SetGridLineWeight(
	LineWeight lineWeight,
	int gridLineTypes,
	int rowTypes
)
 Parameters
lineWeight(LineWeight)
gridLineTypes(Int32)
rowTypes(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)