Reference Library
ColorPolicy Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleData »ColorPolicy
 Declaration Syntax
C# | Visual Basic | Visual C++
public int ColorPolicy { get; set; }
Public Property ColorPolicy As Integer
	Get
	Set
public:
property int ColorPolicy {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)