Reference Library
PageCancelled Event
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotReactorManager »PageCancelled
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PageCancelledEventHandler PageCancelled
Public Event PageCancelled As PageCancelledEventHandler
public:
 event PageCancelledEventHandler^ PageCancelled {
	void add (PageCancelledEventHandler^ value);
	void remove (PageCancelledEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)