Reference Library
IsPeriodicInV Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbSurface »IsPeriodicInV
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPeriodicInV { get; }
Public ReadOnly Property IsPeriodicInV As Boolean
	Get
public:
property bool IsPeriodicInV {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)