Reference Library
SetColor Method (nSecType, nGeometry, color)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »SetColor(SectionType, SectionGeometry, Color)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetColor(
	SectionType nSecType,
	SectionGeometry nGeometry,
	Color color
)
Public Sub SetColor ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry, _
	color As Color _
)
public:
void SetColor(
	SectionType nSecType,
	SectionGeometry nGeometry,
	Color^ color
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
color(Color)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)