Reference Library
DrawFlags Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »SubEntityTraits »DrawFlags
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract int DrawFlags { get; set; }
Public MustOverride Property DrawFlags As Integer
	Get
	Set
public:
virtual property int DrawFlags {
	int get () abstract;
	void set (int value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)