Reference Library
WorkingDatabase Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HostApplicationServices »WorkingDatabase
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Database WorkingDatabase { get; set; }
Public Shared Property WorkingDatabase As Database
	Get
	Set
public:
static property Database^ WorkingDatabase {
	Database^ get ();
	void set (Database^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)