Reference Library
RasterImageSource Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »RasterImageSource
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiRasterImage::ImageSource")]
public enum RasterImageSource
<WrapperAttribute("ZcGiRasterImage::ImageSource")> _
Public Enumeration RasterImageSource
[WrapperAttribute(L"ZcGiRasterImage::ImageSource")]
public enum class RasterImageSource
 Members
Member | Description
FromFile
FromPdfUnderlay
FromImageBGRA32
FromUnderlay
FromRender
FromOleObject
FromDwg
UndefinedSource
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)