Reference Library
ViewportGeometry Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ViewportGeometry
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiViewportGeometry")]
public abstract class ViewportGeometry : Geometry
<WrapperAttribute("ZcGiViewportGeometry")> _
Public MustInherit Class ViewportGeometry _
	Inherits Geometry
[WrapperAttribute(L"ZcGiViewportGeometry")]
public ref class ViewportGeometry abstract : public Geometry
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
ViewportGeometry(IntPtr, Boolean)
ViewportGeometry()
DeviceContextPolygon(Point3dCollection)
DeviceContextPolyline(Point3dCollection)
DeviceContextRasterImage(Point3d, Vector3d, Vector3d, Matrix2d, ObjectId, ImageOrg, Int32, Int32, Int16, Boolean, ImageSource, Vector3d, ImageOrg, Matrix2d, Int32, Int32)
PolygonEye(Point3dCollection)
PolylineEye(Point3dCollection)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Geometry
|  |  |  | ViewportGeometry
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)