Reference Library
Remove Method (ids)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »Remove(ObjectIdCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Remove(
	ObjectIdCollection ids
)
Public Sub Remove ( _
	ids As ObjectIdCollection _
)
public:
void Remove(
	ObjectIdCollection^ ids
)
 Parameters
ids(ObjectIdCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)