Reference Library
DrawFlags Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »NonEntityTraits »DrawFlags
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed int DrawFlags { get; set; }
Public Overrides NotOverridable Property DrawFlags As Integer
	Get
	Set
public:
virtual property int DrawFlags {
	int get () override sealed;
	void set (int value) override sealed;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)