Reference Library
Plimmax Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Plimmax
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d Plimmax { get; set; }
Public Property Plimmax As Point2d
	Get
	Set
public:
property Point2d Plimmax {
	Point2d get ();
	void set (Point2d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)