Reference Library
BooleanSubtract Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolvedSurface »BooleanSubtract()
 Members
Icon | Member | Description
BooleanSubtract(Surface)
BooleanSubtract(Solid3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)