Reference Library
SetCellState Method (row, column, cellState)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetCellState(Int32, Int32, CellStates)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetCellState(
	int row,
	int column,
	CellStates cellState
)
Public Overridable Sub SetCellState ( _
	row As Integer, _
	column As Integer, _
	cellState As CellStates _
)
public:
virtual void SetCellState(
	int row,
	int column,
	CellStates cellState
)
 Parameters
row(Int32)
column(Int32)
cellState(CellStates)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)