Reference Library
Ellipse Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ellipse »Ellipse()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Ellipse()
Public Sub New
public:
Ellipse()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)