Reference Library
DeleteUnmanagedObject Method
Namespaces »ZwSoft.ZwCAD.Windows »Window »DeleteUnmanagedObject()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected override void DeleteUnmanagedObject()
Protected Overrides Sub DeleteUnmanagedObject
protected:
virtual void DeleteUnmanagedObject() override
Assembly: ZwManaged (Module: ZwManaged)