Reference Library
RestoreLayerState Method (name, id, undefinedLayerStatePolicy, clientMask)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »RestoreLayerState(String, ObjectId, Int32, LayerStateMasks)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void RestoreLayerState(
	string name,
	ObjectId id,
	int undefinedLayerStatePolicy,
	LayerStateMasks clientMask
)
Public Sub RestoreLayerState ( _
	name As String, _
	id As ObjectId, _
	undefinedLayerStatePolicy As Integer, _
	clientMask As LayerStateMasks _
)
public:
void RestoreLayerState(
	String^ name,
	ObjectId id,
	int undefinedLayerStatePolicy,
	LayerStateMasks clientMask
)
 Parameters
name(String)
id(ObjectId)
undefinedLayerStatePolicy(Int32)
clientMask(LayerStateMasks)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)