Reference Library
LargestElement Property
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »LargestElement
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LargestElement { get; }
Public ReadOnly Property LargestElement As Double
	Get
public:
property double LargestElement {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)