Reference Library
VertexData Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »VertexData
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiVertexData")]
public sealed class VertexData
<WrapperAttribute("ZcGiVertexData")> _
Public NotInheritable Class VertexData
[WrapperAttribute(L"ZcGiVertexData")]
public ref class VertexData sealed
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
VertexData()
get_MappingCoords(MapChannel)
GetNormalVectors()
GetTrueColors()
OrientationFlag
set_MappingCoords(MapChannel, Point3d[])
SetNormalVectors(Vector3d[])
SetTrueColors(EntityColor[])
 Inheritance Hierarchy
Object
VertexData
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)