Reference Library
DxfCode Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DxfCode
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDb::DxfCode")]
public enum DxfCode
<WrapperAttribute("ZcDb::DxfCode")> _
Public Enumeration DxfCode
[WrapperAttribute(L"ZcDb::DxfCode")]
public enum class DxfCode
 Members
Member | Description
Thickness
PlotStyleNameType
LineWeight
Handle
ZCoordinate
YCoordinate
XXInt16
XTextString
XRefPath
XReal
XInt16
XDictionary
XDataStart
XCoordinate
ViewWidth
ViewportZoom
ViewportVisibility
ViewportTwist
ViewportSnapStyle
ViewportSnapPair
ViewportSnapAngle
ViewportSnap
ViewportNumber
ViewportIcon
ViewportHeight
ViewportGrid
ViewportAspect
ViewportActive
ViewMode
ViewLensLength
ViewHeight
ViewFrontClip
ViewBackClip
UcsOrientationY
UcsOrientationX
UcsOrg
TxtStyleXScale
TxtStylePSize
TxtStyleFlags
TxtSize
TextStyleName
TextFontFile
TextBigFontFile
SymbolTableRecordName
SymbolTableRecordComments
SymbolTableName
Subclass
SoftPointerId
SoftOwnershipId
ShapeYOffset
ShapeXOffset
ShapeScale
ShapeName
RegAppFlags
Real
PReactors
PlotStyleNameId
PixelScale
NormalZ
NormalY
NormalX
MlineStyleName
MlineOffset
LinetypeScale
LinetypeProse
LinetypePdc
LinetypeName
LinetypeElement
LinetypeAlign
LayoutName
LayerName
LayerLinetype
Invalid
Int8
HeaderId
HasSubentities
HardPointerId
HardOwnershipId
GradientTintVal
GradientTintType
GradientShift
GradientPatType
GradientObjType
GradientName
GradientColVal
GradientColCount
GradientAngle
FirstEntityId
ExtendedInt16
ExtendedDataZCoordinate
ExtendedDataYCoordinate
ExtendedDataXCoordinate
ExtendedDataWorldZDisp
ExtendedDataWorldZDir
ExtendedDataWorldZCoordinate
ExtendedDataWorldYDisp
ExtendedDataWorldYDir
ExtendedDataWorldYCoordinate
ExtendedDataWorldXDisp
ExtendedDataWorldXDir
ExtendedDataWorldXCoordinate
ExtendedDataScale
ExtendedDataRegAppName
ExtendedDataReal
ExtendedDataLayerName
ExtendedDataInteger32
ExtendedDataInteger16
ExtendedDataHandle
ExtendedDataDist
ExtendedDataControlString
ExtendedDataBinaryChunk
ExtendedDataAsciiString
EmbeddedObjectStart
Elevation
DimVarHandle
DimStyleName
DimPostString
DimensionBlock
DimensionAlternativePrefixSuffix
DimBlk2
DimBlk1
DashLength
ControlString
Comment
ColorRgb
CLShapeText
CLShapeName
CircleSides
Bool
BlockName
BinaryChunk
AttributeTag
AttributePrompt
ArbitraryHandle
Angle
Visibility
Start
RenderMode
End
Description
ColorName
Text
Operator
Int32
Int16
Color
Alpha
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)