Reference Library
GetCellExtents Method (row, col, isOuterCell, pts)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GetCellExtents(Int32, Int32, Boolean, Point3dCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void GetCellExtents(
	int row,
	int col,
	bool isOuterCell,
	Point3dCollection pts
)
Public Overridable Sub GetCellExtents ( _
	row As Integer, _
	col As Integer, _
	isOuterCell As Boolean, _
	pts As Point3dCollection _
)
public:
virtual void GetCellExtents(
	int row,
	int col,
	bool isOuterCell,
	Point3dCollection^ pts
)
 Parameters
row(Int32)
col(Int32)
isOuterCell(Boolean)
pts(Point3dCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)