Reference Library
SetClipBoundary Method (type, clipBoundaryVertices)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImage »SetClipBoundary(ClipBoundaryType, Point2dCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetClipBoundary(
	ClipBoundaryType type,
	Point2dCollection clipBoundaryVertices
)
Public Overridable Sub SetClipBoundary ( _
	type As ClipBoundaryType, _
	clipBoundaryVertices As Point2dCollection _
)
public:
virtual void SetClipBoundary(
	ClipBoundaryType type,
	Point2dCollection^ clipBoundaryVertices
)
 Parameters
type(ClipBoundaryType)
clipBoundaryVertices(Point2dCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)