Reference Library
PlotLogger Class
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotLogger
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcPlPlotLogger")]
public class PlotLogger : DisposableWrapper
<WrapperAttribute("AcPlPlotLogger")> _
Public Class PlotLogger _
	Inherits DisposableWrapper
[WrapperAttribute(L"AcPlPlotLogger")]
public ref class PlotLogger : public DisposableWrapper
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DeleteUnmanagedObject() |  (Overrides DisposableWrapper.DeleteUnmanagedObject().)
EndJob()
EndSheet()
ErrorHasHappenedInJob
ErrorHasHappenedInSheet
LogAbortRetryIgnoreError(String)
LogError(String)
LogInformation(String)
LogMessage(String)
LogSevereError(String)
LogTerminalError(String)
LogWarning(String)
StartJob()
StartSheet()
WarningHasHappenedInJob
WarningHasHappenedInSheet
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | PlotLogger
Assembly: ZwManaged (Module: ZwManaged)