Reference Library
Contains Method (key)
Namespaces »ZwSoft.ZwCAD.Runtime »Dictionary »Contains(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool Contains(
	string key
)
Public Overridable Function Contains ( _
	key As String _
) As Boolean
public:
virtual bool Contains(
	String^ key
)
 Parameters
key(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)