Reference Library
SplineFit Method (value, segments)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline2d »SplineFit(Poly2dType, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SplineFit(
	Poly2dType value,
	int segments
)
Public Sub SplineFit ( _
	value As Poly2dType, _
	segments As Integer _
)
public:
void SplineFit(
	Poly2dType value,
	int segments
)
 Parameters
value(Poly2dType)
segments(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)