Reference Library
Value Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionResult »Value
 Declaration Syntax
C# | Visual Basic | Visual C++
public SelectionSet Value { get; }
Public ReadOnly Property Value As SelectionSet
	Get
public:
property SelectionSet^ Value {
	SelectionSet^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)