Reference Library
LayoutBoundsMinX Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »LayoutBoundsMinX
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LayoutBoundsMinX { get; }
Public ReadOnly Property LayoutBoundsMinX As Double
	Get
public:
property double LayoutBoundsMinX {
	double get ();
}
Assembly: ZwManaged (Module: ZwManaged)