Reference Library
IsOn Method (point, value, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »IsOn(Point3d, Double, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsOn(
	Point3d point,
	out double value,
	Tolerance tolerance
)
Public Function IsOn ( _
	point As Point3d, _
	<OutAttribute> ByRef value As Double, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsOn(
	Point3d point,
	[OutAttribute] double% value,
	Tolerance tolerance
)
 Parameters
point(Point3d)
value(Double%)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)