Reference Library
UseDefaultValue Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptStringOptions »UseDefaultValue
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool UseDefaultValue { get; set; }
Public Property UseDefaultValue As Boolean
	Get
	Set
public:
property bool UseDefaultValue {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)