Reference Library
DeleteUnmanagedObject Method
Namespaces »ZwSoft.ZwCAD.Geometry »IntegerCollection »DeleteUnmanagedObject()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected override sealed void DeleteUnmanagedObject()
Protected Overrides NotOverridable Sub DeleteUnmanagedObject
protected:
virtual void DeleteUnmanagedObject() override sealed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)