Reference Library
ShadowsOn Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ShadowParameters »ShadowsOn
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool ShadowsOn { get; set; }
Public Property ShadowsOn As Boolean
	Get
	Set
public:
property bool ShadowsOn {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)