Reference Library
UpDirection Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »SpatialFilterVolume »UpDirection
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d UpDirection { get; }
Public ReadOnly Property UpDirection As Vector3d
	Get
public:
property Vector3d UpDirection {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)