Reference Library
DestinationBlock Method (nSecType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »DestinationBlock(SectionType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId DestinationBlock(
	SectionType nSecType
)
Public Function DestinationBlock ( _
	nSecType As SectionType _
) As ObjectId
public:
ObjectId DestinationBlock(
	SectionType nSecType
)
 Parameters
nSecType(SectionType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)