Reference Library
NsUrl Property
Namespaces »ZwSoft.ZwCAD.Publishing »EPlotAttribute »NsUrl
 Declaration Syntax
C# | Visual Basic | Visual C++
public string NsUrl { get; set; }
Public Property NsUrl As String
	Get
	Set
public:
property String^ NsUrl {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwManaged (Module: ZwManaged)