Reference Library
FillStyle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleData »FillStyle
 Declaration Syntax
C# | Visual Basic | Visual C++
public FillStyle FillStyle { get; set; }
Public Property FillStyle As FillStyle
	Get
	Set
public:
property FillStyle FillStyle {
	FillStyle get ();
	void set (FillStyle value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)