Reference Library
GetNormalPoint Method (point)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »GetNormalPoint(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnCurve3d GetNormalPoint(
	Point3d point
)
Public Function GetNormalPoint ( _
	point As Point3d _
) As PointOnCurve3d
public:
PointOnCurve3d^ GetNormalPoint(
	Point3d point
)
 Parameters
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)