Reference Library
IsValidLineWeight Method (weight)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »IsValidLineWeight(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsValidLineWeight(
	int weight
)
Public Function IsValidLineWeight ( _
	weight As Integer _
) As Boolean
public:
bool IsValidLineWeight(
	int weight
)
 Parameters
weight(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)