Reference Library
Insert Method (blockName, dataBase, preserveSourceDatabase)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Insert(String, Database, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Insert(
	string blockName,
	Database dataBase,
	bool preserveSourceDatabase
)
Public Function Insert ( _
	blockName As String, _
	dataBase As Database, _
	preserveSourceDatabase As Boolean _
) As ObjectId
public:
ObjectId Insert(
	String^ blockName,
	Database^ dataBase,
	bool preserveSourceDatabase
)
 Parameters
blockName(String)
dataBase(Database)
preserveSourceDatabase(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)