Reference Library
Dimltype Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimltype
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId Dimltype { get; set; }
Public Overridable Property Dimltype As ObjectId
	Get
	Set
public:
virtual property ObjectId Dimltype {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)