Reference Library
TypedValue Constructor (typeCode)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TypedValue »TypedValue(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public TypedValue(
	int typeCode
)
Public Sub New ( _
	typeCode As Integer _
)
public:
TypedValue(
	int typeCode
)
 Parameters
typeCode(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)