Reference Library
PointOnCurve2d Constructor (curve)
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve2d »PointOnCurve2d(Curve2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnCurve2d(
	Curve2d curve
)
Public Sub New ( _
	curve As Curve2d _
)
public:
PointOnCurve2d(
	Curve2d^ curve
)
 Parameters
curve(Curve2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)