Reference Library
GetAngleAtParameter Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ellipse »GetAngleAtParameter(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetAngleAtParameter(
	double value
)
Public Function GetAngleAtParameter ( _
	value As Double _
) As Double
public:
double GetAngleAtParameter(
	double value
)
 Parameters
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)