Reference Library
Contains Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3dCollection »Contains(Curve3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Contains(
	Curve3d value
)
Public Function Contains ( _
	value As Curve3d _
) As Boolean
public:
bool Contains(
	Curve3d^ value
)
 Parameters
value(Curve3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)