Reference Library
AxisOfSymmetry Property
Namespaces »ZwSoft.ZwCAD.Geometry »Cylinder »AxisOfSymmetry
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d AxisOfSymmetry { get; }
Public ReadOnly Property AxisOfSymmetry As Vector3d
	Get
public:
property Vector3d AxisOfSymmetry {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)