Reference Library
SetAttachmentMovingLocation Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »SetAttachmentMovingLocation(AttachmentPoint)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetAttachmentMovingLocation(
	AttachmentPoint value
)
Public Sub SetAttachmentMovingLocation ( _
	value As AttachmentPoint _
)
public:
void SetAttachmentMovingLocation(
	AttachmentPoint value
)
 Parameters
value(AttachmentPoint)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)