Reference Library
LandingGap Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »LandingGap
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LandingGap { get; set; }
Public Property LandingGap As Double
	Get
	Set
public:
property double LandingGap {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)