Reference Library
Leader Constructor (unmanagedObjPtr, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Leader »Leader(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal Leader(
	IntPtr unmanagedObjPtr,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedObjPtr As IntPtr, _
	autoDelete As Boolean _
)
protected public:
Leader(
	IntPtr unmanagedObjPtr,
	bool autoDelete
)
 Parameters
unmanagedObjPtr(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)