Reference Library
PromptDragOptions Constructor (selection, messageAndKeywords, globalKeywords, callback)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDragOptions »PromptDragOptions(SelectionSet, String, String, DragCallback)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDragOptions(
	SelectionSet selection,
	string messageAndKeywords,
	string globalKeywords,
	DragCallback callback
)
Public Sub New ( _
	selection As SelectionSet, _
	messageAndKeywords As String, _
	globalKeywords As String, _
	callback As DragCallback _
)
public:
PromptDragOptions(
	SelectionSet^ selection,
	String^ messageAndKeywords,
	String^ globalKeywords,
	DragCallback^ callback
)
 Parameters
selection(SelectionSet)
messageAndKeywords(String)
globalKeywords(String)
callback(DragCallback)
Assembly: ZwManaged (Module: ZwManaged)