Reference Library
SetGridVisibility Method (row, column, gridLinetype, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »SetGridVisibility(Int32, Int32, GridLineType, Visibility)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetGridVisibility(
	int row,
	int column,
	GridLineType gridLinetype,
	Visibility value
)
Public Overridable Sub SetGridVisibility ( _
	row As Integer, _
	column As Integer, _
	gridLinetype As GridLineType, _
	value As Visibility _
)
public:
virtual void SetGridVisibility(
	int row,
	int column,
	GridLineType gridLinetype,
	Visibility value
)
 Parameters
row(Int32)
column(Int32)
gridLinetype(GridLineType)
value(Visibility)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)