Reference Library
Dimtxtdirection Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimtxtdirection
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Dimtxtdirection { get; set; }
Public Property Dimtxtdirection As Double
	Get
	Set
public:
property double Dimtxtdirection {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)