Reference Library
SetValue Method (value, parseOption)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Cell »SetValue(Object, ParseOption)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetValue(
	Object value,
	ParseOption parseOption
)
Public Sub SetValue ( _
	value As Object, _
	parseOption As ParseOption _
)
public:
void SetValue(
	Object^ value,
	ParseOption parseOption
)
 Parameters
value(Object)
parseOption(ParseOption)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)