Reference Library
Status Property
Namespaces »ZwSoft.ZwCAD.EditorInput »DraggingEndedEventArgs »Status
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptStatus Status { get; }
Public ReadOnly Property Status As PromptStatus
	Get
public:
property PromptStatus Status {
	PromptStatus get ();
}
Assembly: ZwManaged (Module: ZwManaged)