Reference Library
AppendLoop Method (loopType, vertexCollection, bulgeCollection)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »AppendLoop(HatchLoopTypes, Point2dCollection, DoubleCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AppendLoop(
	HatchLoopTypes loopType,
	Point2dCollection vertexCollection,
	DoubleCollection bulgeCollection
)
Public Sub AppendLoop ( _
	loopType As HatchLoopTypes, _
	vertexCollection As Point2dCollection, _
	bulgeCollection As DoubleCollection _
)
public:
void AppendLoop(
	HatchLoopTypes loopType,
	Point2dCollection^ vertexCollection,
	DoubleCollection^ bulgeCollection
)
 Parameters
loopType(HatchLoopTypes)
vertexCollection(Point2dCollection)
bulgeCollection(DoubleCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)