Reference Library
IsOuterNormal Property
Namespaces »ZwSoft.ZwCAD.Geometry »Cone »IsOuterNormal
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsOuterNormal { get; }
Public ReadOnly Property IsOuterNormal As Boolean
	Get
public:
property bool IsOuterNormal {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)