Reference Library
MInsertBlock Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MInsertBlock
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbMInsertBlock")]
public class MInsertBlock : BlockReference
<WrapperAttribute("AcDbMInsertBlock")> _
Public Class MInsertBlock _
	Inherits BlockReference
[WrapperAttribute(L"AcDbMInsertBlock")]
public ref class MInsertBlock : public BlockReference
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
MInsertBlock(Point3d, ObjectId, Int16, Int16, Double, Double)
MInsertBlock()
MInsertBlock(IntPtr, Boolean)
Columns
ColumnSpacing
Rows
RowSpacing
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | BlockReference
|  |  |  |  |  |  | MInsertBlock
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)