Reference Library
SetCustomPrintScale Method (plotSet, scale)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsValidator »SetCustomPrintScale(PlotSettings, CustomScale)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetCustomPrintScale(
	PlotSettings plotSet,
	CustomScale scale
)
Public Sub SetCustomPrintScale ( _
	plotSet As PlotSettings, _
	scale As CustomScale _
)
public:
void SetCustomPrintScale(
	PlotSettings^ plotSet,
	CustomScale scale
)
 Parameters
plotSet(PlotSettings)
scale(CustomScale)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)