Reference Library
ExchangeXData Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DecomposeForSaveReplacementRecord »ExchangeXData
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool ExchangeXData { get; }
Public ReadOnly Property ExchangeXData As Boolean
	Get
public:
property bool ExchangeXData {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)