Reference Library
GradientName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »GradientName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string GradientName { get; }
Public ReadOnly Property GradientName As String
	Get
public:
property String^ GradientName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)