Reference Library
Insert Method (index, value)
Namespaces »ZwSoft.ZwCAD.Geometry »KnotCollection »Insert(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Insert(
	int index,
	double value
)
Public Sub Insert ( _
	index As Integer, _
	value As Double _
)
public:
void Insert(
	int index,
	double value
)
 Parameters
index(Int32)
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)