Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PixelFormatInfo »Equality(PixelFormatInfo, PixelFormatInfo)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	PixelFormatInfo inf,
	PixelFormatInfo inf2
)
Public Shared Operator = ( _
	inf As PixelFormatInfo, _
	inf2 As PixelFormatInfo _
) As Boolean
public:
static bool operator ==(
	PixelFormatInfo inf,
	PixelFormatInfo inf2
)
 Parameters
inf(PixelFormatInfo)
inf2(PixelFormatInfo)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)