Reference Library
SetFieldCode Method (fieldCode)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Field »SetFieldCode(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFieldCode(
	string fieldCode
)
Public Sub SetFieldCode ( _
	fieldCode As String _
)
public:
void SetFieldCode(
	String^ fieldCode
)
 Parameters
fieldCode(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)