Reference Library
PointOnPlane Property
Namespaces »ZwSoft.ZwCAD.Geometry »PlanarEntity »PointOnPlane
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d PointOnPlane { get; }
Public ReadOnly Property PointOnPlane As Point3d
	Get
public:
property Point3d PointOnPlane {
	Point3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)