Reference Library
Format Method (row, col)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »Format(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string Format(
	int row,
	int col
)
Public Overridable Function Format ( _
	row As Integer, _
	col As Integer _
) As String
public:
virtual String^ Format(
	int row,
	int col
)
 Parameters
row(Int32)
col(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)