Reference Library
OpenTime Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »WhoHasInfo »OpenTime
 Declaration Syntax
C# | Visual Basic | Visual C++
public string OpenTime { get; }
Public ReadOnly Property OpenTime As String
	Get
public:
property String^ OpenTime {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)