Reference Library
CompareTo Method (obj)
Namespaces »ZwSoft.ZwCAD.Colors »Color »CompareTo(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int CompareTo(
	Object obj
)
Public Function CompareTo ( _
	obj As Object _
) As Integer
public:
virtual int CompareTo(
	Object^ obj
) sealed
 Parameters
obj(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)