Reference Library
SetPointAt Method (index, pointValue)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Trace »SetPointAt(Int16, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetPointAt(
	short index,
	Point3d pointValue
)
Public Sub SetPointAt ( _
	index As Short, _
	pointValue As Point3d _
)
public:
void SetPointAt(
	short index,
	Point3d pointValue
)
 Parameters
index(Int16)
pointValue(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)