Reference Library
Evaluated Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldEvaluationResult »Evaluated
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Evaluated { get; }
Public ReadOnly Property Evaluated As Integer
	Get
public:
property int Evaluated {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)