Reference Library
RemoveField Method (propertyName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »RemoveField(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId RemoveField(
	string propertyName
)
Public Function RemoveField ( _
	propertyName As String _
) As ObjectId
public:
ObjectId RemoveField(
	String^ propertyName
)
 Parameters
propertyName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)