Reference Library
IsTangential Method (intersection)
Namespaces »ZwSoft.ZwCAD.Geometry »CurveCurveIntersector3d »IsTangential(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsTangential(
	int intersection
)
Public Function IsTangential ( _
	intersection As Integer _
) As Boolean
public:
bool IsTangential(
	int intersection
)
 Parameters
intersection(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)