Reference Library
Area Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »Area
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double Area { get; }
Public Overridable ReadOnly Property Area As Double
	Get
public:
virtual property double Area {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)