Reference Library
IsLineWeightOverridden Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerViewportProperties »IsLineWeightOverridden
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsLineWeightOverridden { get; set; }
Public Property IsLineWeightOverridden As Boolean
	Get
	Set
public:
property bool IsLineWeightOverridden {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)