Reference Library
IsPaperspaceView Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewTableRecord »IsPaperspaceView
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPaperspaceView { get; set; }
Public Property IsPaperspaceView As Boolean
	Get
	Set
public:
property bool IsPaperspaceView {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)