Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SubentityId »Equality(SubentityId, SubentityId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	SubentityId a,
	SubentityId b
)
Public Shared Operator = ( _
	a As SubentityId, _
	b As SubentityId _
) As Boolean
public:
static bool operator ==(
	SubentityId a,
	SubentityId b
)
 Parameters
a(SubentityId)
b(SubentityId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)