Reference Library
View Class
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcGsView")]
public class View : DisposableWrapper
<WrapperAttribute("AcGsView")> _
Public Class View _
	Inherits DisposableWrapper
[WrapperAttribute(L"AcGsView")]
public ref class View : public DisposableWrapper
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
View(ClientViewInfo, Boolean)
View()
View(IntPtr, Boolean, Boolean)
BackClip
BackgroundId
BeginInteractivity(Double)
ClearFrozenLayers()
Clone(Boolean, Boolean)
Clone()
Create(IntPtr, Boolean, Boolean)
DeleteUnmanagedObject() |  (Overrides DisposableWrapper.DeleteUnmanagedObject().)
Dolly(Double, Double, Double)
Dolly(Vector3d)
EnableBackClip
EnableDefaultLighting(Boolean, DefaultLightingType)
EnableDefaultLighting(Boolean)
EnableFrontClip
EnableStereo
EndInteractivity()
Erase(Drawable)
EraseAll()
ExceededBounds
ExtentsInView(Point3d, Point3d)
FieldHeight
FieldWidth
Flush()
FreezeLayer(IntPtr)
FrontClip
GetNumPixelsInUnitSquare(Point3d, Boolean)
GetNumPixelsInUnitSquare(Point3d)
GetSnapshot(Rectangle)
Hide()
Invalidate(Rectangle)
Invalidate()
InvalidateCachedViewportGeometry()
IsInteractive
IsPerspective
IsValid
IsVisible
Mode
ObjectToDeviceMatrix
Orbit(Double, Double)
Pan(Double, Double)
PointInView(Point3d)
Position
ProjectionMatrix
RemoveViewportClipRegion()
RenderToImage(Drawable, Rectangle)
RenderToImage()
Roll(Double)
ScreenMatrix
SetView(Point3d, Point3d, Vector3d, Double, Double, Projection)
SetView(Point3d, Point3d, Vector3d, Double, Double)
SetViewportClipRegion(Int32, Int32[], Point[])
Show()
StereoParameters
Target
ThawLayer(IntPtr)
Update()
UpVector
ViewingMatrix
Viewport
ViewportBorderProperties
ViewportBorderVisibility
VisualStyleId
WorldToDeviceMatrix
Zoom(Double)
ZoomExtents(Point3d, Point3d)
ZoomWindow(Point2d, Point2d)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | View
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)