Reference Library
Changed Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »SystemVariableChangedEventArgs »Changed
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Changed { get; }
Public ReadOnly Property Changed As Boolean
	Get
public:
property bool Changed {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)