Reference Library
InsertColumn Method (index, columnsNumber)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »InsertColumn(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int InsertColumn(
	int index,
	int columnsNumber
)
Public Overridable Function InsertColumn ( _
	index As Integer, _
	columnsNumber As Integer _
) As Integer
public:
virtual int InsertColumn(
	int index,
	int columnsNumber
)
 Parameters
index(Int32)
columnsNumber(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)