Reference Library
RenameLayerState Method (name, newName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »RenameLayerState(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void RenameLayerState(
	string name,
	string newName
)
Public Sub RenameLayerState ( _
	name As String, _
	newName As String _
)
public:
void RenameLayerState(
	String^ name,
	String^ newName
)
 Parameters
name(String)
newName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)