Reference Library
UnitTypeAttribute Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnitTypeAttribute
 Declaration Syntax
C# | Visual Basic | Visual C++
[AttributeUsageAttribute(AttributeTargets.Property|AttributeTargets.Field|AttributeTargets.Parameter|AttributeTargets.ReturnValue, AllowMultiple = false,
	Inherited = true)]
public sealed class UnitTypeAttribute : Attribute
<AttributeUsageAttribute(AttributeTargets.Property Or AttributeTargets.Field Or AttributeTargets.Parameter Or AttributeTargets.ReturnValue, AllowMultiple := False,  _
	Inherited := True)> _
Public NotInheritable Class UnitTypeAttribute _
	Inherits Attribute
[AttributeUsageAttribute(AttributeTargets::Property|AttributeTargets::Field|AttributeTargets::Parameter|AttributeTargets::ReturnValue, AllowMultiple = false,
	Inherited = true)]
public ref class UnitTypeAttribute sealed : public Attribute
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
UnitTypeAttribute(UnitType)
UnitType
 Inheritance Hierarchy
Object
Attribute
| UnitTypeAttribute
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)