Reference Library
GreenOffset Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PixelFormatInfo »GreenOffset
 Declaration Syntax
C# | Visual Basic | Visual C++
public short GreenOffset { get; set; }
Public Property GreenOffset As Short
	Get
	Set
public:
property short GreenOffset {
	short get ();
	void set (short value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)