Reference Library
LayerTableId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »LayerTableId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId LayerTableId { get; }
Public ReadOnly Property LayerTableId As ObjectId
	Get
public:
property ObjectId LayerTableId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)