Reference Library
RemoveAt Method (index, ids)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »RemoveAt(Int32, ObjectIdCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void RemoveAt(
	int index,
	ObjectIdCollection ids
)
Public Sub RemoveAt ( _
	index As Integer, _
	ids As ObjectIdCollection _
)
public:
void RemoveAt(
	int index,
	ObjectIdCollection^ ids
)
 Parameters
index(Int32)
ids(ObjectIdCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)