Reference Library
SurfaceSurfaceIntersector Class
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersector
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ODGeSurfSurfInt")]
public class SurfaceSurfaceIntersector : Entity3d
<WrapperAttribute("ODGeSurfSurfInt")> _
Public Class SurfaceSurfaceIntersector _
	Inherits Entity3d
[WrapperAttribute(L"ODGeSurfSurfInt")]
public ref class SurfaceSurfaceIntersector : public Entity3d
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
SurfaceSurfaceIntersector(Surface, Surface)
SurfaceSurfaceIntersector()
SurfaceSurfaceIntersector(Surface, Surface, Tolerance)
Create(IntPtr, Boolean)
GetDimension(Int32)
GetIntersectionConfigurations(Int32)
GetIntersectPointParameters(Int32)
GetType(Int32)
IntersectCurve(Int32, Boolean)
IntersectParameterCurve(Int32, Boolean, Boolean)
IntersectPoint(Int32)
NumResults
Set(Surface, Surface, Tolerance)
Set(Surface, Surface)
Surface1
Surface2
Tolerance
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity3d
|  |  | SurfaceSurfaceIntersector
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)