Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Extents3d »Equality(Extents3d, Extents3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	Extents3d a,
	Extents3d b
)
Public Shared Operator = ( _
	a As Extents3d, _
	b As Extents3d _
) As Boolean
public:
static bool operator ==(
	Extents3d a,
	Extents3d b
)
 Parameters
a(Extents3d)
b(Extents3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)