Reference Library
EndFitTangent Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Spline »EndFitTangent
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d EndFitTangent { get; }
Public ReadOnly Property EndFitTangent As Vector3d
	Get
public:
property Vector3d EndFitTangent {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)