Reference Library
DynamicDimensionData Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicDimensionData
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbDimData")]
public sealed class DynamicDimensionData : DisposableWrapper
<WrapperAttribute("ZcDbDimData")> _
Public NotInheritable Class DynamicDimensionData _
	Inherits DisposableWrapper
[WrapperAttribute(L"ZcDbDimData")]
public ref class DynamicDimensionData sealed : public DisposableWrapper
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DynamicDimensionData(Dimension, Boolean, Boolean)
DynamicDimensionData(Dimension, Boolean)
DynamicDimensionData(Dimension)
DynamicDimensionData()
ApplicationData
Create(IntPtr, Boolean)
Dimension
Editable
Focal
HideIfValueIsZero
Visible
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | DynamicDimensionData
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)