Reference Library
GetColumnName Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GetColumnName(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string GetColumnName(
	int index
)
Public Overridable Function GetColumnName ( _
	index As Integer _
) As String
public:
virtual String^ GetColumnName(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)