Reference Library
License Property
Namespaces »ZwSoft.ZwCAD.Runtime »SecuredApplicationAttribute »License
 Declaration Syntax
C# | Visual Basic | Visual C++
public string License { get; }
Public ReadOnly Property License As String
	Get
public:
property String^ License {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)