Reference Library
GetVertices Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImage »GetVertices()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Point3dCollection GetVertices()
Public Overridable Function GetVertices As Point3dCollection
public:
virtual Point3dCollection^ GetVertices()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)