Reference Library
Format Method (pField)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldEvaluator »Format(Field)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract string Format(
	Field pField
)
Public MustOverride Function Format ( _
	pField As Field _
) As String
public:
virtual String^ Format(
	Field^ pField
) abstract
 Parameters
pField(Field)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)