Reference Library
DowngradeToNotify Method (wasWritable)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »DowngradeToNotify(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void DowngradeToNotify(
	bool wasWritable
)
Public Sub DowngradeToNotify ( _
	wasWritable As Boolean _
)
public:
void DowngradeToNotify(
	bool wasWritable
)
 Parameters
wasWritable(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)