Reference Library
IsParallelTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity3d »IsParallelTo()
 Members
Icon | Member | Description
IsParallelTo(PlanarEntity, Tolerance)
IsParallelTo(LinearEntity3d, Tolerance)
IsParallelTo(PlanarEntity)
IsParallelTo(LinearEntity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)