Reference Library
PointFilterResult Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PointFilterResult
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PointFilterResult : IDisposable
Public NotInheritable Class PointFilterResult _
	Implements IDisposable
public ref class PointFilterResult sealed : IDisposable
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DisplayObjectSnapGlyph
Dispose()
NewPoint
Retry
ToolTipText
 Inheritance Hierarchy
Object
PointFilterResult
Assembly: ZwManaged (Module: ZwManaged)