Reference Library
DimstyleData Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Leader »DimstyleData
 Declaration Syntax
C# | Visual Basic | Visual C++
public DimStyleTableRecord DimstyleData { get; set; }
Public Property DimstyleData As DimStyleTableRecord
	Get
	Set
public:
property DimStyleTableRecord^ DimstyleData {
	DimStyleTableRecord^ get ();
	void set (DimStyleTableRecord^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)