Reference Library
RemovePointRef Method (force)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimAssoc »RemovePointRef(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void RemovePointRef(
	bool force
)
Public Sub RemovePointRef ( _
	force As Boolean _
)
public:
void RemovePointRef(
	bool force
)
 Parameters
force(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)