Reference Library
GetString Method (options)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »GetString(PromptStringOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptResult GetString(
	PromptStringOptions options
)
Public Function GetString ( _
	options As PromptStringOptions _
) As PromptResult
public:
PromptResult^ GetString(
	PromptStringOptions^ options
)
 Parameters
options(PromptStringOptions)
Assembly: ZwManaged (Module: ZwManaged)