Reference Library
IsClear Property
Namespaces »ZwSoft.ZwCAD.Colors »Transparency »IsClear
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsClear { get; }
Public ReadOnly Property IsClear As Boolean
	Get
public:
property bool IsClear {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)