Reference Library
CopyTo Method (array, index)
Namespaces »ZwSoft.ZwCAD.Geometry »IntPtrCollection »CopyTo(IntPtr[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void CopyTo(
	IntPtr[] array,
	int index
)
Public Overridable Sub CopyTo ( _
	array As IntPtr(), _
	index As Integer _
)
public:
virtual void CopyTo(
	array<IntPtr>^ array,
	int index
)
 Parameters
array(IntPtr[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)