Reference Library
PlotWindowMinX Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »PlotWindowMinX
 Declaration Syntax
C# | Visual Basic | Visual C++
public double PlotWindowMinX { get; }
Public ReadOnly Property PlotWindowMinX As Double
	Get
public:
property double PlotWindowMinX {
	double get ();
}
Assembly: ZwManaged (Module: ZwManaged)