Reference Library
IsEqualAtLower Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Interval »IsEqualAtLower(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualAtLower(
	double value
)
Public Function IsEqualAtLower ( _
	value As Double _
) As Boolean
public:
bool IsEqualAtLower(
	double value
)
 Parameters
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)