Reference Library
PromptEditorOptions Constructor (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptEditorOptions »PromptEditorOptions(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal PromptEditorOptions(
	string message
)
Protected Friend Sub New ( _
	message As String _
)
protected public:
PromptEditorOptions(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)