Reference Library
IsPerpendicularTo Method (vector, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »IsPerpendicularTo(Vector3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPerpendicularTo(
	Vector3d vector,
	Tolerance tolerance
)
Public Function IsPerpendicularTo ( _
	vector As Vector3d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsPerpendicularTo(
	Vector3d vector,
	Tolerance tolerance
)
 Parameters
vector(Vector3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)