Reference Library
Style Property
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »Style
 Declaration Syntax
C# | Visual Basic | Visual C++
public PaletteSetStyles Style { get; set; }
Public Property Style As PaletteSetStyles
	Get
	Set
public:
property PaletteSetStyles Style {
	PaletteSetStyles get ();
	void set (PaletteSetStyles value);
}
Assembly: ZwManaged (Module: ZwManaged)