Reference Library
NonInteractivePickPoint Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptNestedEntityOptions »NonInteractivePickPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d NonInteractivePickPoint { get; set; }
Public Property NonInteractivePickPoint As Point3d
	Get
	Set
public:
property Point3d NonInteractivePickPoint {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwManaged (Module: ZwManaged)