Reference Library
PlotRotation Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »PlotRotation
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlotRotation PlotRotation { get; }
Public ReadOnly Property PlotRotation As PlotRotation
	Get
public:
property PlotRotation PlotRotation {
	PlotRotation get ();
}
Assembly: ZwManaged (Module: ZwManaged)