Reference Library
GetSubentityMaterialMapper Method (subEntityId)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Surface »GetSubentityMaterialMapper(SubentityId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Mapper GetSubentityMaterialMapper(
	SubentityId subEntityId
)
Public Overridable Function GetSubentityMaterialMapper ( _
	subEntityId As SubentityId _
) As Mapper
public:
virtual Mapper^ GetSubentityMaterialMapper(
	SubentityId subEntityId
)
 Parameters
subEntityId(SubentityId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)