Reference Library
IsScaledToFit Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinetypeTableRecord »IsScaledToFit
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsScaledToFit { get; set; }
Public Property IsScaledToFit As Boolean
	Get
	Set
public:
property bool IsScaledToFit {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)