Reference Library
PlotStyleDescriptor Structure
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleDescriptor
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct PlotStyleDescriptor
Public Structure PlotStyleDescriptor
public value class PlotStyleDescriptor
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PlotStyleDescriptor(ObjectId, PlotStyleNameType)
Equality(PlotStyleDescriptor, PlotStyleDescriptor)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
Id
Inequality(PlotStyleDescriptor, PlotStyleDescriptor)
ToString(IFormatProvider)
ToString() |  (Overrides ValueType.ToString().)
Type
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)