Reference Library
CommandMethodAttribute Class
Namespaces »ZwSoft.ZwCAD.Runtime »CommandMethodAttribute
 Declaration Syntax
C# | Visual Basic | Visual C++
[AttributeUsageAttribute(AttributeTargets.Method, AllowMultiple = true, Inherited = false)]
public sealed class CommandMethodAttribute : Attribute,
	ICommandLineCallable
<AttributeUsageAttribute(AttributeTargets.Method, AllowMultiple := True, Inherited := False)> _
Public NotInheritable Class CommandMethodAttribute _
	Inherits Attribute _
	Implements ICommandLineCallable
[AttributeUsageAttribute(AttributeTargets::Method, AllowMultiple = true, Inherited = false)]
public ref class CommandMethodAttribute sealed : public Attribute,
	ICommandLineCallable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
CommandMethodAttribute(String, String, String, CommandFlags, Type, String, String)
CommandMethodAttribute(String, String, String, CommandFlags, Type)
CommandMethodAttribute(String, String, String, CommandFlags, String)
CommandMethodAttribute(String, String, String, CommandFlags)
CommandMethodAttribute(String, String, CommandFlags)
CommandMethodAttribute(String, CommandFlags)
CommandMethodAttribute(String)
ContextMenuExtensionType
Flags
GlobalName
GroupName
HelpFileName
HelpTopic
LocalizedNameId
 Inheritance Hierarchy
Object
Attribute
| CommandMethodAttribute
Assembly: ZwManaged (Module: ZwManaged)