Reference Library
Reset Method
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3dCollectionEnumerator »Reset()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void Reset()
Public Overridable Sub Reset
public:
virtual void Reset()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)