Reference Library
DisplayMaxY Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »DisplayMaxY
 Declaration Syntax
C# | Visual Basic | Visual C++
public double DisplayMaxY { get; }
Public ReadOnly Property DisplayMaxY As Double
	Get
public:
property double DisplayMaxY {
	double get ();
}
Assembly: ZwManaged (Module: ZwManaged)