Reference Library
ReadBinaryChunk Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »ReadBinaryChunk()
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract byte[] ReadBinaryChunk()
Public MustOverride Function ReadBinaryChunk As Byte()
public:
virtual array<unsigned char>^ ReadBinaryChunk() abstract
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)