Reference Library
Device Constructor
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »Device()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Device()
Public Sub New
public:
Device()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)