Reference Library
DragCallback Delegate
Namespaces »ZwSoft.ZwCAD.EditorInput »DragCallback
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate SamplerStatus DragCallback(
	Point3d current,
	out Matrix3d xform
)
Public Delegate Function DragCallback ( _
	current As Point3d, _
	<OutAttribute> ByRef xform As Matrix3d _
) As SamplerStatus
public delegate SamplerStatus DragCallback(
	Point3d current,
	[InAttribute] [OutAttribute] Matrix3d% xform
)
 Parameters
current(Point3d)
xform(Matrix3d%)
Assembly: ZwManaged (Module: ZwManaged)