Reference Library
SetContentsRtf Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »SetContentsRtf(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int SetContentsRtf(
	string value
)
Public Function SetContentsRtf ( _
	value As String _
) As Integer
public:
int SetContentsRtf(
	String^ value
)
 Parameters
value(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)