Reference Library
SetHatchPatternName Method (nSecType, nGeometry, sNewName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »SetHatchPatternName(SectionType, SectionGeometry, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetHatchPatternName(
	SectionType nSecType,
	SectionGeometry nGeometry,
	string sNewName
)
Public Sub SetHatchPatternName ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry, _
	sNewName As String _
)
public:
void SetHatchPatternName(
	SectionType nSecType,
	SectionGeometry nGeometry,
	String^ sNewName
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
sNewName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)