Reference Library
GetVisibility Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FaceData »GetVisibility()
 Declaration Syntax
C# | Visual Basic | Visual C++
public byte[] GetVisibility()
Public Function GetVisibility As Byte()
public:
array<unsigned char>^ GetVisibility()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)