Reference Library
MentalRayRenderSettingsTraitsIntegerRangeParameter Constructor (a, b)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraitsIntegerRangeParameter »MentalRayRenderSettingsTraitsIntegerRangeParameter(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public MentalRayRenderSettingsTraitsIntegerRangeParameter(
	int a,
	int b
)
Public Sub New ( _
	a As Integer, _
	b As Integer _
)
public:
MentalRayRenderSettingsTraitsIntegerRangeParameter(
	int a,
	int b
)
 Parameters
a(Int32)
b(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)