Reference Library
IsLayerFrozenOrOff Property
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor »IsLayerFrozenOrOff
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsLayerFrozenOrOff { get; }
Public ReadOnly Property IsLayerFrozenOrOff As Boolean
	Get
public:
property bool IsLayerFrozenOrOff {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)