Reference Library
MText Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »MText
 Declaration Syntax
C# | Visual Basic | Visual C++
public MText MText { get; set; }
Public Property MText As MText
	Get
	Set
public:
property MText^ MText {
	MText^ get ();
	void set (MText^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)