Reference Library
AddRange Method (range)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2dCollection »AddRange(Vector2d[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AddRange(
	Vector2d[] range
)
Public Sub AddRange ( _
	range As Vector2d() _
)
public:
virtual void AddRange(
	array<Vector2d>^ range
) sealed
 Parameters
range(Vector2d[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)