Reference Library
PointOnCurve2d Class
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve2d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGePointOnCurve2d")]
public sealed class PointOnCurve2d : PointEntity2d
<WrapperAttribute("ZcGePointOnCurve2d")> _
Public NotInheritable Class PointOnCurve2d _
	Inherits PointEntity2d
[WrapperAttribute(L"ZcGePointOnCurve2d")]
public ref class PointOnCurve2d sealed : public PointEntity2d
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PointOnCurve2d(Curve2d, Double)
PointOnCurve2d(Curve2d)
PointOnCurve2d()
Create(IntPtr, Boolean)
Curve
GetDerivative(Int32, Curve2d, Double)
GetDerivative(Int32, Double)
GetDerivative(Int32)
GetPointAtParameter(Double)
GetPointOnCurve(Curve2d, Double)
Parameter
Point
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity2d
|  |  | PointEntity2d
|  |  |  | PointOnCurve2d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)