Reference Library
Save Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Save()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Save()
Public Sub Save
public:
void Save()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)