Reference Library
CopyTo Method (__unnamed000, index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AttributeCollection »CopyTo(ObjectId[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	ObjectId[] __unnamed000,
	int index
)
Public Sub CopyTo ( _
	__unnamed000 As ObjectId(), _
	index As Integer _
)
public:
void CopyTo(
	array<ObjectId>^ __unnamed000,
	int index
)
 Parameters
__unnamed000(ObjectId[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)