Reference Library
CommandMethodAttribute Constructor (globalName, flags)
Namespaces »ZwSoft.ZwCAD.Runtime »CommandMethodAttribute »CommandMethodAttribute(String, CommandFlags)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CommandMethodAttribute(
	string globalName,
	CommandFlags flags
)
Public Sub New ( _
	globalName As String, _
	flags As CommandFlags _
)
public:
CommandMethodAttribute(
	String^ globalName,
	CommandFlags flags
)
 Parameters
globalName(String)
flags(CommandFlags)
Assembly: ZwManaged (Module: ZwManaged)