Reference Library
DBObjectReferenceCollection Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObjectReferenceCollection
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class DBObjectReferenceCollection : CollectionBase
Public NotInheritable Class DBObjectReferenceCollection _
	Inherits CollectionBase
public ref class DBObjectReferenceCollection sealed : public CollectionBase
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Add(DBObjectReference)
Contains(DBObjectReference)
CopyTo(DBObjectReference[], Int32)
IndexOf(DBObjectReference)
Insert(Int32, DBObjectReference)
Item[Int32]
Remove(DBObjectReference)
 Inheritance Hierarchy
Object
CollectionBase
| DBObjectReferenceCollection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)