Reference Library
Split Method (parameter, multiplicityLast, multiplicityFirst)
Namespaces »ZwSoft.ZwCAD.Geometry »KnotCollection »Split(Double, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public KnotCollection[] Split(
	double parameter,
	int multiplicityLast,
	int multiplicityFirst
)
Public Function Split ( _
	parameter As Double, _
	multiplicityLast As Integer, _
	multiplicityFirst As Integer _
) As KnotCollection()
public:
array<KnotCollection^>^ Split(
	double parameter,
	int multiplicityLast,
	int multiplicityFirst
)
 Parameters
parameter(Double)
multiplicityLast(Int32)
multiplicityFirst(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)