Reference Library
Filter Method (layer)
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerFilter »Filter(LayerTableRecord)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Filter(
	LayerTableRecord layer
)
Public Function Filter ( _
	layer As LayerTableRecord _
) As Boolean
public:
bool Filter(
	LayerTableRecord^ layer
)
 Parameters
layer(LayerTableRecord)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)