Reference Library
GetNormalPoint Method (point, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »GetNormalPoint(Point3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnCurve3d GetNormalPoint(
	Point3d point,
	Tolerance tolerance
)
Public Function GetNormalPoint ( _
	point As Point3d, _
	tolerance As Tolerance _
) As PointOnCurve3d
public:
PointOnCurve3d^ GetNormalPoint(
	Point3d point,
	Tolerance tolerance
)
 Parameters
point(Point3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)