Reference Library
ContrastUpperLimit Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayReference »ContrastUpperLimit
 Declaration Syntax
C# | Visual Basic | Visual C++
public static int ContrastUpperLimit { get; }
Public Shared ReadOnly Property ContrastUpperLimit As Integer
	Get
public:
static property int ContrastUpperLimit {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)