Reference Library
CopyTo Method (a, index)
Namespaces »ZwSoft.ZwCAD.Windows »PaneCollection »CopyTo(Pane[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	Pane[] a,
	int index
)
Public Sub CopyTo ( _
	a As Pane(), _
	index As Integer _
)
public:
void CopyTo(
	array<Pane^>^ a,
	int index
)
 Parameters
a(Pane[])
index(Int32)
Assembly: ZwManaged (Module: ZwManaged)