Reference Library
IsZeroLength Method (tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »IsZeroLength(Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsZeroLength(
	Tolerance tolerance
)
Public Function IsZeroLength ( _
	tolerance As Tolerance _
) As Boolean
public:
bool IsZeroLength(
	Tolerance tolerance
)
 Parameters
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)