Reference Library
AcquireDistance Method (options)
Namespaces »ZwSoft.ZwCAD.EditorInput »JigPrompts »AcquireDistance(JigPromptDistanceOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDoubleResult AcquireDistance(
	JigPromptDistanceOptions options
)
Public Function AcquireDistance ( _
	options As JigPromptDistanceOptions _
) As PromptDoubleResult
public:
PromptDoubleResult^ AcquireDistance(
	JigPromptDistanceOptions^ options
)
 Parameters
options(JigPromptDistanceOptions)
Assembly: ZwManaged (Module: ZwManaged)