Reference Library
Height Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBText »Height
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public double Height { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Property Height As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
property double Height {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)