Reference Library
IsPerpendicularTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »IsPerpendicularTo()
 Members
Icon | Member | Description
IsPerpendicularTo(Vector2d, Tolerance)
IsPerpendicularTo(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)