Reference Library
Dimtxsty Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimtxsty
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Dimtxsty { get; set; }
Public Property Dimtxsty As ObjectId
	Get
	Set
public:
property ObjectId Dimtxsty {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)