Reference Library
EndPageEventArgs Constructor (status)
Namespaces »ZwSoft.ZwCAD.PlottingServices »EndPageEventArgs »EndPageEventArgs(SheetCancelStatus)
 Declaration Syntax
C# | Visual Basic | Visual C++
public EndPageEventArgs(
	SheetCancelStatus status
)
Public Sub New ( _
	status As SheetCancelStatus _
)
public:
EndPageEventArgs(
	SheetCancelStatus status
)
 Parameters
status(SheetCancelStatus)
Assembly: ZwManaged (Module: ZwManaged)