Reference Library
SetTextRotation Method (row, col, rot)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetTextRotation(Int32, Int32, RotationAngle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetTextRotation(
	int row,
	int col,
	RotationAngle rot
)
Public Overridable Sub SetTextRotation ( _
	row As Integer, _
	col As Integer, _
	rot As RotationAngle _
)
public:
virtual void SetTextRotation(
	int row,
	int col,
	RotationAngle rot
)
 Parameters
row(Int32)
col(Int32)
rot(RotationAngle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)