Reference Library
TransformBy Method (transform)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »TransformBy(Matrix3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void TransformBy(
	Matrix3d transform
)
Public Overridable Sub TransformBy ( _
	transform As Matrix3d _
)
public:
virtual void TransformBy(
	Matrix3d transform
)
 Parameters
transform(Matrix3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)