Reference Library
CellContentLayout Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellContentLayout
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum CellContentLayout
Public Enumeration CellContentLayout
public enum class CellContentLayout
 Members
Member | Description
StackedVertical
StackedHorizontal
Flow
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)