Reference Library
SnapIsometric Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »SnapIsometric
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool SnapIsometric { get; set; }
Public Property SnapIsometric As Boolean
	Get
	Set
public:
property bool SnapIsometric {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)