Reference Library
ShadowMode Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraits »ShadowMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract ShadowMode ShadowMode { get; set; }
Public MustOverride Property ShadowMode As ShadowMode
	Get
	Set
public:
virtual property ShadowMode ShadowMode {
	ShadowMode get () abstract;
	void set (ShadowMode value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)