Reference Library
SetInteger Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCell »SetInteger(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetInteger(
	int value
)
Public Sub SetInteger ( _
	value As Integer _
)
public:
void SetInteger(
	int value
)
 Parameters
value(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)