Reference Library
SetLinetype Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »SetLinetype(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetLinetype(
	string value
)
Public Sub SetLinetype ( _
	value As String _
)
public:
void SetLinetype(
	String^ value
)
 Parameters
value(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)