Reference Library
ToleranceSuppressZeroFeet Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »ToleranceSuppressZeroFeet
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool ToleranceSuppressZeroFeet { get; set; }
Public Overridable Property ToleranceSuppressZeroFeet As Boolean
	Get
	Set
public:
virtual property bool ToleranceSuppressZeroFeet {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)