Reference Library
BoundingBoxIntersectWith Method (entityPointer, intersectType, projectionPlane, points, thisGraphicSystemMarker, otherGraphicSystemMarker)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void BoundingBoxIntersectWith(
	Entity entityPointer,
	Intersect intersectType,
	Plane projectionPlane,
	Point3dCollection points,
	IntPtr thisGraphicSystemMarker,
	IntPtr otherGraphicSystemMarker
)
Public Sub BoundingBoxIntersectWith ( _
	entityPointer As Entity, _
	intersectType As Intersect, _
	projectionPlane As Plane, _
	points As Point3dCollection, _
	thisGraphicSystemMarker As IntPtr, _
	otherGraphicSystemMarker As IntPtr _
)
public:
void BoundingBoxIntersectWith(
	Entity^ entityPointer,
	Intersect intersectType,
	Plane^ projectionPlane,
	Point3dCollection^ points,
	IntPtr thisGraphicSystemMarker,
	IntPtr otherGraphicSystemMarker
)
 Parameters
entityPointer(Entity)
intersectType(Intersect)
projectionPlane(Plane)
points(Point3dCollection)
thisGraphicSystemMarker(IntPtr)
otherGraphicSystemMarker(IntPtr)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)