Reference Library
Polyline Method (points, normal, subEntityMarker)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »Polyline(Point3dCollection, Vector3d, IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool Polyline(
	Point3dCollection points,
	Vector3d normal,
	IntPtr subEntityMarker
)
Public MustOverride Function Polyline ( _
	points As Point3dCollection, _
	normal As Vector3d, _
	subEntityMarker As IntPtr _
) As Boolean
public:
virtual bool Polyline(
	Point3dCollection^ points,
	Vector3d normal,
	IntPtr subEntityMarker
) abstract
 Parameters
points(Point3dCollection)
normal(Vector3d)
subEntityMarker(IntPtr)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)