Reference Library
Contains Method (p)
Namespaces »ZwSoft.ZwCAD.Geometry »Point2dCollection »Contains(Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Contains(
	Point2d p
)
Public Function Contains ( _
	p As Point2d _
) As Boolean
public:
bool Contains(
	Point2d p
)
 Parameters
p(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)