Reference Library
LinkedTableEnumerator Constructor (tab, eOpt)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableEnumerator »LinkedTableEnumerator(LinkedTableData, TableEnumeratorOption)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LinkedTableEnumerator(
	LinkedTableData tab,
	TableEnumeratorOption eOpt
)
Public Sub New ( _
	tab As LinkedTableData, _
	eOpt As TableEnumeratorOption _
)
public:
LinkedTableEnumerator(
	LinkedTableData^ tab,
	TableEnumeratorOption eOpt
)
 Parameters
tab(LinkedTableData)
eOpt(TableEnumeratorOption)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)