Reference Library
ToleranceLocation Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »ToleranceLocation
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d ToleranceLocation { get; set; }
Public Property ToleranceLocation As Point3d
	Get
	Set
public:
property Point3d ToleranceLocation {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)