Reference Library
GetPointOnCurve1 Method (intersection)
Namespaces »ZwSoft.ZwCAD.Geometry »CurveCurveIntersector3d »GetPointOnCurve1(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnCurve3d GetPointOnCurve1(
	int intersection
)
Public Function GetPointOnCurve1 ( _
	intersection As Integer _
) As PointOnCurve3d
public:
PointOnCurve3d^ GetPointOnCurve1(
	int intersection
)
 Parameters
intersection(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)