Reference Library
Twist Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Helix »Twist
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Twist { get; set; }
Public Property Twist As Boolean
	Get
	Set
public:
property bool Twist {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)