Reference Library
RefreshLists Method (plotSet)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsValidator »RefreshLists(PlotSettings)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void RefreshLists(
	PlotSettings plotSet
)
Public Sub RefreshLists ( _
	plotSet As PlotSettings _
)
public:
void RefreshLists(
	PlotSettings^ plotSet
)
 Parameters
plotSet(PlotSettings)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)