Reference Library
LocalToGlobalParameter Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »CompositeCurve3d »LocalToGlobalParameter(CompositeParameter)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LocalToGlobalParameter(
	CompositeParameter value
)
Public Function LocalToGlobalParameter ( _
	value As CompositeParameter _
) As Double
public:
double LocalToGlobalParameter(
	CompositeParameter value
)
 Parameters
value(CompositeParameter)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)