Reference Library
Refraction Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraitsTraceParameter »Refraction
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Refraction { get; }
Public ReadOnly Property Refraction As Integer
	Get
public:
property int Refraction {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)