Reference Library
HelpTopic Property
Namespaces »ZwSoft.ZwCAD.Runtime »LispFunctionAttribute »HelpTopic
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string HelpTopic { get; }
Public Overridable ReadOnly Property HelpTopic As String
	Get
public:
virtual property String^ HelpTopic {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)