Reference Library
MLStyleDictionaryId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »MLStyleDictionaryId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId MLStyleDictionaryId { get; }
Public ReadOnly Property MLStyleDictionaryId As ObjectId
	Get
public:
property ObjectId MLStyleDictionaryId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)