Reference Library
GetClosestPointTo Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Helix »GetClosestPointTo()
 Members
Icon | Member | Description
GetClosestPointTo(Point3d, Vector3d, Boolean)
GetClosestPointTo(Point3d, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)