Reference Library
DisassociateUcsFromView Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewTableRecord »DisassociateUcsFromView()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void DisassociateUcsFromView()
Public Sub DisassociateUcsFromView
public:
void DisassociateUcsFromView()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)