Reference Library
ReadSoftOwnershipId Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »ReadSoftOwnershipId()
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract ObjectId ReadSoftOwnershipId()
Public MustOverride Function ReadSoftOwnershipId As ObjectId
public:
virtual ObjectId ReadSoftOwnershipId() abstract
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)