Reference Library
WblockCloneObjects Method (identifiers, id, mapping, cloning, deferTranslation)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »WblockCloneObjects(ObjectIdCollection, ObjectId, IdMapping, DuplicateRecordCloning, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void WblockCloneObjects(
	ObjectIdCollection identifiers,
	ObjectId id,
	IdMapping mapping,
	DuplicateRecordCloning cloning,
	bool deferTranslation
)
Public Sub WblockCloneObjects ( _
	identifiers As ObjectIdCollection, _
	id As ObjectId, _
	mapping As IdMapping, _
	cloning As DuplicateRecordCloning, _
	deferTranslation As Boolean _
)
public:
void WblockCloneObjects(
	ObjectIdCollection^ identifiers,
	ObjectId id,
	IdMapping^ mapping,
	DuplicateRecordCloning cloning,
	bool deferTranslation
)
 Parameters
identifiers(ObjectIdCollection)
id(ObjectId)
mapping(IdMapping)
cloning(DuplicateRecordCloning)
deferTranslation(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)