Reference Library
DwfNode Constructor (nodeId, nodeName)
Namespaces »ZwSoft.ZwCAD.Publishing »DwfNode »DwfNode(Int32, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DwfNode(
	int nodeId,
	string nodeName
)
Public Sub New ( _
	nodeId As Integer, _
	nodeName As String _
)
public:
DwfNode(
	int nodeId,
	String^ nodeName
)
 Parameters
nodeId(Int32)
nodeName(String)
Assembly: ZwManaged (Module: ZwManaged)