Reference Library
Create Method (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.Geometry »OffsetSurface »Create(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static OffsetSurface Create(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Public Shared Function Create ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
) As OffsetSurface
public:
static OffsetSurface^ Create(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)