Reference Library
SelectionFilter Constructor (value)
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionFilter »SelectionFilter(TypedValue[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public SelectionFilter(
	TypedValue[] value
)
Public Sub New ( _
	value As TypedValue() _
)
public:
SelectionFilter(
	array<TypedValue>^ value
)
 Parameters
value(TypedValue[])
Assembly: ZwManaged (Module: ZwManaged)