Reference Library
RevolvedSurface Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolvedSurface »RevolvedSurface()
 Members
Icon | Member | Description
RevolvedSurface()
RevolvedSurface(IntPtr, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)