Reference Library
EndGenerateGraphics Method (parameters)
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotEngine »EndGenerateGraphics(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void EndGenerateGraphics(
	Object parameters
)
Public Sub EndGenerateGraphics ( _
	parameters As Object _
)
public:
void EndGenerateGraphics(
	Object^ parameters
)
 Parameters
parameters(Object)
Assembly: ZwManaged (Module: ZwManaged)