Reference Library
GetTrimmedOffset Method
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »GetTrimmedOffset()
 Members
Icon | Member | Description
GetTrimmedOffset(Double, Vector3d, OffsetCurveExtensionType, Tolerance)
GetTrimmedOffset(Double, Vector3d, OffsetCurveExtensionType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)