Reference Library
BlockTableRecord Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockTableRecord
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbBlockTableRecord")]
public class BlockTableRecord : SymbolTableRecord,
	IEnumerable
<WrapperAttribute("AcDbBlockTableRecord")> _
Public Class BlockTableRecord _
	Inherits SymbolTableRecord _
	Implements IEnumerable
[WrapperAttribute(L"AcDbBlockTableRecord")]
public ref class BlockTableRecord : public SymbolTableRecord,
	IEnumerable
 Members
All Members | Constructors | Methods | Properties | Fields | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
BlockTableRecord()
BlockTableRecord(IntPtr, Boolean)
AppendEntity(Entity)
AssumeOwnershipOf(ObjectIdCollection)
BlockBeginId
BlockEndId
BlockInsertionPoints
BlockScaling
Comments
Copy()
DrawOrderTableId
Explodable
GetAnonymousBlockIds()
GetBlockReferenceIds(Boolean, Boolean)
GetEnumerator()
GetErasedBlockReferenceIds()
GetXrefDatabase(Boolean)
HasAttributeDefinitions
HasPreviewIcon
IEnumerable_GetEnumerator()
IncludingErased
IsAnonymous
IsDynamicBlock
IsFromExternalReference
IsFromOverlayReference
IsLayout
IsUnloaded
LayoutId
ModelSpace
Origin
PaperSpace
PathName
PreviewIcon
SkipDeleted
Units
UpdateAnonymousBlocks()
XrefStatus
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | SymbolTableRecord
|  |  |  |  |  | BlockTableRecord
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)