Reference Library
LowerLeftPrintableArea Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »MediaBounds »LowerLeftPrintableArea
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d LowerLeftPrintableArea { get; set; }
Public Property LowerLeftPrintableArea As Point2d
	Get
	Set
public:
property Point2d LowerLeftPrintableArea {
	Point2d get ();
	void set (Point2d value);
}
Assembly: ZwManaged (Module: ZwManaged)