Reference Library
GetNode Method (nodeId)
Namespaces »ZwSoft.ZwCAD.Publishing »PublishEntityEventArgs »GetNode(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DwfNode GetNode(
	int nodeId
)
Public Function GetNode ( _
	nodeId As Integer _
) As DwfNode
public:
DwfNode^ GetNode(
	int nodeId
)
 Parameters
nodeId(Int32)
Assembly: ZwManaged (Module: ZwManaged)