Reference Library
HidePrecision Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeStyle »HidePrecision
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool HidePrecision { get; set; }
Public Property HidePrecision As Boolean
	Get
	Set
public:
property bool HidePrecision {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)