Reference Library
Panes Property
Namespaces »ZwSoft.ZwCAD.Windows »StatusBar »Panes
 Declaration Syntax
C# | Visual Basic | Visual C++
public PaneCollection Panes { get; }
Public ReadOnly Property Panes As PaneCollection
	Get
public:
property PaneCollection^ Panes {
	PaneCollection^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)