Reference Library
IndexOf Method (value)
Namespaces »ZwSoft.ZwCAD.Colors »TransparencyCollection »IndexOf(Transparency)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int IndexOf(
	Transparency value
)
Public Function IndexOf ( _
	value As Transparency _
) As Integer
public:
virtual int IndexOf(
	Transparency value
) sealed
 Parameters
value(Transparency)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)