Reference Library
Interferevpvs Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Interferevpvs
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Interferevpvs { get; set; }
Public Property Interferevpvs As ObjectId
	Get
	Set
public:
property ObjectId Interferevpvs {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)