Reference Library
PlotLogger Property
Namespaces »ZwSoft.ZwCAD.Publishing »BeginPublishingSheetEventArgs »PlotLogger
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlotLogger PlotLogger { get; }
Public ReadOnly Property PlotLogger As PlotLogger
	Get
public:
property PlotLogger^ PlotLogger {
	PlotLogger^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)