Reference Library
Overhang Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeStyle »Overhang
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Overhang { get; set; }
Public Property Overhang As Integer
	Get
	Set
public:
property int Overhang {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)