Reference Library
PromptEntityResult Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptEntityResult
 Declaration Syntax
C# | Visual Basic | Visual C++
public class PromptEntityResult : PromptResult
Public Class PromptEntityResult _
	Inherits PromptResult
public ref class PromptEntityResult : public PromptResult
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
ObjectId
PickedPoint
ToString(IFormatProvider)
ToString() |  (Overrides PromptResult.ToString().)
 Inheritance Hierarchy
Object
PromptResult
| PromptEntityResult
|  | PromptNestedEntityResult
Assembly: ZwManaged (Module: ZwManaged)