Reference Library
EffectivePlotOffsetXDevice Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »EffectivePlotOffsetXDevice
 Declaration Syntax
C# | Visual Basic | Visual C++
public int EffectivePlotOffsetXDevice { get; }
Public ReadOnly Property EffectivePlotOffsetXDevice As Integer
	Get
public:
property int EffectivePlotOffsetXDevice {
	int get ();
}
Assembly: ZwManaged (Module: ZwManaged)