Reference Library
Add Method (value)
Namespaces »ZwSoft.ZwCAD.Publishing »EPlotPropertyCollection »Add(EPlotProperty)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Add(
	EPlotProperty value
)
Public Sub Add ( _
	value As EPlotProperty _
)
public:
virtual void Add(
	EPlotProperty^ value
) sealed
 Parameters
value(EPlotProperty)
Assembly: ZwManaged (Module: ZwManaged)