Reference Library
CreateSphere Method (radius)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »CreateSphere(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void CreateSphere(
	double radius
)
Public Overridable Sub CreateSphere ( _
	radius As Double _
)
public:
virtual void CreateSphere(
	double radius
)
 Parameters
radius(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)