Reference Library
CreateRevolvedSurface Method (revolveEntity, axisPoint, axisDirection, revolveAngle, startAngle, revolveOptions)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolvedSurface »CreateRevolvedSurface(Entity, Point3d, Vector3d, Double, Double, RevolveOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CreateRevolvedSurface(
	Entity revolveEntity,
	Point3d axisPoint,
	Vector3d axisDirection,
	double revolveAngle,
	double startAngle,
	RevolveOptions revolveOptions
)
Public Sub CreateRevolvedSurface ( _
	revolveEntity As Entity, _
	axisPoint As Point3d, _
	axisDirection As Vector3d, _
	revolveAngle As Double, _
	startAngle As Double, _
	revolveOptions As RevolveOptions _
)
public:
void CreateRevolvedSurface(
	Entity^ revolveEntity,
	Point3d axisPoint,
	Vector3d axisDirection,
	double revolveAngle,
	double startAngle,
	RevolveOptions^ revolveOptions
)
 Parameters
revolveEntity(Entity)
axisPoint(Point3d)
axisDirection(Vector3d)
revolveAngle(Double)
startAngle(Double)
revolveOptions(RevolveOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)