Reference Library
SymbolTable Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolTable
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbSymbolTable")]
public abstract class SymbolTable : DBObject,
	IEnumerable
<WrapperAttribute("AcDbSymbolTable")> _
Public MustInherit Class SymbolTable _
	Inherits DBObject _
	Implements IEnumerable
[WrapperAttribute(L"AcDbSymbolTable")]
public ref class SymbolTable abstract : public DBObject,
	IEnumerable
 Members
All Members | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Add(SymbolTableRecord)
GetEnumerator()
Has(String)
Has(ObjectId)
IEnumerable_GetEnumerator()
IncludingErased
Item[String]
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | SymbolTable
|  |  |  |  |  | AbstractViewTable
|  |  |  |  |  | BlockTable
|  |  |  |  |  | DimStyleTable
|  |  |  |  |  | LayerTable
|  |  |  |  |  | LinetypeTable
|  |  |  |  |  | RegAppTable
|  |  |  |  |  | TextStyleTable
|  |  |  |  |  | UcsTable
|  |  |  |  |  | ViewportTable
|  |  |  |  |  | ViewTable
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)