Reference Library
EnableLanding Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »EnableLanding
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool EnableLanding { get; set; }
Public Property EnableLanding As Boolean
	Get
	Set
public:
property bool EnableLanding {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)