Reference Library
IsSolid Property
Namespaces »ZwSoft.ZwCAD.Colors »Transparency »IsSolid
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsSolid { get; }
Public ReadOnly Property IsSolid As Boolean
	Get
public:
property bool IsSolid {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)