Reference Library
Clone Method
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »Clone()
 Declaration Syntax
C# | Visual Basic | Visual C++
public View Clone()
Public Function Clone As View
public:
View^ Clone()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)