Reference Library
GraphNodeCollection Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GraphNodeCollection
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class GraphNodeCollection : DisposableWrapper,
	IList
Public NotInheritable Class GraphNodeCollection _
	Inherits DisposableWrapper _
	Implements IList
public ref class GraphNodeCollection sealed : public DisposableWrapper,
	IList
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
GraphNodeCollection()
Add(GraphNode)
Clear()
Contains(GraphNode)
CopyTo(GraphNode[], Int32)
Count
GetEnumerator()
ICollection.CopyTo(Array, Int32)
IList.Add(Object)
IList.Contains(Object)
IList.IndexOf(Object)
IList.Insert(Int32, Object)
IListIsFixedSize
IListIsReadOnly
IListItem[Int32]
IList.Remove(Object)
IndexOf(GraphNode)
Insert(Int32, GraphNode)
IsSynchronized
Item[Int32]
Remove(GraphNode)
RemoveAt(Int32)
SyncRoot
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | GraphNodeCollection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)