Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.Windows »TrayItemCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public TrayItem this[
	int index
] { get; set; }
Public Default Property Item ( _
	index As Integer _
) As TrayItem
	Get
	Set
public:
property TrayItem^ default[int index] {
	TrayItem^ get (int index);
	void set (int index, TrayItem^ value);
}
 Parameters
index(Int32)
Assembly: ZwManaged (Module: ZwManaged)