Reference Library
SetBreakOffset Method (index, offset)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetBreakOffset(Int32, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetBreakOffset(
	int index,
	Vector3d offset
)
Public Overridable Sub SetBreakOffset ( _
	index As Integer, _
	offset As Vector3d _
)
public:
virtual void SetBreakOffset(
	int index,
	Vector3d offset
)
 Parameters
index(Int32)
offset(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)