Reference Library
GetHatchPatternName Method (nSecType, nGeometry)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »GetHatchPatternName(SectionType, SectionGeometry)
 Declaration Syntax
C# | Visual Basic | Visual C++
public string GetHatchPatternName(
	SectionType nSecType,
	SectionGeometry nGeometry
)
Public Function GetHatchPatternName ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry _
) As String
public:
String^ GetHatchPatternName(
	SectionType nSecType,
	SectionGeometry nGeometry
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)