Reference Library
DisplayMinX Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »DisplayMinX
 Declaration Syntax
C# | Visual Basic | Visual C++
public double DisplayMinX { get; }
Public ReadOnly Property DisplayMinX As Double
	Get
public:
property double DisplayMinX {
	double get ();
}
Assembly: ZwManaged (Module: ZwManaged)