Reference Library
Curve Property
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve3d »Curve
 Declaration Syntax
C# | Visual Basic | Visual C++
public Curve3d Curve { get; set; }
Public Property Curve As Curve3d
	Get
	Set
public:
property Curve3d^ Curve {
	Curve3d^ get ();
	void set (Curve3d^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)