Reference Library
BlockConnectionType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeaderStyle »BlockConnectionType
 Declaration Syntax
C# | Visual Basic | Visual C++
public BlockConnectionType BlockConnectionType { get; set; }
Public Property BlockConnectionType As BlockConnectionType
	Get
	Set
public:
property BlockConnectionType BlockConnectionType {
	BlockConnectionType get ();
	void set (BlockConnectionType value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)