Reference Library
Exception Constructor (es, message)
Namespaces »ZwSoft.ZwCAD.Runtime »Exception »Exception(ErrorStatus, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Exception(
	ErrorStatus es,
	string message
)
Public Sub New ( _
	es As ErrorStatus, _
	message As String _
)
public:
Exception(
	ErrorStatus es,
	String^ message
)
 Parameters
es(ErrorStatus)
message(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)