Reference Library
UniqueEntityId Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishEntityEventArgs »UniqueEntityId
 Declaration Syntax
C# | Visual Basic | Visual C++
public string UniqueEntityId { get; }
Public ReadOnly Property UniqueEntityId As String
	Get
public:
property String^ UniqueEntityId {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)