Reference Library
LayerTableRecord Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerTableRecord »LayerTableRecord()
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerTableRecord()
Public Sub New
public:
LayerTableRecord()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)