Reference Library
Status Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »EndDocumentEventArgs »Status
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlotCancelStatus Status { get; }
Public ReadOnly Property Status As PlotCancelStatus
	Get
public:
property PlotCancelStatus Status {
	PlotCancelStatus get ();
}
Assembly: ZwManaged (Module: ZwManaged)