Reference Library
Overrides Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellBorder »Overrides
 Declaration Syntax
C# | Visual Basic | Visual C++
public Nullable<GridProperties> Overrides { get; set; }
Public Property Overrides As Nullable(Of GridProperties)
	Get
	Set
public:
property Nullable<GridProperties> Overrides {
	Nullable<GridProperties> get ();
	void set (Nullable<GridProperties> value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)