Reference Library
HitTest Method (point, viewVector)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »HitTest(Point3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual TableHitTestInfo HitTest(
	Point3d point,
	Vector3d viewVector
)
Public Overridable Function HitTest ( _
	point As Point3d, _
	viewVector As Vector3d _
) As TableHitTestInfo
public:
virtual TableHitTestInfo HitTest(
	Point3d point,
	Vector3d viewVector
)
 Parameters
point(Point3d)
viewVector(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)