Reference Library
PromptKeywordOptions Constructor (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptKeywordOptions »PromptKeywordOptions(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptKeywordOptions(
	string message
)
Public Sub New ( _
	message As String _
)
public:
PromptKeywordOptions(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)