Reference Library
IsEqualTo Method (a)
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »IsEqualTo(Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	Point2d a
)
Public Function IsEqualTo ( _
	a As Point2d _
) As Boolean
public:
bool IsEqualTo(
	Point2d a
)
 Parameters
a(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)