Reference Library
FitPointAt Method (i)
Namespaces »ZwSoft.ZwCAD.Geometry »PolylineCurve3d »FitPointAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d FitPointAt(
	int i
)
Public Function FitPointAt ( _
	i As Integer _
) As Point3d
public:
Point3d FitPointAt(
	int i
)
 Parameters
i(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)