Reference Library
MTextFragment Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MTextFragment
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbMTextFragment")]
public sealed class MTextFragment : DisposableWrapper
<WrapperAttribute("ZcDbMTextFragment")> _
Public NotInheritable Class MTextFragment _
	Inherits DisposableWrapper
[WrapperAttribute(L"ZcDbMTextFragment")]
public ref class MTextFragment sealed : public DisposableWrapper
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
BigFont
Bold
CapsHeight
Color
Direction
Extents
GetOverLinePoints()
GetUnderLinePoints()
Italic
LineBreak
Location
NewParagraph
Normal
ObliqueAngle
Overlined
ShxFont
StackBottom
StackTop
Text
TrackingFactor
TrueTypeFont
Underlined
WidthFactor
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | MTextFragment
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)