Reference Library
PromptingForAngle Event
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »PromptingForAngle
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PromptAngleOptionsEventHandler PromptingForAngle
Public Event PromptingForAngle As PromptAngleOptionsEventHandler
public:
 event PromptAngleOptionsEventHandler^ PromptingForAngle {
	void add (PromptAngleOptionsEventHandler^ value);
	void remove (PromptAngleOptionsEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)