Reference Library
DatabaseSummaryInfo Structure
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DatabaseSummaryInfo
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbDatabaseSummaryInfo")]
public struct DatabaseSummaryInfo
<WrapperAttribute("ZcDbDatabaseSummaryInfo")> _
Public Structure DatabaseSummaryInfo
[WrapperAttribute(L"ZcDbDatabaseSummaryInfo")]
public value class DatabaseSummaryInfo
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Author
Comments
CustomProperties
Equality(DatabaseSummaryInfo, DatabaseSummaryInfo)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
HyperlinkBase
Inequality(DatabaseSummaryInfo, DatabaseSummaryInfo)
Keywords
LastSavedBy
RevisionNumber
Subject
Title
ToString(IFormatProvider)
ToString() |  (Overrides ValueType.ToString().)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)