Reference Library
Scale3d Constructor (x, y, z)
Namespaces »ZwSoft.ZwCAD.Geometry »Scale3d »Scale3d(Double, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Scale3d(
	double x,
	double y,
	double z
)
Public Sub New ( _
	x As Double, _
	y As Double, _
	z As Double _
)
public:
Scale3d(
	double x,
	double y,
	double z
)
 Parameters
x(Double)
y(Double)
z(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)