Reference Library
PushPositionTransform Method (behavior, offset)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »PushPositionTransform(PositionBehavior, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Matrix3d PushPositionTransform(
	PositionBehavior behavior,
	Point2d offset
)
Public MustOverride Function PushPositionTransform ( _
	behavior As PositionBehavior, _
	offset As Point2d _
) As Matrix3d
public:
virtual Matrix3d PushPositionTransform(
	PositionBehavior behavior,
	Point2d offset
) abstract
 Parameters
behavior(PositionBehavior)
offset(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)