Reference Library
SetCellStyle Method (row, column, styleName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetCellStyle(Int32, Int32, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetCellStyle(
	int row,
	int column,
	string styleName
)
Public Overridable Sub SetCellStyle ( _
	row As Integer, _
	column As Integer, _
	styleName As String _
)
public:
virtual void SetCellStyle(
	int row,
	int column,
	String^ styleName
)
 Parameters
row(Int32)
column(Int32)
styleName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)