Reference Library
Dimtvp Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimtvp
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Unitless)]
public virtual double Dimtvp { get; set; }
<UnitTypeAttribute(UnitType.Unitless)> _
Public Overridable Property Dimtvp As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Unitless)]
public:
virtual property double Dimtvp {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)