Reference Library
EndPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Line »EndPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public override Point3d EndPoint { get; set; }
Public Overrides Property EndPoint As Point3d
	Get
	Set
public:
virtual property Point3d EndPoint {
	Point3d get () override;
	void set (Point3d value) override;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)