Reference Library
BackgroundColor Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »BackgroundColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Color BackgroundColor { get; set; }
Public MustOverride Property BackgroundColor As Color
	Get
	Set
public:
virtual property Color BackgroundColor {
	Color get () abstract;
	void set (Color value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)