Reference Library
DocumentCreateStarted Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentCollection »DocumentCreateStarted
 Declaration Syntax
C# | Visual Basic | Visual C++
public event DocumentCollectionEventHandler DocumentCreateStarted
Public Event DocumentCreateStarted As DocumentCollectionEventHandler
public:
 event DocumentCollectionEventHandler^ DocumentCreateStarted {
	void add (DocumentCollectionEventHandler^ value);
	void remove (DocumentCollectionEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)