Reference Library
InsertMappingAvailable Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »InsertMappingAvailable
 Declaration Syntax
C# | Visual Basic | Visual C++
public event IdMappingEventHandler InsertMappingAvailable
Public Event InsertMappingAvailable As IdMappingEventHandler
public:
 event IdMappingEventHandler^ InsertMappingAvailable {
	void add (IdMappingEventHandler^ value);
	void remove (IdMappingEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)