Reference Library
TopPlane Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Section »TopPlane
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public double TopPlane { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Property TopPlane As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
property double TopPlane {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)