Reference Library
OsnapType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »OsnapPointRef »OsnapType
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectSnapModes OsnapType { get; set; }
Public Property OsnapType As ObjectSnapModes
	Get
	Set
public:
property ObjectSnapModes OsnapType {
	ObjectSnapModes get ();
	void set (ObjectSnapModes value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)