Reference Library
BottomRightPlusOne Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »BottomRightPlusOne
 Declaration Syntax
C# | Visual Basic | Visual C++
public Cell BottomRightPlusOne { get; }
Public ReadOnly Property BottomRightPlusOne As Cell
	Get
public:
property Cell^ BottomRightPlusOne {
	Cell^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)