Reference Library
XclipFrame Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »XclipFrame
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool XclipFrame { get; set; }
Public Property XclipFrame As Boolean
	Get
	Set
public:
property bool XclipFrame {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)