Reference Library
SetBlockAttributeValue Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetBlockAttributeValue()
 Members
Icon | Member | Description
SetBlockAttributeValue(Int32, Int32, Int32, ObjectId, String)
SetBlockAttributeValue(Int32, Int32, ObjectId, String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)