Reference Library
GlobalCommandName Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentLockModeChangeVetoedEventArgs »GlobalCommandName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string GlobalCommandName { get; }
Public ReadOnly Property GlobalCommandName As String
	Get
public:
property String^ GlobalCommandName {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)