Reference Library
RenderType Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »RenderType
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum RenderType
Public Enumeration RenderType
public enum class RenderType
 Members
Member | Description
HighlightSelection
Highlight
Direct
Sprite
Main
Count
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)