Reference Library
GetArea Method (startingParameter, endingParameter, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »GetArea(Double, Double, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetArea(
	double startingParameter,
	double endingParameter,
	Tolerance tolerance
)
Public Function GetArea ( _
	startingParameter As Double, _
	endingParameter As Double, _
	tolerance As Tolerance _
) As Double
public:
double GetArea(
	double startingParameter,
	double endingParameter,
	Tolerance tolerance
)
 Parameters
startingParameter(Double)
endingParameter(Double)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)