Reference Library
EndCaps Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »EndCaps
 Declaration Syntax
C# | Visual Basic | Visual C++
public EndCap EndCaps { get; set; }
Public Property EndCaps As EndCap
	Get
	Set
public:
property EndCap EndCaps {
	EndCap get ();
	void set (EndCap value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)