Reference Library
EntityColor Constructor (trueColor)
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor »EntityColor(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public EntityColor(
	int trueColor
)
Public Sub New ( _
	trueColor As Integer _
)
public:
EntityColor(
	int trueColor
)
 Parameters
trueColor(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)