Reference Library
GetAngle Method (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »GetAngle(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDoubleResult GetAngle(
	string message
)
Public Function GetAngle ( _
	message As String _
) As PromptDoubleResult
public:
PromptDoubleResult^ GetAngle(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)