Reference Library
Polyline Method (value, fromIndex, segments)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »Polyline(Polyline, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool Polyline(
	Polyline value,
	int fromIndex,
	int segments
)
Public MustOverride Function Polyline ( _
	value As Polyline, _
	fromIndex As Integer, _
	segments As Integer _
) As Boolean
public:
virtual bool Polyline(
	Polyline^ value,
	int fromIndex,
	int segments
) abstract
 Parameters
value(Polyline)
fromIndex(Int32)
segments(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)