Reference Library
DynamicDimensionData Constructor (dimension, editable, hideIfValueIsZero)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicDimensionData »DynamicDimensionData(Dimension, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DynamicDimensionData(
	Dimension dimension,
	bool editable,
	bool hideIfValueIsZero
)
Public Sub New ( _
	dimension As Dimension, _
	editable As Boolean, _
	hideIfValueIsZero As Boolean _
)
public:
DynamicDimensionData(
	Dimension^ dimension,
	bool editable,
	bool hideIfValueIsZero
)
 Parameters
dimension(Dimension)
editable(Boolean)
hideIfValueIsZero(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)