Reference Library
SetFitData Method (fitKnots, fitPoints, startTangent, endTangent, fitTolerance, periodic)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »SetFitData(KnotCollection, Point2dCollection, Vector2d, Vector2d, Tolerance, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFitData(
	KnotCollection fitKnots,
	Point2dCollection fitPoints,
	Vector2d startTangent,
	Vector2d endTangent,
	Tolerance fitTolerance,
	bool periodic
)
Public Sub SetFitData ( _
	fitKnots As KnotCollection, _
	fitPoints As Point2dCollection, _
	startTangent As Vector2d, _
	endTangent As Vector2d, _
	fitTolerance As Tolerance, _
	periodic As Boolean _
)
public:
void SetFitData(
	KnotCollection^ fitKnots,
	Point2dCollection^ fitPoints,
	Vector2d startTangent,
	Vector2d endTangent,
	Tolerance fitTolerance,
	bool periodic
)
 Parameters
fitKnots(KnotCollection)
fitPoints(Point2dCollection)
startTangent(Vector2d)
endTangent(Vector2d)
fitTolerance(Tolerance)
periodic(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)