Reference Library
Dimupt Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimupt
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Dimupt { get; set; }
Public Property Dimupt As Boolean
	Get
	Set
public:
property bool Dimupt {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)