Reference Library
Dimtvp Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimtvp
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Dimtvp { get; set; }
Public Property Dimtvp As Double
	Get
	Set
public:
property double Dimtvp {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)