Reference Library
EndPageEventArgs Class
Namespaces »ZwSoft.ZwCAD.PlottingServices »EndPageEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public class EndPageEventArgs : EventArgs
Public Class EndPageEventArgs _
	Inherits EventArgs
public ref class EndPageEventArgs : public EventArgs
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
EndPageEventArgs(SheetCancelStatus)
Status
 Inheritance Hierarchy
Object
EventArgs
| EndPageEventArgs
Assembly: ZwManaged (Module: ZwManaged)