Reference Library
View Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ViewEventArgs »View
 Declaration Syntax
C# | Visual Basic | Visual C++
public View View { get; }
Public ReadOnly Property View As View
	Get
public:
property View^ View {
	View^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)