Reference Library
SelectionAddedEventArgs Class
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionAddedEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class SelectionAddedEventArgs : EventArgs,
	IDisposable
Public NotInheritable Class SelectionAddedEventArgs _
	Inherits EventArgs _
	Implements IDisposable
public ref class SelectionAddedEventArgs sealed : public EventArgs,
	IDisposable
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Add(SelectedObject)
AddedObjects
AddSubEntity(SelectedSubObject)
Dispose()
Flags
Highlight(Int32, FullSubentityPath)
Remove(Int32)
RemoveSubEntity(Int32, Int32)
Selection
 Inheritance Hierarchy
Object
EventArgs
| SelectionAddedEventArgs
Assembly: ZwManaged (Module: ZwManaged)