Reference Library
Entry Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DbDictionaryEnumerator »Entry
 Declaration Syntax
C# | Visual Basic | Visual C++
public DBDictionaryEntry Entry { get; }
Public ReadOnly Property Entry As DBDictionaryEntry
	Get
public:
property DBDictionaryEntry Entry {
	DBDictionaryEntry get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)