Reference Library
SequenceEnd Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SequenceEnd
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbSequenceEnd")]
public class SequenceEnd : Entity
<WrapperAttribute("AcDbSequenceEnd")> _
Public Class SequenceEnd _
	Inherits Entity
[WrapperAttribute(L"AcDbSequenceEnd")]
public ref class SequenceEnd : public Entity
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
SequenceEnd()
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | SequenceEnd
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)