Reference Library
Set Method (curve1, curve2, range1, range2, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »CurveCurveIntersector2d »Set(Curve2d, Curve2d, Interval, Interval, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	Curve2d curve1,
	Curve2d curve2,
	Interval range1,
	Interval range2,
	Tolerance tolerance
)
Public Sub Set ( _
	curve1 As Curve2d, _
	curve2 As Curve2d, _
	range1 As Interval, _
	range2 As Interval, _
	tolerance As Tolerance _
)
public:
void Set(
	Curve2d^ curve1,
	Curve2d^ curve2,
	Interval^ range1,
	Interval^ range2,
	Tolerance tolerance
)
 Parameters
curve1(Curve2d)
curve2(Curve2d)
range1(Interval)
range2(Interval)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)