Reference Library
PromptedForDistance Event
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »PromptedForDistance
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PromptDoubleResultEventHandler PromptedForDistance
Public Event PromptedForDistance As PromptDoubleResultEventHandler
public:
 event PromptDoubleResultEventHandler^ PromptedForDistance {
	void add (PromptDoubleResultEventHandler^ value);
	void remove (PromptDoubleResultEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)