Reference Library
SetDataType Method (row, column, dataType, unitType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »SetDataType(Int32, Int32, DataType, UnitType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetDataType(
	int row,
	int column,
	DataType dataType,
	UnitType unitType
)
Public Overridable Sub SetDataType ( _
	row As Integer, _
	column As Integer, _
	dataType As DataType, _
	unitType As UnitType _
)
public:
virtual void SetDataType(
	int row,
	int column,
	DataType dataType,
	UnitType unitType
)
 Parameters
row(Int32)
column(Int32)
dataType(DataType)
unitType(UnitType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)