Reference Library
GridAdaptive Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewportTableRecord »GridAdaptive
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool GridAdaptive { get; set; }
Public Property GridAdaptive As Boolean
	Get
	Set
public:
property bool GridAdaptive {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)