Reference Library
Author Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DatabaseSummaryInfo »Author
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Author { get; }
Public ReadOnly Property Author As String
	Get
public:
property String^ Author {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)