Reference Library
CanConvertFrom Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnitsConverter »CanConvertFrom()
 Members
Icon | Member | Description
CanConvertFrom(ITypeDescriptorContext, Type) |  (Overrides TypeConverter.CanConvertFrom(ITypeDescriptorContext, Type).)
CanConvertFrom(Type)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)