Reference Library
Dimatfit Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimatfit
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Dimatfit { get; set; }
Public Overridable Property Dimatfit As Integer
	Get
	Set
public:
virtual property int Dimatfit {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)