Reference Library
HatchVisibility Method (nSecType, nGeometry)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »HatchVisibility(SectionType, SectionGeometry)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool HatchVisibility(
	SectionType nSecType,
	SectionGeometry nGeometry
)
Public Function HatchVisibility ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry _
) As Boolean
public:
bool HatchVisibility(
	SectionType nSecType,
	SectionGeometry nGeometry
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)