Reference Library
GetAsVector Method
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »GetAsVector()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector2d GetAsVector()
Public Function GetAsVector As Vector2d
public:
Vector2d GetAsVector()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)