Reference Library
ObliquingAngle Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »TextStyle »ObliquingAngle
 Declaration Syntax
C# | Visual Basic | Visual C++
public double ObliquingAngle { get; set; }
Public Property ObliquingAngle As Double
	Get
	Set
public:
property double ObliquingAngle {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)