Reference Library
TransformBy Method ()
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock3d »TransformBy(Matrix3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void TransformBy(
	Matrix3d
)
Public Sub TransformBy ( _
	 As Matrix3d _
)
public:
void TransformBy(
	Matrix3d
)
 Parameters
(Matrix3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)