Reference Library
NurbCurve2d Constructor (ellipse)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »NurbCurve2d(EllipticalArc2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public NurbCurve2d(
	EllipticalArc2d ellipse
)
Public Sub New ( _
	ellipse As EllipticalArc2d _
)
public:
NurbCurve2d(
	EllipticalArc2d^ ellipse
)
 Parameters
ellipse(EllipticalArc2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)