Reference Library
IsProportional Method (tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Scale2d »IsProportional(Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsProportional(
	Tolerance tolerance
)
Public Function IsProportional ( _
	tolerance As Tolerance _
) As Boolean
public:
bool IsProportional(
	Tolerance tolerance
)
 Parameters
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)