Reference Library
Y Property
Namespaces »ZwSoft.ZwCAD.Geometry »Scale3d »Y
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Y { get; }
Public ReadOnly Property Y As Double
	Get
public:
property double Y {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)