Reference Library
SetEndWidthAt Method (index, endWidth)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline »SetEndWidthAt(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetEndWidthAt(
	int index,
	double endWidth
)
Public Sub SetEndWidthAt ( _
	index As Integer, _
	endWidth As Double _
)
public:
void SetEndWidthAt(
	int index,
	double endWidth
)
 Parameters
index(Int32)
endWidth(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)