Reference Library
PreviewEngineFlags Enumeration
Namespaces »ZwSoft.ZwCAD.PlottingServices »PreviewEngineFlags
 Declaration Syntax
C# | Visual Basic | Visual C++
[FlagsAttribute]
public enum PreviewEngineFlags
<FlagsAttribute> _
Public Enumeration PreviewEngineFlags
[FlagsAttribute]
public enum class PreviewEngineFlags
 Members
Member | Description
PreviousSheet
NextSheet
Plot
Assembly: ZwManaged (Module: ZwManaged)