Reference Library
EPlotProperty Constructor (name, val)
Namespaces »ZwSoft.ZwCAD.Publishing »EPlotProperty »EPlotProperty(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public EPlotProperty(
	string name,
	string val
)
Public Sub New ( _
	name As String, _
	val As String _
)
public:
EPlotProperty(
	String^ name,
	String^ val
)
 Parameters
name(String)
val(String)
Assembly: ZwManaged (Module: ZwManaged)