Reference Library
Pucsxdir Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Pucsxdir
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d Pucsxdir { get; }
Public ReadOnly Property Pucsxdir As Vector3d
	Get
public:
property Vector3d Pucsxdir {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)