Reference Library
DgnDefinition Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DgnDefinition »DgnDefinition()
 Members
Icon | Member | Description
DgnDefinition()
DgnDefinition(IntPtr, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)