Reference Library
ProjectTo Method (planeNormal, projectDirection)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »ProjectTo(Vector3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d ProjectTo(
	Vector3d planeNormal,
	Vector3d projectDirection
)
Public Function ProjectTo ( _
	planeNormal As Vector3d, _
	projectDirection As Vector3d _
) As Vector3d
public:
Vector3d ProjectTo(
	Vector3d planeNormal,
	Vector3d projectDirection
)
 Parameters
planeNormal(Vector3d)
projectDirection(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)