Reference Library
SetFromGeCurve Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Spline »SetFromGeCurve()
 Members
Icon | Member | Description
SetFromGeCurve(Curve3d, Vector3d, Tolerance)
SetFromGeCurve(Curve3d, Vector3d)
SetFromGeCurve(Curve3d, Tolerance)
SetFromGeCurve(Curve3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)