Reference Library
TransparencyCollection Constructor (capacity)
Namespaces »ZwSoft.ZwCAD.Colors »TransparencyCollection »TransparencyCollection(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public TransparencyCollection(
	int capacity
)
Public Sub New ( _
	capacity As Integer _
)
public:
TransparencyCollection(
	int capacity
)
 Parameters
capacity(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)