Reference Library
Options Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionOptionsEventArgs »Options
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptSelectionOptions Options { get; }
Public ReadOnly Property Options As PromptSelectionOptions
	Get
public:
property PromptSelectionOptions^ Options {
	PromptSelectionOptions^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)