Reference Library
GetPerpendicularPlane Method (intersectionPoint)
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity3d »GetPerpendicularPlane(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Plane GetPerpendicularPlane(
	Point3d intersectionPoint
)
Public Function GetPerpendicularPlane ( _
	intersectionPoint As Point3d _
) As Plane
public:
Plane^ GetPerpendicularPlane(
	Point3d intersectionPoint
)
 Parameters
intersectionPoint(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)