Reference Library
Exception Constructor (es, message, innerException)
Namespaces »ZwSoft.ZwCAD.Runtime »Exception »Exception(ErrorStatus, String, Exception)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Exception(
	ErrorStatus es,
	string message,
	Exception innerException
)
Public Sub New ( _
	es As ErrorStatus, _
	message As String, _
	innerException As Exception _
)
public:
Exception(
	ErrorStatus es,
	String^ message,
	Exception^ innerException
)
 Parameters
es(ErrorStatus)
message(String)
innerException(Exception)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)