Reference Library
MentalRayRenderSettingsTraitsTraceParameter Constructor (reflect, refract, s)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraitsTraceParameter »MentalRayRenderSettingsTraitsTraceParameter(Int32, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public MentalRayRenderSettingsTraitsTraceParameter(
	int reflect,
	int refract,
	int s
)
Public Sub New ( _
	reflect As Integer, _
	refract As Integer, _
	s As Integer _
)
public:
MentalRayRenderSettingsTraitsTraceParameter(
	int reflect,
	int refract,
	int s
)
 Parameters
reflect(Int32)
refract(Int32)
s(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)