Reference Library
ShapeNumberAt Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinetypeTableRecord »ShapeNumberAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int ShapeNumberAt(
	int index
)
Public Function ShapeNumberAt ( _
	index As Integer _
) As Integer
public:
int ShapeNumberAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)