Reference Library
SetNames Method (colorName, bookName)
Namespaces »ZwSoft.ZwCAD.Colors »Color »SetNames(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetNames(
	string colorName,
	string bookName
)
Public Sub SetNames ( _
	colorName As String, _
	bookName As String _
)
public:
void SetNames(
	String^ colorName,
	String^ bookName
)
 Parameters
colorName(String)
bookName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)