Reference Library
Negate Method
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »Negate()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector2d Negate()
Public Function Negate As Vector2d
public:
Vector2d Negate()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)