Reference Library
OnOk Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »TabbedDialogExtension »OnOk
 Declaration Syntax
C# | Visual Basic | Visual C++
public TabbedDialogAction OnOk { get; }
Public ReadOnly Property OnOk As TabbedDialogAction
	Get
public:
property TabbedDialogAction^ OnOk {
	TabbedDialogAction^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)