Reference Library
GetOverride Method (row, column, gridLinetype)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »GetOverride(Int32, Int32, GridLineType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual GridProperties GetOverride(
	int row,
	int column,
	GridLineType gridLinetype
)
Public Overridable Function GetOverride ( _
	row As Integer, _
	column As Integer, _
	gridLinetype As GridLineType _
) As GridProperties
public:
virtual GridProperties GetOverride(
	int row,
	int column,
	GridLineType gridLinetype
)
 Parameters
row(Int32)
column(Int32)
gridLinetype(GridLineType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)