Reference Library
GetDataLink Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »GetDataLink()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectIdCollection GetDataLink()
Public Overridable Function GetDataLink As ObjectIdCollection
public:
virtual ObjectIdCollection^ GetDataLink()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)