Reference Library
SystemVariableChangingEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.ApplicationServices »SystemVariableChangingEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void SystemVariableChangingEventHandler(
	Object sender,
	SystemVariableChangingEventArgs e
)
Public Delegate Sub SystemVariableChangingEventHandler ( _
	sender As Object, _
	e As SystemVariableChangingEventArgs _
)
public delegate void SystemVariableChangingEventHandler(
	Object^ sender,
	SystemVariableChangingEventArgs^ e
)
 Parameters
sender(Object)
e(SystemVariableChangingEventArgs)
Assembly: ZwManaged (Module: ZwManaged)