Reference Library
Surftab2 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Surftab2
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Surftab2 { get; set; }
Public Property Surftab2 As Integer
	Get
	Set
public:
property int Surftab2 {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)