Reference Library
Mode Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »Mode
 Declaration Syntax
C# | Visual Basic | Visual C++
public RenderMode Mode { get; set; }
Public Property Mode As RenderMode
	Get
	Set
public:
property RenderMode Mode {
	RenderMode get ();
	void set (RenderMode value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)