Reference Library
MenuBar Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »MenuBar
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Object MenuBar { get; }
Public Shared ReadOnly Property MenuBar As Object
	Get
public:
static property Object^ MenuBar {
	Object^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)