Reference Library
Xaxis Property
Namespaces »ZwSoft.ZwCAD.Geometry »CoordinateSystem3d »Xaxis
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d Xaxis { get; }
Public ReadOnly Property Xaxis As Vector3d
	Get
public:
property Vector3d Xaxis {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)