Reference Library
ObjectEventArgs Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class ObjectEventArgs : EventArgs
Public NotInheritable Class ObjectEventArgs _
	Inherits EventArgs
public ref class ObjectEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DBObject
 Inheritance Hierarchy
Object
EventArgs
| ObjectEventArgs
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)