Reference Library
GetDefinition Method
Namespaces »ZwSoft.ZwCAD.Geometry »NurbSurface »GetDefinition()
 Declaration Syntax
C# | Visual Basic | Visual C++
public NurbSurfaceDefinition GetDefinition()
Public Function GetDefinition As NurbSurfaceDefinition
public:
NurbSurfaceDefinition GetDefinition()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)