Reference Library
IsParallelTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »Ray2d »IsParallelTo()
 Members
Icon | Member | Description
IsParallelTo(LinearEntity2d, Tolerance)
IsParallelTo(LinearEntity2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)