Reference Library
BoundingBoxIntersectWith Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »BoundingBoxIntersectWith()
 Members
Icon | Member | Description
BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, Int32, Int32) |  Obsolete.
BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, Int32, Int32) |  Obsolete.
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)