Reference Library
PromptEntityOptionsEventArgs Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptEntityOptionsEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PromptEntityOptionsEventArgs : EventArgs
Public NotInheritable Class PromptEntityOptionsEventArgs _
	Inherits EventArgs
public ref class PromptEntityOptionsEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Options
 Inheritance Hierarchy
Object
EventArgs
| PromptEntityOptionsEventArgs
Assembly: ZwManaged (Module: ZwManaged)