Reference Library
IsClosedInU Method
Namespaces »ZwSoft.ZwCAD.Geometry »PlanarEntity »IsClosedInU()
 Members
Icon | Member | Description
IsClosedInU(Tolerance)
IsClosedInU()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)