Reference Library
SubItem Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionHitTestInfo »SubItem
 Declaration Syntax
C# | Visual Basic | Visual C++
public SectionSubItem SubItem { get; }
Public ReadOnly Property SubItem As SectionSubItem
	Get
public:
property SectionSubItem SubItem {
	SectionSubItem get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)