Reference Library
Add Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BulgeVertexCollection »Add(BulgeVertex)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Add(
	BulgeVertex value
)
Public Function Add ( _
	value As BulgeVertex _
) As Integer
public:
int Add(
	BulgeVertex^ value
)
 Parameters
value(BulgeVertex)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)