Reference Library
LayerStateCompareFailed Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »LayerStateCompareFailed
 Declaration Syntax
C# | Visual Basic | Visual C++
public event LayerStateEventHandler LayerStateCompareFailed
Public Event LayerStateCompareFailed As LayerStateEventHandler
public:
 event LayerStateEventHandler^ LayerStateCompareFailed {
	void add (LayerStateEventHandler^ value);
	void remove (LayerStateEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)