Reference Library
CanonicalMediaNames Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfig »CanonicalMediaNames
 Declaration Syntax
C# | Visual Basic | Visual C++
public StringCollection CanonicalMediaNames { get; }
Public ReadOnly Property CanonicalMediaNames As StringCollection
	Get
public:
property StringCollection^ CanonicalMediaNames {
	StringCollection^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)