Reference Library
ObjectSnapModes Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectSnapModes
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDb::OsnapMode")]
[FlagsAttribute]
public enum ObjectSnapModes
<WrapperAttribute("ZcDb::OsnapMode")> _
<FlagsAttribute> _
Public Enumeration ObjectSnapModes
[WrapperAttribute(L"ZcDb::OsnapMode")]
[FlagsAttribute]
public enum class ObjectSnapModes
 Members
Member | Description
ModeTangent
ModeQuad
ModePerpendicular
ModeNode
ModeNear
ModeMid
ModeIns
ModeEnd
ModeCenter
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)