Reference Library
Description Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerTableRecord »Description
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Description { get; set; }
Public Property Description As String
	Get
	Set
public:
property String^ Description {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)