Reference Library
IsEqualTo Method (vector, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »IsEqualTo(Vector3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	Vector3d vector,
	Tolerance tolerance
)
Public Function IsEqualTo ( _
	vector As Vector3d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsEqualTo(
	Vector3d vector,
	Tolerance tolerance
)
 Parameters
vector(Vector3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)