Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »Equality(Vector3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	Vector3d a,
	Vector3d b
)
Public Shared Operator = ( _
	a As Vector3d, _
	b As Vector3d _
) As Boolean
public:
static bool operator ==(
	Vector3d a,
	Vector3d b
)
 Parameters
a(Vector3d)
b(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)