Reference Library
Enabled Property
Namespaces »ZwSoft.ZwCAD.EditorInput »Keyword »Enabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Enabled { get; set; }
Public Property Enabled As Boolean
	Get
	Set
public:
property bool Enabled {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)