Reference Library
Interfereobjvs Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Interfereobjvs
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Interfereobjvs { get; set; }
Public Property Interfereobjvs As ObjectId
	Get
	Set
public:
property ObjectId Interfereobjvs {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)