Reference Library
DestinationName Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdData »DestinationName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string DestinationName { get; set; }
Public Property DestinationName As String
	Get
	Set
public:
property String^ DestinationName {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwManaged (Module: ZwManaged)