Reference Library
Comment Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfig »Comment
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Comment { get; }
Public ReadOnly Property Comment As String
	Get
public:
property String^ Comment {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)