Reference Library
DbHomeView Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DbHomeView »DbHomeView(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DbHomeView(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Public Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
public:
DbHomeView(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)