Reference Library
Sum Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraitsTraceParameter »Sum
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Sum { get; }
Public ReadOnly Property Sum As Integer
	Get
public:
property int Sum {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)