Reference Library
Dimblks Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimblks
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Dimblks { get; set; }
Public Property Dimblks As String
	Get
	Set
public:
property String^ Dimblks {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)