Reference Library
Contains Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BulgeVertexCollection »Contains(BulgeVertex)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Contains(
	BulgeVertex value
)
Public Function Contains ( _
	value As BulgeVertex _
) As Boolean
public:
bool Contains(
	BulgeVertex^ value
)
 Parameters
value(BulgeVertex)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)