Reference Library
PlotWindowArea Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettings »PlotWindowArea
 Declaration Syntax
C# | Visual Basic | Visual C++
public Extents2d PlotWindowArea { get; }
Public ReadOnly Property PlotWindowArea As Extents2d
	Get
public:
property Extents2d PlotWindowArea {
	Extents2d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)