Reference Library
AbstractViewTableRecord Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AbstractViewTableRecord
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbAbstractViewTableRecord")]
public abstract class AbstractViewTableRecord : SymbolTableRecord
<WrapperAttribute("AcDbAbstractViewTableRecord")> _
Public MustInherit Class AbstractViewTableRecord _
	Inherits SymbolTableRecord
[WrapperAttribute(L"AcDbAbstractViewTableRecord")]
public ref class AbstractViewTableRecord abstract : public SymbolTableRecord
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
AbstractViewTableRecord(IntPtr, Boolean)
AmbientLightColor
BackClipDistance
BackClipEnabled
Background
Brightness
CenterPoint
Contrast
DefaultLightingOn
DefaultLightingType
Elevation
FrontClipAtEye
FrontClipDistance
FrontClipEnabled
Height
LensLength
PerspectiveEnabled
RenderMode
SetSun(DBObject)
SetUcs(Point3d, Vector3d, Vector3d)
SetUcs(OrthographicView)
SetUcs(ObjectId)
SetUcsToWorld()
SetViewDirection(OrthographicView)
SunId
Target
Ucs
UcsName
UcsOrthographic
ViewDirection
ViewOrthographic
ViewTwist
VisualStyleId
Width
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | SymbolTableRecord
|  |  |  |  |  | AbstractViewTableRecord
|  |  |  |  |  |  | ViewportTableRecord
|  |  |  |  |  |  | ViewTableRecord
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)