Reference Library
GetMixedPartial Method
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnSurface »GetMixedPartial()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d GetMixedPartial()
Public Function GetMixedPartial As Vector3d
public:
Vector3d GetMixedPartial()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)