Reference Library
GradientType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »GradientType
 Declaration Syntax
C# | Visual Basic | Visual C++
public GradientPatternType GradientType { get; }
Public ReadOnly Property GradientType As GradientPatternType
	Get
public:
property GradientPatternType GradientType {
	GradientPatternType get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)