Reference Library
EffectiveBlockLayerId Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishEntityEventArgs »EffectiveBlockLayerId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId EffectiveBlockLayerId { get; }
Public ReadOnly Property EffectiveBlockLayerId As ObjectId
	Get
public:
property ObjectId EffectiveBlockLayerId {
	ObjectId get ();
}
Assembly: ZwManaged (Module: ZwManaged)