Reference Library
LispFunctionAttribute Constructor (globalName, localizedNameId)
Namespaces »ZwSoft.ZwCAD.Runtime »LispFunctionAttribute »LispFunctionAttribute(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LispFunctionAttribute(
	string globalName,
	string localizedNameId
)
Public Sub New ( _
	globalName As String, _
	localizedNameId As String _
)
public:
LispFunctionAttribute(
	String^ globalName,
	String^ localizedNameId
)
 Parameters
globalName(String)
localizedNameId(String)
Assembly: ZwManaged (Module: ZwManaged)