Reference Library
ApplicationLoadReasons Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ApplicationLoadReasons
 Declaration Syntax
C# | Visual Basic | Visual C++
[FlagsAttribute]
public enum ApplicationLoadReasons
<FlagsAttribute> _
Public Enumeration ApplicationLoadReasons
[FlagsAttribute]
public enum class ApplicationLoadReasons
 Members
Member | Description
TransparentlyLoadable
LoadDisabled
OnLoadRequest
OnCommandInvocation
OnAutoCADStartup
OnProxyDetection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)