Reference Library
CameraUpVector Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Viewport »CameraUpVector
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Vector3d CameraUpVector { get; }
Public MustOverride ReadOnly Property CameraUpVector As Vector3d
	Get
public:
virtual property Vector3d CameraUpVector {
	Vector3d get () abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)