Reference Library
Database Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Database()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Database()
Public Sub New
public:
Database()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)