Reference Library
Insert Method
Namespaces »ZwSoft.ZwCAD.Geometry »Line2dCollection »Insert()
 Members
Icon | Member | Description
IList.Insert(Int32, Object)
Insert(Int32, Line2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)