Reference Library
Celtype Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Celtype
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Celtype { get; set; }
Public Property Celtype As ObjectId
	Get
	Set
public:
property ObjectId Celtype {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)