Reference Library
IndexOf Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCellCollection »IndexOf(DataCell)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int IndexOf(
	DataCell value
)
Public Function IndexOf ( _
	value As DataCell _
) As Integer
public:
int IndexOf(
	DataCell^ value
)
 Parameters
value(DataCell)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)