Reference Library
Extend Method (pointToInclude)
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock3d »Extend(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Extend(
	Point3d pointToInclude
)
Public Sub Extend ( _
	pointToInclude As Point3d _
)
public:
void Extend(
	Point3d pointToInclude
)
 Parameters
pointToInclude(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)