Reference Library
Surftab1 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Surftab1
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Surftab1 { get; set; }
Public Property Surftab1 As Integer
	Get
	Set
public:
property int Surftab1 {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)