Reference Library
MakeRational Method (weight)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »MakeRational(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void MakeRational(
	double weight
)
Public Sub MakeRational ( _
	weight As Double _
)
public:
void MakeRational(
	double weight
)
 Parameters
weight(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)