Reference Library
PlotProgressPos Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotProgress »PlotProgressPos
 Declaration Syntax
C# | Visual Basic | Visual C++
public int PlotProgressPos { get; set; }
Public Property PlotProgressPos As Integer
	Get
	Set
public:
property int PlotProgressPos {
	int get ();
	void set (int value);
}
Assembly: ZwManaged (Module: ZwManaged)