Reference Library
NumVertices Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Leader »NumVertices
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int NumVertices { get; }
Public Overridable ReadOnly Property NumVertices As Integer
	Get
public:
virtual property int NumVertices {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)