Reference Library
LayoutCopiedEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutCopiedEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void LayoutCopiedEventHandler(
	Object sender,
	LayoutCopiedEventArgs e
)
Public Delegate Sub LayoutCopiedEventHandler ( _
	sender As Object, _
	e As LayoutCopiedEventArgs _
)
public delegate void LayoutCopiedEventHandler(
	Object^ sender,
	LayoutCopiedEventArgs^ e
)
 Parameters
sender(Object)
e(LayoutCopiedEventArgs)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)