Reference Library
Set Method (degreeU, degreeV, propsInU, propsInV, numControlPointsInU, numControlPointsInV, controlPoints, weights, knotsInU, knotsInV)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbSurface »Set(Int32, Int32, Int32, Int32, Int32, Int32, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	int degreeU,
	int degreeV,
	int propsInU,
	int propsInV,
	int numControlPointsInU,
	int numControlPointsInV,
	Point3dCollection controlPoints,
	DoubleCollection weights,
	KnotCollection knotsInU,
	KnotCollection knotsInV
)
Public Sub Set ( _
	degreeU As Integer, _
	degreeV As Integer, _
	propsInU As Integer, _
	propsInV As Integer, _
	numControlPointsInU As Integer, _
	numControlPointsInV As Integer, _
	controlPoints As Point3dCollection, _
	weights As DoubleCollection, _
	knotsInU As KnotCollection, _
	knotsInV As KnotCollection _
)
public:
void Set(
	int degreeU,
	int degreeV,
	int propsInU,
	int propsInV,
	int numControlPointsInU,
	int numControlPointsInV,
	Point3dCollection^ controlPoints,
	DoubleCollection^ weights,
	KnotCollection^ knotsInU,
	KnotCollection^ knotsInV
)
 Parameters
degreeU(Int32)
degreeV(Int32)
propsInU(Int32)
propsInV(Int32)
numControlPointsInU(Int32)
numControlPointsInV(Int32)
controlPoints(Point3dCollection)
weights(DoubleCollection)
knotsInU(KnotCollection)
knotsInV(KnotCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)