Reference Library
XLine1Point Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RotatedDimension »XLine1Point
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d XLine1Point { get; set; }
Public Property XLine1Point As Point3d
	Get
	Set
public:
property Point3d XLine1Point {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)