Reference Library
Remove Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »IntPtrCollection »Remove(IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void Remove(
	IntPtr value
)
Public Overridable Sub Remove ( _
	value As IntPtr _
)
public:
virtual void Remove(
	IntPtr value
)
 Parameters
value(IntPtr)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)