Reference Library
StringToDistance Method (value, units)
Namespaces »ZwSoft.ZwCAD.Runtime »Converter »StringToDistance(String, DistanceUnitFormat)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static double StringToDistance(
	string value,
	DistanceUnitFormat units
)
Public Shared Function StringToDistance ( _
	value As String, _
	units As DistanceUnitFormat _
) As Double
public:
static double StringToDistance(
	String^ value,
	DistanceUnitFormat units
)
 Parameters
value(String)
units(DistanceUnitFormat)
Assembly: ZwManaged (Module: ZwManaged)