Reference Library
SetAppBusy Method (moduleName, busyFlag)
Namespaces »ZwSoft.ZwCAD.Runtime »DynamicLinker »SetAppBusy(String, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetAppBusy(
	string moduleName,
	bool busyFlag
)
Public Sub SetAppBusy ( _
	moduleName As String, _
	busyFlag As Boolean _
)
public:
void SetAppBusy(
	String^ moduleName,
	bool busyFlag
)
 Parameters
moduleName(String)
busyFlag(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)