Reference Library
Add Method (data)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicDimensionDataCollection »Add(DynamicDimensionData)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Add(
	DynamicDimensionData data
)
Public Function Add ( _
	data As DynamicDimensionData _
) As Integer
public:
int Add(
	DynamicDimensionData^ data
)
 Parameters
data(DynamicDimensionData)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)