Reference Library
IsPerpendicularTo Method (vector)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »IsPerpendicularTo(Vector2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPerpendicularTo(
	Vector2d vector
)
Public Function IsPerpendicularTo ( _
	vector As Vector2d _
) As Boolean
public:
bool IsPerpendicularTo(
	Vector2d vector
)
 Parameters
vector(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)