Reference Library
IntPtrCollection Constructor (values)
Namespaces »ZwSoft.ZwCAD.Geometry »IntPtrCollection »IntPtrCollection(IntPtr[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public IntPtrCollection(
	IntPtr[] values
)
Public Sub New ( _
	values As IntPtr() _
)
public:
IntPtrCollection(
	array<IntPtr>^ values
)
 Parameters
values(IntPtr[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)