Reference Library
GetMediaBounds Method (canonicalMediaName)
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfig »GetMediaBounds(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public MediaBounds GetMediaBounds(
	string canonicalMediaName
)
Public Function GetMediaBounds ( _
	canonicalMediaName As String _
) As MediaBounds
public:
MediaBounds GetMediaBounds(
	String^ canonicalMediaName
)
 Parameters
canonicalMediaName(String)
Assembly: ZwManaged (Module: ZwManaged)