Reference Library
SetStaticColumns Method (width, gutter, count)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »SetStaticColumns(Double, Double, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetStaticColumns(
	double width,
	double gutter,
	int count
)
Public Sub SetStaticColumns ( _
	width As Double, _
	gutter As Double, _
	count As Integer _
)
public:
void SetStaticColumns(
	double width,
	double gutter,
	int count
)
 Parameters
width(Double)
gutter(Double)
count(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)