Reference Library
Spline Constructor (point, startTangent, endTangent, order, fitTolerance)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Spline »Spline(Point3dCollection, Vector3d, Vector3d, Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Spline(
	Point3dCollection point,
	Vector3d startTangent,
	Vector3d endTangent,
	int order,
	double fitTolerance
)
Public Sub New ( _
	point As Point3dCollection, _
	startTangent As Vector3d, _
	endTangent As Vector3d, _
	order As Integer, _
	fitTolerance As Double _
)
public:
Spline(
	Point3dCollection^ point,
	Vector3d startTangent,
	Vector3d endTangent,
	int order,
	double fitTolerance
)
 Parameters
point(Point3dCollection)
startTangent(Vector3d)
endTangent(Vector3d)
order(Int32)
fitTolerance(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)