Reference Library
AppendVertex Method (vertexToAppend)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline3d »AppendVertex(PolylineVertex3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId AppendVertex(
	PolylineVertex3d vertexToAppend
)
Public Function AppendVertex ( _
	vertexToAppend As PolylineVertex3d _
) As ObjectId
public:
ObjectId AppendVertex(
	PolylineVertex3d^ vertexToAppend
)
 Parameters
vertexToAppend(PolylineVertex3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)