Reference Library
Thickness Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Line »Thickness
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Thickness { get; set; }
Public Property Thickness As Double
	Get
	Set
public:
property double Thickness {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)