Reference Library
Ray Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ray
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbRay")]
public class Ray : Curve
<WrapperAttribute("AcDbRay")> _
Public Class Ray _
	Inherits Curve
[WrapperAttribute(L"AcDbRay")]
public ref class Ray : public Curve
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Ray(IntPtr, Boolean)
Ray()
BasePoint
SecondPoint
UnitDir
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Curve
|  |  |  |  |  |  | Ray
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)