Reference Library
IsCoplanarWith Method
Namespaces »ZwSoft.ZwCAD.Geometry »CubicSplineCurve3d »IsCoplanarWith()
 Members
Icon | Member | Description
IsCoplanarWith(Curve3d, Plane, Tolerance)
IsCoplanarWith(Curve3d, Plane)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)