Reference Library
DBDictionaryEntry Constructor (key, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionaryEntry »DBDictionaryEntry(String, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DBDictionaryEntry(
	string key,
	ObjectId value
)
Public Sub New ( _
	key As String, _
	value As ObjectId _
)
public:
DBDictionaryEntry(
	String^ key,
	ObjectId value
)
 Parameters
key(String)
value(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)