Reference Library
PhysicalPenNumber Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleData »PhysicalPenNumber
 Declaration Syntax
C# | Visual Basic | Visual C++
public int PhysicalPenNumber { get; set; }
Public Property PhysicalPenNumber As Integer
	Get
	Set
public:
property int PhysicalPenNumber {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)