Reference Library
RegenType Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »RegenType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiRegenType")]
public enum RegenType
<WrapperAttribute("ZcGiRegenType")> _
Public Enumeration RegenType
[WrapperAttribute(L"ZcGiRegenType")]
public enum class RegenType
 Members
Member | Description
StandardDisplay
SaveWorldDrawForProxy
RenderCommand
HideOrShadeCommand
ForExplode
Invalid
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)