Reference Library
Dispose Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockReference »Dispose()
 Members
Icon | Member | Description
Dispose(Boolean) |  (Overrides DBObject.Dispose(Boolean).)
Dispose()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)