Reference Library
Index Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionHitTestInfo »Index
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Index { get; }
Public ReadOnly Property Index As Integer
	Get
public:
property int Index {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)