Reference Library
GraphicsManager Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »GraphicsManager
 Declaration Syntax
C# | Visual Basic | Visual C++
public Manager GraphicsManager { get; }
Public ReadOnly Property GraphicsManager As Manager
	Get
public:
property Manager^ GraphicsManager {
	Manager^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)