Reference Library
CopyTo Method (arr, index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HyperLinkCollection »CopyTo(HyperLink[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	HyperLink[] arr,
	int index
)
Public Sub CopyTo ( _
	arr As HyperLink(), _
	index As Integer _
)
public:
void CopyTo(
	array<HyperLink^>^ arr,
	int index
)
 Parameters
arr(HyperLink[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)