Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MlineStyleElementCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public MlineStyleElement this[
	int index
] { get; set; }
Public Default Property Item ( _
	index As Integer _
) As MlineStyleElement
	Get
	Set
public:
property MlineStyleElement default[int index] {
	MlineStyleElement get (int index);
	void set (int index, MlineStyleElement value);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)