Reference Library
IntersectWith Method (plane, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »BoundedPlane »IntersectWith(BoundedPlane, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LineSegment3d IntersectWith(
	BoundedPlane plane,
	Tolerance tolerance
)
Public Function IntersectWith ( _
	plane As BoundedPlane, _
	tolerance As Tolerance _
) As LineSegment3d
public:
LineSegment3d^ IntersectWith(
	BoundedPlane^ plane,
	Tolerance tolerance
)
 Parameters
plane(BoundedPlane)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)