Reference Library
AllowSubSelections Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionOptions »AllowSubSelections
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool AllowSubSelections { get; set; }
Public Property AllowSubSelections As Boolean
	Get
	Set
public:
property bool AllowSubSelections {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)