Reference Library
IsActive Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »IsActive
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsActive { get; }
Public ReadOnly Property IsActive As Boolean
	Get
public:
property bool IsActive {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)