Reference Library
GetContentTypes Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »GetContentTypes(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual CellContentTypes GetContentTypes(
	int row,
	int column
)
Public Overridable Function GetContentTypes ( _
	row As Integer, _
	column As Integer _
) As CellContentTypes
public:
virtual CellContentTypes GetContentTypes(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)