Reference Library
Unappended Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »Unappended
 Declaration Syntax
C# | Visual Basic | Visual C++
public event EventHandler Unappended
Public Event Unappended As EventHandler
public:
 event EventHandler^ Unappended {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)