Reference Library
IsByColor Property
Namespaces »ZwSoft.ZwCAD.Colors »Color »IsByColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsByColor { get; }
Public ReadOnly Property IsByColor As Boolean
	Get
public:
property bool IsByColor {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)