Reference Library
Point2d Structure
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGePoint2d")]
public struct Point2d : IFormattable
<WrapperAttribute("ZcGePoint2d")> _
Public Structure Point2d _
	Implements IFormattable
[WrapperAttribute(L"ZcGePoint2d")]
public value class Point2d : IFormattable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Point2d(Double, Double)
Point2d(Double[])
Add(Vector2d)
Addition(Point2d, Vector2d)
Coordinate[Int32]
DivideBy(Double)
Division(Point2d, Double)
Equality(Point2d, Point2d)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetAsVector()
GetDistanceTo(Point2d)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
GetVectorTo(Point2d)
Inequality(Point2d, Point2d)
IsEqualTo(Point2d, Tolerance)
IsEqualTo(Point2d)
Mirror(Line2d)
Multiply(Double, Point2d)
Multiply(Point2d, Double)
Multiply(Matrix2d, Point2d)
MultiplyBy(Double)
Origin
RotateBy(Double, Point2d)
ScaleBy(Double, Point2d)
Subtract(Vector2d)
Subtraction(Point2d, Vector2d)
Subtraction(Point2d, Point2d)
ToArray()
ToString(String, IFormatProvider)
ToString(IFormatProvider)
ToString() |  (Overrides ValueType.ToString().)
TransformBy(Matrix2d)
X
Y
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)