Reference Library
Int32Collection Constructor (capacity)
Namespaces »ZwSoft.ZwCAD.Geometry »Int32Collection »Int32Collection(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Int32Collection(
	int capacity
)
Public Sub New ( _
	capacity As Integer _
)
public:
Int32Collection(
	int capacity
)
 Parameters
capacity(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)