Reference Library
SaveAs Method (fileName, st, version, saveThumbnailImage, dxfPrecision)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »SaveAs(String, SaveType, DwgVersion, Boolean, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SaveAs(
	string fileName,
	SaveType st,
	DwgVersion version,
	bool saveThumbnailImage,
	int dxfPrecision
)
Public Sub SaveAs ( _
	fileName As String, _
	st As SaveType, _
	version As DwgVersion, _
	saveThumbnailImage As Boolean, _
	dxfPrecision As Integer _
)
public:
void SaveAs(
	String^ fileName,
	SaveType st,
	DwgVersion version,
	bool saveThumbnailImage,
	int dxfPrecision
)
 Parameters
fileName(String)
st(SaveType)
version(DwgVersion)
saveThumbnailImage(Boolean)
dxfPrecision(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)