Reference Library
LeaderLength Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RadialDimension »LeaderLength
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public double LeaderLength { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Property LeaderLength As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
property double LeaderLength {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)