Reference Library
Dimlwe Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimlwe
 Declaration Syntax
C# | Visual Basic | Visual C++
public LineWeight Dimlwe { get; set; }
Public Property Dimlwe As LineWeight
	Get
	Set
public:
property LineWeight Dimlwe {
	LineWeight get ();
	void set (LineWeight value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)