Reference Library
PlotStyleDescriptor Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »SubEntityTraits »PlotStyleDescriptor
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract PlotStyleDescriptor PlotStyleDescriptor { get; set; }
Public MustOverride Property PlotStyleDescriptor As PlotStyleDescriptor
	Get
	Set
public:
virtual property PlotStyleDescriptor PlotStyleDescriptor {
	PlotStyleDescriptor get () abstract;
	void set (PlotStyleDescriptor value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)