Reference Library
XrefStatus Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefStatus
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum XrefStatus
Public Enumeration XrefStatus
public enum class XrefStatus
 Members
Member | Description
FileNotFound
Unresolved
Unreferenced
Unloaded
Resolved
NotAnXref
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)