Reference Library
CopyTo Method (arr, index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicDimensionDataCollection »CopyTo(DynamicDimensionData[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	DynamicDimensionData[] arr,
	int index
)
Public Sub CopyTo ( _
	arr As DynamicDimensionData(), _
	index As Integer _
)
public:
void CopyTo(
	array<DynamicDimensionData^>^ arr,
	int index
)
 Parameters
arr(DynamicDimensionData[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)