Reference Library
FromPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »SpatialFilterVolume »FromPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d FromPoint { get; }
Public ReadOnly Property FromPoint As Point3d
	Get
public:
property Point3d FromPoint {
	Point3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)