Reference Library
PopModelTransform Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »PopModelTransform()
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool PopModelTransform()
Public MustOverride Function PopModelTransform As Boolean
public:
virtual bool PopModelTransform() abstract
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)