Reference Library
IsContentSnappable Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »IsContentSnappable()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool IsContentSnappable()
Public Overridable Function IsContentSnappable As Boolean
public:
virtual bool IsContentSnappable()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)