Reference Library
Dimtol Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimtol
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Dimtol { get; set; }
Public Property Dimtol As Boolean
	Get
	Set
public:
property bool Dimtol {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)