Reference Library
Filter Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraitsSamplingParameter »Filter
 Declaration Syntax
C# | Visual Basic | Visual C++
public Filter Filter { get; }
Public ReadOnly Property Filter As Filter
	Get
public:
property Filter Filter {
	Filter get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)