Reference Library
Erased Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »Erased
 Declaration Syntax
C# | Visual Basic | Visual C++
public event ObjectErasedEventHandler Erased
Public Event Erased As ObjectErasedEventHandler
public:
 event ObjectErasedEventHandler^ Erased {
	void add (ObjectErasedEventHandler^ value);
	void remove (ObjectErasedEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)