Reference Library
PaletteAddContextMenuEventArgs Class
Namespaces »ZwSoft.ZwCAD.Windows »PaletteAddContextMenuEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PaletteAddContextMenuEventArgs : EventArgs
Public NotInheritable Class PaletteAddContextMenuEventArgs _
	Inherits EventArgs
public ref class PaletteAddContextMenuEventArgs sealed : public EventArgs
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PaletteAddContextMenuEventArgs(List<MenuItem>, List<Int32>, Int32, Int32)
HitFlag
Menuitems
RemoveMenuItems
RightClkTab
 Inheritance Hierarchy
Object
EventArgs
| PaletteAddContextMenuEventArgs
Assembly: ZwManaged (Module: ZwManaged)