Reference Library
Thumbnail Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewTableRecord »Thumbnail
 Declaration Syntax
C# | Visual Basic | Visual C++
public Bitmap Thumbnail { get; set; }
Public Property Thumbnail As Bitmap
	Get
	Set
public:
property Bitmap^ Thumbnail {
	Bitmap^ get ();
	void set (Bitmap^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)