Reference Library
GetLocaleMediaName Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsValidator »GetLocaleMediaName()
 Members
Icon | Member | Description
GetLocaleMediaName(PlotSettings, String)
GetLocaleMediaName(PlotSettings, Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)