Reference Library
DocumentLockModeWillChange Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentCollection »DocumentLockModeWillChange
 Declaration Syntax
C# | Visual Basic | Visual C++
public event DocumentLockModeWillChangeEventHandler DocumentLockModeWillChange
Public Event DocumentLockModeWillChange As DocumentLockModeWillChangeEventHandler
public:
 event DocumentLockModeWillChangeEventHandler^ DocumentLockModeWillChange {
	void add (DocumentLockModeWillChangeEventHandler^ value);
	void remove (DocumentLockModeWillChangeEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)