Reference Library
GetInteger Method (options)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »GetInteger(PromptIntegerOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptIntegerResult GetInteger(
	PromptIntegerOptions options
)
Public Function GetInteger ( _
	options As PromptIntegerOptions _
) As PromptIntegerResult
public:
PromptIntegerResult^ GetInteger(
	PromptIntegerOptions^ options
)
 Parameters
options(PromptIntegerOptions)
Assembly: ZwManaged (Module: ZwManaged)