Reference Library
IsometricSnapEnabled Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewportTableRecord »IsometricSnapEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsometricSnapEnabled { get; set; }
Public Property IsometricSnapEnabled As Boolean
	Get
	Set
public:
property bool IsometricSnapEnabled {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)