Reference Library
GetClosestPointTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »CubicSplineCurve2d »GetClosestPointTo()
 Members
Icon | Member | Description
GetClosestPointTo(Point2d, Tolerance)
GetClosestPointTo(Curve2d, Tolerance)
GetClosestPointTo(Point2d)
GetClosestPointTo(Curve2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)