Reference Library
Multiply Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »Multiply(Point3d, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Point3d operator *(
	Point3d a,
	double value
)
Public Shared Operator * ( _
	a As Point3d, _
	value As Double _
) As Point3d
public:
static Point3d operator *(
	Point3d a,
	double value
)
 Parameters
a(Point3d)
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)