Reference Library
DBDictionary Constructor (obj, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »DBDictionary(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal DBDictionary(
	IntPtr obj,
	bool autoDelete
)
Protected Friend Sub New ( _
	obj As IntPtr, _
	autoDelete As Boolean _
)
protected public:
DBDictionary(
	IntPtr obj,
	bool autoDelete
)
 Parameters
obj(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)