Reference Library
InvokeContextHelp Method (window, contextId)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »InvokeContextHelp(IntPtr, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static void InvokeContextHelp(
	IntPtr window,
	int contextId
)
Public Shared Sub InvokeContextHelp ( _
	window As IntPtr, _
	contextId As Integer _
)
public:
static void InvokeContextHelp(
	IntPtr window,
	int contextId
)
 Parameters
window(IntPtr)
contextId(Int32)
Assembly: ZwManaged (Module: ZwManaged)