Reference Library
IsDependent Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolTableRecord »IsDependent
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsDependent { get; }
Public ReadOnly Property IsDependent As Boolean
	Get
public:
property bool IsDependent {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)