Reference Library
Intensity Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Sun »Intensity
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Unitless)]
public double Intensity { get; set; }
<UnitTypeAttribute(UnitType.Unitless)> _
Public Property Intensity As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Unitless)]
public:
property double Intensity {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)