Reference Library
CellClass Method (styleName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableStyle »CellClass(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual CellClass CellClass(
	string styleName
)
Public Overridable Function CellClass ( _
	styleName As String _
) As CellClass
public:
virtual CellClass CellClass(
	String^ styleName
)
 Parameters
styleName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)