Reference Library
PickPointSelectedObject Constructor (id, method, gsMarker, descriptor)
Namespaces »ZwSoft.ZwCAD.EditorInput »PickPointSelectedObject »PickPointSelectedObject(ObjectId, SelectionMethod, IntPtr, PickPointDescriptor)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PickPointSelectedObject(
	ObjectId id,
	SelectionMethod method,
	IntPtr gsMarker,
	PickPointDescriptor descriptor
)
Public Sub New ( _
	id As ObjectId, _
	method As SelectionMethod, _
	gsMarker As IntPtr, _
	descriptor As PickPointDescriptor _
)
public:
PickPointSelectedObject(
	ObjectId id,
	SelectionMethod method,
	IntPtr gsMarker,
	PickPointDescriptor descriptor
)
 Parameters
id(ObjectId)
method(SelectionMethod)
gsMarker(IntPtr)
descriptor(PickPointDescriptor)
Assembly: ZwManaged (Module: ZwManaged)