Reference Library
Direction Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FeatureControlFrame »Direction
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Vector3d Direction { get; }
Public Overridable ReadOnly Property Direction As Vector3d
	Get
public:
virtual property Vector3d Direction {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)