Reference Library
Convert Method (convertPaletteToRGB)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »GIRasterImage »Convert(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public GIRasterImage Convert(
	bool convertPaletteToRGB
)
Public Function Convert ( _
	convertPaletteToRGB As Boolean _
) As GIRasterImage
public:
GIRasterImage^ Convert(
	bool convertPaletteToRGB
)
 Parameters
convertPaletteToRGB(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)