Reference Library
Dimarcsym Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimarcsym
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Dimarcsym { get; set; }
Public Overridable Property Dimarcsym As Integer
	Get
	Set
public:
virtual property int Dimarcsym {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)