Reference Library
ProxyEntity Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ProxyEntity
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbProxyEntity")]
public sealed class ProxyEntity : Entity
<WrapperAttribute("AcDbProxyEntity")> _
Public NotInheritable Class ProxyEntity _
	Inherits Entity
[WrapperAttribute(L"AcDbProxyEntity")]
public ref class ProxyEntity sealed : public Entity
 Members
All Members | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
ApplicationDescription
GetReferences()
GraphicsMetafileType
OriginalClassName
OriginalDxfName
ProxyFlags
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | ProxyEntity
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)