Reference Library
BlockTableRecordId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Layout »BlockTableRecordId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId BlockTableRecordId { get; set; }
Public Property BlockTableRecordId As ObjectId
	Get
	Set
public:
property ObjectId BlockTableRecordId {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)