Reference Library
KnotParam Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FitData »KnotParam
 Declaration Syntax
C# | Visual Basic | Visual C++
public KnotParameterizationEnum KnotParam { get; }
Public ReadOnly Property KnotParam As KnotParameterizationEnum
	Get
public:
property KnotParameterizationEnum KnotParam {
	KnotParameterizationEnum get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)