Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.Colors »Color »Equality(Color, Color)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	Color a,
	Color b
)
Public Shared Operator = ( _
	a As Color, _
	b As Color _
) As Boolean
public:
static bool operator ==(
	Color^ a,
	Color^ b
)
 Parameters
a(Color)
b(Color)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)