Reference Library
SetAlignment Method (row, col, align)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetAlignment(Int32, Int32, CellAlignment)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetAlignment(
	int row,
	int col,
	CellAlignment align
)
Public Overridable Sub SetAlignment ( _
	row As Integer, _
	col As Integer, _
	align As CellAlignment _
)
public:
virtual void SetAlignment(
	int row,
	int col,
	CellAlignment align
)
 Parameters
row(Int32)
col(Int32)
align(CellAlignment)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)