Reference Library
Dimtofl Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimtofl
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool Dimtofl { get; set; }
Public Overridable Property Dimtofl As Boolean
	Get
	Set
public:
virtual property bool Dimtofl {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)