Reference Library
GetNumberOfContents Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GetNumberOfContents(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int GetNumberOfContents(
	int row,
	int column
)
Public Overridable Function GetNumberOfContents ( _
	row As Integer, _
	column As Integer _
) As Integer
public:
virtual int GetNumberOfContents(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)