Reference Library
AppName Property
Namespaces »ZwSoft.ZwCAD.Runtime »RXClass »AppName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string AppName { get; }
Public ReadOnly Property AppName As String
	Get
public:
property String^ AppName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)