Reference Library
CancelledOrFailedPublishing Event
Namespaces »ZwSoft.ZwCAD.Publishing »Publisher »CancelledOrFailedPublishing
 Declaration Syntax
C# | Visual Basic | Visual C++
public event CancelledOrFailedPublishingEventHandler CancelledOrFailedPublishing
Public Event CancelledOrFailedPublishing As CancelledOrFailedPublishingEventHandler
public:
 event CancelledOrFailedPublishingEventHandler^ CancelledOrFailedPublishing {
	void add (CancelledOrFailedPublishingEventHandler^ value);
	void remove (CancelledOrFailedPublishingEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)