Reference Library
View Constructor (unmanagedPointer, autoDelete, zwcadView)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »View(IntPtr, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal View(
	IntPtr unmanagedPointer,
	bool autoDelete,
	bool zwcadView
)
Protected Friend Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean, _
	zwcadView As Boolean _
)
protected public:
View(
	IntPtr unmanagedPointer,
	bool autoDelete,
	bool zwcadView
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
zwcadView(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)