Reference Library
LastSavedAsMaintenanceVersion Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »LastSavedAsMaintenanceVersion
 Declaration Syntax
C# | Visual Basic | Visual C++
public MaintenanceReleaseVersion LastSavedAsMaintenanceVersion { get; }
Public ReadOnly Property LastSavedAsMaintenanceVersion As MaintenanceReleaseVersion
	Get
public:
property MaintenanceReleaseVersion LastSavedAsMaintenanceVersion {
	MaintenanceReleaseVersion get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)