Reference Library
PropertiesInU Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbSurfaceDefinition »PropertiesInU
 Declaration Syntax
C# | Visual Basic | Visual C++
public int PropertiesInU { get; }
Public ReadOnly Property PropertiesInU As Integer
	Get
public:
property int PropertiesInU {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)