Reference Library
DistanceTo Method (point)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »DistanceTo(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double DistanceTo(
	Point3d point
)
Public Function DistanceTo ( _
	point As Point3d _
) As Double
public:
double DistanceTo(
	Point3d point
)
 Parameters
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)