Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3dCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d this[
	int index
] { get; set; }
Public Default Property Item ( _
	index As Integer _
) As Point3d
	Get
	Set
public:
property Point3d default[int index] {
	Point3d get (int index);
	void set (int index, Point3d value);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)