Reference Library
Skpoly Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Skpoly
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Skpoly { get; set; }
Public Property Skpoly As Boolean
	Get
	Set
public:
property bool Skpoly {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)