Reference Library
Section Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Section »Section()
 Members
Icon | Member | Description
Section(Point3dCollection, Vector3d, Vector3d)
Section(Point3dCollection, Vector3d)
Section()
Section(IntPtr, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)