Reference Library
Load1 Method (fileName, extensionHolderType, handler)
Namespaces »ZwSoft.ZwCAD.Runtime »ExtensionLoader »Load1(String, Type, ExtensionLoader.BeforeLoadHandler)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static void Load1(
	string fileName,
	Type extensionHolderType,
	ExtensionLoader.BeforeLoadHandler handler
)
Public Shared Sub Load1 ( _
	fileName As String, _
	extensionHolderType As Type, _
	handler As ExtensionLoader.BeforeLoadHandler _
)
public:
static void Load1(
	String^ fileName,
	Type^ extensionHolderType,
	ExtensionLoader.BeforeLoadHandler^ handler
)
 Parameters
fileName(String)
extensionHolderType(Type)
handler(ExtensionLoader.BeforeLoadHandler)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)