Reference Library
DeleteUnmanagedObject Method
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »DeleteUnmanagedObject()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected override void DeleteUnmanagedObject()
Protected Overrides Sub DeleteUnmanagedObject
protected:
virtual void DeleteUnmanagedObject() override
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)