Reference Library
CellType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCell »CellType
 Declaration Syntax
C# | Visual Basic | Visual C++
public CellType CellType { get; }
Public ReadOnly Property CellType As CellType
	Get
public:
property CellType CellType {
	CellType get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)