Reference Library
Surface Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Surface »Surface(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal Surface(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
protected public:
Surface(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)