Reference Library
ControlPointTolerance Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »NurbsData »ControlPointTolerance
 Declaration Syntax
C# | Visual Basic | Visual C++
public double ControlPointTolerance { get; }
Public ReadOnly Property ControlPointTolerance As Double
	Get
public:
property double ControlPointTolerance {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)