Reference Library
Chamferd Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Chamferd
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Chamferd { get; set; }
Public Property Chamferd As Double
	Get
	Set
public:
property double Chamferd {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)