Reference Library
IntersectWith Method (linearEntity, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Cylinder »IntersectWith(LinearEntity3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d[] IntersectWith(
	LinearEntity3d linearEntity,
	Tolerance tolerance
)
Public Function IntersectWith ( _
	linearEntity As LinearEntity3d, _
	tolerance As Tolerance _
) As Point3d()
public:
array<Point3d>^ IntersectWith(
	LinearEntity3d^ linearEntity,
	Tolerance tolerance
)
 Parameters
linearEntity(LinearEntity3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)