Reference Library
SetExtents Method (extents)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »WorldGeometry »SetExtents(Extents3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void SetExtents(
	Extents3d extents
)
Public MustOverride Sub SetExtents ( _
	extents As Extents3d _
)
public:
virtual void SetExtents(
	Extents3d extents
) abstract
 Parameters
extents(Extents3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)