Reference Library
CenterPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Point3AngularDimension »CenterPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d CenterPoint { get; set; }
Public Property CenterPoint As Point3d
	Get
	Set
public:
property Point3d CenterPoint {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)