Reference Library
Azimuth Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Sun »Azimuth
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Unitless)]
public double Azimuth { get; set; }
<UnitTypeAttribute(UnitType.Unitless)> _
Public Property Azimuth As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Unitless)]
public:
property double Azimuth {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)