Reference Library
ReclaimMemoryFromErasedObjects Method (ids)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »ReclaimMemoryFromErasedObjects(ObjectIdCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void ReclaimMemoryFromErasedObjects(
	ObjectIdCollection ids
)
Public Sub ReclaimMemoryFromErasedObjects ( _
	ids As ObjectIdCollection _
)
public:
void ReclaimMemoryFromErasedObjects(
	ObjectIdCollection^ ids
)
 Parameters
ids(ObjectIdCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)