Reference Library
IsByBlock Property
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor »IsByBlock
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsByBlock { get; }
Public ReadOnly Property IsByBlock As Boolean
	Get
public:
property bool IsByBlock {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)