Reference Library
Create Method (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.Geometry »CurveCurveIntersector2d »Create(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static CurveCurveIntersector2d Create(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Public Shared Function Create ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
) As CurveCurveIntersector2d
public:
static CurveCurveIntersector2d^ Create(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)