Reference Library
Torus Class
Namespaces »ZwSoft.ZwCAD.Geometry »Torus
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeTorus")]
public sealed class Torus : Surface
<WrapperAttribute("ZcGeTorus")> _
Public NotInheritable Class Torus _
	Inherits Surface
[WrapperAttribute(L"ZcGeTorus")]
public ref class Torus sealed : public Surface
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Torus(Double, Double, Point3d, Vector3d, Vector3d, Double, Double, Double, Double)
Torus(Double, Double, Point3d, Vector3d)
Torus()
AxisOfSymmetry
Center
Create(IntPtr, Boolean)
GetAnglesInU()
GetAnglesInV()
IntersectWith(LinearEntity3d, Tolerance)
IntersectWith(LinearEntity3d)
IsApple
IsDegenerate
IsDoughnut
IsHollow
IsLemon
IsOuterNormal
IsVortex
MajorRadius
MinorRadius
ReferenceAxis
Set(Double, Double, Point3d, Vector3d, Vector3d, Double, Double, Double, Double)
Set(Double, Double, Point3d, Vector3d)
SetAnglesInU(Double, Double)
SetAnglesInV(Double, Double)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity3d
|  |  | Surface
|  |  |  | Torus
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)