Reference Library
VersionGuid Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »VersionGuid
 Declaration Syntax
C# | Visual Basic | Visual C++
public string VersionGuid { get; set; }
Public Property VersionGuid As String
	Get
	Set
public:
property String^ VersionGuid {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)