Reference Library
SetAttributeFromBlock Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AttributeReference »SetAttributeFromBlock()
 Members
Icon | Member | Description
SetAttributeFromBlock(AttributeDefinition, Matrix3d)
SetAttributeFromBlock(Matrix3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)