Reference Library
PromptDoubleOptions Constructor (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDoubleOptions »PromptDoubleOptions(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDoubleOptions(
	string message
)
Public Sub New ( _
	message As String _
)
public:
PromptDoubleOptions(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)