Reference Library
EllipticalArc3d Constructor (center, majorAxis, minorAxis, majorRadius, minorRadius, startAngle, endAngle)
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc3d »EllipticalArc3d(Point3d, Vector3d, Vector3d, Double, Double, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public EllipticalArc3d(
	Point3d center,
	Vector3d majorAxis,
	Vector3d minorAxis,
	double majorRadius,
	double minorRadius,
	double startAngle,
	double endAngle
)
Public Sub New ( _
	center As Point3d, _
	majorAxis As Vector3d, _
	minorAxis As Vector3d, _
	majorRadius As Double, _
	minorRadius As Double, _
	startAngle As Double, _
	endAngle As Double _
)
public:
EllipticalArc3d(
	Point3d center,
	Vector3d majorAxis,
	Vector3d minorAxis,
	double majorRadius,
	double minorRadius,
	double startAngle,
	double endAngle
)
 Parameters
center(Point3d)
majorAxis(Vector3d)
minorAxis(Vector3d)
majorRadius(Double)
minorRadius(Double)
startAngle(Double)
endAngle(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)