Reference Library
UpdateDimension Method (update)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimAssoc »UpdateDimension(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void UpdateDimension(
	bool update
)
Public Sub UpdateDimension ( _
	update As Boolean _
)
public:
void UpdateDimension(
	bool update
)
 Parameters
update(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)