Reference Library
ProxyFlags Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ProxyEntity »ProxyFlags
 Declaration Syntax
C# | Visual Basic | Visual C++
public int ProxyFlags { get; }
Public ReadOnly Property ProxyFlags As Integer
	Get
public:
property int ProxyFlags {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)