Reference Library
FenceSelectedSubObject Constructor (path, method, gsMarker, descriptors)
Namespaces »ZwSoft.ZwCAD.EditorInput »FenceSelectedSubObject »FenceSelectedSubObject(FullSubentityPath, SelectionMethod, Int32, PickPointDescriptor[])
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use overload taking System::IntPtr instead.")]
public FenceSelectedSubObject(
	FullSubentityPath path,
	SelectionMethod method,
	int gsMarker,
	PickPointDescriptor[] descriptors
)
<ObsoleteAttribute("Use overload taking System::IntPtr instead.")> _
Public Sub New ( _
	path As FullSubentityPath, _
	method As SelectionMethod, _
	gsMarker As Integer, _
	descriptors As PickPointDescriptor() _
)
[ObsoleteAttribute(L"Use overload taking System::IntPtr instead.")]
public:
FenceSelectedSubObject(
	FullSubentityPath path,
	SelectionMethod method,
	int gsMarker,
	array<PickPointDescriptor>^ descriptors
)
 Parameters
path(FullSubentityPath)
method(SelectionMethod)
gsMarker(Int32)
descriptors(PickPointDescriptor[])
Assembly: ZwManaged (Module: ZwManaged)