Reference Library
GetDataLink Method (name)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataLinkManager »GetDataLink(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId GetDataLink(
	string name
)
Public Function GetDataLink ( _
	name As String _
) As ObjectId
public:
ObjectId GetDataLink(
	String^ name
)
 Parameters
name(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)