Reference Library
RawGeometry Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »CommonDraw »RawGeometry
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Geometry RawGeometry { get; }
Public MustOverride ReadOnly Property RawGeometry As Geometry
	Get
public:
virtual property Geometry^ RawGeometry {
	Geometry^ get () abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)