Reference Library
IntersectWith Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Image »IntersectWith()
 Members
Icon | Member | Description
IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
IntersectWith(Entity, Intersect, Plane, Point3dCollection, Int32, Int32) |  Obsolete.
IntersectWith(Entity, Intersect, Point3dCollection, Int32, Int32) |  Obsolete.
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)