Reference Library
GetDerivative Method
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve2d »GetDerivative()
 Members
Icon | Member | Description
GetDerivative(Int32, Curve2d, Double)
GetDerivative(Int32, Double)
GetDerivative(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)