Reference Library
DiametricDimension Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DiametricDimension
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbDiametricDimension")]
public class DiametricDimension : Dimension
<WrapperAttribute("AcDbDiametricDimension")> _
Public Class DiametricDimension _
	Inherits Dimension
[WrapperAttribute(L"AcDbDiametricDimension")]
public ref class DiametricDimension : public Dimension
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DiametricDimension(Point3d, Point3d, Double, String, ObjectId)
DiametricDimension(IntPtr, Boolean)
DiametricDimension()
ChordPoint
FarChordPoint
LeaderLength
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Dimension
|  |  |  |  |  |  | DiametricDimension
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)