Reference Library
Radius Property
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc2d »Radius
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Radius { get; set; }
Public Property Radius As Double
	Get
	Set
public:
property double Radius {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)