Reference Library
Multiply Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »Multiply(Matrix2d, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Point2d operator *(
	Matrix2d mat,
	Point2d a
)
Public Shared Operator * ( _
	mat As Matrix2d, _
	a As Point2d _
) As Point2d
public:
static Point2d operator *(
	Matrix2d mat,
	Point2d a
)
 Parameters
mat(Matrix2d)
a(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)