Reference Library
Draw Method (hDC, bounds)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »GdiDrawObject »Draw(IntPtr, Rectangle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool Draw(
	IntPtr hDC,
	Rectangle bounds
)
Public MustOverride Function Draw ( _
	hDC As IntPtr, _
	bounds As Rectangle _
) As Boolean
public:
virtual bool Draw(
	IntPtr hDC,
	Rectangle bounds
) abstract
 Parameters
hDC(IntPtr)
bounds(Rectangle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)