Reference Library
PaletteActivatedEventArgs Constructor (activated, deactivated)
Namespaces »ZwSoft.ZwCAD.Windows »PaletteActivatedEventArgs »PaletteActivatedEventArgs(Palette, Palette)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PaletteActivatedEventArgs(
	Palette activated,
	Palette deactivated
)
Public Sub New ( _
	activated As Palette, _
	deactivated As Palette _
)
public:
PaletteActivatedEventArgs(
	Palette^ activated,
	Palette^ deactivated
)
 Parameters
activated(Palette)
deactivated(Palette)
Assembly: ZwManaged (Module: ZwManaged)