Reference Library
Contents Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »Contents
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Contents { get; set; }
Public Property Contents As String
	Get
	Set
public:
property String^ Contents {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)