Reference Library
FGSampleRadiusState Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraits »FGSampleRadiusState
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract MentalRayRenderSettingsTraitsBoolParameter FGSampleRadiusState { get; set; }
Public MustOverride Property FGSampleRadiusState As MentalRayRenderSettingsTraitsBoolParameter
	Get
	Set
public:
virtual property MentalRayRenderSettingsTraitsBoolParameter FGSampleRadiusState {
	MentalRayRenderSettingsTraitsBoolParameter get () abstract;
	void set (MentalRayRenderSettingsTraitsBoolParameter value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)