Reference Library
PolyMeshType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolyMeshType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDb::PolyMeshType")]
public enum PolyMeshType
<WrapperAttribute("ZcDb::PolyMeshType")> _
Public Enumeration PolyMeshType
[WrapperAttribute(L"ZcDb::PolyMeshType")]
public enum class PolyMeshType
 Members
Member | Description
SimpleMesh
QuadSurfaceMesh
CubicSurfaceMesh
BezierSurfaceMesh
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)