Reference Library
SetObjectId Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCell »SetObjectId(ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetObjectId(
	ObjectId value
)
Public Sub SetObjectId ( _
	value As ObjectId _
)
public:
void SetObjectId(
	ObjectId value
)
 Parameters
value(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)