Reference Library
LayerStateMasks Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateMasks
 Declaration Syntax
C# | Visual Basic | Visual C++
[FlagsAttribute]
[WrapperAttribute("ZcDbLayerState::Mask")]
public enum LayerStateMasks
<FlagsAttribute> _
<WrapperAttribute("ZcDbLayerState::Mask")> _
Public Enumeration LayerStateMasks
[FlagsAttribute]
[WrapperAttribute(L"ZcDbLayerState::Mask")]
public enum class LayerStateMasks
 Members
Member | Description
LastRestored
CurrentViewport
PlotStyle
NewViewport
Plot
Locked
On
None
LineWeight
LineType
Color
Frozen
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)