Reference Library
IsReadOnly Property
Namespaces »ZwSoft.ZwCAD.Runtime »Dictionary »IsReadOnly
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual bool IsReadOnly { get; }
Protected Overridable ReadOnly Property IsReadOnly As Boolean
	Get
protected:
virtual property bool IsReadOnly {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)