Reference Library
Attachment Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »Attachment
 Declaration Syntax
C# | Visual Basic | Visual C++
public AttachmentPoint Attachment { get; set; }
Public Property Attachment As AttachmentPoint
	Get
	Set
public:
property AttachmentPoint Attachment {
	AttachmentPoint get ();
	void set (AttachmentPoint value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)