Reference Library
ReservedStringEnumType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ReservedStringEnumType
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum ReservedStringEnumType
Public Enumeration ReservedStringEnumType
public enum class ReservedStringEnumType
 Members
Member | Description
ByColor
None
ByBlock
ByLayer
VSShaded
VSShadedWithEdges
VSXRay
VSSketchy
VSShadesOfGray
Header
Title
VSConceptual
VSRealistic
VS3DHidden
VS3DWireframe
VS2DWireframe
Default
DefPoints
Normal
Standard
Continuous
Data
Global
Model
Missing
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)