Reference Library
GetFirstDerivative Method (point)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »GetFirstDerivative(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Vector3d GetFirstDerivative(
	Point3d point
)
Public Overridable Function GetFirstDerivative ( _
	point As Point3d _
) As Vector3d
public:
virtual Vector3d GetFirstDerivative(
	Point3d point
)
 Parameters
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)