Reference Library
CopyTo Method (array, index)
Namespaces »ZwSoft.ZwCAD.Geometry »Line2dCollection »CopyTo(Line2d[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	Line2d[] array,
	int index
)
Public Sub CopyTo ( _
	array As Line2d(), _
	index As Integer _
)
public:
void CopyTo(
	array<Line2d^>^ array,
	int index
)
 Parameters
array(Line2d[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)