Reference Library
GetDistanceTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc2d »GetDistanceTo()
 Members
Icon | Member | Description
GetDistanceTo(Point2d, Tolerance)
GetDistanceTo(Curve2d, Tolerance)
GetDistanceTo(Point2d)
GetDistanceTo(Curve2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)