Reference Library
CreateZWCADOffScreenDevice Method
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Manager »CreateZWCADOffScreenDevice()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Device CreateZWCADOffScreenDevice()
Public Function CreateZWCADOffScreenDevice As Device
public:
Device^ CreateZWCADOffScreenDevice()
Assembly: ZwManaged (Module: ZwManaged)