Reference Library
EvaluatePoint Method (parameter)
Namespaces »ZwSoft.ZwCAD.Geometry »Surface »EvaluatePoint(Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d EvaluatePoint(
	Point2d parameter
)
Public Function EvaluatePoint ( _
	parameter As Point2d _
) As Point3d
public:
Point3d EvaluatePoint(
	Point2d parameter
)
 Parameters
parameter(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)