Reference Library
IsOne Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Handle »IsOne
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsOne { get; }
Public ReadOnly Property IsOne As Boolean
	Get
public:
property bool IsOne {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)