Reference Library
CopyTo Method (arr, index)
Namespaces »ZwSoft.ZwCAD.Publishing »EPlotAttributeCollection »CopyTo(Array, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	Array arr,
	int index
)
Public Sub CopyTo ( _
	arr As Array, _
	index As Integer _
)
public:
virtual void CopyTo(
	Array^ arr,
	int index
) sealed
 Parameters
arr(Array)
index(Int32)
Assembly: ZwManaged (Module: ZwManaged)