Reference Library
AttenuationType Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »AttenuationType
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum AttenuationType
Public Enumeration AttenuationType
public enum class AttenuationType
 Members
Member | Description
InverseSquare
InverseLinear
None
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)