Reference Library
AxisVector Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Helix »AxisVector
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d AxisVector { get; set; }
Public Property AxisVector As Vector3d
	Get
	Set
public:
property Vector3d AxisVector {
	Vector3d get ();
	void set (Vector3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)