Reference Library
TransformBy Method (leftSide)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »TransformBy(Matrix3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d TransformBy(
	Matrix3d leftSide
)
Public Function TransformBy ( _
	leftSide As Matrix3d _
) As Point3d
public:
Point3d TransformBy(
	Matrix3d leftSide
)
 Parameters
leftSide(Matrix3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)