Reference Library
SurfaceSliceResults Constructor (negativeHalfSurface, newSurface)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SurfaceSliceResults »SurfaceSliceResults(Surface, Surface)
 Declaration Syntax
C# | Visual Basic | Visual C++
public SurfaceSliceResults(
	Surface negativeHalfSurface,
	Surface newSurface
)
Public Sub New ( _
	negativeHalfSurface As Surface, _
	newSurface As Surface _
)
public:
SurfaceSliceResults(
	Surface^ negativeHalfSurface,
	Surface^ newSurface
)
 Parameters
negativeHalfSurface(Surface)
newSurface(Surface)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)