Reference Library
Add Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »UInt32Collection »Add(UInt32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Add(
	uint value
)
Public Overridable Function Add ( _
	value As UInteger _
) As Integer
public:
virtual int Add(
	unsigned int value
)
 Parameters
value(UInt32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)