Reference Library
NurbSurface Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »NurbSurface »NurbSurface()
 Members
Icon | Member | Description
NurbSurface(Int32, Int32, Int32, Int32, Int32, Int32, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection, Tolerance)
NurbSurface(Int32, Int32, Int32, Int32, Int32, Int32, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection)
NurbSurface()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)