Reference Library
IsLinetypeContinuousName Method (name)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »IsLinetypeContinuousName(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool IsLinetypeContinuousName(
	string name
)
Public Shared Function IsLinetypeContinuousName ( _
	name As String _
) As Boolean
public:
static bool IsLinetypeContinuousName(
	String^ name
)
 Parameters
name(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)