Reference Library
PushOrientationTransform Method (behavior)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »PushOrientationTransform(OrientationBehavior)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Matrix3d PushOrientationTransform(
	OrientationBehavior behavior
)
Public MustOverride Function PushOrientationTransform ( _
	behavior As OrientationBehavior _
) As Matrix3d
public:
virtual Matrix3d PushOrientationTransform(
	OrientationBehavior behavior
) abstract
 Parameters
behavior(OrientationBehavior)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)