Reference Library
ObjectModified Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »ObjectModified
 Declaration Syntax
C# | Visual Basic | Visual C++
public event ObjectEventHandler ObjectModified
Public Event ObjectModified As ObjectEventHandler
public:
 event ObjectEventHandler^ ObjectModified {
	void add (ObjectEventHandler^ value);
	void remove (ObjectEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)