Reference Library
CalculateResult Method (status, result)
Namespaces »ZwSoft.ZwCAD.EditorInput »JigPromptOptions »CalculateResult(DragStatus, PromptResult)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal void CalculateResult(
	DragStatus status,
	PromptResult result
)
Protected Friend Sub CalculateResult ( _
	status As DragStatus, _
	result As PromptResult _
)
protected public:
void CalculateResult(
	DragStatus status,
	PromptResult^ result
)
 Parameters
status(DragStatus)
result(PromptResult)
Assembly: ZwManaged (Module: ZwManaged)