Reference Library
IsHatch Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »IsHatch
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool IsHatch { get; }
Public Overridable ReadOnly Property IsHatch As Boolean
	Get
public:
virtual property bool IsHatch {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)