Reference Library
DetachUnmanagedObject Method (obj)
Namespaces »ZwSoft.ZwCAD.Runtime »Interop »DetachUnmanagedObject(DisposableWrapper)
 Declaration Syntax
C# | Visual Basic | Visual C++
[SecurityPermissionAttribute(SecurityAction.LinkDemand, Flags = SecurityPermissionFlag.UnmanagedCode)]
public static void DetachUnmanagedObject(
	DisposableWrapper obj
)
<SecurityPermissionAttribute(SecurityAction.LinkDemand, Flags := SecurityPermissionFlag.UnmanagedCode)> _
Public Shared Sub DetachUnmanagedObject ( _
	obj As DisposableWrapper _
)
[SecurityPermissionAttribute(SecurityAction::LinkDemand, Flags = SecurityPermissionFlag::UnmanagedCode)]
public:
static void DetachUnmanagedObject(
	DisposableWrapper^ obj
)
 Parameters
obj(DisposableWrapper)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)