Reference Library
TransformFaces Method (subentityIds, matrix)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »TransformFaces(SubentityId[], Matrix3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void TransformFaces(
	SubentityId[] subentityIds,
	Matrix3d matrix
)
Public Overridable Sub TransformFaces ( _
	subentityIds As SubentityId(), _
	matrix As Matrix3d _
)
public:
virtual void TransformFaces(
	array<SubentityId>^ subentityIds,
	Matrix3d matrix
)
 Parameters
subentityIds(SubentityId[])
matrix(Matrix3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)