Reference Library
NurbCurve3d Constructor (fitPoints, startTangent, endTangent, startTangentDefined, endTangentDefined)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »NurbCurve3d(Point3dCollection, Vector3d, Vector3d, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public NurbCurve3d(
	Point3dCollection fitPoints,
	Vector3d startTangent,
	Vector3d endTangent,
	bool startTangentDefined,
	bool endTangentDefined
)
Public Sub New ( _
	fitPoints As Point3dCollection, _
	startTangent As Vector3d, _
	endTangent As Vector3d, _
	startTangentDefined As Boolean, _
	endTangentDefined As Boolean _
)
public:
NurbCurve3d(
	Point3dCollection^ fitPoints,
	Vector3d startTangent,
	Vector3d endTangent,
	bool startTangentDefined,
	bool endTangentDefined
)
 Parameters
fitPoints(Point3dCollection)
startTangent(Vector3d)
endTangent(Vector3d)
startTangentDefined(Boolean)
endTangentDefined(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)