Reference Library
AutoOutputQuality Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ole2Frame »AutoOutputQuality
 Declaration Syntax
C# | Visual Basic | Visual C++
public byte AutoOutputQuality { get; set; }
Public Property AutoOutputQuality As Byte
	Get
	Set
public:
property unsigned char AutoOutputQuality {
	unsigned char get ();
	void set (unsigned char value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)