Reference Library
IsEqualTo Method (a, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2d »IsEqualTo(Matrix2d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	Matrix2d a,
	Tolerance tolerance
)
Public Function IsEqualTo ( _
	a As Matrix2d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsEqualTo(
	Matrix2d a,
	Tolerance tolerance
)
 Parameters
a(Matrix2d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)