Reference Library
Dimblk2s Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimblk2s
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Dimblk2s { get; set; }
Public Property Dimblk2s As String
	Get
	Set
public:
property String^ Dimblk2s {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)