Reference Library
GetDataFormat Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GetDataFormat(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string GetDataFormat(
	int row,
	int column
)
Public Overridable Function GetDataFormat ( _
	row As Integer, _
	column As Integer _
) As String
public:
virtual String^ GetDataFormat(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)