Reference Library
ReplacementObject Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DecomposeForSaveReplacementRecord »ReplacementObject
 Declaration Syntax
C# | Visual Basic | Visual C++
public DBObject ReplacementObject { get; }
Public ReadOnly Property ReplacementObject As DBObject
	Get
public:
property DBObject^ ReplacementObject {
	DBObject^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)