Reference Library
ColumnCount Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »ColumnCount
 Declaration Syntax
C# | Visual Basic | Visual C++
public int ColumnCount { get; set; }
Public Property ColumnCount As Integer
	Get
	Set
public:
property int ColumnCount {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)