Reference Library
NearPointParam Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »OsnapPointRef »NearPointParam
 Declaration Syntax
C# | Visual Basic | Visual C++
public double NearPointParam { get; set; }
Public Property NearPointParam As Double
	Get
	Set
public:
property double NearPointParam {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)