Reference Library
UKnots Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbSurfaceDefinition »UKnots
 Declaration Syntax
C# | Visual Basic | Visual C++
public KnotCollection UKnots { get; }
Public ReadOnly Property UKnots As KnotCollection
	Get
public:
property KnotCollection^ UKnots {
	KnotCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)