Reference Library
MessageForRemoval Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionOptions »MessageForRemoval
 Declaration Syntax
C# | Visual Basic | Visual C++
public string MessageForRemoval { get; set; }
Public Property MessageForRemoval As String
	Get
	Set
public:
property String^ MessageForRemoval {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwManaged (Module: ZwManaged)