Reference Library
AttachXref Method (fileName, blockName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »AttachXref(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId AttachXref(
	string fileName,
	string blockName
)
Public Function AttachXref ( _
	fileName As String, _
	blockName As String _
) As ObjectId
public:
ObjectId AttachXref(
	String^ fileName,
	String^ blockName
)
 Parameters
fileName(String)
blockName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)