Reference Library
LayerStateRenamed Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »LayerStateRenamed
 Declaration Syntax
C# | Visual Basic | Visual C++
public event LayerStateRenameEventHandler LayerStateRenamed
Public Event LayerStateRenamed As LayerStateRenameEventHandler
public:
 event LayerStateRenameEventHandler^ LayerStateRenamed {
	void add (LayerStateRenameEventHandler^ value);
	void remove (LayerStateRenameEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)