Reference Library
RowOfDots Method (count, start, step)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »RowOfDots(Int32, Point3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool RowOfDots(
	int count,
	Point3d start,
	Vector3d step
)
Public MustOverride Function RowOfDots ( _
	count As Integer, _
	start As Point3d, _
	step As Vector3d _
) As Boolean
public:
virtual bool RowOfDots(
	int count,
	Point3d start,
	Vector3d step
) abstract
 Parameters
count(Int32)
start(Point3d)
step(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)