Reference Library
Material Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »Material
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Material { get; set; }
Public Property Material As String
	Get
	Set
public:
property String^ Material {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)