Reference Library
EntityColor Structure
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcCmEntityColor")]
public struct EntityColor
<WrapperAttribute("AcCmEntityColor")> _
Public Structure EntityColor
[WrapperAttribute(L"AcCmEntityColor")]
public value class EntityColor
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
EntityColor(Byte, Byte, Byte)
EntityColor(ColorMethod)
EntityColor(Int32)
EntityColor(ColorMethod, Int16)
Blue
ColorIndex
ColorMethod
Green
IsByAci
IsByBlock
IsByColor
IsByLayer
IsByPen
IsForeground
IsLayerFrozen
IsLayerFrozenOrOff
IsLayerOff
IsNone
LayerIndex
LookUpAci(Byte, Byte, Byte)
LookUpRgb(Byte)
PenIndex
Red
SetRgb(Byte, Byte, Byte)
SetTrueColor()
SetTrueColorMethod()
TrueColor
TrueColorMethod
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)