Reference Library
ToPolyline Method (numOfVertices)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Spline »ToPolyline(UInt32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Curve ToPolyline(
	uint numOfVertices
)
Public Function ToPolyline ( _
	numOfVertices As UInteger _
) As Curve
public:
Curve^ ToPolyline(
	unsigned int numOfVertices
)
 Parameters
numOfVertices(UInt32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)