Reference Library
AltToleranceSuppressTrailingZeros Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »AltToleranceSuppressTrailingZeros
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool AltToleranceSuppressTrailingZeros { get; set; }
Public Overridable Property AltToleranceSuppressTrailingZeros As Boolean
	Get
	Set
public:
virtual property bool AltToleranceSuppressTrailingZeros {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)