Reference Library
Polyline Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbPolyline")]
public class Polyline : Curve
<WrapperAttribute("AcDbPolyline")> _
Public Class Polyline _
	Inherits Curve
[WrapperAttribute(L"AcDbPolyline")]
public ref class Polyline : public Curve
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Polyline(IntPtr, Boolean)
Polyline(Int32)
Polyline()
AddVertexAt(Int32, Point2d, Double, Double, Double)
Closed
ConstantWidth
ConvertFrom(Entity, Boolean)
ConvertTo(Boolean)
Elevation
GetArcSegment2dAt(Int32)
GetArcSegmentAt(Int32)
GetBulgeAt(Int32)
GetEndWidthAt(Int32)
GetLineSegment2dAt(Int32)
GetLineSegmentAt(Int32)
GetPoint2dAt(Int32)
GetPoint3dAt(Int32)
GetSegmentType(Int32)
GetStartWidthAt(Int32)
HasBulges
HasWidth
IsOnlyLines
Length
MaximizeMemory()
MinimizeMemory()
Normal
NumberOfVertices
OnSegmentAt(Int32, Point2d, Double)
Plinegen
RemoveVertexAt(Int32)
Reset(Boolean, Int32)
SetBulgeAt(Int32, Double)
SetEndWidthAt(Int32, Double)
SetPointAt(Int32, Point2d)
SetStartWidthAt(Int32, Double)
Thickness
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Curve
|  |  |  |  |  |  | Polyline
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)