Reference Library
DiagnosticGridMode Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraits »DiagnosticGridMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract MentalRayRenderSettingsTraitsDiagnosticGridModeParameter DiagnosticGridMode { get; set; }
Public MustOverride Property DiagnosticGridMode As MentalRayRenderSettingsTraitsDiagnosticGridModeParameter
	Get
	Set
public:
virtual property MentalRayRenderSettingsTraitsDiagnosticGridModeParameter DiagnosticGridMode {
	MentalRayRenderSettingsTraitsDiagnosticGridModeParameter get () abstract;
	void set (MentalRayRenderSettingsTraitsDiagnosticGridModeParameter value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)