Reference Library
IsProportional Method
Namespaces »ZwSoft.ZwCAD.Geometry »Scale2d »IsProportional()
 Members
Icon | Member | Description
IsProportional(Tolerance)
IsProportional()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)