Reference Library
AddRange Method (range)
Namespaces »ZwSoft.ZwCAD.Geometry »Int32Collection »AddRange(Int32[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void AddRange(
	int[] range
)
Public Overridable Sub AddRange ( _
	range As Integer() _
)
public:
virtual void AddRange(
	array<int>^ range
)
 Parameters
range(Int32[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)