Reference Library
DimBlockPosition Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »DimBlockPosition
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d DimBlockPosition { get; }
Public ReadOnly Property DimBlockPosition As Point3d
	Get
public:
property Point3d DimBlockPosition {
	Point3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)