Reference Library
DeviceContextViewportCorners Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Viewport »DeviceContextViewportCorners
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Extents2d DeviceContextViewportCorners { get; }
Public MustOverride ReadOnly Property DeviceContextViewportCorners As Extents2d
	Get
public:
virtual property Extents2d DeviceContextViewportCorners {
	Extents2d get () abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)