Reference Library
GetStandardValuesSupported Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnitsConverter »GetStandardValuesSupported()
 Members
Icon | Member | Description
GetStandardValuesSupported()
GetStandardValuesSupported(ITypeDescriptorContext)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)