Reference Library
PaletteSetSizeEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSetSizeEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void PaletteSetSizeEventHandler(
	Object sender,
	PaletteSetSizeEventArgs e
)
Public Delegate Sub PaletteSetSizeEventHandler ( _
	sender As Object, _
	e As PaletteSetSizeEventArgs _
)
public delegate void PaletteSetSizeEventHandler(
	Object^ sender,
	PaletteSetSizeEventArgs^ e
)
 Parameters
sender(Object)
e(PaletteSetSizeEventArgs)
Assembly: ZwManaged (Module: ZwManaged)