Reference Library
TagLine Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfig »TagLine
 Declaration Syntax
C# | Visual Basic | Visual C++
public string TagLine { get; }
Public ReadOnly Property TagLine As String
	Get
public:
property String^ TagLine {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)