Reference Library
Contains Method (p)
Namespaces »ZwSoft.ZwCAD.Windows »TrayItemCollection »Contains(TrayItem)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Contains(
	TrayItem p
)
Public Function Contains ( _
	p As TrayItem _
) As Boolean
public:
bool Contains(
	TrayItem^ p
)
 Parameters
p(TrayItem)
Assembly: ZwManaged (Module: ZwManaged)