Reference Library
Int Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Variant »Int
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Int { get; set; }
Public Property Int As Integer
	Get
	Set
public:
property int Int {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)