Reference Library
LastPointRef Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »OsnapPointRef »LastPointRef
 Declaration Syntax
C# | Visual Basic | Visual C++
public OsnapPointRef LastPointRef { get; set; }
Public Property LastPointRef As OsnapPointRef
	Get
	Set
public:
property OsnapPointRef^ LastPointRef {
	OsnapPointRef^ get ();
	void set (OsnapPointRef^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)