Reference Library
SunColor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Sun »SunColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color SunColor { get; set; }
Public Property SunColor As Color
	Get
	Set
public:
property Color^ SunColor {
	Color^ get ();
	void set (Color^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)