Reference Library
Current Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockTableRecordEnumerator »Current
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId Current { get; }
Public Overridable ReadOnly Property Current As ObjectId
	Get
public:
virtual property ObjectId Current {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)