Reference Library
NonEntityTraits Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »NonEntityTraits
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcGiNonEntityTraits")]
public class NonEntityTraits : SubEntityTraits
<WrapperAttribute("AcGiNonEntityTraits")> _
Public Class NonEntityTraits _
	Inherits SubEntityTraits
[WrapperAttribute(L"AcGiNonEntityTraits")]
public ref class NonEntityTraits : public SubEntityTraits
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
NonEntityTraits(IntPtr, Boolean)
AddLight(ObjectId) |  (Overrides DrawableTraits.AddLight(ObjectId).)
Color |  (Overrides SubEntityTraits.Color.)
DrawFlags |  (Overrides SubEntityTraits.DrawFlags.)
FillType |  (Overrides SubEntityTraits.FillType.)
Layer |  (Overrides SubEntityTraits.Layer.)
LineType |  (Overrides SubEntityTraits.LineType.)
LineTypeScale |  (Overrides SubEntityTraits.LineTypeScale.)
LineWeight |  (Overrides SubEntityTraits.LineWeight.)
Mapper |  (Overrides SubEntityTraits.Mapper.)
Material |  (Overrides SubEntityTraits.Material.)
PlotStyleDescriptor |  (Overrides SubEntityTraits.PlotStyleDescriptor.)
Sectionable |  (Overrides SubEntityTraits.Sectionable.)
SelectionOnlyGeometry |  (Overrides SubEntityTraits.SelectionOnlyGeometry.)
SetLayerFlags(DrawableTraits.LayerFlags) |  (Overrides DrawableTraits.SetLayerFlags(DrawableTraits.LayerFlags).)
SetSelectionMarker(IntPtr) |  (Overrides SubEntityTraits.SetSelectionMarker(IntPtr).)
SetupForEntity(Entity) |  (Overrides DrawableTraits.SetupForEntity(Entity).)
ShadowFlags |  (Overrides SubEntityTraits.ShadowFlags.)
Thickness |  (Overrides SubEntityTraits.Thickness.)
Transparency |  (Overrides SubEntityTraits.Transparency.)
TrueColor |  (Overrides SubEntityTraits.TrueColor.)
VisualStyle |  (Overrides SubEntityTraits.VisualStyle.)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | DrawableTraits
|  |  |  | SubEntityTraits
|  |  |  |  | NonEntityTraits
|  |  |  |  |  | LightTraits
|  |  |  |  |  | RenderSettingsTraits
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)