Reference Library
IntersectWith Method (line, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc2d »IntersectWith(LinearEntity2d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d[] IntersectWith(
	LinearEntity2d line,
	Tolerance tolerance
)
Public Function IntersectWith ( _
	line As LinearEntity2d, _
	tolerance As Tolerance _
) As Point2d()
public:
array<Point2d>^ IntersectWith(
	LinearEntity2d^ line,
	Tolerance tolerance
)
 Parameters
line(LinearEntity2d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)