Reference Library
Point3dCollection Class
Namespaces »ZwSoft.ZwCAD.Geometry »Point3dCollection
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGePoint3dArray")]
public sealed class Point3dCollection : DisposableWrapper,
	IList
<WrapperAttribute("ZcGePoint3dArray")> _
Public NotInheritable Class Point3dCollection _
	Inherits DisposableWrapper _
	Implements IList
[WrapperAttribute(L"ZcGePoint3dArray")]
public ref class Point3dCollection sealed : public DisposableWrapper,
	IList
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Point3dCollection(Point3d[])
Point3dCollection()
Add(Point3d)
Clear()
Contains(Point3d)
CopyTo(Point3d[], Int32)
Count
GetEnumerator()
ICollection.CopyTo(Array, Int32)
IList.Add(Object)
IList.Contains(Object)
IList.IndexOf(Object)
IList.Insert(Int32, Object)
IList.Item[Int32]
IList.Remove(Object)
IndexOf(Point3d)
Insert(Int32, Point3d)
IsFixedSize
IsReadOnly
IsSynchronized
Item[Int32]
Remove(Point3d)
RemoveAt(Int32)
SyncRoot
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Point3dCollection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)