Reference Library
Polyline3d Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline3d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDb3dPolyline")]
public class Polyline3d : Curve, IEnumerable
<WrapperAttribute("AcDb3dPolyline")> _
Public Class Polyline3d _
	Inherits Curve _
	Implements IEnumerable
[WrapperAttribute(L"AcDb3dPolyline")]
public ref class Polyline3d : public Curve,
	IEnumerable
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Polyline3d(Poly3dType, Point3dCollection, Boolean)
Polyline3d()
Polyline3d(IntPtr, Boolean)
AppendVertex(PolylineVertex3d)
Closed
ConvertToPolyType(Poly3dType)
GetEnumerator()
InsertVertexAt(PolylineVertex3d, PolylineVertex3d)
InsertVertexAt(ObjectId, PolylineVertex3d)
Length
PolyType
SplineFit(Poly3dType, Int32)
SplineFit()
Straighten()
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Curve
|  |  |  |  |  |  | Polyline3d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)