Reference Library
m_pLayerStateRenamed Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »m_pLayerStateRenamed
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerStateRenameEventHandler m_pLayerStateRenamed
Public m_pLayerStateRenamed As LayerStateRenameEventHandler
public:
LayerStateRenameEventHandler^ m_pLayerStateRenamed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)