Reference Library
IsParallelTo Method (vector, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »IsParallelTo(Vector2d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsParallelTo(
	Vector2d vector,
	Tolerance tolerance
)
Public Function IsParallelTo ( _
	vector As Vector2d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsParallelTo(
	Vector2d vector,
	Tolerance tolerance
)
 Parameters
vector(Vector2d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)