Reference Library
VisualStyle Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »VisualStyle
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiVisualStyle")]
public class VisualStyle : RXObject
<WrapperAttribute("ZcGiVisualStyle")> _
Public Class VisualStyle _
	Inherits RXObject
[WrapperAttribute(L"ZcGiVisualStyle")]
public ref class VisualStyle : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
VisualStyle(IntPtr, Boolean)
VisualStyle(VisualStyleType)
VisualStyle()
ConfigureForType(VisualStyleType)
DisplayStyle
EdgeStyle
FaceStyle
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | VisualStyle
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)