Reference Library
ModuleUnloadedEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.Runtime »ModuleUnloadedEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void ModuleUnloadedEventHandler(
	Object sender,
	DynamicLinkerEventArgs e
)
Public Delegate Sub ModuleUnloadedEventHandler ( _
	sender As Object, _
	e As DynamicLinkerEventArgs _
)
public delegate void ModuleUnloadedEventHandler(
	Object^ sender,
	DynamicLinkerEventArgs^ e
)
 Parameters
sender(Object)
e(DynamicLinkerEventArgs)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)