Reference Library
DiametricDimension Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DiametricDimension »DiametricDimension()
 Declaration Syntax
C# | Visual Basic | Visual C++
public DiametricDimension()
Public Sub New
public:
DiametricDimension()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)