Reference Library
Columns Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »Columns
 Declaration Syntax
C# | Visual Basic | Visual C++
public ColumnsCollection Columns { get; }
Public ReadOnly Property Columns As ColumnsCollection
	Get
public:
property ColumnsCollection^ Columns {
	ColumnsCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)