Reference Library
BlockEnd Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »BlockEnd
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string BlockEnd { get; }
Public Shared ReadOnly Property BlockEnd As String
	Get
public:
static property String^ BlockEnd {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)