Reference Library
NurbCurve2d Constructor (degree, fitPolyline, periodic)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »NurbCurve2d(Int32, PolylineCurve2d, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public NurbCurve2d(
	int degree,
	PolylineCurve2d fitPolyline,
	bool periodic
)
Public Sub New ( _
	degree As Integer, _
	fitPolyline As PolylineCurve2d, _
	periodic As Boolean _
)
public:
NurbCurve2d(
	int degree,
	PolylineCurve2d^ fitPolyline,
	bool periodic
)
 Parameters
degree(Int32)
fitPolyline(PolylineCurve2d)
periodic(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)