Reference Library
CanDeleteRows Method (index, nCount)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »CanDeleteRows(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool CanDeleteRows(
	int index,
	int nCount
)
Public Overridable Function CanDeleteRows ( _
	index As Integer, _
	nCount As Integer _
) As Boolean
public:
virtual bool CanDeleteRows(
	int index,
	int nCount
)
 Parameters
index(Int32)
nCount(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)