Reference Library
WriteInt16 Method (opCode, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DxfFiler »WriteInt16(DxfCode, Int16)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void WriteInt16(
	DxfCode opCode,
	short value
)
Public MustOverride Sub WriteInt16 ( _
	opCode As DxfCode, _
	value As Short _
)
public:
virtual void WriteInt16(
	DxfCode opCode,
	short value
) abstract
 Parameters
opCode(DxfCode)
value(Int16)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)