Reference Library
UpgradeOpen Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »UpgradeOpen()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void UpgradeOpen()
Public Sub UpgradeOpen
public:
void UpgradeOpen()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)