Reference Library
SwapIdWith Method (otherId, swapExtendedData, swapExtensionDictionary)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »SwapIdWith(ObjectId, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SwapIdWith(
	ObjectId otherId,
	bool swapExtendedData,
	bool swapExtensionDictionary
)
Public Sub SwapIdWith ( _
	otherId As ObjectId, _
	swapExtendedData As Boolean, _
	swapExtensionDictionary As Boolean _
)
public:
void SwapIdWith(
	ObjectId otherId,
	bool swapExtendedData,
	bool swapExtensionDictionary
)
 Parameters
otherId(ObjectId)
swapExtendedData(Boolean)
swapExtensionDictionary(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)