Reference Library
EntityColorCollection Constructor
Namespaces »ZwSoft.ZwCAD.Colors »EntityColorCollection »EntityColorCollection()
 Members
Icon | Member | Description
EntityColorCollection(Int32)
EntityColorCollection(EntityColor[])
EntityColorCollection()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)