Reference Library
GetUDerivative Method (order, surface, point)
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnSurface »GetUDerivative(Int32, Surface, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Vector3d GetUDerivative(
	int order,
	Surface surface,
	Point2d point
)
Public Shared Function GetUDerivative ( _
	order As Integer, _
	surface As Surface, _
	point As Point2d _
) As Vector3d
public:
static Vector3d GetUDerivative(
	int order,
	Surface^ surface,
	Point2d point
)
 Parameters
order(Int32)
surface(Surface)
point(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)