Reference Library
Max Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraitsIntegerRangeParameter »Max
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Max { get; }
Public ReadOnly Property Max As Integer
	Get
public:
property int Max {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)