Reference Library
PromptIntegerOptions Constructor (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptIntegerOptions »PromptIntegerOptions(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptIntegerOptions(
	string message
)
Public Sub New ( _
	message As String _
)
public:
PromptIntegerOptions(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)