Reference Library
AddToBuffer Method (id)
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »FilteredBlockIterator »AddToBuffer(ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AddToBuffer(
	ObjectId id
)
Public Sub AddToBuffer ( _
	id As ObjectId _
)
public:
void AddToBuffer(
	ObjectId id
)
 Parameters
id(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)