Reference Library
IsModifiedGraphics Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »IsModifiedGraphics
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsModifiedGraphics { get; }
Public ReadOnly Property IsModifiedGraphics As Boolean
	Get
public:
property bool IsModifiedGraphics {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)