Reference Library
IntersectWith Method (plane, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »BoundedPlane »IntersectWith(Plane, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LineSegment3d IntersectWith(
	Plane plane,
	Tolerance tolerance
)
Public Function IntersectWith ( _
	plane As Plane, _
	tolerance As Tolerance _
) As LineSegment3d
public:
LineSegment3d^ IntersectWith(
	Plane^ plane,
	Tolerance tolerance
)
 Parameters
plane(Plane)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)