Reference Library
IEnumeratorCurrent Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableEnumerator »IEnumeratorCurrent
 Declaration Syntax
C# | Visual Basic | Visual C++
internal virtual Object IEnumeratorCurrent { get; }
Friend Overridable ReadOnly Property IEnumeratorCurrent As Object
	Get
internal:
virtual property Object^ IEnumeratorCurrent {
	Object^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)