Reference Library
SetKnotAt Method (index, value)
Namespaces »ZwSoft.ZwCAD.Geometry »SplineEntity2d »SetKnotAt(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetKnotAt(
	int index,
	double value
)
Public Sub SetKnotAt ( _
	index As Integer, _
	value As Double _
)
public:
void SetKnotAt(
	int index,
	double value
)
 Parameters
index(Int32)
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)