Reference Library
QuitWillStart Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »QuitWillStart
 Declaration Syntax
C# | Visual Basic | Visual C++
public static event EventHandler QuitWillStart
Public Shared Event QuitWillStart As EventHandler
public:
static  event EventHandler^ QuitWillStart {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)