Reference Library
Annotative Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »Annotative
 Declaration Syntax
C# | Visual Basic | Visual C++
public AnnotativeStates Annotative { get; set; }
Public Property Annotative As AnnotativeStates
	Get
	Set
public:
property AnnotativeStates Annotative {
	AnnotativeStates get ();
	void set (AnnotativeStates value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)