Reference Library
UpdateDataLink Method (dir, option)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »UpdateDataLink(UpdateDirection, UpdateOption)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void UpdateDataLink(
	UpdateDirection dir,
	UpdateOption option
)
Public Overridable Sub UpdateDataLink ( _
	dir As UpdateDirection, _
	option As UpdateOption _
)
public:
virtual void UpdateDataLink(
	UpdateDirection dir,
	UpdateOption option
)
 Parameters
dir(UpdateDirection)
option(UpdateOption)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)