Reference Library
set_MappingCoords Method (mapChannel, coords)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »VertexData »set_MappingCoords(MapChannel, Point3d[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void set_MappingCoords(
	MapChannel mapChannel,
	Point3d[] coords
)
Public Sub set_MappingCoords ( _
	mapChannel As MapChannel, _
	coords As Point3d() _
)
public:
void set_MappingCoords(
	MapChannel mapChannel,
	array<Point3d>^ coords
)
 Parameters
mapChannel(MapChannel)
coords(Point3d[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)