Reference Library
SetColumnName Method (index, name)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetColumnName(Int32, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetColumnName(
	int index,
	string name
)
Public Overridable Sub SetColumnName ( _
	index As Integer, _
	name As String _
)
public:
virtual void SetColumnName(
	int index,
	String^ name
)
 Parameters
index(Int32)
name(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)