Reference Library
UpVector Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »UpVector
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d UpVector { get; }
Public ReadOnly Property UpVector As Vector3d
	Get
public:
property Vector3d UpVector {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)