Reference Library
PolygonMeshVertex Constructor (point)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolygonMeshVertex »PolygonMeshVertex(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PolygonMeshVertex(
	Point3d point
)
Public Sub New ( _
	point As Point3d _
)
public:
PolygonMeshVertex(
	Point3d point
)
 Parameters
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)