Reference Library
Properties Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ImpDevice »Properties
 Declaration Syntax
C# | Visual Basic | Visual C++
public override Dictionary Properties { get; }
Public Overrides ReadOnly Property Properties As Dictionary
	Get
public:
virtual property Dictionary^ Properties {
	Dictionary^ get () override;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)