Reference Library
TwistAngle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweepOptions »TwistAngle
 Declaration Syntax
C# | Visual Basic | Visual C++
public double TwistAngle { get; }
Public ReadOnly Property TwistAngle As Double
	Get
public:
property double TwistAngle {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)