Reference Library
IsValid Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectId »IsValid
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsValid { get; }
Public ReadOnly Property IsValid As Boolean
	Get
public:
property bool IsValid {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)