Reference Library
DocumentLockModeChangedEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentLockModeChangedEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void DocumentLockModeChangedEventHandler(
	Object sender,
	DocumentLockModeChangedEventArgs e
)
Public Delegate Sub DocumentLockModeChangedEventHandler ( _
	sender As Object, _
	e As DocumentLockModeChangedEventArgs _
)
public delegate void DocumentLockModeChangedEventHandler(
	Object^ sender,
	DocumentLockModeChangedEventArgs^ e
)
 Parameters
sender(Object)
e(DocumentLockModeChangedEventArgs)
Assembly: ZwManaged (Module: ZwManaged)