Reference Library
Flags Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptForSelectionEndingEventArgs »Flags
 Declaration Syntax
C# | Visual Basic | Visual C++
public SelectionFlags Flags { get; }
Public ReadOnly Property Flags As SelectionFlags
	Get
public:
property SelectionFlags Flags {
	SelectionFlags get ();
}
Assembly: ZwManaged (Module: ZwManaged)