Reference Library
LinkedTableEnumerator Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableEnumerator
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class LinkedTableEnumerator : TableEnumerator
Public NotInheritable Class LinkedTableEnumerator _
	Inherits TableEnumerator
public ref class LinkedTableEnumerator sealed : public TableEnumerator
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
LinkedTableEnumerator(LinkedTableData, TableEnumeratorOption)
MoveNext() |  (Overrides TableEnumerator.MoveNext().)
Reset() |  (Overrides TableEnumerator.Reset().)
 Inheritance Hierarchy
Object
TableEnumerator
| LinkedTableEnumerator
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)