Reference Library
BackgroundColor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »BackgroundColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color BackgroundColor { get; set; }
Public Property BackgroundColor As Color
	Get
	Set
public:
property Color^ BackgroundColor {
	Color^ get ();
	void set (Color^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)