Reference Library
SetNormalVectors Method (normal)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »VertexData »SetNormalVectors(Vector3d[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetNormalVectors(
	Vector3d[] normal
)
Public Sub SetNormalVectors ( _
	normal As Vector3d() _
)
public:
void SetNormalVectors(
	array<Vector3d>^ normal
)
 Parameters
normal(Vector3d[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)