Reference Library
CenterPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AbstractViewTableRecord »CenterPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d CenterPoint { get; set; }
Public Property CenterPoint As Point2d
	Get
	Set
public:
property Point2d CenterPoint {
	Point2d get ();
	void set (Point2d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)