Reference Library
Insert Method (index, value)
Namespaces »ZwSoft.ZwCAD.Geometry »IntPtrCollection »Insert(Int32, IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void Insert(
	int index,
	IntPtr value
)
Public Overridable Sub Insert ( _
	index As Integer, _
	value As IntPtr _
)
public:
virtual void Insert(
	int index,
	IntPtr value
)
 Parameters
index(Int32)
value(IntPtr)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)