Reference Library
Dimjust Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimjust
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Dimjust { get; set; }
Public Overridable Property Dimjust As Integer
	Get
	Set
public:
virtual property int Dimjust {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)