Reference Library
Points Property
Namespaces »ZwSoft.ZwCAD.Geometry »AugmentedPolylineCurve3d »Points
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3dCollection Points { get; }
Public ReadOnly Property Points As Point3dCollection
	Get
public:
property Point3dCollection^ Points {
	Point3dCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)