Reference Library
IsClosedInV Method
Namespaces »ZwSoft.ZwCAD.Geometry »Surface »IsClosedInV()
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsClosedInV()
Public Function IsClosedInV As Boolean
public:
bool IsClosedInV()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)