Reference Library
Hyperlinks Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »Hyperlinks
 Declaration Syntax
C# | Visual Basic | Visual C++
public HyperLinkCollection Hyperlinks { get; }
Public ReadOnly Property Hyperlinks As HyperLinkCollection
	Get
public:
property HyperLinkCollection^ Hyperlinks {
	HyperLinkCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)