Reference Library
InsertRowsAndInherit Method (index, inheritFrom, numRows)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »InsertRowsAndInherit(Int32, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void InsertRowsAndInherit(
	int index,
	int inheritFrom,
	int numRows
)
Public Overridable Sub InsertRowsAndInherit ( _
	index As Integer, _
	inheritFrom As Integer, _
	numRows As Integer _
)
public:
virtual void InsertRowsAndInherit(
	int index,
	int inheritFrom,
	int numRows
)
 Parameters
index(Int32)
inheritFrom(Int32)
numRows(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)