Reference Library
FitPoints Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3dFitData »FitPoints
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3dCollection FitPoints { get; }
Public ReadOnly Property FitPoints As Point3dCollection
	Get
public:
property Point3dCollection^ FitPoints {
	Point3dCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)