Reference Library
TableEnumeratorOption Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableEnumeratorOption
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum TableEnumeratorOption
Public Enumeration TableEnumeratorOption
public enum class TableEnumeratorOption
 Members
Member | Description
SkipMerged
SkipReadOnlyFormat
SkipReadOnlyContent
IterateColumns
IterateRows
IterateSelection
None
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)