Reference Library
HpInherit Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »HpInherit
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool HpInherit { get; set; }
Public Property HpInherit As Boolean
	Get
	Set
public:
property bool HpInherit {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)