Reference Library
SkippingReconciled Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerTable »SkippingReconciled
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerTable SkippingReconciled { get; }
Public ReadOnly Property SkippingReconciled As LayerTable
	Get
public:
property LayerTable^ SkippingReconciled {
	LayerTable^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)