Reference Library
GetColumnHeight Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »GetColumnHeight(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetColumnHeight(
	int index
)
Public Function GetColumnHeight ( _
	index As Integer _
) As Double
public:
double GetColumnHeight(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)