Reference Library
MaintenanceReleaseVersion Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MaintenanceReleaseVersion
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum MaintenanceReleaseVersion
Public Enumeration MaintenanceReleaseVersion
public enum class MaintenanceReleaseVersion
 Members
Member | Description
ReleaseMax
ReleaseKnown
ReleaseCurrent
Release49
Release48
Release47
Release46
Release45
Release44
Release43
Release42
Release41
Release40
Release39
Release38
Release37
Release36
Release35
Release34
Release33
Release32
Release31
Release30
Release29
Release28
Release27
Release26
Release25
Release24
Release23
Release22
Release21
Release20
Release19
Release18
Release17
Release16
Release15
Release14
Release13
Release12
Release11
Release10
Release9
Release8
Release7
Release6
Release5
Release4
Release3
Release2
Release1
Release0
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)