Reference Library
Contrast Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImage »Contrast
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual byte Contrast { get; set; }
Public Overridable Property Contrast As Byte
	Get
	Set
public:
virtual property unsigned char Contrast {
	unsigned char get ();
	void set (unsigned char value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)