Reference Library
BackClipEnabled Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AbstractViewTableRecord »BackClipEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool BackClipEnabled { get; set; }
Public Property BackClipEnabled As Boolean
	Get
	Set
public:
property bool BackClipEnabled {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)