Reference Library
SetSubentityMaterial Method (subEntityId, materialId)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Surface »SetSubentityMaterial(SubentityId, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetSubentityMaterial(
	SubentityId subEntityId,
	ObjectId materialId
)
Public Overridable Sub SetSubentityMaterial ( _
	subEntityId As SubentityId, _
	materialId As ObjectId _
)
public:
virtual void SetSubentityMaterial(
	SubentityId subEntityId,
	ObjectId materialId
)
 Parameters
subEntityId(SubentityId)
materialId(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)