Reference Library
Rectangle3d Constructor (upperLeft, upperRight, lowerLeft, lowerRight)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Rectangle3d »Rectangle3d(Point3d, Point3d, Point3d, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Rectangle3d(
	Point3d upperLeft,
	Point3d upperRight,
	Point3d lowerLeft,
	Point3d lowerRight
)
Public Sub New ( _
	upperLeft As Point3d, _
	upperRight As Point3d, _
	lowerLeft As Point3d, _
	lowerRight As Point3d _
)
public:
Rectangle3d(
	Point3d upperLeft,
	Point3d upperRight,
	Point3d lowerLeft,
	Point3d lowerRight
)
 Parameters
upperLeft(Point3d)
upperRight(Point3d)
lowerLeft(Point3d)
lowerRight(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)