Reference Library
SetAngles Method (startAngle, endAngle)
Namespaces »ZwSoft.ZwCAD.Geometry »Cone »SetAngles(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetAngles(
	double startAngle,
	double endAngle
)
Public Sub SetAngles ( _
	startAngle As Double, _
	endAngle As Double _
)
public:
void SetAngles(
	double startAngle,
	double endAngle
)
 Parameters
startAngle(Double)
endAngle(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)