Reference Library
GetNormal Method (tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »GetNormal(Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector2d GetNormal(
	Tolerance tolerance
)
Public Function GetNormal ( _
	tolerance As Tolerance _
) As Vector2d
public:
Vector2d GetNormal(
	Tolerance tolerance
)
 Parameters
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)