Reference Library
Data Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Xrecord »Data
 Declaration Syntax
C# | Visual Basic | Visual C++
public ResultBuffer Data { get; set; }
Public Property Data As ResultBuffer
	Get
	Set
public:
property ResultBuffer^ Data {
	ResultBuffer^ get ();
	void set (ResultBuffer^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)