Reference Library
Clone Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FaceStyle »Clone()
 Declaration Syntax
C# | Visual Basic | Visual C++
public FaceStyle Clone()
Public Function Clone As FaceStyle
public:
FaceStyle^ Clone()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)