Reference Library
BackgroundColor Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ImpDevice »BackgroundColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public override Color BackgroundColor { get; set; }
Public Overrides Property BackgroundColor As Color
	Get
	Set
public:
virtual property Color BackgroundColor {
	Color get () override;
	void set (Color value) override;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)