Reference Library
GetSubentityPathsAtGraphicsMarker Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ray »GetSubentityPathsAtGraphicsMarker()
 Members
Icon | Member | Description
GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
GetSubentityPathsAtGraphicsMarker(SubentityType, Int32, Point3d, Matrix3d, Int32, ObjectId[]) |  Obsolete.
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)