Reference Library
BasePoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Xline »BasePoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d BasePoint { get; set; }
Public Property BasePoint As Point3d
	Get
	Set
public:
property Point3d BasePoint {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)