Reference Library
CopyTo Method (array, index)
Namespaces »ZwSoft.ZwCAD.Colors »EntityColorCollection »CopyTo(EntityColor[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	EntityColor[] array,
	int index
)
Public Sub CopyTo ( _
	array As EntityColor(), _
	index As Integer _
)
public:
virtual void CopyTo(
	array<EntityColor>^ array,
	int index
) sealed
 Parameters
array(EntityColor[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)