Reference Library
EndPlotEventArgs Constructor (status)
Namespaces »ZwSoft.ZwCAD.PlottingServices »EndPlotEventArgs »EndPlotEventArgs(PlotCancelStatus)
 Declaration Syntax
C# | Visual Basic | Visual C++
public EndPlotEventArgs(
	PlotCancelStatus status
)
Public Sub New ( _
	status As PlotCancelStatus _
)
public:
EndPlotEventArgs(
	PlotCancelStatus status
)
 Parameters
status(PlotCancelStatus)
Assembly: ZwManaged (Module: ZwManaged)