Reference Library
ThawLayer Method (layerId)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »ThawLayer(IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void ThawLayer(
	IntPtr layerId
)
Public Sub ThawLayer ( _
	layerId As IntPtr _
)
public:
void ThawLayer(
	IntPtr layerId
)
 Parameters
layerId(IntPtr)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)