Reference Library
DeleteElem Method (key)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Variant »DeleteElem(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void DeleteElem(
	string key
)
Public Sub DeleteElem ( _
	key As String _
)
public:
void DeleteElem(
	String^ key
)
 Parameters
key(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)