Reference Library
DefaultValue Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptIntegerOptions »DefaultValue
 Declaration Syntax
C# | Visual Basic | Visual C++
public int DefaultValue { get; set; }
Public Property DefaultValue As Integer
	Get
	Set
public:
property int DefaultValue {
	int get ();
	void set (int value);
}
Assembly: ZwManaged (Module: ZwManaged)