Reference Library
ReadPrivateSection Method (sectionName)
Namespaces »ZwSoft.ZwCAD.Publishing »AboutToBeginBackgroundPublishingEventArgs »ReadPrivateSection(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public IDictionaryEnumerator ReadPrivateSection(
	string sectionName
)
Public Function ReadPrivateSection ( _
	sectionName As String _
) As IDictionaryEnumerator
public:
IDictionaryEnumerator^ ReadPrivateSection(
	String^ sectionName
)
 Parameters
sectionName(String)
Assembly: ZwManaged (Module: ZwManaged)