Reference Library
LineSegment3d Class
Namespaces »ZwSoft.ZwCAD.Geometry »LineSegment3d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeLineSeg3d")]
public sealed class LineSegment3d : LinearEntity3d
<WrapperAttribute("ZcGeLineSeg3d")> _
Public NotInheritable Class LineSegment3d _
	Inherits LinearEntity3d
[WrapperAttribute(L"ZcGeLineSeg3d")]
public ref class LineSegment3d sealed : public LinearEntity3d
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
LineSegment3d(Point3d, Vector3d)
LineSegment3d(Point3d, Point3d)
LineSegment3d()
BaryComb(Double)
Create(IntPtr, Boolean)
EndPoint
GetBisector()
Length
MidPoint
Set(Curve3d, Curve3d, Double, Double)
Set(Curve3d, Point3d, Double)
Set(Point3d, Vector3d)
Set(Point3d, Point3d)
StartPoint
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity3d
|  |  | Curve3d
|  |  |  | LinearEntity3d
|  |  |  |  | LineSegment3d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)