Reference Library
ObjectIdGraph Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectIdGraph
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbObjectIdGraph")]
public class ObjectIdGraph : Graph
<WrapperAttribute("ZcDbObjectIdGraph")> _
Public Class ObjectIdGraph _
	Inherits Graph
[WrapperAttribute(L"ZcDbObjectIdGraph")]
public ref class ObjectIdGraph : public Graph
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Graph
|  |  | ObjectIdGraph
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)