Reference Library
ServiceDictionary Property
Namespaces »ZwSoft.ZwCAD.Runtime »SystemObjects »ServiceDictionary
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Dictionary ServiceDictionary { get; }
Public Shared ReadOnly Property ServiceDictionary As Dictionary
	Get
public:
static property Dictionary^ ServiceDictionary {
	Dictionary^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)