Reference Library
HorizontalMode Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBText »HorizontalMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public TextHorizontalMode HorizontalMode { get; set; }
Public Property HorizontalMode As TextHorizontalMode
	Get
	Set
public:
property TextHorizontalMode HorizontalMode {
	TextHorizontalMode get ();
	void set (TextHorizontalMode value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)