Reference Library
SetTextHeight Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetTextHeight()
 Members
Icon | Member | Description
SetTextHeight(Int32, Int32, Int32, Double)
SetTextHeight(Int32, Int32, Double)
SetTextHeight(Double, Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)