Reference Library
IntegerCollection Constructor (values)
Namespaces »ZwSoft.ZwCAD.Geometry »IntegerCollection »IntegerCollection(Int32[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public IntegerCollection(
	int[] values
)
Public Sub New ( _
	values As Integer() _
)
public:
IntegerCollection(
	array<int>^ values
)
 Parameters
values(Int32[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)