Reference Library
LineWeight Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »LineWeight
 Declaration Syntax
C# | Visual Basic | Visual C++
public LineWeight LineWeight { get; set; }
Public Property LineWeight As LineWeight
	Get
	Set
public:
property LineWeight LineWeight {
	LineWeight get ();
	void set (LineWeight value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)