Reference Library
ZAxis Property
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »ZAxis
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Vector3d ZAxis { get; }
Public Shared ReadOnly Property ZAxis As Vector3d
	Get
public:
static property Vector3d ZAxis {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)