Reference Library
CapsHeight Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MTextFragment »CapsHeight
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public double CapsHeight { get; }
<UnitTypeAttribute(UnitType.Distance)> _
Public ReadOnly Property CapsHeight As Double
	Get
[UnitTypeAttribute(UnitType::Distance)]
public:
property double CapsHeight {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)