Reference Library
Transparency Constructor
Namespaces »ZwSoft.ZwCAD.Colors »Transparency »Transparency()
 Members
Icon | Member | Description
Transparency(Byte)
Transparency(TransparencyMethod)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)