Reference Library
SetVertex Method (nIndex, pt)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Section »SetVertex(Int32, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use Boundary property instead")]
public void SetVertex(
	int nIndex,
	Point3d pt
)
<ObsoleteAttribute("Use Boundary property instead")> _
Public Sub SetVertex ( _
	nIndex As Integer, _
	pt As Point3d _
)
[ObsoleteAttribute(L"Use Boundary property instead")]
public:
void SetVertex(
	int nIndex,
	Point3d pt
)
 Parameters
nIndex(Int32)
pt(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)