Reference Library
IsEqualTo Method (a)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3dData »IsEqualTo(NurbCurve3dData)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	NurbCurve3dData a
)
Public Function IsEqualTo ( _
	a As NurbCurve3dData _
) As Boolean
public:
bool IsEqualTo(
	NurbCurve3dData a
)
 Parameters
a(NurbCurve3dData)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)