Reference Library
DeleteContent Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »DeleteContent(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void DeleteContent(
	int row,
	int column
)
Public Overridable Sub DeleteContent ( _
	row As Integer, _
	column As Integer _
)
public:
virtual void DeleteContent(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)