Reference Library
CrossingOrWindowSelectedSubObject Constructor (path, method, gsMarker)
Namespaces »ZwSoft.ZwCAD.EditorInput »CrossingOrWindowSelectedSubObject »CrossingOrWindowSelectedSubObject(FullSubentityPath, SelectionMethod, IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CrossingOrWindowSelectedSubObject(
	FullSubentityPath path,
	SelectionMethod method,
	IntPtr gsMarker
)
Public Sub New ( _
	path As FullSubentityPath, _
	method As SelectionMethod, _
	gsMarker As IntPtr _
)
public:
CrossingOrWindowSelectedSubObject(
	FullSubentityPath path,
	SelectionMethod method,
	IntPtr gsMarker
)
 Parameters
path(FullSubentityPath)
method(SelectionMethod)
gsMarker(IntPtr)
Assembly: ZwManaged (Module: ZwManaged)