Reference Library
TextStyleId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »TextStyleId
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId TextStyleId { get; set; }
Public Overridable Property TextStyleId As ObjectId
	Get
	Set
public:
virtual property ObjectId TextStyleId {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)