Reference Library
Set Method (center, radius, angle1, angle2, referenceVector, isClockWise)
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc2d »Set(Point2d, Double, Double, Double, Vector2d, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	Point2d center,
	double radius,
	double angle1,
	double angle2,
	Vector2d referenceVector,
	bool isClockWise
)
Public Sub Set ( _
	center As Point2d, _
	radius As Double, _
	angle1 As Double, _
	angle2 As Double, _
	referenceVector As Vector2d, _
	isClockWise As Boolean _
)
public:
void Set(
	Point2d center,
	double radius,
	double angle1,
	double angle2,
	Vector2d referenceVector,
	bool isClockWise
)
 Parameters
center(Point2d)
radius(Double)
angle1(Double)
angle2(Double)
referenceVector(Vector2d)
isClockWise(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)