Reference Library
ObjectContext Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectContext
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbObjectContext")]
public abstract class ObjectContext : RXObject
<WrapperAttribute("ZcDbObjectContext")> _
Public MustInherit Class ObjectContext _
	Inherits RXObject
[WrapperAttribute(L"ZcDbObjectContext")]
public ref class ObjectContext abstract : public RXObject
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
CollectionName
Name
UniqueIdentifier
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | ObjectContext
|  |  |  | AnnotationScale
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)