Reference Library
TextStyleId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FeatureControlFrame »TextStyleId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId TextStyleId { get; set; }
Public Property TextStyleId As ObjectId
	Get
	Set
public:
property ObjectId TextStyleId {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)