Reference Library
IsUndoAvailable Method
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Utilities »IsUndoAvailable()
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool IsUndoAvailable()
Public Shared Function IsUndoAvailable As Boolean
public:
static bool IsUndoAvailable()
Assembly: ZwManaged (Module: ZwManaged)