Reference Library
IsInside Method
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc2d »IsInside()
 Members
Icon | Member | Description
IsInside(Point2d, Tolerance)
IsInside(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)