Reference Library
RegAppTableRecord Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RegAppTableRecord
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbRegAppTableRecord")]
public class RegAppTableRecord : SymbolTableRecord
<WrapperAttribute("AcDbRegAppTableRecord")> _
Public Class RegAppTableRecord _
	Inherits SymbolTableRecord
[WrapperAttribute(L"AcDbRegAppTableRecord")]
public ref class RegAppTableRecord : public SymbolTableRecord
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
RegAppTableRecord(IntPtr, Boolean)
RegAppTableRecord()
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | SymbolTableRecord
|  |  |  |  |  | RegAppTableRecord
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)