Reference Library
Dimlwd Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimlwd
 Declaration Syntax
C# | Visual Basic | Visual C++
public LineWeight Dimlwd { get; set; }
Public Property Dimlwd As LineWeight
	Get
	Set
public:
property LineWeight Dimlwd {
	LineWeight get ();
	void set (LineWeight value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)