Reference Library
Number Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewportTableRecord »Number
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Number { get; }
Public ReadOnly Property Number As Integer
	Get
public:
property int Number {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)