Reference Library
TextRotation Method (row, col)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »TextRotation(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual RotationAngle TextRotation(
	int row,
	int col
)
Public Overridable Function TextRotation ( _
	row As Integer, _
	col As Integer _
) As RotationAngle
public:
virtual RotationAngle TextRotation(
	int row,
	int col
)
 Parameters
row(Int32)
col(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)