Reference Library
CreateFromGeCurve Method (geCurve, vec)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »CreateFromGeCurve(Curve3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Curve CreateFromGeCurve(
	Curve3d geCurve,
	Vector3d vec
)
Public Shared Function CreateFromGeCurve ( _
	geCurve As Curve3d, _
	vec As Vector3d _
) As Curve
public:
static Curve^ CreateFromGeCurve(
	Curve3d^ geCurve,
	Vector3d vec
)
 Parameters
geCurve(Curve3d)
vec(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)