Reference Library
DisplayStyle Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »DisplayStyle
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiDisplayStyle")]
public sealed class DisplayStyle : RXObject,
	ICloneable
<WrapperAttribute("ZcGiDisplayStyle")> _
Public NotInheritable Class DisplayStyle _
	Inherits RXObject _
	Implements ICloneable
[WrapperAttribute(L"ZcGiDisplayStyle")]
public ref class DisplayStyle sealed : public RXObject,
	ICloneable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DisplayStyle()
Brightness
Clone()
DisplaySettings
ICloneable.Clone()
Set(DisplayStyle)
ShadowType
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | DisplayStyle
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)