Reference Library
GetPropertiesSupported Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LineWeightConverter »GetPropertiesSupported()
 Members
Icon | Member | Description
GetPropertiesSupported()
GetPropertiesSupported(ITypeDescriptorContext)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)