Reference Library
AllowSpaces Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptStringOptions »AllowSpaces
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool AllowSpaces { get; set; }
Public Property AllowSpaces As Boolean
	Get
	Set
public:
property bool AllowSpaces {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)