Reference Library
CurveBoundary Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »CurveBoundary »CurveBoundary()
 Declaration Syntax
C# | Visual Basic | Visual C++
public CurveBoundary()
Public Sub New
public:
CurveBoundary()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)