Reference Library
UniqueId Property
Namespaces »ZwSoft.ZwCAD.Publishing »BeginPublishingSheetEventArgs »UniqueId
 Declaration Syntax
C# | Visual Basic | Visual C++
public string UniqueId { get; }
Public ReadOnly Property UniqueId As String
	Get
public:
property String^ UniqueId {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)