Reference Library
Variant Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Variant
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiVariant")]
public sealed class Variant : RXObject
<WrapperAttribute("ZcGiVariant")> _
Public NotInheritable Class Variant _
	Inherits RXObject
[WrapperAttribute(L"ZcGiVariant")]
public ref class Variant sealed : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Variant(String)
Variant(Color)
Variant(Int32)
Variant(Double)
Variant(Boolean)
Variant()
Boolean
Char
Color
CopyFrom(Variant)
DeleteElem(String)
Double
ElemAt(Int32, String, Variant)
ElemCount()
Equals(Object) |  (Overrides DisposableWrapper.Equals(Object).)
Float
get_Elem(String, Variant)
get_Elem(String)
Int
Long
set_Elem(String, Variant)
Short
String
Type
Uchar
Uint
Ulong
Ushort
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Variant
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)