Reference Library
MakeClosed Method
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »MakeClosed()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void MakeClosed()
Public Sub MakeClosed
public:
void MakeClosed()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)