Reference Library
IsClosed Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Mline »IsClosed
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsClosed { get; set; }
Public Property IsClosed As Boolean
	Get
	Set
public:
property bool IsClosed {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)