Reference Library
EndDraftDist Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweepOptionsBuilder »EndDraftDist
 Declaration Syntax
C# | Visual Basic | Visual C++
public double EndDraftDist { get; set; }
Public Property EndDraftDist As Double
	Get
	Set
public:
property double EndDraftDist {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)