Reference Library
LoftOptions Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LoftOptions
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbLoftOptions")]
public class LoftOptions : DisposableWrapper,
	ICloneable
<WrapperAttribute("ZcDbLoftOptions")> _
Public Class LoftOptions _
	Inherits DisposableWrapper _
	Implements ICloneable
[WrapperAttribute(L"ZcDbLoftOptions")]
public ref class LoftOptions : public DisposableWrapper,
	ICloneable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
LoftOptions(LoftOptions)
LoftOptions()
LoftOptions(IntPtr, Boolean)
CheckCrossSectionCurves(Entity[], Boolean)
CheckGuideCurves(Entity[], Boolean)
CheckLoftCurves(Entity[], Entity[], Entity, Boolean)
CheckPathCurve(Entity, Boolean)
Clone()
DeleteUnmanagedObject() |  (Overrides DisposableWrapper.DeleteUnmanagedObject().)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | LoftOptions
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)