Reference Library
GetValue Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »GetValue()
 Members
Icon | Member | Description
GetValue(Int32, Int32, Int32, FormatOption)
GetValue(Int32, Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)