Reference Library
Input Property
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionTextInputEventArgs »Input
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Input { get; }
Public ReadOnly Property Input As String
	Get
public:
property String^ Input {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)