Reference Library
Current Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsValidator »Current
 Declaration Syntax
C# | Visual Basic | Visual C++
public static PlotSettingsValidator Current { get; }
Public Shared ReadOnly Property Current As PlotSettingsValidator
	Get
public:
static property PlotSettingsValidator^ Current {
	PlotSettingsValidator^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)