Reference Library
CanInsertRow Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »CanInsertRow
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool CanInsertRow { get; }
Public ReadOnly Property CanInsertRow As Boolean
	Get
public:
property bool CanInsertRow {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)