Reference Library
SnapBasePoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »SnapBasePoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d SnapBasePoint { get; set; }
Public Property SnapBasePoint As Point2d
	Get
	Set
public:
property Point2d SnapBasePoint {
	Point2d get ();
	void set (Point2d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)