Reference Library
Contains Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »KnotCollection »Contains(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Contains(
	double value
)
Public Function Contains ( _
	value As Double _
) As Boolean
public:
bool Contains(
	double value
)
 Parameters
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)