Reference Library
CommandInProgress Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »CommandInProgress
 Declaration Syntax
C# | Visual Basic | Visual C++
public string CommandInProgress { get; }
Public ReadOnly Property CommandInProgress As String
	Get
public:
property String^ CommandInProgress {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)