Reference Library
SetDestinationBlock Method (nSecType, id)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »SetDestinationBlock(SectionType, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetDestinationBlock(
	SectionType nSecType,
	ObjectId id
)
Public Sub SetDestinationBlock ( _
	nSecType As SectionType, _
	id As ObjectId _
)
public:
void SetDestinationBlock(
	SectionType nSecType,
	ObjectId id
)
 Parameters
nSecType(SectionType)
id(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)