Reference Library
setEvaluationStatus Method (errorStatus, errorCode, errorMessage)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldResultImp »setEvaluationStatus(FieldEvaluationStatus, Int32, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public override void setEvaluationStatus(
	FieldEvaluationStatus errorStatus,
	int errorCode,
	string errorMessage
)
Public Overrides Sub setEvaluationStatus ( _
	errorStatus As FieldEvaluationStatus, _
	errorCode As Integer, _
	errorMessage As String _
)
public:
virtual void setEvaluationStatus(
	FieldEvaluationStatus errorStatus,
	int errorCode,
	String^ errorMessage
) override
 Parameters
errorStatus(FieldEvaluationStatus)
errorCode(Int32)
errorMessage(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)