Reference Library
IsEdgeVisibleAt Method (vertexIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Face »IsEdgeVisibleAt(Int16)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEdgeVisibleAt(
	short vertexIndex
)
Public Function IsEdgeVisibleAt ( _
	vertexIndex As Short _
) As Boolean
public:
bool IsEdgeVisibleAt(
	short vertexIndex
)
 Parameters
vertexIndex(Int16)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)