Reference Library
Surface2Right Property
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersectorConfigurations »Surface2Right
 Declaration Syntax
C# | Visual Basic | Visual C++
public SurfaceSurfaceIntersectorConfiguration Surface2Right { get; }
Public ReadOnly Property Surface2Right As SurfaceSurfaceIntersectorConfiguration
	Get
public:
property SurfaceSurfaceIntersectorConfiguration Surface2Right {
	SurfaceSurfaceIntersectorConfiguration get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)