Reference Library
m_pLayoutRemoved Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »m_pLayoutRemoved
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayoutEventHandler m_pLayoutRemoved
Public m_pLayoutRemoved As LayoutEventHandler
public:
LayoutEventHandler^ m_pLayoutRemoved
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)