Reference Library
EndWidth Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Vertex2d »EndWidth
 Declaration Syntax
C# | Visual Basic | Visual C++
public double EndWidth { get; set; }
Public Property EndWidth As Double
	Get
	Set
public:
property double EndWidth {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)