Reference Library
ResultBuffer Constructor (values)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ResultBuffer »ResultBuffer(TypedValue[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public ResultBuffer(
	params TypedValue[] values
)
Public Sub New ( _
	ParamArray values As TypedValue() _
)
public:
ResultBuffer(
	... array<TypedValue>^ values
)
 Parameters
values(TypedValue[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)