Reference Library
Polyline Constructor (pPoints, normal, pBaseSubEntMarker)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Polyline »Polyline(Point3dCollection, Vector3d, IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Polyline(
	Point3dCollection pPoints,
	Vector3d normal,
	IntPtr pBaseSubEntMarker
)
Public Sub New ( _
	pPoints As Point3dCollection, _
	normal As Vector3d, _
	pBaseSubEntMarker As IntPtr _
)
public:
Polyline(
	Point3dCollection^ pPoints,
	Vector3d normal,
	IntPtr pBaseSubEntMarker
)
 Parameters
pPoints(Point3dCollection)
normal(Vector3d)
pBaseSubEntMarker(IntPtr)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)