Reference Library
MaterialMapper Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »MaterialMapper
 Declaration Syntax
C# | Visual Basic | Visual C++
public Mapper MaterialMapper { get; set; }
Public Property MaterialMapper As Mapper
	Get
	Set
public:
property Mapper^ MaterialMapper {
	Mapper^ get ();
	void set (Mapper^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)