Reference Library
Tolerance Property
Namespaces »ZwSoft.ZwCAD.Geometry »CurveCurveIntersector3d »Tolerance
 Declaration Syntax
C# | Visual Basic | Visual C++
public Tolerance Tolerance { get; }
Public ReadOnly Property Tolerance As Tolerance
	Get
public:
property Tolerance Tolerance {
	Tolerance get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)