Reference Library
Transfer Method (fromIndex, toIndex, numItems)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »Transfer(Int32, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Transfer(
	int fromIndex,
	int toIndex,
	int numItems
)
Public Sub Transfer ( _
	fromIndex As Integer, _
	toIndex As Integer, _
	numItems As Integer _
)
public:
void Transfer(
	int fromIndex,
	int toIndex,
	int numItems
)
 Parameters
fromIndex(Int32)
toIndex(Int32)
numItems(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)