Reference Library
AddExtents Method (source)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Extents3d »AddExtents(Extents3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AddExtents(
	Extents3d source
)
Public Sub AddExtents ( _
	source As Extents3d _
)
public:
void AddExtents(
	Extents3d source
)
 Parameters
source(Extents3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)