Reference Library
IsPerpendicularTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »Ray2d »IsPerpendicularTo()
 Members
Icon | Member | Description
IsPerpendicularTo(LinearEntity2d, Tolerance)
IsPerpendicularTo(LinearEntity2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)