Reference Library
IndexOf Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HyperLinkCollection »IndexOf(HyperLink)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int IndexOf(
	HyperLink value
)
Public Function IndexOf ( _
	value As HyperLink _
) As Integer
public:
int IndexOf(
	HyperLink^ value
)
 Parameters
value(HyperLink)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)