Reference Library
TransparencyCollectionEnumerator Class
Namespaces »ZwSoft.ZwCAD.Colors »TransparencyCollectionEnumerator
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class TransparencyCollectionEnumerator : IEnumerator
Public NotInheritable Class TransparencyCollectionEnumerator _
	Implements IEnumerator
public ref class TransparencyCollectionEnumerator sealed : IEnumerator
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
TransparencyCollectionEnumerator(TransparencyCollection)
Current
IEnumerator.Current
MoveNext()
Reset()
 Inheritance Hierarchy
Object
TransparencyCollectionEnumerator
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)