Reference Library
IsCone Property
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalSurface »IsCone
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsCone { get; }
Public ReadOnly Property IsCone As Boolean
	Get
public:
property bool IsCone {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)