Reference Library
Width Property
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSetSizeEventArgs »Width
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Width { get; }
Public ReadOnly Property Width As Integer
	Get
public:
property int Width {
	int get ();
}
Assembly: ZwManaged (Module: ZwManaged)