Reference Library
Dimtih Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimtih
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool Dimtih { get; set; }
Public Overridable Property Dimtih As Boolean
	Get
	Set
public:
virtual property bool Dimtih {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)