Reference Library
GetSplitCurves Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »GetSplitCurves()
 Members
Icon | Member | Description
GetSplitCurves(Point3dCollection)
GetSplitCurves(DoubleCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)