Reference Library
GenerateUsageData Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerTable »GenerateUsageData()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void GenerateUsageData()
Public Sub GenerateUsageData
public:
void GenerateUsageData()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)