Reference Library
LayerZero Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »LayerZero
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId LayerZero { get; }
Public ReadOnly Property LayerZero As ObjectId
	Get
public:
property ObjectId LayerZero {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)