Reference Library
LinkPath Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ole2Frame »LinkPath
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string LinkPath { get; }
Public Overridable ReadOnly Property LinkPath As String
	Get
public:
virtual property String^ LinkPath {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)