Reference Library
Cursor Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDragOptions »Cursor
 Declaration Syntax
C# | Visual Basic | Visual C++
public DragCursor Cursor { get; set; }
Public Property Cursor As DragCursor
	Get
	Set
public:
property DragCursor Cursor {
	DragCursor get ();
	void set (DragCursor value);
}
Assembly: ZwManaged (Module: ZwManaged)