Reference Library
IsEqualTo Method (a, tolerance)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FrontAndBackClipping »IsEqualTo(FrontAndBackClipping, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	FrontAndBackClipping a,
	Tolerance tolerance
)
Public Function IsEqualTo ( _
	a As FrontAndBackClipping, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsEqualTo(
	FrontAndBackClipping a,
	Tolerance tolerance
)
 Parameters
a(FrontAndBackClipping)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)