Reference Library
VertexType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Vertex2d »VertexType
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vertex2dType VertexType { get; }
Public ReadOnly Property VertexType As Vertex2dType
	Get
public:
property Vertex2dType VertexType {
	Vertex2dType get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)