Reference Library
IteratorInitialize Method (feature, modifiedOnly, affectsGraphicsOnly, walkXRefTree)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FileDependencyManager »IteratorInitialize(String, Boolean, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void IteratorInitialize(
	string feature,
	bool modifiedOnly,
	bool affectsGraphicsOnly,
	bool walkXRefTree
)
Public Sub IteratorInitialize ( _
	feature As String, _
	modifiedOnly As Boolean, _
	affectsGraphicsOnly As Boolean, _
	walkXRefTree As Boolean _
)
public:
void IteratorInitialize(
	String^ feature,
	bool modifiedOnly,
	bool affectsGraphicsOnly,
	bool walkXRefTree
)
 Parameters
feature(String)
modifiedOnly(Boolean)
affectsGraphicsOnly(Boolean)
walkXRefTree(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)