Reference Library
IncludesDefaultValues Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DxfFiler »IncludesDefaultValues
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IncludesDefaultValues { get; }
Public ReadOnly Property IncludesDefaultValues As Boolean
	Get
public:
property bool IncludesDefaultValues {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)