Reference Library
GetValue Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »GetValue(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Object GetValue(
	int row,
	int column
)
Public Overridable Function GetValue ( _
	row As Integer, _
	column As Integer _
) As Object
public:
virtual Object^ GetValue(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)