Reference Library
SetCustomData Method (row, column, data)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetCustomData(Int32, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetCustomData(
	int row,
	int column,
	int data
)
Public Overridable Sub SetCustomData ( _
	row As Integer, _
	column As Integer, _
	data As Integer _
)
public:
virtual void SetCustomData(
	int row,
	int column,
	int data
)
 Parameters
row(Int32)
column(Int32)
data(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)