Reference Library
PromptStringOptionsEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptStringOptionsEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void PromptStringOptionsEventHandler(
	Object sender,
	PromptStringOptionsEventArgs e
)
Public Delegate Sub PromptStringOptionsEventHandler ( _
	sender As Object, _
	e As PromptStringOptionsEventArgs _
)
public delegate void PromptStringOptionsEventHandler(
	Object^ sender,
	PromptStringOptionsEventArgs^ e
)
 Parameters
sender(Object)
e(PromptStringOptionsEventArgs)
Assembly: ZwManaged (Module: ZwManaged)