Reference Library
CallWorldDraw Method (worldDraw, entityId, t, imageGripPoint, dGripSize)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripData »CallWorldDraw(WorldDraw, ObjectId, GripData.DrawType, Nullable<Point3d>, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool CallWorldDraw(
	WorldDraw worldDraw,
	ObjectId entityId,
	GripData.DrawType t,
	Nullable<Point3d> imageGripPoint,
	double dGripSize
)
Public Function CallWorldDraw ( _
	worldDraw As WorldDraw, _
	entityId As ObjectId, _
	t As GripData.DrawType, _
	imageGripPoint As Nullable(Of Point3d), _
	dGripSize As Double _
) As Boolean
public:
bool CallWorldDraw(
	WorldDraw^ worldDraw,
	ObjectId entityId,
	GripData.DrawType t,
	Nullable<Point3d> imageGripPoint,
	double dGripSize
)
 Parameters
worldDraw(WorldDraw)
entityId(ObjectId)
t(GripData.DrawType)
imageGripPoint(Nullable<Point3d>)
dGripSize(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)