Reference Library
TextAttachmentType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »TextAttachmentType
 Declaration Syntax
C# | Visual Basic | Visual C++
public TextAttachmentType TextAttachmentType { get; set; }
Public Property TextAttachmentType As TextAttachmentType
	Get
	Set
public:
property TextAttachmentType TextAttachmentType {
	TextAttachmentType get ();
	void set (TextAttachmentType value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)