Reference Library
Result Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptForEntityEndingEventArgs »Result
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptEntityResult Result { get; }
Public ReadOnly Property Result As PromptEntityResult
	Get
public:
property PromptEntityResult^ Result {
	PromptEntityResult^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)