Reference Library
IndicatorTransparency Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Section »IndicatorTransparency
 Declaration Syntax
C# | Visual Basic | Visual C++
public int IndicatorTransparency { get; set; }
Public Property IndicatorTransparency As Integer
	Get
	Set
public:
property int IndicatorTransparency {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)