Reference Library
DiagnosticBSPMode Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »DiagnosticBSPMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum DiagnosticBSPMode
Public Enumeration DiagnosticBSPMode
public enum class DiagnosticBSPMode
 Members
Member | Description
Depth
Size
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)