Reference Library
WriteProperty Method (name, value)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »IConfigurationSection »WriteProperty(String, Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
void WriteProperty(
	string name,
	Object value
)
Sub WriteProperty ( _
	name As String, _
	value As Object _
)
void WriteProperty(
	String^ name,
	Object^ value
)
 Parameters
name(String)
value(Object)
Assembly: ZwManaged (Module: ZwManaged)