Reference Library
CloseAndDiscard Method
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »CloseAndDiscard()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CloseAndDiscard()
Public Sub CloseAndDiscard
public:
void CloseAndDiscard()
Assembly: ZwManaged (Module: ZwManaged)