Reference Library
GetPoints Method
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionOptionsEventArgs »GetPoints()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d[] GetPoints()
Public Function GetPoints As Point3d()
public:
array<Point3d>^ GetPoints()
Assembly: ZwManaged (Module: ZwManaged)