Reference Library
InsertView Method (viewIndex, pView)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »InsertView(Int32, View)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void InsertView(
	int viewIndex,
	View pView
)
Public MustOverride Sub InsertView ( _
	viewIndex As Integer, _
	pView As View _
)
public:
virtual void InsertView(
	int viewIndex,
	View^ pView
) abstract
 Parameters
viewIndex(Int32)
pView(View)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)