Reference Library
AcadDatabase Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »AcadDatabase
 Declaration Syntax
C# | Visual Basic | Visual C++
public Object AcadDatabase { get; }
Public ReadOnly Property AcadDatabase As Object
	Get
public:
property Object^ AcadDatabase {
	Object^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)