Reference Library
TextVerticalMode Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TextVerticalMode
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDb::TextVertMode")]
public enum TextVerticalMode
<WrapperAttribute("ZcDb::TextVertMode")> _
Public Enumeration TextVerticalMode
[WrapperAttribute(L"ZcDb::TextVertMode")]
public enum class TextVerticalMode
 Members
Member | Description
TextTop
TextVerticalMid
TextBottom
TextBase
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)