Reference Library
SetUseStandardScale Method (plotSet, useStandard)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsValidator »SetUseStandardScale(PlotSettings, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetUseStandardScale(
	PlotSettings plotSet,
	bool useStandard
)
Public Sub SetUseStandardScale ( _
	plotSet As PlotSettings, _
	useStandard As Boolean _
)
public:
void SetUseStandardScale(
	PlotSettings^ plotSet,
	bool useStandard
)
 Parameters
plotSet(PlotSettings)
useStandard(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)