Reference Library
IsLinear Method (line)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »IsLinear(Line2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsLinear(
	out Line2d line
)
Public Function IsLinear ( _
	<OutAttribute> ByRef line As Line2d _
) As Boolean
public:
bool IsLinear(
	[OutAttribute] Line2d^% line
)
 Parameters
line(Line2d%)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)