Reference Library
LineWeight Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »SubEntityTraits »LineWeight
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract LineWeight LineWeight { get; set; }
Public MustOverride Property LineWeight As LineWeight
	Get
	Set
public:
virtual property LineWeight LineWeight {
	LineWeight get () abstract;
	void set (LineWeight value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)