Reference Library
SetToOwnSurface Method
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalBoundedSurface »SetToOwnSurface()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetToOwnSurface()
Public Sub SetToOwnSurface
public:
void SetToOwnSurface()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)