Reference Library
Entity Property
Namespaces »ZwSoft.ZwCAD.EditorInput »EntityJig »Entity
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal Entity Entity { get; }
Protected Friend ReadOnly Property Entity As Entity
	Get
protected public:
property Entity^ Entity {
	Entity^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)