Reference Library
SurfaceSurfaceIntersector Constructor (surface2, surface1)
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersector »SurfaceSurfaceIntersector(Surface, Surface)
 Declaration Syntax
C# | Visual Basic | Visual C++
public SurfaceSurfaceIntersector(
	Surface surface2,
	Surface surface1
)
Public Sub New ( _
	surface2 As Surface, _
	surface1 As Surface _
)
public:
SurfaceSurfaceIntersector(
	Surface^ surface2,
	Surface^ surface1
)
 Parameters
surface2(Surface)
surface1(Surface)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)