Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FrontAndBackClipping »Inequality(FrontAndBackClipping, FrontAndBackClipping)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	FrontAndBackClipping a,
	FrontAndBackClipping b
)
Public Shared Operator <> ( _
	a As FrontAndBackClipping, _
	b As FrontAndBackClipping _
) As Boolean
public:
static bool operator !=(
	FrontAndBackClipping a,
	FrontAndBackClipping b
)
 Parameters
a(FrontAndBackClipping)
b(FrontAndBackClipping)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)