Reference Library
GetCurrentEntityNode Method (objIds)
Namespaces »ZwSoft.ZwCAD.Publishing »PublishEntityEventArgs »GetCurrentEntityNode(ObjectIdCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DwfNode GetCurrentEntityNode(
	ObjectIdCollection objIds
)
Public Function GetCurrentEntityNode ( _
	objIds As ObjectIdCollection _
) As DwfNode
public:
DwfNode^ GetCurrentEntityNode(
	ObjectIdCollection^ objIds
)
 Parameters
objIds(ObjectIdCollection)
Assembly: ZwManaged (Module: ZwManaged)