Reference Library
SweepEntityTransform Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweepOptions »SweepEntityTransform
 Declaration Syntax
C# | Visual Basic | Visual C++
public Matrix3d SweepEntityTransform { get; }
Public ReadOnly Property SweepEntityTransform As Matrix3d
	Get
public:
property Matrix3d SweepEntityTransform {
	Matrix3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)