Reference Library
SetTextStyle Method (id, rowTypes)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetTextStyle(ObjectId, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetTextStyle(
	ObjectId id,
	int rowTypes
)
Public Overridable Sub SetTextStyle ( _
	id As ObjectId, _
	rowTypes As Integer _
)
public:
virtual void SetTextStyle(
	ObjectId id,
	int rowTypes
)
 Parameters
id(ObjectId)
rowTypes(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)