Reference Library
ProcessPlotState Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotFactory »ProcessPlotState
 Declaration Syntax
C# | Visual Basic | Visual C++
public static ProcessPlotState ProcessPlotState { get; }
Public Shared ReadOnly Property ProcessPlotState As ProcessPlotState
	Get
public:
static property ProcessPlotState ProcessPlotState {
	ProcessPlotState get ();
}
Assembly: ZwManaged (Module: ZwManaged)