Reference Library
PromptPointOptions Constructor (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptPointOptions »PromptPointOptions(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptPointOptions(
	string message
)
Public Sub New ( _
	message As String _
)
public:
PromptPointOptions(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)