Reference Library
IntersectParameterCurve Method (number, isExternal, isFirst)
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersector »IntersectParameterCurve(Int32, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Curve2d IntersectParameterCurve(
	int number,
	bool isExternal,
	bool isFirst
)
Public Function IntersectParameterCurve ( _
	number As Integer, _
	isExternal As Boolean, _
	isFirst As Boolean _
) As Curve2d
public:
Curve2d^ IntersectParameterCurve(
	int number,
	bool isExternal,
	bool isFirst
)
 Parameters
number(Int32)
isExternal(Boolean)
isFirst(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)