Reference Library
Cylinder Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Cylinder »Cylinder()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Cylinder()
Public Sub New
public:
Cylinder()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)