Reference Library
RolledUp Property
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »RolledUp
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool RolledUp { get; set; }
Public Property RolledUp As Boolean
	Get
	Set
public:
property bool RolledUp {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)