Reference Library
SelectionOnlyGeometry Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »NonEntityTraits »SelectionOnlyGeometry
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed bool SelectionOnlyGeometry { get; set; }
Public Overrides NotOverridable Property SelectionOnlyGeometry As Boolean
	Get
	Set
public:
virtual property bool SelectionOnlyGeometry {
	bool get () override sealed;
	void set (bool value) override sealed;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)