Reference Library
Has Method (id)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolTable »Has(ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Has(
	ObjectId id
)
Public Function Has ( _
	id As ObjectId _
) As Boolean
public:
bool Has(
	ObjectId id
)
 Parameters
id(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)