Reference Library
LocalizedNameId Property
Namespaces »ZwSoft.ZwCAD.Runtime »ICommandLineCallable »LocalizedNameId
 Declaration Syntax
C# | Visual Basic | Visual C++
string LocalizedNameId { get; }
ReadOnly Property LocalizedNameId As String
	Get
property String^ LocalizedNameId {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)