Reference Library
ClipBoundary Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ClipBoundary
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiClipBoundary")]
public sealed class ClipBoundary : DisposableWrapper
<WrapperAttribute("ZcGiClipBoundary")> _
Public NotInheritable Class ClipBoundary _
	Inherits DisposableWrapper
[WrapperAttribute(L"ZcGiClipBoundary")]
public ref class ClipBoundary sealed : public DisposableWrapper
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
ClipBoundary()
BackClipZ
ClippingBack
ClippingFront
DrawBoundary
FrontClipZ
NormalVector
Point
TransformInverseBlockRefXForm
TransformToClipSpace
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | ClipBoundary
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)