Reference Library
GetOverlapRanges Method (overlapNumber)
Namespaces »ZwSoft.ZwCAD.Geometry »CurveCurveIntersector2d »GetOverlapRanges(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Interval[] GetOverlapRanges(
	int overlapNumber
)
Public Function GetOverlapRanges ( _
	overlapNumber As Integer _
) As Interval()
public:
array<Interval^>^ GetOverlapRanges(
	int overlapNumber
)
 Parameters
overlapNumber(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)