Reference Library
LayerStateToBeRenamed Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »LayerStateToBeRenamed
 Declaration Syntax
C# | Visual Basic | Visual C++
public event LayerStateRenameEventHandler LayerStateToBeRenamed
Public Event LayerStateToBeRenamed As LayerStateRenameEventHandler
public:
 event LayerStateRenameEventHandler^ LayerStateToBeRenamed {
	void add (LayerStateRenameEventHandler^ value);
	void remove (LayerStateRenameEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)