Reference Library
PlotSettings Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettings »PlotSettings(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal PlotSettings(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
protected public:
PlotSettings(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)