Reference Library
AlignmentPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBText »AlignmentPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d AlignmentPoint { get; set; }
Public Property AlignmentPoint As Point3d
	Get
	Set
public:
property Point3d AlignmentPoint {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)