Reference Library
IncNumEntities Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AuditInfo »IncNumEntities()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void IncNumEntities()
Public Sub IncNumEntities
public:
void IncNumEntities()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)