Reference Library
Face Constructor (pointer1, pointer2, pointer3, value1, value2, value3, value4)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Face »Face(Point3d, Point3d, Point3d, Boolean, Boolean, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Face(
	Point3d pointer1,
	Point3d pointer2,
	Point3d pointer3,
	bool value1,
	bool value2,
	bool value3,
	bool value4
)
Public Sub New ( _
	pointer1 As Point3d, _
	pointer2 As Point3d, _
	pointer3 As Point3d, _
	value1 As Boolean, _
	value2 As Boolean, _
	value3 As Boolean, _
	value4 As Boolean _
)
public:
Face(
	Point3d pointer1,
	Point3d pointer2,
	Point3d pointer3,
	bool value1,
	bool value2,
	bool value3,
	bool value4
)
 Parameters
pointer1(Point3d)
pointer2(Point3d)
pointer3(Point3d)
value1(Boolean)
value2(Boolean)
value3(Boolean)
value4(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)