Reference Library
IntersectWith Method (otherPlane)
Namespaces »ZwSoft.ZwCAD.Geometry »Plane »IntersectWith(Plane)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Line3d IntersectWith(
	Plane otherPlane
)
Public Function IntersectWith ( _
	otherPlane As Plane _
) As Line3d
public:
Line3d^ IntersectWith(
	Plane^ otherPlane
)
 Parameters
otherPlane(Plane)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)