Reference Library
SourceFileName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImageDef »SourceFileName
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string SourceFileName { get; set; }
Public Overridable Property SourceFileName As String
	Get
	Set
public:
virtual property String^ SourceFileName {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)