Reference Library
Seek Method (offset, method)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »Seek(Int64, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void Seek(
	long offset,
	int method
)
Public MustOverride Sub Seek ( _
	offset As Long, _
	method As Integer _
)
public:
virtual void Seek(
	long long offset,
	int method
) abstract
 Parameters
offset(Int64)
method(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)