Reference Library
Closed Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline2d »Closed
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Closed { get; set; }
Public Property Closed As Boolean
	Get
	Set
public:
property bool Closed {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)