Reference Library
LoadApp Method (appName, printIt, asCmd)
Namespaces »ZwSoft.ZwCAD.Runtime »DynamicLinker »LoadApp(String, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void LoadApp(
	string appName,
	bool printIt,
	bool asCmd
)
Public Sub LoadApp ( _
	appName As String, _
	printIt As Boolean, _
	asCmd As Boolean _
)
public:
void LoadApp(
	String^ appName,
	bool printIt,
	bool asCmd
)
 Parameters
appName(String)
printIt(Boolean)
asCmd(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)