Reference Library
NurbCurve3dData Structure
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3dData
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct NurbCurve3dData
Public Structure NurbCurve3dData
public value class NurbCurve3dData
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
ControlPoints
Degree
Equality(NurbCurve3dData, NurbCurve3dData)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
Inequality(NurbCurve3dData, NurbCurve3dData)
IsEqualTo(NurbCurve3dData)
Knots
Periodic
Rational
Weights
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)