Reference Library
DxfOut Method (fileName, precision, version, saveThumbnailImage)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »DxfOut(String, Int32, DwgVersion, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void DxfOut(
	string fileName,
	int precision,
	DwgVersion version,
	bool saveThumbnailImage
)
Public Sub DxfOut ( _
	fileName As String, _
	precision As Integer, _
	version As DwgVersion, _
	saveThumbnailImage As Boolean _
)
public:
void DxfOut(
	String^ fileName,
	int precision,
	DwgVersion version,
	bool saveThumbnailImage
)
 Parameters
fileName(String)
precision(Int32)
version(DwgVersion)
saveThumbnailImage(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)