Reference Library
IdPair Structure
Namespaces »ZwSoft.ZwCAD.DatabaseServices »IdPair
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbIdPair")]
public struct IdPair
<WrapperAttribute("AcDbIdPair")> _
Public Structure IdPair
[WrapperAttribute(L"AcDbIdPair")]
public value class IdPair
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
IdPair(ObjectId, ObjectId, Boolean, Boolean, Boolean)
Equality(IdPair, IdPair)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
Inequality(IdPair, IdPair)
IsCloned
IsOwnerTranslated
IsPrimary
Key
ToString(IFormatProvider)
ToString() |  (Overrides ValueType.ToString().)
Value
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)