Reference Library
FileDependencyManager Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FileDependencyManager
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcFileDependencyManager")]
public sealed class FileDependencyManager : DisposableWrapper
<WrapperAttribute("ZcFileDependencyManager")> _
Public NotInheritable Class FileDependencyManager _
	Inherits DisposableWrapper
[WrapperAttribute(L"ZcFileDependencyManager")]
public ref class FileDependencyManager sealed : public DisposableWrapper
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
CountEntries
CreateEntry(String, String, Boolean, Boolean)
EraseEntry(String, String, Boolean)
EraseEntry(Int32, Boolean)
GetEntry(String, String)
GetEntry(Int32)
GetEntry(String, String, Boolean)
GetEntry(Int32, Boolean)
IteratorInitialize(String, Boolean, Boolean, Boolean)
IteratorNext
UpdateEntry(String, String)
UpdateEntry(Int32)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | FileDependencyManager
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)