Reference Library
Value Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptIntegerResult »Value
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Value { get; }
Public ReadOnly Property Value As Integer
	Get
public:
property int Value {
	int get ();
}
Assembly: ZwManaged (Module: ZwManaged)