Reference Library
ApproximateArcLength Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweepOptionsCheckSweepCurveOut »ApproximateArcLength
 Declaration Syntax
C# | Visual Basic | Visual C++
public double ApproximateArcLength { get; }
Public ReadOnly Property ApproximateArcLength As Double
	Get
public:
property double ApproximateArcLength {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)