Reference Library
DocumentLockModeWillChangeEventArgs Class
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentLockModeWillChangeEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class DocumentLockModeWillChangeEventArgs : EventArgs
Public NotInheritable Class DocumentLockModeWillChangeEventArgs _
	Inherits EventArgs
public ref class DocumentLockModeWillChangeEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
CurrentMode
Document
GlobalCommandName
MyCurrentMode
MyNewMode
 Inheritance Hierarchy
Object
EventArgs
| DocumentLockModeWillChangeEventArgs
Assembly: ZwManaged (Module: ZwManaged)