Reference Library
PointOnLine Property
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity2d »PointOnLine
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d PointOnLine { get; }
Public ReadOnly Property PointOnLine As Point2d
	Get
public:
property Point2d PointOnLine {
	Point2d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)