Reference Library
TableStyle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »TableStyle
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId TableStyle { get; set; }
Public Overridable Property TableStyle As ObjectId
	Get
	Set
public:
virtual property ObjectId TableStyle {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)