Reference Library
Overlap Method (line)
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity3d »Overlap(LinearEntity3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LinearEntity3d Overlap(
	LinearEntity3d line
)
Public Function Overlap ( _
	line As LinearEntity3d _
) As LinearEntity3d
public:
LinearEntity3d^ Overlap(
	LinearEntity3d^ line
)
 Parameters
line(LinearEntity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)