Reference Library
WidthFactor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBText »WidthFactor
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Unitless)]
public double WidthFactor { get; set; }
<UnitTypeAttribute(UnitType.Unitless)> _
Public Property WidthFactor As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Unitless)]
public:
property double WidthFactor {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)