Reference Library
IsPolyline Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HatchLoop »IsPolyline
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPolyline { get; }
Public ReadOnly Property IsPolyline As Boolean
	Get
public:
property bool IsPolyline {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)