Reference Library
GetObjectSaveVersion Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AbstractViewTable »GetObjectSaveVersion()
 Members
Icon | Member | Description
GetObjectSaveVersion(DxfFiler)
GetObjectSaveVersion(DwgFiler)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)