Reference Library
IntersectWith Method (entityPointer, intersectType, projectionPlane, points, thisGraphicSystemMarker, otherGraphicSystemMarker)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void IntersectWith(
	Entity entityPointer,
	Intersect intersectType,
	Plane projectionPlane,
	Point3dCollection points,
	IntPtr thisGraphicSystemMarker,
	IntPtr otherGraphicSystemMarker
)
Public Overridable Sub IntersectWith ( _
	entityPointer As Entity, _
	intersectType As Intersect, _
	projectionPlane As Plane, _
	points As Point3dCollection, _
	thisGraphicSystemMarker As IntPtr, _
	otherGraphicSystemMarker As IntPtr _
)
public:
virtual void IntersectWith(
	Entity^ entityPointer,
	Intersect intersectType,
	Plane^ projectionPlane,
	Point3dCollection^ points,
	IntPtr thisGraphicSystemMarker,
	IntPtr otherGraphicSystemMarker
)
 Parameters
entityPointer(Entity)
intersectType(Intersect)
projectionPlane(Plane)
points(Point3dCollection)
thisGraphicSystemMarker(IntPtr)
otherGraphicSystemMarker(IntPtr)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)