Reference Library
CommandMethodAttribute Constructor (globalName)
Namespaces »ZwSoft.ZwCAD.Runtime »CommandMethodAttribute »CommandMethodAttribute(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CommandMethodAttribute(
	string globalName
)
Public Sub New ( _
	globalName As String _
)
public:
CommandMethodAttribute(
	String^ globalName
)
 Parameters
globalName(String)
Assembly: ZwManaged (Module: ZwManaged)