Reference Library
GetClosestPointTo Method (curve3d)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »GetClosestPointTo(Curve3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnCurve3d[] GetClosestPointTo(
	Curve3d curve3d
)
Public Function GetClosestPointTo ( _
	curve3d As Curve3d _
) As PointOnCurve3d()
public:
array<PointOnCurve3d^>^ GetClosestPointTo(
	Curve3d^ curve3d
)
 Parameters
curve3d(Curve3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)