Reference Library
PlotOrigin Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettings »PlotOrigin
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d PlotOrigin { get; }
Public ReadOnly Property PlotOrigin As Point2d
	Get
public:
property Point2d PlotOrigin {
	Point2d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)