Reference Library
Transparent Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »Transparent
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Transparent { get; set; }
Public Property Transparent As Boolean
	Get
	Set
public:
property bool Transparent {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)