Reference Library
DraftAngle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweepOptionsBuilder »DraftAngle
 Declaration Syntax
C# | Visual Basic | Visual C++
public double DraftAngle { get; set; }
Public Property DraftAngle As Double
	Get
	Set
public:
property double DraftAngle {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)