Reference Library
ErrorHasHappenedInJob Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotLogger »ErrorHasHappenedInJob
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool ErrorHasHappenedInJob { get; }
Public ReadOnly Property ErrorHasHappenedInJob As Boolean
	Get
public:
property bool ErrorHasHappenedInJob {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)