Reference Library
Polyline3d Constructor (type, vertices, closed)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline3d »Polyline3d(Poly3dType, Point3dCollection, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Polyline3d(
	Poly3dType type,
	Point3dCollection vertices,
	bool closed
)
Public Sub New ( _
	type As Poly3dType, _
	vertices As Point3dCollection, _
	closed As Boolean _
)
public:
Polyline3d(
	Poly3dType type,
	Point3dCollection^ vertices,
	bool closed
)
 Parameters
type(Poly3dType)
vertices(Point3dCollection)
closed(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)