Reference Library
PromptIntegerOptions Constructor (messageAndKeywords, globalKeywords, lowerLimit, upperLimit)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptIntegerOptions »PromptIntegerOptions(String, String, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptIntegerOptions(
	string messageAndKeywords,
	string globalKeywords,
	int lowerLimit,
	int upperLimit
)
Public Sub New ( _
	messageAndKeywords As String, _
	globalKeywords As String, _
	lowerLimit As Integer, _
	upperLimit As Integer _
)
public:
PromptIntegerOptions(
	String^ messageAndKeywords,
	String^ globalKeywords,
	int lowerLimit,
	int upperLimit
)
 Parameters
messageAndKeywords(String)
globalKeywords(String)
lowerLimit(Int32)
upperLimit(Int32)
Assembly: ZwManaged (Module: ZwManaged)