Reference Library
CopyTo Method (arr, index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObjectCollection »CopyTo(DBObject[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	DBObject[] arr,
	int index
)
Public Sub CopyTo ( _
	arr As DBObject(), _
	index As Integer _
)
public:
void CopyTo(
	array<DBObject^>^ arr,
	int index
)
 Parameters
arr(DBObject[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)