Reference Library
HardTrimByParams Method (newStartParameter, newEndParameter)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »HardTrimByParams(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void HardTrimByParams(
	double newStartParameter,
	double newEndParameter
)
Public Sub HardTrimByParams ( _
	newStartParameter As Double, _
	newEndParameter As Double _
)
public:
void HardTrimByParams(
	double newStartParameter,
	double newEndParameter
)
 Parameters
newStartParameter(Double)
newEndParameter(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)