Reference Library
LinetypeTable Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinetypeTable
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbLinetypeTable")]
public sealed class LinetypeTable : SymbolTable
<WrapperAttribute("AcDbLinetypeTable")> _
Public NotInheritable Class LinetypeTable _
	Inherits SymbolTable
[WrapperAttribute(L"AcDbLinetypeTable")]
public ref class LinetypeTable sealed : public SymbolTable
 Members
All Members | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | SymbolTable
|  |  |  |  |  | LinetypeTable
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)