Reference Library
SectionState Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionState
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbSection::State")]
public enum SectionState
<WrapperAttribute("ZcDbSection::State")> _
Public Enumeration SectionState
[WrapperAttribute(L"ZcDbSection::State")]
public enum class SectionState
 Members
Member | Description
Volume
Boundary
Plane
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)