Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.Colors »Transparency »Equality(Transparency, Transparency)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	Transparency a,
	Transparency b
)
Public Shared Operator = ( _
	a As Transparency, _
	b As Transparency _
) As Boolean
public:
static bool operator ==(
	Transparency a,
	Transparency b
)
 Parameters
a(Transparency)
b(Transparency)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)