Reference Library
LineType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LineType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("OdPs::LineType")]
public enum LineType
<WrapperAttribute("OdPs::LineType")> _
Public Enumeration LineType
[WrapperAttribute(L"OdPs::LineType")]
public enum class LineType
 Members
Member | Description
LtpLast
LtpUseObject
LtpISODoubleDashTripleDot
LtpISODashTripleDot
LtpISODoubleDashDoubleDot
LtpISODashDoubleDot
LtpISODoubleDashDot
LtpISODashDot
LtpISOLongDashDoubleShortDash
LtpISOLongDashShortDash
LtpISODot
LtpISOLongDashTripleDot
LtpISOLongDashDoubleDot
LtpISOLongDashDot
LtpISODashSpace
LtpISODash
LtpSparseDot
LtpMediumDashDotShortDashDot
LtpLongDashDot
LtpLongDashDotDot
LtpLongDashShortDash
LtpMediumDashShortDashShortDash
LtpMediumLongDash
LtpLongDashX2
LtpMediumDashX2
LtpShortDashX2
LtpLongDash
LtpMediumDash
LtpShortDash
LtpDashDot
LtpDotted
LtpDashed
LtpSolid
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)