Reference Library
DwgIn Method (filer)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »DwgIn(DwgFiler)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void DwgIn(
	DwgFiler filer
)
Public Sub DwgIn ( _
	filer As DwgFiler _
)
public:
void DwgIn(
	DwgFiler^ filer
)
 Parameters
filer(DwgFiler)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)