Reference Library
OriginalFileMaintenanceVersion Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »OriginalFileMaintenanceVersion
 Declaration Syntax
C# | Visual Basic | Visual C++
public MaintenanceReleaseVersion OriginalFileMaintenanceVersion { get; }
Public ReadOnly Property OriginalFileMaintenanceVersion As MaintenanceReleaseVersion
	Get
public:
property MaintenanceReleaseVersion OriginalFileMaintenanceVersion {
	MaintenanceReleaseVersion get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)