Reference Library
GroundPlaneBackground Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GroundPlaneBackground
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbGroundPlaneBackground")]
public class GroundPlaneBackground : Background
<WrapperAttribute("AcDbGroundPlaneBackground")> _
Public Class GroundPlaneBackground _
	Inherits Background
[WrapperAttribute(L"AcDbGroundPlaneBackground")]
public ref class GroundPlaneBackground : public Background
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
GroundPlaneBackground()
GroundPlaneBackground(IntPtr, Boolean)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Background
|  |  |  |  |  | GroundPlaneBackground
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)