Reference Library
DefaultValue Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDistanceOptions »DefaultValue
 Declaration Syntax
C# | Visual Basic | Visual C++
public double DefaultValue { get; set; }
Public Property DefaultValue As Double
	Get
	Set
public:
property double DefaultValue {
	double get ();
	void set (double value);
}
Assembly: ZwManaged (Module: ZwManaged)