Reference Library
GetColumnNameAt Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataTable »GetColumnNameAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string GetColumnNameAt(
	int index
)
Public Overridable Function GetColumnNameAt ( _
	index As Integer _
) As String
public:
virtual String^ GetColumnNameAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)