Reference Library
NumFixes Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AuditInfo »NumFixes
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumFixes { get; }
Public ReadOnly Property NumFixes As Integer
	Get
public:
property int NumFixes {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)