Reference Library
WorldDraw Constructor
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »WorldDraw »WorldDraw()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected WorldDraw()
Protected Sub New
protected:
WorldDraw()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)