Reference Library
GetSubentityMaterial Method (subEntityId)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Surface »GetSubentityMaterial(SubentityId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId GetSubentityMaterial(
	SubentityId subEntityId
)
Public Overridable Function GetSubentityMaterial ( _
	subEntityId As SubentityId _
) As ObjectId
public:
virtual ObjectId GetSubentityMaterial(
	SubentityId subEntityId
)
 Parameters
subEntityId(SubentityId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)