Reference Library
SetClipBoundary Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImage »SetClipBoundary()
 Members
Icon | Member | Description
SetClipBoundary(ClipBoundaryType, Point2dCollection)
SetClipBoundary(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)