Reference Library
IsEqualTo Method (a, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »CoordinateSystem3d »IsEqualTo(CoordinateSystem3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	CoordinateSystem3d a,
	Tolerance tolerance
)
Public Function IsEqualTo ( _
	a As CoordinateSystem3d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsEqualTo(
	CoordinateSystem3d a,
	Tolerance tolerance
)
 Parameters
a(CoordinateSystem3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)