Reference Library
Denominator Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CustomScale »Denominator
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Denominator { get; }
Public ReadOnly Property Denominator As Double
	Get
public:
property double Denominator {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)