Reference Library
Linetype Property
Namespaces »ZwSoft.ZwCAD.Windows »LinetypeDialog »Linetype
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Linetype { get; set; }
Public Property Linetype As ObjectId
	Get
	Set
public:
property ObjectId Linetype {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwManaged (Module: ZwManaged)