Reference Library
TextAt Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinetypeTableRecord »TextAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public string TextAt(
	int index
)
Public Function TextAt ( _
	index As Integer _
) As String
public:
String^ TextAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)