Reference Library
IsClosed Method (tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Sphere »IsClosed(Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsClosed(
	Tolerance tolerance
)
Public Function IsClosed ( _
	tolerance As Tolerance _
) As Boolean
public:
bool IsClosed(
	Tolerance tolerance
)
 Parameters
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)