Reference Library
IsLayerOff Property
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor »IsLayerOff
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsLayerOff { get; }
Public ReadOnly Property IsLayerOff As Boolean
	Get
public:
property bool IsLayerOff {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)