Reference Library
TextStringConst Method (row, col)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »TextStringConst(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string TextStringConst(
	int row,
	int col
)
Public Overridable Function TextStringConst ( _
	row As Integer, _
	col As Integer _
) As String
public:
virtual String^ TextStringConst(
	int row,
	int col
)
 Parameters
row(Int32)
col(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)