Reference Library
EdgeModifiers Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeModifiers
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum EdgeModifiers
Public Enumeration EdgeModifiers
public enum class EdgeModifiers
 Members
Member | Description
Opacity
AlwaysOnTop
HaloGap
Width
Jitter
Overhang
None
Color
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)