Reference Library
GripData Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripData
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbGripData")]
public class GripData : DisposableWrapper
<WrapperAttribute("ZcDbGripData")> _
Public Class GripData _
	Inherits DisposableWrapper
[WrapperAttribute(L"ZcDbGripData")]
public ref class GripData : public DisposableWrapper
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
GripData()
AlternateBasePoint
AppData
CallHotGrip(ObjectId, GripData.Context)
CallHoverGrip(ObjectId, GripData.Context)
CallTooltip()
CallViewportDraw(ViewportDraw, ObjectId, GripData.DrawType, Nullable<Point3d>, Int32)
CallWorldDraw(WorldDraw, ObjectId, GripData.DrawType, Nullable<Point3d>, Double)
ChangeGripStatus(ObjectId, GripData.Status)
DeleteUnmanagedObject() |  (Overrides DisposableWrapper.DeleteUnmanagedObject().)
DrawAtDragImageGripPoint
ForcedPickOn
GetHotGripDimensionData(Double)
GetHoverDimensionData(Double)
GetTooltip()
GizmosEnabled
GripPoint
HotGripInvokesRightClick
IsPerViewport
ModeKeywordsDisabled
OnGripStatusChanged(ObjectId, GripData.Status)
OnHotGrip(ObjectId, GripData.Context)
OnHover(ObjectId, GripData.Context)
OnRightClick(GripDataCollection, ObjectIdCollection, Object)
RubberBandLineDisabled
SkipWhenShared
TriggerGrip
ViewportDraw(ViewportDraw, ObjectId, GripData.DrawType, Nullable<Point3d>, Int32)
WorldDraw(WorldDraw, ObjectId, GripData.DrawType, Nullable<Point3d>, Double)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | GripData
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)