Reference Library
Viewport Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »Viewport
 Declaration Syntax
C# | Visual Basic | Visual C++
public Rectangle Viewport { get; set; }
Public Property Viewport As Rectangle
	Get
	Set
public:
property Rectangle Viewport {
	Rectangle get ();
	void set (Rectangle value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)