Reference Library
GrippedPoint Property
Namespaces »ZwSoft.ZwCAD.EditorInput »InputPointContext »GrippedPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d GrippedPoint { get; }
Public ReadOnly Property GrippedPoint As Point3d
	Get
public:
property Point3d GrippedPoint {
	Point3d get ();
}
Assembly: ZwManaged (Module: ZwManaged)