Reference Library
IsEraseStatusToggled Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »IsEraseStatusToggled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEraseStatusToggled { get; }
Public ReadOnly Property IsEraseStatusToggled As Boolean
	Get
public:
property bool IsEraseStatusToggled {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)