Reference Library
Thickness Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »NonEntityTraits »Thickness
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed double Thickness { get; set; }
Public Overrides NotOverridable Property Thickness As Double
	Get
	Set
public:
virtual property double Thickness {
	double get () override sealed;
	void set (double value) override sealed;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)