Reference Library
OnDragLeave Method
Namespaces »ZwSoft.ZwCAD.Windows »DropTarget »OnDragLeave()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void OnDragLeave()
Public Overridable Sub OnDragLeave
public:
virtual void OnDragLeave()
Assembly: ZwManaged (Module: ZwManaged)