Reference Library
Point2d Constructor (x, y)
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »Point2d(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d(
	double x,
	double y
)
Public Sub New ( _
	x As Double, _
	y As Double _
)
public:
Point2d(
	double x,
	double y
)
 Parameters
x(Double)
y(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)