Reference Library
Front Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FrontAndBackClipping »Front
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Front { get; }
Public ReadOnly Property Front As Double
	Get
public:
property double Front {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)