Reference Library
IEnumerator_Current Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MlineStyleElementCollectionEnumerator »IEnumerator.Current
 Declaration Syntax
C# | Visual Basic | Visual C++
Object IEnumerator.Current { get; }
Private ReadOnly Property IEnumerator_Current As Object
	Implements IEnumerator.Current
	Get
private:
virtual property Object^ IEnumerator_Current {
	Object^ get () sealed = IEnumerator::Current::get;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)