Reference Library
LayoutBoundsMaxY Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »LayoutBoundsMaxY
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LayoutBoundsMaxY { get; }
Public ReadOnly Property LayoutBoundsMaxY As Double
	Get
public:
property double LayoutBoundsMaxY {
	double get ();
}
Assembly: ZwManaged (Module: ZwManaged)