Reference Library
LeaderLength Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DiametricDimension »LeaderLength
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LeaderLength { get; set; }
Public Property LeaderLength As Double
	Get
	Set
public:
property double LeaderLength {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)