Reference Library
Clear Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObjectCollection »Clear()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void Clear()
Public Overridable Sub Clear
public:
virtual void Clear()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)