Reference Library
Polyline Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ViewportGeometry »Polyline()
 Members
Icon | Member | Description
Polyline(Point3dCollection, Vector3d, IntPtr)
Polyline(Polyline, Int32, Int32)
Polyline(Polyline)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)