Reference Library
ConvertFromString Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnitsConverter »ConvertFromString()
 Members
Icon | Member | Description
ConvertFromString(String)
ConvertFromString(ITypeDescriptorContext, String)
ConvertFromString(ITypeDescriptorContext, CultureInfo, String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)