Reference Library
PromptKeywordOptionsEventArgs Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptKeywordOptionsEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PromptKeywordOptionsEventArgs : EventArgs
Public NotInheritable Class PromptKeywordOptionsEventArgs _
	Inherits EventArgs
public ref class PromptKeywordOptionsEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Options
 Inheritance Hierarchy
Object
EventArgs
| PromptKeywordOptionsEventArgs
Assembly: ZwManaged (Module: ZwManaged)