Reference Library
InsertEnded Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »InsertEnded
 Declaration Syntax
C# | Visual Basic | Visual C++
public event EventHandler InsertEnded
Public Event InsertEnded As EventHandler
public:
 event EventHandler^ InsertEnded {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)