Reference Library
StateEventIndex Enumeration
Namespaces »ZwSoft.ZwCAD.Windows »StateEventIndex
 Declaration Syntax
C# | Visual Basic | Visual C++
[FlagsAttribute]
public enum StateEventIndex
<FlagsAttribute> _
Public Enumeration StateEventIndex
[FlagsAttribute]
public enum class StateEventIndex
 Members
Member | Description
ThemeChange
Floating
Docking
Show
Hide
Assembly: ZwManaged (Module: ZwManaged)