Reference Library
BeginDocumentClose Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »BeginDocumentClose
 Declaration Syntax
C# | Visual Basic | Visual C++
public event DocumentBeginCloseEventHandler BeginDocumentClose
Public Event BeginDocumentClose As DocumentBeginCloseEventHandler
public:
 event DocumentBeginCloseEventHandler^ BeginDocumentClose {
	void add (DocumentBeginCloseEventHandler^ value);
	void remove (DocumentBeginCloseEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)