Reference Library
SetTextAttachmentType Method (textAttachmentType, leaderDirection)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »SetTextAttachmentType(TextAttachmentType, LeaderDirectionType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetTextAttachmentType(
	TextAttachmentType textAttachmentType,
	LeaderDirectionType leaderDirection
)
Public Sub SetTextAttachmentType ( _
	textAttachmentType As TextAttachmentType, _
	leaderDirection As LeaderDirectionType _
)
public:
void SetTextAttachmentType(
	TextAttachmentType textAttachmentType,
	LeaderDirectionType leaderDirection
)
 Parameters
textAttachmentType(TextAttachmentType)
leaderDirection(LeaderDirectionType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)