Reference Library
Polyline2d Constructor (unmanagedObjPtr, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline2d »Polyline2d(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal Polyline2d(
	IntPtr unmanagedObjPtr,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedObjPtr As IntPtr, _
	autoDelete As Boolean _
)
protected public:
Polyline2d(
	IntPtr unmanagedObjPtr,
	bool autoDelete
)
 Parameters
unmanagedObjPtr(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)