Reference Library
DivideBy Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »DivideBy(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d DivideBy(
	double value
)
Public Function DivideBy ( _
	value As Double _
) As Point3d
public:
Point3d DivideBy(
	double value
)
 Parameters
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)