Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DbHomeView »Inequality(DbHomeView, DbHomeView)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	DbHomeView lhvm,
	DbHomeView rhvw
)
Public Shared Operator <> ( _
	lhvm As DbHomeView, _
	rhvw As DbHomeView _
) As Boolean
public:
static bool operator !=(
	DbHomeView^ lhvm,
	DbHomeView^ rhvw
)
 Parameters
lhvm(DbHomeView)
rhvw(DbHomeView)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)