Reference Library
TopLeft Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »TopLeft
 Declaration Syntax
C# | Visual Basic | Visual C++
public Cell TopLeft { get; }
Public ReadOnly Property TopLeft As Cell
	Get
public:
property Cell^ TopLeft {
	Cell^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)