Reference Library
TableStyleDictionaryId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »TableStyleDictionaryId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId TableStyleDictionaryId { get; }
Public ReadOnly Property TableStyleDictionaryId As ObjectId
	Get
public:
property ObjectId TableStyleDictionaryId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)