Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FontDescriptor »Equality(FontDescriptor, FontDescriptor)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	FontDescriptor a,
	FontDescriptor b
)
Public Shared Operator = ( _
	a As FontDescriptor, _
	b As FontDescriptor _
) As Boolean
public:
static bool operator ==(
	FontDescriptor a,
	FontDescriptor b
)
 Parameters
a(FontDescriptor)
b(FontDescriptor)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)