Reference Library
BaseX Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PatternDefinition »BaseX
 Declaration Syntax
C# | Visual Basic | Visual C++
public double BaseX { get; }
Public ReadOnly Property BaseX As Double
	Get
public:
property double BaseX {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)