Reference Library
InsertRows Method (row, height, rows)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »InsertRows(Int32, Double, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void InsertRows(
	int row,
	double height,
	int rows
)
Public Overridable Sub InsertRows ( _
	row As Integer, _
	height As Double, _
	rows As Integer _
)
public:
virtual void InsertRows(
	int row,
	double height,
	int rows
)
 Parameters
row(Int32)
height(Double)
rows(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)