Reference Library
LayerFilterTree Constructor (root, current)
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerFilterTree »LayerFilterTree(LayerFilter, LayerFilter)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerFilterTree(
	LayerFilter root,
	LayerFilter current
)
Public Sub New ( _
	root As LayerFilter, _
	current As LayerFilter _
)
public:
LayerFilterTree(
	LayerFilter^ root,
	LayerFilter^ current
)
 Parameters
root(LayerFilter)
current(LayerFilter)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)