Reference Library
GetClosestPointTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »GetClosestPointTo()
 Members
Icon | Member | Description
GetClosestPointTo(Point3d, Tolerance)
GetClosestPointTo(Curve3d, Tolerance)
GetClosestPointTo(Point3d)
GetClosestPointTo(Curve3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)