Reference Library
IEnumerable_GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.Geometry »IntPtrCollection »IEnumerable_GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual IEnumerator IEnumerable_GetEnumerator()
Public Overridable Function IEnumerable_GetEnumerator As IEnumerator
public:
virtual IEnumerator^ IEnumerable_GetEnumerator()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)