Reference Library
Dimtxsty Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimtxsty
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId Dimtxsty { get; set; }
Public Overridable Property Dimtxsty As ObjectId
	Get
	Set
public:
virtual property ObjectId Dimtxsty {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)