Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.PlottingServices »MediaBounds »Equality(MediaBounds, MediaBounds)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	MediaBounds a,
	MediaBounds b
)
Public Shared Operator = ( _
	a As MediaBounds, _
	b As MediaBounds _
) As Boolean
public:
static bool operator ==(
	MediaBounds a,
	MediaBounds b
)
 Parameters
a(MediaBounds)
b(MediaBounds)
Assembly: ZwManaged (Module: ZwManaged)