Reference Library
Dimfxlen Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimfxlen
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Dimfxlen { get; set; }
Public Property Dimfxlen As Double
	Get
	Set
public:
property double Dimfxlen {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)