Reference Library
IsSingular Method (tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »IsSingular(Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsSingular(
	Tolerance tolerance
)
Public Function IsSingular ( _
	tolerance As Tolerance _
) As Boolean
public:
bool IsSingular(
	Tolerance tolerance
)
 Parameters
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)