Reference Library
SetGridVisibility Method (visible, borders, rows)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetGridVisibility(Boolean, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetGridVisibility(
	bool visible,
	int borders,
	int rows
)
Public Overridable Sub SetGridVisibility ( _
	visible As Boolean, _
	borders As Integer, _
	rows As Integer _
)
public:
virtual void SetGridVisibility(
	bool visible,
	int borders,
	int rows
)
 Parameters
visible(Boolean)
borders(Int32)
rows(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)