Reference Library
BeginDocument Method (plotInfo, documentName, parameters, copies, plotToFile, fileName)
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotEngine »BeginDocument(PlotInfo, String, Object, Int32, Boolean, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void BeginDocument(
	PlotInfo plotInfo,
	string documentName,
	Object parameters,
	int copies,
	bool plotToFile,
	string fileName
)
Public Sub BeginDocument ( _
	plotInfo As PlotInfo, _
	documentName As String, _
	parameters As Object, _
	copies As Integer, _
	plotToFile As Boolean, _
	fileName As String _
)
public:
void BeginDocument(
	PlotInfo^ plotInfo,
	String^ documentName,
	Object^ parameters,
	int copies,
	bool plotToFile,
	String^ fileName
)
 Parameters
plotInfo(PlotInfo)
documentName(String)
parameters(Object)
copies(Int32)
plotToFile(Boolean)
fileName(String)
Assembly: ZwManaged (Module: ZwManaged)