Reference Library
SetLayerStateMask Method (name, mask)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »SetLayerStateMask(String, LayerStateMasks)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetLayerStateMask(
	string name,
	LayerStateMasks mask
)
Public Sub SetLayerStateMask ( _
	name As String, _
	mask As LayerStateMasks _
)
public:
void SetLayerStateMask(
	String^ name,
	LayerStateMasks mask
)
 Parameters
name(String)
mask(LayerStateMasks)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)