Reference Library
IntersectWith Method
Namespaces »ZwSoft.ZwCAD.Geometry »Plane »IntersectWith()
 Members
Icon | Member | Description
IntersectWith(Plane, Tolerance)
IntersectWith(BoundedPlane, Tolerance)
IntersectWith(Plane)
IntersectWith(BoundedPlane)
IntersectWith(LinearEntity3d, Tolerance)
IntersectWith(LinearEntity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)