Reference Library
Position3d Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Position3d »Position3d()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Position3d()
Public Sub New
public:
Position3d()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)