Reference Library
EvaluatePoint Method (parameter)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »EvaluatePoint(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d EvaluatePoint(
	double parameter
)
Public Function EvaluatePoint ( _
	parameter As Double _
) As Point2d
public:
Point2d EvaluatePoint(
	double parameter
)
 Parameters
parameter(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)