Reference Library
PaletteSetMoveEventArgs Class
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSetMoveEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PaletteSetMoveEventArgs : EventArgs
Public NotInheritable Class PaletteSetMoveEventArgs _
	Inherits EventArgs
public ref class PaletteSetMoveEventArgs sealed : public EventArgs
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PaletteSetMoveEventArgs(Int32, Int32)
X
Y
 Inheritance Hierarchy
Object
EventArgs
| PaletteSetMoveEventArgs
Assembly: ZwManaged (Module: ZwManaged)