Reference Library
IsOn Method (point, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Entity3d »IsOn(Point3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsOn(
	Point3d point,
	Tolerance tolerance
)
Public Function IsOn ( _
	point As Point3d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsOn(
	Point3d point,
	Tolerance tolerance
)
 Parameters
point(Point3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)