Reference Library
ShadowType Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »DisplayStyle »ShadowType
 Declaration Syntax
C# | Visual Basic | Visual C++
public ShadowDisplayType ShadowType { get; set; }
Public Property ShadowType As ShadowDisplayType
	Get
	Set
public:
property ShadowDisplayType ShadowType {
	ShadowDisplayType get ();
	void set (ShadowDisplayType value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)