Reference Library
NonRectClipOn Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »NonRectClipOn
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool NonRectClipOn { get; set; }
Public Property NonRectClipOn As Boolean
	Get
	Set
public:
property bool NonRectClipOn {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)