Reference Library
OleStartUp Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »OleStartUp
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool OleStartUp { get; set; }
Public Property OleStartUp As Boolean
	Get
	Set
public:
property bool OleStartUp {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)