Reference Library
SupportsTrueTypeText Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Context »SupportsTrueTypeText
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool SupportsTrueTypeText { get; }
Public Overridable ReadOnly Property SupportsTrueTypeText As Boolean
	Get
public:
virtual property bool SupportsTrueTypeText {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)