Reference Library
PromptedForCorner Event
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »PromptedForCorner
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PromptPointResultEventHandler PromptedForCorner
Public Event PromptedForCorner As PromptPointResultEventHandler
public:
 event PromptPointResultEventHandler^ PromptedForCorner {
	void add (PromptPointResultEventHandler^ value);
	void remove (PromptPointResultEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)