Reference Library
SequenceEnd Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SequenceEnd »SequenceEnd()
 Declaration Syntax
C# | Visual Basic | Visual C++
public SequenceEnd()
Public Sub New
public:
SequenceEnd()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)