Reference Library
Visible Property
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »Visible
 Declaration Syntax
C# | Visual Basic | Visual C++
public override bool Visible { get; set; }
Public Overrides Property Visible As Boolean
	Get
	Set
public:
virtual property bool Visible {
	bool get () override;
	void set (bool value) override;
}
Assembly: ZwManaged (Module: ZwManaged)