Reference Library
IsDragging Property
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »IsDragging
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsDragging { get; }
Public ReadOnly Property IsDragging As Boolean
	Get
public:
property bool IsDragging {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)