Reference Library
Dimaltz Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimaltz
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Dimaltz { get; set; }
Public Overridable Property Dimaltz As Integer
	Get
	Set
public:
virtual property int Dimaltz {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)