Reference Library
Multiply Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »Multiply(Point2d, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Point2d operator *(
	Point2d a,
	double value
)
Public Shared Operator * ( _
	a As Point2d, _
	value As Double _
) As Point2d
public:
static Point2d operator *(
	Point2d a,
	double value
)
 Parameters
a(Point2d)
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)