Reference Library
DocumentToBeActivated Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentCollection »DocumentToBeActivated
 Declaration Syntax
C# | Visual Basic | Visual C++
public event DocumentCollectionEventHandler DocumentToBeActivated
Public Event DocumentToBeActivated As DocumentCollectionEventHandler
public:
 event DocumentCollectionEventHandler^ DocumentToBeActivated {
	void add (DocumentCollectionEventHandler^ value);
	void remove (DocumentCollectionEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)