Reference Library
LastUpdatedAt Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »Index »LastUpdatedAt
 Declaration Syntax
C# | Visual Basic | Visual C++
public DateTime LastUpdatedAt { get; set; }
Public Property LastUpdatedAt As DateTime
	Get
	Set
public:
property DateTime LastUpdatedAt {
	DateTime get ();
	void set (DateTime value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)