Reference Library
RemovedObjects Property
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionRemovedEventArgs »RemovedObjects
 Declaration Syntax
C# | Visual Basic | Visual C++
public SelectionSet RemovedObjects { get; }
Public ReadOnly Property RemovedObjects As SelectionSet
	Get
public:
property SelectionSet^ RemovedObjects {
	SelectionSet^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)