Reference Library
AddNodeToMap Method (entityId, objIds, nodeId)
Namespaces »ZwSoft.ZwCAD.Publishing »PublishEntityEventArgs »AddNodeToMap(ObjectId, ObjectIdCollection, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool AddNodeToMap(
	ObjectId entityId,
	ObjectIdCollection objIds,
	int nodeId
)
Public Function AddNodeToMap ( _
	entityId As ObjectId, _
	objIds As ObjectIdCollection, _
	nodeId As Integer _
) As Boolean
public:
bool AddNodeToMap(
	ObjectId entityId,
	ObjectIdCollection^ objIds,
	int nodeId
)
 Parameters
entityId(ObjectId)
objIds(ObjectIdCollection)
nodeId(Int32)
Assembly: ZwManaged (Module: ZwManaged)