Reference Library
SetOverrides Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetOverrides()
 Members
Icon | Member | Description
SetOverrides(Int32, Int32, Int32, CellProperties)
SetOverrides(Int32, Int32, GridLineType, CellProperties)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)