Reference Library
GetBoundBlockOf Method (range)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »GetBoundBlockOf(Interval)
 Declaration Syntax
C# | Visual Basic | Visual C++
public BoundBlock3d GetBoundBlockOf(
	Interval range
)
Public Function GetBoundBlockOf ( _
	range As Interval _
) As BoundBlock3d
public:
BoundBlock3d^ GetBoundBlockOf(
	Interval^ range
)
 Parameters
range(Interval)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)