Reference Library
FixErrors Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AuditInfo »FixErrors
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool FixErrors { get; }
Public ReadOnly Property FixErrors As Boolean
	Get
public:
property bool FixErrors {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)