Reference Library
SetShapeOffsetAt Method (index, offset)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinetypeTableRecord »SetShapeOffsetAt(Int32, Vector2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetShapeOffsetAt(
	int index,
	Vector2d offset
)
Public Sub SetShapeOffsetAt ( _
	index As Integer, _
	offset As Vector2d _
)
public:
void SetShapeOffsetAt(
	int index,
	Vector2d offset
)
 Parameters
index(Int32)
offset(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)