Reference Library
UnitDir Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ray »UnitDir
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d UnitDir { get; set; }
Public Property UnitDir As Vector3d
	Get
	Set
public:
property Vector3d UnitDir {
	Vector3d get ();
	void set (Vector3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)