Reference Library
Dimtix Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimtix
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Dimtix { get; set; }
Public Property Dimtix As Boolean
	Get
	Set
public:
property bool Dimtix {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)