Reference Library
Weights Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3dData »Weights
 Declaration Syntax
C# | Visual Basic | Visual C++
public DoubleCollection Weights { get; }
Public ReadOnly Property Weights As DoubleCollection
	Get
public:
property DoubleCollection^ Weights {
	DoubleCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)