Reference Library
ViewTableId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »ViewTableId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId ViewTableId { get; }
Public ReadOnly Property ViewTableId As ObjectId
	Get
public:
property ObjectId ViewTableId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)