Reference Library
PolygonMeshVertex Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolygonMeshVertex »PolygonMeshVertex()
 Declaration Syntax
C# | Visual Basic | Visual C++
public PolygonMeshVertex()
Public Sub New
public:
PolygonMeshVertex()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)