Reference Library
CubicSplineCurve3d Constructor (curve, epsilon)
Namespaces »ZwSoft.ZwCAD.Geometry »CubicSplineCurve3d »CubicSplineCurve3d(Curve3d, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CubicSplineCurve3d(
	Curve3d curve,
	double epsilon
)
Public Sub New ( _
	curve As Curve3d, _
	epsilon As Double _
)
public:
CubicSplineCurve3d(
	Curve3d^ curve,
	double epsilon
)
 Parameters
curve(Curve3d)
epsilon(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)