Reference Library
RenderToImage Method
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »RenderToImage()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Bitmap RenderToImage()
Public Function RenderToImage As Bitmap
public:
Bitmap^ RenderToImage()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)