Reference Library
FieldEvaluationStatusResult Structure
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldEvaluationStatusResult
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct FieldEvaluationStatusResult
Public Structure FieldEvaluationStatusResult
public value class FieldEvaluationStatusResult
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
FieldEvaluationStatusResult(FieldEvaluationStatus, Int32, String)
ErrorCode
ErrorMessage
Status
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)