Reference Library
IsPeriodicInU Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbSurface »IsPeriodicInU
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPeriodicInU { get; }
Public ReadOnly Property IsPeriodicInU As Boolean
	Get
public:
property bool IsPeriodicInU {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)