Reference Library
CreateJog Method (ptOnSection)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Section »CreateJog(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CreateJog(
	Point3d ptOnSection
)
Public Sub CreateJog ( _
	ptOnSection As Point3d _
)
public:
void CreateJog(
	Point3d ptOnSection
)
 Parameters
ptOnSection(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)