Reference Library
IsInside Method (pointValue, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc3d »IsInside(Point3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsInside(
	Point3d pointValue,
	Tolerance tolerance
)
Public Function IsInside ( _
	pointValue As Point3d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsInside(
	Point3d pointValue,
	Tolerance tolerance
)
 Parameters
pointValue(Point3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)