Reference Library
UcsFollowMode Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewportTableRecord »UcsFollowMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool UcsFollowMode { get; set; }
Public Property UcsFollowMode As Boolean
	Get
	Set
public:
property bool UcsFollowMode {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)