Reference Library
BeginDeepCloneTranslation Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »BeginDeepCloneTranslation
 Declaration Syntax
C# | Visual Basic | Visual C++
public event IdMappingEventHandler BeginDeepCloneTranslation
Public Event BeginDeepCloneTranslation As IdMappingEventHandler
public:
 event IdMappingEventHandler^ BeginDeepCloneTranslation {
	void add (IdMappingEventHandler^ value);
	void remove (IdMappingEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)