Reference Library
SubViewportDraw Method (vd)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »SubViewportDraw(ViewportDraw)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal override void SubViewportDraw(
	ViewportDraw vd
)
Protected Friend Overrides Sub SubViewportDraw ( _
	vd As ViewportDraw _
)
protected public:
virtual void SubViewportDraw(
	ViewportDraw^ vd
) override
 Parameters
vd(ViewportDraw)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)