Reference Library
Set Method (point1, point2)
Namespaces »ZwSoft.ZwCAD.Geometry »Ray2d »Set(Point2d, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	Point2d point1,
	Point2d point2
)
Public Sub Set ( _
	point1 As Point2d, _
	point2 As Point2d _
)
public:
void Set(
	Point2d point1,
	Point2d point2
)
 Parameters
point1(Point2d)
point2(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)