Reference Library
SetFitData Method (fitPoints, startTangent, endTangent, fitTolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »SetFitData(Point3dCollection, Vector3d, Vector3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFitData(
	Point3dCollection fitPoints,
	Vector3d startTangent,
	Vector3d endTangent,
	Tolerance fitTolerance
)
Public Sub SetFitData ( _
	fitPoints As Point3dCollection, _
	startTangent As Vector3d, _
	endTangent As Vector3d, _
	fitTolerance As Tolerance _
)
public:
void SetFitData(
	Point3dCollection^ fitPoints,
	Vector3d startTangent,
	Vector3d endTangent,
	Tolerance fitTolerance
)
 Parameters
fitPoints(Point3dCollection)
startTangent(Vector3d)
endTangent(Vector3d)
fitTolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)