Reference Library
GraphicsSystemMarker Property
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectedSubObject »GraphicsSystemMarker
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use GraphicsSystemMarkerPtr instead.")]
public long GraphicsSystemMarker { get; }
<ObsoleteAttribute("Use GraphicsSystemMarkerPtr instead.")> _
Public ReadOnly Property GraphicsSystemMarker As Long
	Get
[ObsoleteAttribute(L"Use GraphicsSystemMarkerPtr instead.")]
public:
property long long GraphicsSystemMarker {
	long long get ();
}
Assembly: ZwManaged (Module: ZwManaged)