Reference Library
Dimalttd Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimalttd
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Dimalttd { get; set; }
Public Property Dimalttd As Integer
	Get
	Set
public:
property int Dimalttd {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)