Reference Library
LineWeight Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »NonEntityTraits »LineWeight
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed LineWeight LineWeight { get; set; }
Public Overrides NotOverridable Property LineWeight As LineWeight
	Get
	Set
public:
virtual property LineWeight LineWeight {
	LineWeight get () override sealed;
	void set (LineWeight value) override sealed;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)