Reference Library
IsDegenerate Method (result, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »IsDegenerate(Entity3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsDegenerate(
	out Entity3d result,
	Tolerance tolerance
)
Public Function IsDegenerate ( _
	<OutAttribute> ByRef result As Entity3d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsDegenerate(
	[OutAttribute] Entity3d^% result,
	Tolerance tolerance
)
 Parameters
result(Entity3d%)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)