Reference Library
Thickness Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »SubEntityTraits »Thickness
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract double Thickness { get; set; }
Public MustOverride Property Thickness As Double
	Get
	Set
public:
virtual property double Thickness {
	double get () abstract;
	void set (double value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)