Reference Library
EntityColor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerTableRecord »EntityColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public EntityColor EntityColor { get; }
Public ReadOnly Property EntityColor As EntityColor
	Get
public:
property EntityColor EntityColor {
	EntityColor get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)