Reference Library
StartPoint Property
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc2d »StartPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d StartPoint { get; }
Public ReadOnly Property StartPoint As Point2d
	Get
public:
property Point2d StartPoint {
	Point2d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)