Reference Library
Ascent Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »Ascent
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public double Ascent { get; }
<UnitTypeAttribute(UnitType.Distance)> _
Public ReadOnly Property Ascent As Double
	Get
[UnitTypeAttribute(UnitType::Distance)]
public:
property double Ascent {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)