Reference Library
History Property
Namespaces »ZwSoft.ZwCAD.EditorInput »InputPointContext »History
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointHistoryBits History { get; }
Public ReadOnly Property History As PointHistoryBits
	Get
public:
property PointHistoryBits History {
	PointHistoryBits get ();
}
Assembly: ZwManaged (Module: ZwManaged)