Reference Library
GetObjectData Method (info, context)
Namespaces »ZwSoft.ZwCAD.Runtime »Exception »GetObjectData(SerializationInfo, StreamingContext)
 Declaration Syntax
C# | Visual Basic | Visual C++
[SecurityPermissionAttribute(SecurityAction.Demand, SerializationFormatter = true)]
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
<SecurityPermissionAttribute(SecurityAction.Demand, SerializationFormatter := True)> _
Public Overrides Sub GetObjectData ( _
	info As SerializationInfo, _
	context As StreamingContext _
)
[SecurityPermissionAttribute(SecurityAction::Demand, SerializationFormatter = true)]
public:
virtual void GetObjectData(
	SerializationInfo^ info,
	StreamingContext context
) override
 Parameters
info(SerializationInfo)
context(StreamingContext)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)