Reference Library
OwnerId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »OwnerId
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId OwnerId { get; }
Public Overridable ReadOnly Property OwnerId As ObjectId
	Get
public:
virtual property ObjectId OwnerId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)