Reference Library
ReadProperty Method (name, defaultValue)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »IConfigurationSection »ReadProperty(String, Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
Object ReadProperty(
	string name,
	Object defaultValue
)
Function ReadProperty ( _
	name As String, _
	defaultValue As Object _
) As Object
Object^ ReadProperty(
	String^ name,
	Object^ defaultValue
)
 Parameters
name(String)
defaultValue(Object)
Assembly: ZwManaged (Module: ZwManaged)