Reference Library
IsEqualTo Method (a)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Extents2d »IsEqualTo(Extents2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	Extents2d a
)
Public Function IsEqualTo ( _
	a As Extents2d _
) As Boolean
public:
bool IsEqualTo(
	Extents2d a
)
 Parameters
a(Extents2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)