Reference Library
Transaction Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Transaction
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcTransaction")]
public class Transaction : RXObject
<WrapperAttribute("AcTransaction")> _
Public Class Transaction _
	Inherits RXObject
[WrapperAttribute(L"AcTransaction")]
public ref class Transaction : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Transaction(IntPtr, Boolean)
Abort()
AddNewlyCreatedDBObject(DBObject, Boolean)
Commit()
DeleteUnmanagedObject() |  (Overrides RXObject.DeleteUnmanagedObject().)
GetAllObjects()
GetObject(ObjectId, OpenMode, Boolean, Boolean)
GetObject(ObjectId, OpenMode, Boolean)
GetObject(ObjectId, OpenMode)
TransactionManager
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Transaction
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)