Reference Library
FireAboutToBeginPublishing Method (e)
Namespaces »ZwSoft.ZwCAD.Publishing »Publisher »FireAboutToBeginPublishing(AboutToBeginPublishingEventArgs)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void FireAboutToBeginPublishing(
	AboutToBeginPublishingEventArgs e
)
Public Sub FireAboutToBeginPublishing ( _
	e As AboutToBeginPublishingEventArgs _
)
public:
void FireAboutToBeginPublishing(
	AboutToBeginPublishingEventArgs^ e
)
 Parameters
e(AboutToBeginPublishingEventArgs)
Assembly: ZwManaged (Module: ZwManaged)