Reference Library
CameraDisplay Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »CameraDisplay
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool CameraDisplay { get; set; }
Public Property CameraDisplay As Boolean
	Get
	Set
public:
property bool CameraDisplay {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)