Reference Library
BeginDocument Event
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotReactorManager »BeginDocument
 Declaration Syntax
C# | Visual Basic | Visual C++
public event BeginDocumentEventHandler BeginDocument
Public Event BeginDocument As BeginDocumentEventHandler
public:
 event BeginDocumentEventHandler^ BeginDocument {
	void add (BeginDocumentEventHandler^ value);
	void remove (BeginDocumentEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)