Reference Library
Translation Property
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2d »Translation
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector2d Translation { get; }
Public ReadOnly Property Translation As Vector2d
	Get
public:
property Vector2d Translation {
	Vector2d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)