Reference Library
GetParameterOf Method
Namespaces »ZwSoft.ZwCAD.Geometry »AugmentedPolylineCurve3d »GetParameterOf()
 Members
Icon | Member | Description
GetParameterOf(Point3d, Tolerance)
GetParameterOf(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)