Reference Library
UcsPerViewport Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »UcsPerViewport
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool UcsPerViewport { get; set; }
Public Property UcsPerViewport As Boolean
	Get
	Set
public:
property bool UcsPerViewport {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)