Reference Library
DrawMLeaderOrderType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DrawMLeaderOrderType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbMLeaderStyle::DrawMLeaderOrderType")]
public enum DrawMLeaderOrderType
<WrapperAttribute("ZcDbMLeaderStyle::DrawMLeaderOrderType")> _
Public Enumeration DrawMLeaderOrderType
[WrapperAttribute(L"ZcDbMLeaderStyle::DrawMLeaderOrderType")]
public enum class DrawMLeaderOrderType
 Members
Member | Description
DrawLeaderFirst
DrawContentFirst
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)