Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »Inequality(Vector2d, Vector2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	Vector2d a,
	Vector2d b
)
Public Shared Operator <> ( _
	a As Vector2d, _
	b As Vector2d _
) As Boolean
public:
static bool operator !=(
	Vector2d a,
	Vector2d b
)
 Parameters
a(Vector2d)
b(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)