Reference Library
Update Method (pUpdatedRect)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ImpDevice »Update(Rectangle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public override void Update(
	Rectangle pUpdatedRect
)
Public Overrides Sub Update ( _
	pUpdatedRect As Rectangle _
)
public:
virtual void Update(
	Rectangle pUpdatedRect
) override
 Parameters
pUpdatedRect(Rectangle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)