Reference Library
Helix Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Helix »Helix()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Helix()
Public Sub New
public:
Helix()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)