Reference Library
IsProxy Property
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerFilter »IsProxy
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsProxy { get; }
Public ReadOnly Property IsProxy As Boolean
	Get
public:
property bool IsProxy {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)