Reference Library
SetShowRasterRef Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DgnUnderlayItem »SetShowRasterRef
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool SetShowRasterRef { set; }
Public WriteOnly Property SetShowRasterRef As Boolean
	Set
public:
property bool SetShowRasterRef {
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)