Reference Library
PlotBoundsMaxY Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »PlotBoundsMaxY
 Declaration Syntax
C# | Visual Basic | Visual C++
public double PlotBoundsMaxY { get; }
Public ReadOnly Property PlotBoundsMaxY As Double
	Get
public:
property double PlotBoundsMaxY {
	double get ();
}
Assembly: ZwManaged (Module: ZwManaged)