Reference Library
OnDisplayChange Method (bitsPerPixel, xPixels, yPixels)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ImpDevice »OnDisplayChange(Int32, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public override void OnDisplayChange(
	int bitsPerPixel,
	int xPixels,
	int yPixels
)
Public Overrides Sub OnDisplayChange ( _
	bitsPerPixel As Integer, _
	xPixels As Integer, _
	yPixels As Integer _
)
public:
virtual void OnDisplayChange(
	int bitsPerPixel,
	int xPixels,
	int yPixels
) override
 Parameters
bitsPerPixel(Int32)
xPixels(Int32)
yPixels(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)