Reference Library
AcadWindowId Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Viewport »AcadWindowId
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract int AcadWindowId { get; }
Public MustOverride ReadOnly Property AcadWindowId As Integer
	Get
public:
virtual property int AcadWindowId {
	int get () abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)