Reference Library
ExposureType Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraits2 »ExposureType
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract ExposureType ExposureType { get; set; }
Public MustOverride Property ExposureType As ExposureType
	Get
	Set
public:
virtual property ExposureType ExposureType {
	ExposureType get () abstract;
	void set (ExposureType value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)