Reference Library
SyncRoot Property
Namespaces »ZwSoft.ZwCAD.Windows »MenuItemCollection »SyncRoot
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Object SyncRoot { get; }
Public Overridable ReadOnly Property SyncRoot As Object
	Get
public:
virtual property Object^ SyncRoot {
	Object^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)