Reference Library
CrossingOrWindowSelectedSubObject Class
Namespaces »ZwSoft.ZwCAD.EditorInput »CrossingOrWindowSelectedSubObject
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class CrossingOrWindowSelectedSubObject : SelectedSubObject
Public NotInheritable Class CrossingOrWindowSelectedSubObject _
	Inherits SelectedSubObject
public ref class CrossingOrWindowSelectedSubObject sealed : public SelectedSubObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
CrossingOrWindowSelectedSubObject(FullSubentityPath, SelectionMethod, IntPtr)
CrossingOrWindowSelectedSubObject(FullSubentityPath, SelectionMethod, Int32) |  Obsolete.
GetPickPoints()
ToString(IFormatProvider)
ToString() |  (Overrides SelectedSubObject.ToString().)
 Inheritance Hierarchy
Object
SelectedSubObject
| CrossingOrWindowSelectedSubObject
Assembly: ZwManaged (Module: ZwManaged)