Reference Library
Item Property ()
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicBlockReferencePropertyCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public DynamicBlockReferenceProperty this[
	int
] { get; }
Public ReadOnly Default Property Item ( _
	 As Integer _
) As DynamicBlockReferenceProperty
	Get
public:
property DynamicBlockReferenceProperty^ default[int ] {
	DynamicBlockReferenceProperty^ get (int );
}
 Parameters
(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)