Reference Library
InsertAborted Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »InsertAborted
 Declaration Syntax
C# | Visual Basic | Visual C++
public event EventHandler InsertAborted
Public Event InsertAborted As EventHandler
public:
 event EventHandler^ InsertAborted {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)