Reference Library
Latitude Property
Namespaces »ZwSoft.ZwCAD.Geometry »GeoDataLonLatAltInfo »Latitude
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Latitude { get; set; }
Public Property Latitude As Double
	Get
	Set
public:
property double Latitude {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)