Reference Library
DimAssoc Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimAssoc »DimAssoc()
 Declaration Syntax
C# | Visual Basic | Visual C++
public DimAssoc()
Public Sub New
public:
DimAssoc()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)