Reference Library
UnderlayItem Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayItem
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbUnderlayItem")]
public class UnderlayItem : DisposableWrapper
<WrapperAttribute("ZcDbUnderlayItem")> _
Public Class UnderlayItem _
	Inherits DisposableWrapper
[WrapperAttribute(L"ZcDbUnderlayItem")]
public ref class UnderlayItem : public DisposableWrapper
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DeleteUnmanagedObject() |  (Overrides DisposableWrapper.DeleteUnmanagedObject().)
Extents
Name
Thumbnail
Units
UsingPartialContent
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | UnderlayItem
|  |  | DgnUnderlayItem
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)