Reference Library
HatchLoop Constructor (loopType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HatchLoop »HatchLoop(HatchLoopTypes)
 Declaration Syntax
C# | Visual Basic | Visual C++
public HatchLoop(
	HatchLoopTypes loopType
)
Public Sub New ( _
	loopType As HatchLoopTypes _
)
public:
HatchLoop(
	HatchLoopTypes loopType
)
 Parameters
loopType(HatchLoopTypes)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)