Reference Library
FrontClipOn Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »FrontClipOn
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool FrontClipOn { get; set; }
Public Property FrontClipOn As Boolean
	Get
	Set
public:
property bool FrontClipOn {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)