Reference Library
DBText Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBText
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbText")]
public class DBText : Entity
<WrapperAttribute("AcDbText")> _
Public Class DBText _
	Inherits Entity
[WrapperAttribute(L"AcDbText")]
public ref class DBText : public Entity
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DBText()
AdjustAlignment(Database)
AlignmentPoint
ConvertFieldToText()
CorrectSpelling()
getTextWithFieldCodes()
Height
HorizontalMode
IsDefaultAlignment
IsMirroredInX
IsMirroredInY
Justify
Normal
Oblique
Position
Rotation
TextString
TextStyle
TextStyleId
TextStyleName
Thickness
VerticalMode
WidthFactor
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | DBText
|  |  |  |  |  |  | AttributeDefinition
|  |  |  |  |  |  | AttributeReference
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)