Reference Library
Preset Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AttributeDefinition »Preset
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Preset { get; set; }
Public Property Preset As Boolean
	Get
	Set
public:
property bool Preset {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)