Reference Library
Subject Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SecurityParameters »Subject
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Subject { get; set; }
Public Property Subject As String
	Get
	Set
public:
property String^ Subject {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)