Reference Library
ClosestPointToLinearEntity Method (line)
Namespaces »ZwSoft.ZwCAD.Geometry »PlanarEntity »ClosestPointToLinearEntity(LinearEntity3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d[] ClosestPointToLinearEntity(
	LinearEntity3d line
)
Public Function ClosestPointToLinearEntity ( _
	line As LinearEntity3d _
) As Point3d()
public:
array<Point3d>^ ClosestPointToLinearEntity(
	LinearEntity3d^ line
)
 Parameters
line(LinearEntity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)