Reference Library
Clone Method
Namespaces »ZwSoft.ZwCAD.Geometry »Entity3d »Clone()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Object Clone()
Public Overridable Function Clone As Object
public:
virtual Object^ Clone()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)