Reference Library
Current Property
Namespaces »ZwSoft.ZwCAD.Geometry »DoubleCollectionEnumerator »Current
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Current { get; }
Public ReadOnly Property Current As Double
	Get
public:
property double Current {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)