Reference Library
Dimazin Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimazin
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Dimazin { get; set; }
Public Property Dimazin As Integer
	Get
	Set
public:
property int Dimazin {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)