Reference Library
FirstLine Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »LispWillStartEventArgs »FirstLine
 Declaration Syntax
C# | Visual Basic | Visual C++
public string FirstLine { get; }
Public ReadOnly Property FirstLine As String
	Get
public:
property String^ FirstLine {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)