Reference Library
IsHidden Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerTableRecord »IsHidden
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsHidden { get; set; }
Public Property IsHidden As Boolean
	Get
	Set
public:
property bool IsHidden {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)