Reference Library
Append Method (id)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »Append(ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Append(
	ObjectId id
)
Public Sub Append ( _
	id As ObjectId _
)
public:
void Append(
	ObjectId id
)
 Parameters
id(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)