Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectId »Inequality(ObjectId, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	ObjectId a,
	ObjectId b
)
Public Shared Operator <> ( _
	a As ObjectId, _
	b As ObjectId _
) As Boolean
public:
static bool operator !=(
	ObjectId a,
	ObjectId b
)
 Parameters
a(ObjectId)
b(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)