Reference Library
Dimtolj Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimtolj
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Dimtolj { get; set; }
Public Overridable Property Dimtolj As Integer
	Get
	Set
public:
virtual property int Dimtolj {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)