Reference Library
ObjectIterator Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectIterator
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbObjectIterator")]
public sealed class ObjectIterator : RXObject,
	IEnumerator
<WrapperAttribute("ZcDbObjectIterator")> _
Public NotInheritable Class ObjectIterator _
	Inherits RXObject _
	Implements IEnumerator
[WrapperAttribute(L"ZcDbObjectIterator")]
public ref class ObjectIterator sealed : public RXObject,
	IEnumerator
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Current
MoveNext()
Reset()
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | ObjectIterator
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)