Reference Library
Top Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellBorders »Top
 Declaration Syntax
C# | Visual Basic | Visual C++
public CellBorder Top { get; }
Public ReadOnly Property Top As CellBorder
	Get
public:
property CellBorder^ Top {
	CellBorder^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)