Reference Library
LayerStateManager Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbLayerStateManager")]
public sealed class LayerStateManager : RXObject
<WrapperAttribute("ZcDbLayerStateManager")> _
Public NotInheritable Class LayerStateManager _
	Inherits RXObject
[WrapperAttribute(L"ZcDbLayerStateManager")]
public ref class LayerStateManager sealed : public RXObject
 Members
All Members | Constructors | Methods | Properties | Fields | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
LayerStateManager(Database)
AbortLayerStateDelete
AbortLayerStateRename
AbortLayerStateRestore
CompareLayerStateToDb(String, ObjectId)
DeleteLayerState(String)
ExportLayerState(String, String)
GetLayerStateDescription(String)
GetLayerStateLayers(String, Boolean)
GetLayerStateMask(String)
GetLayerStateNames(Boolean, Boolean)
HasLayerState(String)
ImportLayerState(String)
ImportLayerStateFromDb(String, Database)
LastRestoredLayerState
LayerStateCompareFailed
LayerStateCreated
LayerStateDeleted
LayerStateHasViewportData(String)
LayerStateRenamed
LayerStateRestored
LayerStatesDictionaryId(Boolean)
LayerStateToBeDeleted
LayerStateToBeRenamed
LayerStateToBeRestored
m_pAbortLayerStateDelete
m_pAbortLayerStateRename
m_pAbortLayerStateRestore
m_pLayerStateCompareFailed
m_pLayerStateCreated
m_pLayerStateDeleted
m_pLayerStateRenamed
m_pLayerStateRestored
m_pLayerStateToBeDeleted
m_pLayerStateToBeRenamed
m_pLayerStateToBeRestored
RenameLayerState(String, String)
RestoreLayerState(String, ObjectId, Int32, LayerStateMasks)
SaveLayerState(String, LayerStateMasks, ObjectId)
SetLayerStateDescription(String, String)
SetLayerStateMask(String, LayerStateMasks)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | LayerStateManager
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)