Reference Library
AllowNested Property
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerFilter »AllowNested
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool AllowNested { get; }
Public ReadOnly Property AllowNested As Boolean
	Get
public:
property bool AllowNested {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)