Reference Library
SetOverride Method (row, column, content, cellProperty)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »SetOverride(Int32, Int32, Int32, CellProperties)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetOverride(
	int row,
	int column,
	int content,
	CellProperties cellProperty
)
Public Overridable Sub SetOverride ( _
	row As Integer, _
	column As Integer, _
	content As Integer, _
	cellProperty As CellProperties _
)
public:
virtual void SetOverride(
	int row,
	int column,
	int content,
	CellProperties cellProperty
)
 Parameters
row(Int32)
column(Int32)
content(Int32)
cellProperty(CellProperties)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)