Reference Library
Material Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Material »Material()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Material()
Public Sub New
public:
Material()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)