Reference Library
ViewportDraw Method (worldDraw, entityId, t, imageGripPoint, gripSizeInPixels)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripData »ViewportDraw(ViewportDraw, ObjectId, GripData.DrawType, Nullable<Point3d>, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool ViewportDraw(
	ViewportDraw worldDraw,
	ObjectId entityId,
	GripData.DrawType t,
	Nullable<Point3d> imageGripPoint,
	int gripSizeInPixels
)
Public Overridable Function ViewportDraw ( _
	worldDraw As ViewportDraw, _
	entityId As ObjectId, _
	t As GripData.DrawType, _
	imageGripPoint As Nullable(Of Point3d), _
	gripSizeInPixels As Integer _
) As Boolean
public:
virtual bool ViewportDraw(
	ViewportDraw^ worldDraw,
	ObjectId entityId,
	GripData.DrawType t,
	Nullable<Point3d> imageGripPoint,
	int gripSizeInPixels
)
 Parameters
worldDraw(ViewportDraw)
entityId(ObjectId)
t(GripData.DrawType)
imageGripPoint(Nullable<Point3d>)
gripSizeInPixels(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)