Reference Library
Add Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »Add(Vector2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d Add(
	Vector2d value
)
Public Function Add ( _
	value As Vector2d _
) As Point2d
public:
Point2d Add(
	Vector2d value
)
 Parameters
value(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)