Reference Library
BeginPlot Event
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotReactorManager »BeginPlot
 Declaration Syntax
C# | Visual Basic | Visual C++
public event BeginPlotEventHandler BeginPlot
Public Event BeginPlot As BeginPlotEventHandler
public:
 event BeginPlotEventHandler^ BeginPlot {
	void add (BeginPlotEventHandler^ value);
	void remove (BeginPlotEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)