Reference Library
TrackingFactor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MTextFragment »TrackingFactor
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Unitless)]
public double TrackingFactor { get; }
<UnitTypeAttribute(UnitType.Unitless)> _
Public ReadOnly Property TrackingFactor As Double
	Get
[UnitTypeAttribute(UnitType::Unitless)]
public:
property double TrackingFactor {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)