Reference Library
ConstrainType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ConstrainType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbHelix::ConstrainType")]
public enum ConstrainType
<WrapperAttribute("ZcDbHelix::ConstrainType")> _
Public Enumeration ConstrainType
[WrapperAttribute(L"ZcDbHelix::ConstrainType")]
public enum class ConstrainType
 Members
Member | Description
Height
Turns
TurnHeight
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)