Reference Library
ErrorsFixed Method (count)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AuditInfo »ErrorsFixed(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void ErrorsFixed(
	int count
)
Public Sub ErrorsFixed ( _
	count As Integer _
)
public:
void ErrorsFixed(
	int count
)
 Parameters
count(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)