Reference Library
SetLogicalPalette Method (logicalPalette)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ImpDevice »SetLogicalPalette(Color[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public override void SetLogicalPalette(
	Color[] logicalPalette
)
Public Overrides Sub SetLogicalPalette ( _
	logicalPalette As Color() _
)
public:
virtual void SetLogicalPalette(
	array<Color>^ logicalPalette
) override
 Parameters
logicalPalette(Color[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)