Reference Library
CheckRevolveCurve Method (ent, axisPnt, axisDir, displayErrorMessages)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolveOptions »CheckRevolveCurve(Entity, Point3d, Vector3d, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public RevolveOptionsCheckRevolveCurveOut CheckRevolveCurve(
	Entity ent,
	Point3d axisPnt,
	Vector3d axisDir,
	bool displayErrorMessages
)
Public Function CheckRevolveCurve ( _
	ent As Entity, _
	axisPnt As Point3d, _
	axisDir As Vector3d, _
	displayErrorMessages As Boolean _
) As RevolveOptionsCheckRevolveCurveOut
public:
RevolveOptionsCheckRevolveCurveOut^ CheckRevolveCurve(
	Entity^ ent,
	Point3d axisPnt,
	Vector3d axisDir,
	bool displayErrorMessages
)
 Parameters
ent(Entity)
axisPnt(Point3d)
axisDir(Vector3d)
displayErrorMessages(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)