Reference Library
IsPerpendicularTo Method (plane, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity3d »IsPerpendicularTo(PlanarEntity, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPerpendicularTo(
	PlanarEntity plane,
	Tolerance tolerance
)
Public Function IsPerpendicularTo ( _
	plane As PlanarEntity, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsPerpendicularTo(
	PlanarEntity^ plane,
	Tolerance tolerance
)
 Parameters
plane(PlanarEntity)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)