Reference Library
Current Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HostApplicationServices »Current
 Declaration Syntax
C# | Visual Basic | Visual C++
public static HostApplicationServices Current { get; set; }
Public Shared Property Current As HostApplicationServices
	Get
	Set
public:
static property HostApplicationServices^ Current {
	HostApplicationServices^ get ();
	void set (HostApplicationServices^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)