Reference Library
Equals Method (other)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Mapper »Equals(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed bool Equals(
	Object other
)
Public Overrides NotOverridable Function Equals ( _
	other As Object _
) As Boolean
public:
virtual bool Equals(
	Object^ other
) override sealed
 Parameters
other(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)