Reference Library
BitmapInfoToBitmap Method (bitmapInfo)
Namespaces »ZwSoft.ZwCAD.Runtime »Marshaler »BitmapInfoToBitmap(IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Bitmap BitmapInfoToBitmap(
	IntPtr bitmapInfo
)
Public Shared Function BitmapInfoToBitmap ( _
	bitmapInfo As IntPtr _
) As Bitmap
public:
static Bitmap^ BitmapInfoToBitmap(
	IntPtr bitmapInfo
)
 Parameters
bitmapInfo(IntPtr)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)