Reference Library
DraggingEventArgs Constructor (prompt)
Namespaces »ZwSoft.ZwCAD.EditorInput »DraggingEventArgs »DraggingEventArgs(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DraggingEventArgs(
	string prompt
)
Public Sub New ( _
	prompt As String _
)
public:
DraggingEventArgs(
	String^ prompt
)
 Parameters
prompt(String)
Assembly: ZwManaged (Module: ZwManaged)