Reference Library
PreLoaded Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »TextStyle »PreLoaded
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool PreLoaded { get; set; }
Public Property PreLoaded As Boolean
	Get
	Set
public:
property bool PreLoaded {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)