Reference Library
ShowHistory Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »ShowHistory
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool ShowHistory { get; set; }
Public Overridable Property ShowHistory As Boolean
	Get
	Set
public:
virtual property bool ShowHistory {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)