Reference Library
IntersectWith Method (line)
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc3d »IntersectWith(LinearEntity3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d[] IntersectWith(
	LinearEntity3d line
)
Public Function IntersectWith ( _
	line As LinearEntity3d _
) As Point3d()
public:
array<Point3d>^ IntersectWith(
	LinearEntity3d^ line
)
 Parameters
line(LinearEntity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)