Reference Library
IsInside Method
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc3d »IsInside()
 Members
Icon | Member | Description
IsInside(Point3d, Tolerance)
IsInside(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)