Reference Library
IsEqualTo Method (vector)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »IsEqualTo(Vector2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	Vector2d vector
)
Public Function IsEqualTo ( _
	vector As Vector2d _
) As Boolean
public:
bool IsEqualTo(
	Vector2d vector
)
 Parameters
vector(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)