Reference Library
JobWillPublishInBackground Property
Namespaces »ZwSoft.ZwCAD.Publishing »AboutToBeginPublishingEventArgs »JobWillPublishInBackground
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool JobWillPublishInBackground { get; }
Public ReadOnly Property JobWillPublishInBackground As Boolean
	Get
public:
property bool JobWillPublishInBackground {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)