Reference Library
ColorIndex Property
Namespaces »ZwSoft.ZwCAD.Colors »Color »ColorIndex
 Declaration Syntax
C# | Visual Basic | Visual C++
public short ColorIndex { get; }
Public ReadOnly Property ColorIndex As Short
	Get
public:
property short ColorIndex {
	short get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)