Reference Library
SetDataType Method (row, col, nDataType, nUnitType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetDataType(Int32, Int32, DataType, UnitType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetDataType(
	int row,
	int col,
	DataType nDataType,
	UnitType nUnitType
)
Public Overridable Sub SetDataType ( _
	row As Integer, _
	col As Integer, _
	nDataType As DataType, _
	nUnitType As UnitType _
)
public:
virtual void SetDataType(
	int row,
	int col,
	DataType nDataType,
	UnitType nUnitType
)
 Parameters
row(Int32)
col(Int32)
nDataType(DataType)
nUnitType(UnitType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)