Reference Library
GetParametersOfC1Discontinuity Method
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »GetParametersOfC1Discontinuity()
 Declaration Syntax
C# | Visual Basic | Visual C++
public DoubleCollection GetParametersOfC1Discontinuity()
Public Function GetParametersOfC1Discontinuity As DoubleCollection
public:
DoubleCollection^ GetParametersOfC1Discontinuity()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)