Reference Library
Id Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutEventArgs »Id
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Id { get; }
Public ReadOnly Property Id As ObjectId
	Get
public:
property ObjectId Id {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)