Reference Library
Point3dCollection Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Point3dCollection »Point3dCollection()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3dCollection()
Public Sub New
public:
Point3dCollection()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)