Reference Library
IntPtrCollection Class
Namespaces »ZwSoft.ZwCAD.Geometry »IntPtrCollection
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeIntPtrArray")]
public class IntPtrCollection : IList
<WrapperAttribute("ZcGeIntPtrArray")> _
Public Class IntPtrCollection _
	Implements IList
[WrapperAttribute(L"ZcGeIntPtrArray")]
public ref class IntPtrCollection : IList
 Members
All Members | Constructors | Methods | Properties | Fields
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
IntPtrCollection(Int32)
IntPtrCollection(IntPtr[])
IntPtrCollection()
Add(IntPtr)
AddRange(IntPtr[])
Capacity
Clear()
Contains(IntPtr)
CopyTo(IntPtr[], Int32)
Count
DefaultSize
GetEnumerator()
ICollection.CopyTo(Array, Int32)
IEnumerable_GetEnumerator()
IList.Add(Object)
IList.Contains(Object)
IList.IndexOf(Object)
IList.Insert(Int32, Object)
IList.Item[Int32]
IList.Remove(Object)
IndexOf(IntPtr)
Insert(Int32, IntPtr)
IsFixedSize
IsReadOnly
IsSynchronized
Item[Int32]
Remove(IntPtr)
RemoveAt(Int32)
SyncRoot
ToArray()
TrimToSize()
 Inheritance Hierarchy
Object
IntPtrCollection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)