Reference Library
SetNodeName Method (nodeId, nodeName)
Namespaces »ZwSoft.ZwCAD.Publishing »PublishEntityEventArgs »SetNodeName(Int32, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool SetNodeName(
	int nodeId,
	string nodeName
)
Public Function SetNodeName ( _
	nodeId As Integer, _
	nodeName As String _
) As Boolean
public:
bool SetNodeName(
	int nodeId,
	String^ nodeName
)
 Parameters
nodeId(Int32)
nodeName(String)
Assembly: ZwManaged (Module: ZwManaged)