Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.Geometry »DoubleCollection »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual DoubleCollectionEnumerator GetEnumerator()
Public Overridable Function GetEnumerator As DoubleCollectionEnumerator
public:
virtual DoubleCollectionEnumerator^ GetEnumerator()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)