Reference Library
Insert Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Insert()
 Members
Icon | Member | Description
Insert(String, String, Database, Boolean)
Insert(String, Database, Boolean)
Insert(Matrix3d, Database, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)