Reference Library
GetProjectedClosestPointTo Method (curve3d, projectDirection, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »GetProjectedClosestPointTo(Curve3d, Vector3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnCurve3d[] GetProjectedClosestPointTo(
	Curve3d curve3d,
	Vector3d projectDirection,
	Tolerance tolerance
)
Public Function GetProjectedClosestPointTo ( _
	curve3d As Curve3d, _
	projectDirection As Vector3d, _
	tolerance As Tolerance _
) As PointOnCurve3d()
public:
array<PointOnCurve3d^>^ GetProjectedClosestPointTo(
	Curve3d^ curve3d,
	Vector3d projectDirection,
	Tolerance tolerance
)
 Parameters
curve3d(Curve3d)
projectDirection(Vector3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)