Reference Library
ElementAt Property (i, j)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2d »ElementAt[Int32, Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public double this[
	int i,
	int j
] { get; }
Public ReadOnly Default Property ElementAt ( _
	i As Integer, _
	j As Integer _
) As Double
	Get
public:
property double default[int i, int j] {
	double get (int i, int j);
}
 Parameters
i(Int32)
j(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)