Reference Library
CloneMeForDragging Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »CloneMeForDragging
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool CloneMeForDragging { get; }
Public Overridable ReadOnly Property CloneMeForDragging As Boolean
	Get
public:
virtual property bool CloneMeForDragging {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)