Reference Library
Polypoint Method (points, normals, subentityMarkers)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »Polypoint(Point3dCollection, Vector3dCollection, IntPtrCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool Polypoint(
	Point3dCollection points,
	Vector3dCollection normals,
	IntPtrCollection subentityMarkers
)
Public MustOverride Function Polypoint ( _
	points As Point3dCollection, _
	normals As Vector3dCollection, _
	subentityMarkers As IntPtrCollection _
) As Boolean
public:
virtual bool Polypoint(
	Point3dCollection^ points,
	Vector3dCollection^ normals,
	IntPtrCollection^ subentityMarkers
) abstract
 Parameters
points(Point3dCollection)
normals(Vector3dCollection)
subentityMarkers(IntPtrCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)