Reference Library
Dimtmove Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimtmove
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Dimtmove { get; set; }
Public Overridable Property Dimtmove As Integer
	Get
	Set
public:
virtual property int Dimtmove {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)