Reference Library
IsByPen Property
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor »IsByPen
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsByPen { get; }
Public ReadOnly Property IsByPen As Boolean
	Get
public:
property bool IsByPen {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)