Reference Library
Dimexo Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimexo
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public virtual double Dimexo { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Overridable Property Dimexo As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
virtual property double Dimexo {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)