Reference Library
AcquireString Method (options)
Namespaces »ZwSoft.ZwCAD.EditorInput »JigPrompts »AcquireString(JigPromptStringOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptResult AcquireString(
	JigPromptStringOptions options
)
Public Function AcquireString ( _
	options As JigPromptStringOptions _
) As PromptResult
public:
PromptResult^ AcquireString(
	JigPromptStringOptions^ options
)
 Parameters
options(JigPromptStringOptions)
Assembly: ZwManaged (Module: ZwManaged)