Reference Library
GetObjectSnapPoints Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Helix »GetObjectSnapPoints()
 Members
Icon | Member | Description
GetObjectSnapPoints(ObjectSnapModes, Int32, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
GetObjectSnapPoints(ObjectSnapModes, Int32, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)