Reference Library
IsInverse Method
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »IsInverse()
 Members
Icon | Member | Description
IsInverse(Matrix3d, Tolerance)
IsInverse(Matrix3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)