Reference Library
OffsetY Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PatternDefinition »OffsetY
 Declaration Syntax
C# | Visual Basic | Visual C++
public double OffsetY { get; }
Public ReadOnly Property OffsetY As Double
	Get
public:
property double OffsetY {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)