Reference Library
Coordinate Property (index)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »Coordinate[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public double this[
	int index
] { get; }
Public ReadOnly Default Property Coordinate ( _
	index As Integer _
) As Double
	Get
public:
property double default[int index] {
	double get (int index);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)