Reference Library
Contains Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HyperLinkCollection »Contains(HyperLink)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Contains(
	HyperLink value
)
Public Function Contains ( _
	value As HyperLink _
) As Boolean
public:
bool Contains(
	HyperLink^ value
)
 Parameters
value(HyperLink)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)