Reference Library
IListIndexOf Method (value)
Namespaces »ZwSoft.ZwCAD.Colors »EntityColorCollection »IList.IndexOf(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
int IList.IndexOf(
	Object value
)
Private Function IListIndexOf ( _
	value As Object _
) As Integer Implements IList.IndexOf
private:
virtual int IListIndexOf(
	Object^ value
) sealed = IList::IndexOf
 Parameters
value(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)