Reference Library
AddDataLink Method (dataLink)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataLinkManager »AddDataLink(DataLink)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId AddDataLink(
	DataLink dataLink
)
Public Function AddDataLink ( _
	dataLink As DataLink _
) As ObjectId
public:
ObjectId AddDataLink(
	DataLink^ dataLink
)
 Parameters
dataLink(DataLink)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)