Reference Library
DimAssoc Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »DimAssoc
 Declaration Syntax
C# | Visual Basic | Visual C++
public int DimAssoc { get; set; }
Public Property DimAssoc As Integer
	Get
	Set
public:
property int DimAssoc {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)