Reference Library
HasBookName Property
Namespaces »ZwSoft.ZwCAD.Colors »Color »HasBookName
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool HasBookName { get; }
Public ReadOnly Property HasBookName As Boolean
	Get
public:
property bool HasBookName {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)