Reference Library
Dimblk2 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimblk2
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId Dimblk2 { get; set; }
Public Overridable Property Dimblk2 As ObjectId
	Get
	Set
public:
virtual property ObjectId Dimblk2 {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)