Reference Library
MinorRadius Property
Namespaces »ZwSoft.ZwCAD.Geometry »Torus »MinorRadius
 Declaration Syntax
C# | Visual Basic | Visual C++
public double MinorRadius { get; set; }
Public Property MinorRadius As Double
	Get
	Set
public:
property double MinorRadius {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)