Reference Library
CoordinateSystem3d Constructor (o, x, y)
Namespaces »ZwSoft.ZwCAD.Geometry »CoordinateSystem3d »CoordinateSystem3d(Point3d, Vector3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CoordinateSystem3d(
	Point3d o,
	Vector3d x,
	Vector3d y
)
Public Sub New ( _
	o As Point3d, _
	x As Vector3d, _
	y As Vector3d _
)
public:
CoordinateSystem3d(
	Point3d o,
	Vector3d x,
	Vector3d y
)
 Parameters
o(Point3d)
x(Vector3d)
y(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)