Reference Library
Normal Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »Normal
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d Normal { get; }
Public ReadOnly Property Normal As Vector3d
	Get
public:
property Vector3d Normal {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)