Reference Library
IListAdd Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3dCollection »IList.Add(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
int IList.Add(
	Object value
)
Private Function IListAdd ( _
	value As Object _
) As Integer Implements IList.Add
private:
virtual int IListAdd(
	Object^ value
) sealed = IList::Add
 Parameters
value(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)