Reference Library
SetFitPointAt Method (index, point)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Spline »SetFitPointAt(Int32, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFitPointAt(
	int index,
	Point3d point
)
Public Sub SetFitPointAt ( _
	index As Integer, _
	point As Point3d _
)
public:
void SetFitPointAt(
	int index,
	Point3d point
)
 Parameters
index(Int32)
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)