Reference Library
GetOrthoBoundBlockOf Method (range)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »GetOrthoBoundBlockOf(Interval)
 Declaration Syntax
C# | Visual Basic | Visual C++
public BoundBlock3d GetOrthoBoundBlockOf(
	Interval range
)
Public Function GetOrthoBoundBlockOf ( _
	range As Interval _
) As BoundBlock3d
public:
BoundBlock3d^ GetOrthoBoundBlockOf(
	Interval^ range
)
 Parameters
range(Interval)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)