Reference Library
GetDefaultValueString Method
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptOptions »GetDefaultValueString()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal virtual string GetDefaultValueString()
Protected Friend Overridable Function GetDefaultValueString As String
protected public:
virtual String^ GetDefaultValueString()
Assembly: ZwManaged (Module: ZwManaged)