Reference Library
Dimtfillclr Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimtfillclr
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color Dimtfillclr { get; set; }
Public Property Dimtfillclr As Color
	Get
	Set
public:
property Color^ Dimtfillclr {
	Color^ get ();
	void set (Color^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)