Reference Library
DegreeInU Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbSurfaceDefinition »DegreeInU
 Declaration Syntax
C# | Visual Basic | Visual C++
public int DegreeInU { get; }
Public ReadOnly Property DegreeInU As Integer
	Get
public:
property int DegreeInU {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)