Reference Library
Dimdsep Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimdsep
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual char Dimdsep { get; set; }
Public Overridable Property Dimdsep As Char
	Get
	Set
public:
virtual property wchar_t Dimdsep {
	wchar_t get ();
	void set (wchar_t value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)