Reference Library
IsEqualTo Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Extents2d »IsEqualTo()
 Members
Icon | Member | Description
IsEqualTo(Extents2d, Tolerance)
IsEqualTo(Extents2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)