Reference Library
IList_Contains Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »IntegerCollection »IList.Contains(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
bool IList.Contains(
	Object value
)
Private Function IList_Contains ( _
	value As Object _
) As Boolean Implements IList.Contains
private:
virtual bool IList_Contains(
	Object^ value
) sealed = IList::Contains
 Parameters
value(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)