Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.Windows »MenuItemCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public MenuItem this[
	int index
] { get; set; }
Public Default Property Item ( _
	index As Integer _
) As MenuItem
	Get
	Set
public:
property MenuItem^ default[int index] {
	MenuItem^ get (int index);
	void set (int index, MenuItem^ value);
}
 Parameters
index(Int32)
Assembly: ZwManaged (Module: ZwManaged)