Reference Library
BackgroundColor Method (row, col)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »BackgroundColor(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Color BackgroundColor(
	int row,
	int col
)
Public Overridable Function BackgroundColor ( _
	row As Integer, _
	col As Integer _
) As Color
public:
virtual Color^ BackgroundColor(
	int row,
	int col
)
 Parameters
row(Int32)
col(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)