Reference Library
PromptingForCorner Event
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »PromptingForCorner
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PromptPointOptionsEventHandler PromptingForCorner
Public Event PromptingForCorner As PromptPointOptionsEventHandler
public:
 event PromptPointOptionsEventHandler^ PromptingForCorner {
	void add (PromptPointOptionsEventHandler^ value);
	void remove (PromptPointOptionsEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)