Reference Library
IsParallelTo Method (line)
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity3d »IsParallelTo(LinearEntity3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsParallelTo(
	LinearEntity3d line
)
Public Function IsParallelTo ( _
	line As LinearEntity3d _
) As Boolean
public:
bool IsParallelTo(
	LinearEntity3d^ line
)
 Parameters
line(LinearEntity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)