Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleData »Inequality(PlotStyleData, PlotStyleData)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	PlotStyleData a,
	PlotStyleData b
)
Public Shared Operator <> ( _
	a As PlotStyleData, _
	b As PlotStyleData _
) As Boolean
public:
static bool operator !=(
	PlotStyleData a,
	PlotStyleData b
)
 Parameters
a(PlotStyleData)
b(PlotStyleData)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)