Reference Library
LoftMag1 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »LoftMag1
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LoftMag1 { get; set; }
Public Property LoftMag1 As Double
	Get
	Set
public:
property double LoftMag1 {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)