Reference Library
DockSides Enumeration
Namespaces »ZwSoft.ZwCAD.Windows »DockSides
 Declaration Syntax
C# | Visual Basic | Visual C++
[FlagsAttribute]
public enum DockSides
<FlagsAttribute> _
Public Enumeration DockSides
[FlagsAttribute]
public enum class DockSides
 Members
Member | Description
None
Bottom
Right
Top
Left
Assembly: ZwManaged (Module: ZwManaged)