Reference Library
DataLink Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Cell »DataLink
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId DataLink { get; set; }
Public Property DataLink As ObjectId
	Get
	Set
public:
property ObjectId DataLink {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)