Reference Library
Userr4 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Userr4
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Userr4 { get; set; }
Public Property Userr4 As Double
	Get
	Set
public:
property double Userr4 {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)