Reference Library
Explicit Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionaryEntry »Explicit()
 Members
Icon | Member | Description
Explicit(DBDictionaryEntry to DictionaryEntry)
Explicit(DictionaryEntry to DBDictionaryEntry)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)