Reference Library
FlowDirection Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableStyle »FlowDirection
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual FlowDirection FlowDirection { get; set; }
Public Overridable Property FlowDirection As FlowDirection
	Get
	Set
public:
virtual property FlowDirection FlowDirection {
	FlowDirection get ();
	void set (FlowDirection value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)