Reference Library
IsSynchronized Property
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3dCollection »ICollection.IsSynchronized
 Declaration Syntax
C# | Visual Basic | Visual C++
bool ICollection.IsSynchronized { get; }
Private ReadOnly Property IsSynchronized As Boolean
	Implements ICollection.IsSynchronized
	Get
private:
virtual property bool IsSynchronized {
	bool get () sealed = ICollection::IsSynchronized::get;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)