Reference Library
TextAlignmentType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeaderStyle »TextAlignmentType
 Declaration Syntax
C# | Visual Basic | Visual C++
public TextAlignmentType TextAlignmentType { get; set; }
Public Property TextAlignmentType As TextAlignmentType
	Get
	Set
public:
property TextAlignmentType TextAlignmentType {
	TextAlignmentType get ();
	void set (TextAlignmentType value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)