Reference Library
SubEntityTraits Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »SubEntityTraits »SubEntityTraits(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected SubEntityTraits(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Protected Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
protected:
SubEntityTraits(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)