Reference Library
TypedValuesToResbuf Method (values)
Namespaces »ZwSoft.ZwCAD.Runtime »Marshaler »TypedValuesToResbuf(TypedValue[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public static IntPtr TypedValuesToResbuf(
	params TypedValue[] values
)
Public Shared Function TypedValuesToResbuf ( _
	ParamArray values As TypedValue() _
) As IntPtr
public:
static IntPtr TypedValuesToResbuf(
	... array<TypedValue>^ values
)
 Parameters
values(TypedValue[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)