Reference Library
CanonicalMediaName Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »CanonicalMediaName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string CanonicalMediaName { get; }
Public ReadOnly Property CanonicalMediaName As String
	Get
public:
property String^ CanonicalMediaName {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)