Reference Library
VirtualPenNumber Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleData »VirtualPenNumber
 Declaration Syntax
C# | Visual Basic | Visual C++
public int VirtualPenNumber { get; set; }
Public Property VirtualPenNumber As Integer
	Get
	Set
public:
property int VirtualPenNumber {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)