Reference Library
Multiply Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »Multiply(Matrix3d, Matrix3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Matrix3d operator *(
	Matrix3d a,
	Matrix3d b
)
Public Shared Operator * ( _
	a As Matrix3d, _
	b As Matrix3d _
) As Matrix3d
public:
static Matrix3d operator *(
	Matrix3d a,
	Matrix3d b
)
 Parameters
a(Matrix3d)
b(Matrix3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)