Reference Library
PlotStyleTable Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleTable
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("OdPsPlotStyleTable")]
public class PlotStyleTable : RXObject
<WrapperAttribute("OdPsPlotStyleTable")> _
Public Class PlotStyleTable _
	Inherits RXObject
[WrapperAttribute(L"OdPsPlotStyleTable")]
public ref class PlotStyleTable : public RXObject
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
AddNewPlotStyle(String)
AddPlotStyle(PlotStyle)
ApplyScaleFactor
DelPlotStyle(PlotStyle)
Description
DisplayCustomLineweightUnits
GetLineweightAt(Int32)
Lineweights
LineweightSize
PlotStyleArr
PlotStyleAt(Int32)
PlotStyleAt(String)
PlotStyleSize
ScaleFactor
SetLineweightAt(Double, Int32)
SetOrdering(String[])
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | PlotStyleTable
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)