Reference Library
AreScalingLineWeights Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »AreScalingLineWeights
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool AreScalingLineWeights { get; }
Public ReadOnly Property AreScalingLineWeights As Boolean
	Get
public:
property bool AreScalingLineWeights {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)