Reference Library
DBObject Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectErasedEventArgs »DBObject
 Declaration Syntax
C# | Visual Basic | Visual C++
public DBObject DBObject { get; }
Public ReadOnly Property DBObject As DBObject
	Get
public:
property DBObject^ DBObject {
	DBObject^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)