Reference Library
FromAcadDatabase Method (acadDatabase)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »FromAcadDatabase(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Database FromAcadDatabase(
	Object acadDatabase
)
Public Shared Function FromAcadDatabase ( _
	acadDatabase As Object _
) As Database
public:
static Database^ FromAcadDatabase(
	Object^ acadDatabase
)
 Parameters
acadDatabase(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)