Reference Library
PaletteSet Class
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AdUiPaletteSet")]
public class PaletteSet : Window, ICollection
<WrapperAttribute("AdUiPaletteSet")> _
Public Class PaletteSet _
	Inherits Window _
	Implements ICollection
[WrapperAttribute(L"AdUiPaletteSet")]
public ref class PaletteSet : public Window,
	ICollection
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PaletteSet(String, String, Guid)
PaletteSet(String, Guid)
PaletteSet(String)
Activate(Int32)
Add(String, Control)
AddVisual(String, Visual)
Anchored
AutoRollUp
CopyTo(Palette[], Int32)
Count
Dock
DockEnabled
EnableTransparency(Boolean)
GetEnumerator()
Help
ICollection.CopyTo(Array, Int32)
InitializeFloatingPosition(Rect)
ICollection.IsSynchronized
Item[Int32]
KeepFocus
Load
Location |  (Overrides Window.Location.)
MinimumSize
Name
Opacity
PaletteActivated
PaletteAddContextMenu
PaletteSetDestroy
PaletteSetMoved
PaletteSetShowDockBar
PaletteSetTitleBarLocationChange
PaletteSize
RecalculateDockSiteLayout()
Remove(Int32)
RolledUp
Save
Saving
Size |  (Overrides Window.Size.)
SizeChanged
StateChanged
Style
ICollection.SyncRoot
TitleBarLocation
Visible |  (Overrides Window.Visible.)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Window
|  |  | PaletteSet
Assembly: ZwManaged (Module: ZwManaged)