Reference Library
Scale2d Constructor (x, y)
Namespaces »ZwSoft.ZwCAD.Geometry »Scale2d »Scale2d(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Scale2d(
	double x,
	double y
)
Public Sub New ( _
	x As Double, _
	y As Double _
)
public:
Scale2d(
	double x,
	double y
)
 Parameters
x(Double)
y(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)