Reference Library
SetAt Method (searchKey, newValue)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »SetAt(String, DBObject)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId SetAt(
	string searchKey,
	DBObject newValue
)
Public Function SetAt ( _
	searchKey As String, _
	newValue As DBObject _
) As ObjectId
public:
ObjectId SetAt(
	String^ searchKey,
	DBObject^ newValue
)
 Parameters
searchKey(String)
newValue(DBObject)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)