Reference Library
Min Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraitsDoubleRangeParameter »Min
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Min { get; }
Public ReadOnly Property Min As Double
	Get
public:
property double Min {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)