Reference Library
m_pPlotStyleTableChanged Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »m_pPlotStyleTableChanged
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlotStyleTableChangedEventHandler m_pPlotStyleTableChanged
Public m_pPlotStyleTableChanged As PlotStyleTableChangedEventHandler
public:
PlotStyleTableChangedEventHandler^ m_pPlotStyleTableChanged
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)