Reference Library
LightTraits Constructor
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »LightTraits »LightTraits()
 Members
Icon | Member | Description
LightTraits(IntPtr, Boolean)
LightTraits()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)