Reference Library
Line2d Constructor (point1, point2)
Namespaces »ZwSoft.ZwCAD.Geometry »Line2d »Line2d(Point2d, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Line2d(
	Point2d point1,
	Point2d point2
)
Public Sub New ( _
	point1 As Point2d, _
	point2 As Point2d _
)
public:
Line2d(
	Point2d point1,
	Point2d point2
)
 Parameters
point1(Point2d)
point2(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)