Reference Library
CommandWillStart Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »CommandWillStart
 Declaration Syntax
C# | Visual Basic | Visual C++
public event CommandEventHandler CommandWillStart
Public Event CommandWillStart As CommandEventHandler
public:
 event CommandEventHandler^ CommandWillStart {
	void add (CommandEventHandler^ value);
	void remove (CommandEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)