Reference Library
LogMessage Method (message)
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotLogger »LogMessage(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void LogMessage(
	string message
)
Public Sub LogMessage ( _
	message As String _
)
public:
void LogMessage(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)