Reference Library
FileIsLoad Method (fileName)
Namespaces »ZwSoft.ZwCAD.Runtime »ExtensionLoader »FileIsLoad(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool FileIsLoad(
	string fileName
)
Public Shared Function FileIsLoad ( _
	fileName As String _
) As Boolean
public:
static bool FileIsLoad(
	String^ fileName
)
 Parameters
fileName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)