Reference Library
Boolean Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Variant »Boolean
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Boolean { get; set; }
Public Property Boolean As Boolean
	Get
	Set
public:
property bool Boolean {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)