Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public Palette this[
	int index
] { get; }
Public ReadOnly Default Property Item ( _
	index As Integer _
) As Palette
	Get
public:
property Palette^ default[int index] {
	Palette^ get (int index);
}
 Parameters
index(Int32)
Assembly: ZwManaged (Module: ZwManaged)