Reference Library
NumRows Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataTable »NumRows
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumRows { get; }
Public ReadOnly Property NumRows As Integer
	Get
public:
property int NumRows {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)