Reference Library
Dimension Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicDimensionData »Dimension
 Declaration Syntax
C# | Visual Basic | Visual C++
public Dimension Dimension { get; set; }
Public Property Dimension As Dimension
	Get
	Set
public:
property Dimension^ Dimension {
	Dimension^ get ();
	void set (Dimension^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)