Reference Library
SetDataType Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetDataType()
 Members
Icon | Member | Description
SetDataType(Int32, Int32, Int32, DataTypeParameter)
SetDataType(Int32, Int32, DataType, UnitType)
SetDataType(DataType, UnitType, Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)