Reference Library
ViewTable Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewTable
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbViewTable")]
public class ViewTable : SymbolTable
<WrapperAttribute("AcDbViewTable")> _
Public Class ViewTable _
	Inherits SymbolTable
[WrapperAttribute(L"AcDbViewTable")]
public ref class ViewTable : public SymbolTable
 Members
All Members | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | SymbolTable
|  |  |  |  |  | ViewTable
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)