Reference Library
Height Property
Namespaces »ZwSoft.ZwCAD.Geometry »Cone »Height
 Declaration Syntax
C# | Visual Basic | Visual C++
public Interval Height { get; set; }
Public Property Height As Interval
	Get
	Set
public:
property Interval^ Height {
	Interval^ get ();
	void set (Interval^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)