Reference Library
LayerStateToBeRestored Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »LayerStateToBeRestored
 Declaration Syntax
C# | Visual Basic | Visual C++
public event LayerStateEventHandler LayerStateToBeRestored
Public Event LayerStateToBeRestored As LayerStateEventHandler
public:
 event LayerStateEventHandler^ LayerStateToBeRestored {
	void add (LayerStateEventHandler^ value);
	void remove (LayerStateEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)