Reference Library
HalfAngle Property
Namespaces »ZwSoft.ZwCAD.Geometry »Cone »HalfAngle
 Declaration Syntax
C# | Visual Basic | Visual C++
public double HalfAngle { get; }
Public ReadOnly Property HalfAngle As Double
	Get
public:
property double HalfAngle {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)