Reference Library
Dimaltf Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimaltf
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Dimaltf { get; set; }
Public Property Dimaltf As Double
	Get
	Set
public:
property double Dimaltf {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)