Reference Library
Transparency Structure
Namespaces »ZwSoft.ZwCAD.Colors »Transparency
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("OdCmTransparency")]
public struct Transparency
<WrapperAttribute("OdCmTransparency")> _
Public Structure Transparency
[WrapperAttribute(L"OdCmTransparency")]
public value class Transparency
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Transparency(Byte)
Transparency(TransparencyMethod)
Alpha
CopyFromUnmanagedObject(IntPtr)
CopyToUmgObj(IntPtr)
Equality(Transparency, Transparency)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
Inequality(Transparency, Transparency)
IsByAlpha
IsByBlock
IsByLayer
IsClear
IsSolid
SetMethod(TransparencyMethod)
ToString(IFormatProvider)
ToString() |  (Overrides ValueType.ToString().)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)