Reference Library
Add Method (element, checkIfReferenced)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MlineStyleElementCollection »Add(MlineStyleElement, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Add(
	MlineStyleElement element,
	bool checkIfReferenced
)
Public Function Add ( _
	element As MlineStyleElement, _
	checkIfReferenced As Boolean _
) As Integer
public:
int Add(
	MlineStyleElement element,
	bool checkIfReferenced
)
 Parameters
element(MlineStyleElement)
checkIfReferenced(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)