Reference Library
Graph Constructor (root)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Graph »Graph(GraphNode)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Graph(
	GraphNode root
)
Public Sub New ( _
	root As GraphNode _
)
public:
Graph(
	GraphNode^ root
)
 Parameters
root(GraphNode)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)