Reference Library
DoDragDrop Method (dragSource, data, allowedEffects, target)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »DoDragDrop(DependencyObject, Object, DragDropEffects, DropTarget)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static void DoDragDrop(
	DependencyObject dragSource,
	Object data,
	DragDropEffects allowedEffects,
	DropTarget target
)
Public Shared Sub DoDragDrop ( _
	dragSource As DependencyObject, _
	data As Object, _
	allowedEffects As DragDropEffects, _
	target As DropTarget _
)
public:
static void DoDragDrop(
	DependencyObject^ dragSource,
	Object^ data,
	DragDropEffects allowedEffects,
	DropTarget^ target
)
 Parameters
dragSource(DependencyObject)
data(Object)
allowedEffects(DragDropEffects)
target(DropTarget)
Assembly: ZwManaged (Module: ZwManaged)