Reference Library
LayoutsReordered Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »LayoutsReordered
 Declaration Syntax
C# | Visual Basic | Visual C++
public event EventHandler LayoutsReordered
Public Event LayoutsReordered As EventHandler
public:
 event EventHandler^ LayoutsReordered {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)