Reference Library
Regenmode Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Regenmode
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Regenmode { get; set; }
Public Property Regenmode As Boolean
	Get
	Set
public:
property bool Regenmode {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)