Reference Library
AcquireAngle Method (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »JigPrompts »AcquireAngle(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDoubleResult AcquireAngle(
	string message
)
Public Function AcquireAngle ( _
	message As String _
) As PromptDoubleResult
public:
PromptDoubleResult^ AcquireAngle(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)