Reference Library
Material Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »NonEntityTraits »Material
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed ObjectId Material { get; set; }
Public Overrides NotOverridable Property Material As ObjectId
	Get
	Set
public:
virtual property ObjectId Material {
	ObjectId get () override sealed;
	void set (ObjectId value) override sealed;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)