Reference Library
NurbCurve3d Constructor (degree, knots, controlPoints, periodic)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »NurbCurve3d(Int32, KnotCollection, Point3dCollection, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public NurbCurve3d(
	int degree,
	KnotCollection knots,
	Point3dCollection controlPoints,
	bool periodic
)
Public Sub New ( _
	degree As Integer, _
	knots As KnotCollection, _
	controlPoints As Point3dCollection, _
	periodic As Boolean _
)
public:
NurbCurve3d(
	int degree,
	KnotCollection^ knots,
	Point3dCollection^ controlPoints,
	bool periodic
)
 Parameters
degree(Int32)
knots(KnotCollection)
controlPoints(Point3dCollection)
periodic(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)