Reference Library
GetAngleTo Method (vector, referenceVector)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »GetAngleTo(Vector3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetAngleTo(
	Vector3d vector,
	Vector3d referenceVector
)
Public Function GetAngleTo ( _
	vector As Vector3d, _
	referenceVector As Vector3d _
) As Double
public:
double GetAngleTo(
	Vector3d vector,
	Vector3d referenceVector
)
 Parameters
vector(Vector3d)
referenceVector(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)