Reference Library
GetFirstDerivative Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Helix »GetFirstDerivative()
 Members
Icon | Member | Description
GetFirstDerivative(Double)
GetFirstDerivative(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)