Reference Library
DbDictionaryEnumerator Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DbDictionaryEnumerator
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbDictionaryIterator")]
public class DbDictionaryEnumerator : RXObject,
	IDictionaryEnumerator
<WrapperAttribute("ZcDbDictionaryIterator")> _
Public Class DbDictionaryEnumerator _
	Inherits RXObject _
	Implements IDictionaryEnumerator
[WrapperAttribute(L"ZcDbDictionaryIterator")]
public ref class DbDictionaryEnumerator : public RXObject,
	IDictionaryEnumerator
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Current
Entry
IDictionaryEnumeratorCurrent
IDictionaryEnumeratorEntry
IDictionaryEnumeratorKey
IDictionaryEnumeratorValue
Key
MoveNext()
Reset()
Value
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | DbDictionaryEnumerator
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)