Reference Library
OutputQuality Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ole2Frame »OutputQuality
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual byte OutputQuality { get; set; }
Public Overridable Property OutputQuality As Byte
	Get
	Set
public:
virtual property unsigned char OutputQuality {
	unsigned char get ();
	void set (unsigned char value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)