Reference Library
GetDataLink Method (range)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GetDataLink(CellRange)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectIdCollection GetDataLink(
	CellRange range
)
Public Overridable Function GetDataLink ( _
	range As CellRange _
) As ObjectIdCollection
public:
virtual ObjectIdCollection^ GetDataLink(
	CellRange^ range
)
 Parameters
range(CellRange)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)