Reference Library
IsMirror Property
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2dInfo »IsMirror
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsMirror { get; }
Public ReadOnly Property IsMirror As Boolean
	Get
public:
property bool IsMirror {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)