Reference Library
IsEqualTo Method (a)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FrontAndBackClipping »IsEqualTo(FrontAndBackClipping)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	FrontAndBackClipping a
)
Public Function IsEqualTo ( _
	a As FrontAndBackClipping _
) As Boolean
public:
bool IsEqualTo(
	FrontAndBackClipping a
)
 Parameters
a(FrontAndBackClipping)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)