Reference Library
ReadVector2d Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »ReadVector2d()
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Vector2d ReadVector2d()
Public MustOverride Function ReadVector2d As Vector2d
public:
virtual Vector2d ReadVector2d() abstract
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)