Reference Library
CopyTo Method (copy, index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »CopyTo(DBDictionaryEntry[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	DBDictionaryEntry[] copy,
	int index
)
Public Sub CopyTo ( _
	copy As DBDictionaryEntry(), _
	index As Integer _
)
public:
void CopyTo(
	array<DBDictionaryEntry>^ copy,
	int index
)
 Parameters
copy(DBDictionaryEntry[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)