Reference Library
SetDataType Method (nDataType, nUnitType, rowTypes)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetDataType(DataType, UnitType, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetDataType(
	DataType nDataType,
	UnitType nUnitType,
	int rowTypes
)
Public Overridable Sub SetDataType ( _
	nDataType As DataType, _
	nUnitType As UnitType, _
	rowTypes As Integer _
)
public:
virtual void SetDataType(
	DataType nDataType,
	UnitType nUnitType,
	int rowTypes
)
 Parameters
nDataType(DataType)
nUnitType(UnitType)
rowTypes(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)