Reference Library
SourcePonints Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MeshPointMaps »SourcePonints
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2dCollection SourcePonints { get; set; }
Public Property SourcePonints As Point2dCollection
	Get
	Set
public:
property Point2dCollection^ SourcePonints {
	Point2dCollection^ get ();
	void set (Point2dCollection^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)