Reference Library
ExternalEntityKind Enumeration
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalEntityKind
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum ExternalEntityKind
Public Enumeration ExternalEntityKind
public enum class ExternalEntityKind
 Members
Member | Description
ExternalEntityUndefined
AcisEntity
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)