Reference Library
FrameSetting Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FrameSetting
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbRasterVariables::FrameSettings")]
public enum FrameSetting
<WrapperAttribute("ZcDbRasterVariables::FrameSettings")> _
Public Enumeration FrameSetting
[WrapperAttribute(L"ZcDbRasterVariables::FrameSettings")]
public enum class FrameSetting
 Members
Member | Description
ImageFrameOnNoPlot
ImageFrameBelow
ImageFrameAbove
ImageFrameOff
ImageFrameInvalid
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)