Reference Library
m_pAbortLayerStateRestore Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »m_pAbortLayerStateRestore
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerStateEventHandler m_pAbortLayerStateRestore
Public m_pAbortLayerStateRestore As LayerStateEventHandler
public:
LayerStateEventHandler^ m_pAbortLayerStateRestore
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)