Reference Library
UnitType Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »UnitType(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual UnitType UnitType(
	int row,
	int column
)
Public Overridable Function UnitType ( _
	row As Integer, _
	column As Integer _
) As UnitType
public:
virtual UnitType UnitType(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)