Reference Library
DynamicDimension Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »DynamicDimension
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool DynamicDimension { get; set; }
Public Property DynamicDimension As Boolean
	Get
	Set
public:
property bool DynamicDimension {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)