Reference Library
SetAxes Method (majorAxis, minorAxis)
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc2d »SetAxes(Vector2d, Vector2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetAxes(
	Vector2d majorAxis,
	Vector2d minorAxis
)
Public Sub SetAxes ( _
	majorAxis As Vector2d, _
	minorAxis As Vector2d _
)
public:
void SetAxes(
	Vector2d majorAxis,
	Vector2d minorAxis
)
 Parameters
majorAxis(Vector2d)
minorAxis(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)