Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.Colors »TransparencyCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Transparency this[
	int index
] { get; set; }
Public Overridable Default Property Item ( _
	index As Integer _
) As Transparency
	Get
	Set
public:
virtual property Transparency default[int index] {
	Transparency get (int index);
	void set (int index, Transparency value);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)