Reference Library
GetContentColor Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »GetContentColor(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Color GetContentColor(
	int row,
	int column
)
Public Overridable Function GetContentColor ( _
	row As Integer, _
	column As Integer _
) As Color
public:
virtual Color^ GetContentColor(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)