Reference Library
LineSegment2d Class
Namespaces »ZwSoft.ZwCAD.Geometry »LineSegment2d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeLineSeg2d")]
public sealed class LineSegment2d : LinearEntity2d
<WrapperAttribute("ZcGeLineSeg2d")> _
Public NotInheritable Class LineSegment2d _
	Inherits LinearEntity2d
[WrapperAttribute(L"ZcGeLineSeg2d")]
public ref class LineSegment2d sealed : public LinearEntity2d
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
LineSegment2d(Point2d, Vector2d)
LineSegment2d(Point2d, Point2d)
LineSegment2d()
BaryComb(Double)
Create(IntPtr, Boolean)
EndPoint
GetBisector()
GetSegmentLength(Double, Double, Tolerance)
GetSegmentLength(Double, Double)
Length
MidPoint
Set(Curve2d, Curve2d, Double, Double)
Set(Curve2d, Point2d, Double)
Set(Point2d, Vector2d)
Set(Point2d, Point2d)
StartPoint
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity2d
|  |  | Curve2d
|  |  |  | LinearEntity2d
|  |  |  |  | LineSegment2d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)