Reference Library
UnderlayItem Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayDefinition »UnderlayItem
 Declaration Syntax
C# | Visual Basic | Visual C++
public UnderlayItem UnderlayItem { get; }
Public ReadOnly Property UnderlayItem As UnderlayItem
	Get
public:
property UnderlayItem^ UnderlayItem {
	UnderlayItem^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)