Reference Library
CreateView Method (pViewInfo)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ImpDevice »CreateView(ClientViewInfo)
 Declaration Syntax
C# | Visual Basic | Visual C++
public override View CreateView(
	ClientViewInfo pViewInfo
)
Public Overrides Function CreateView ( _
	pViewInfo As ClientViewInfo _
) As View
public:
virtual View^ CreateView(
	ClientViewInfo pViewInfo
) override
 Parameters
pViewInfo(ClientViewInfo)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)