Reference Library
IsMergedCell Method (row, col, range)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »IsMergedCell(Int32, Int32, CellRange)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsMergedCell(
	int row,
	int col,
	CellRange range
)
Public Function IsMergedCell ( _
	row As Integer, _
	col As Integer, _
	<OutAttribute> range As CellRange _
) As Boolean
public:
bool IsMergedCell(
	int row,
	int col,
	[OutAttribute] CellRange^ range
)
 Parameters
row(Int32)
col(Int32)
range(CellRange)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)