Reference Library
Dimscale Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimscale
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Unitless)]
public virtual double Dimscale { get; set; }
<UnitTypeAttribute(UnitType.Unitless)> _
Public Overridable Property Dimscale As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Unitless)]
public:
virtual property double Dimscale {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)