Reference Library
DisposableSelectionSet Constructor (selectionSet)
Namespaces »ZwSoft.ZwCAD.EditorInput »DisposableSelectionSet »DisposableSelectionSet(SelectionSetDelayMarshalled)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DisposableSelectionSet(
	SelectionSetDelayMarshalled selectionSet
)
Public Sub New ( _
	selectionSet As SelectionSetDelayMarshalled _
)
public:
DisposableSelectionSet(
	SelectionSetDelayMarshalled^ selectionSet
)
 Parameters
selectionSet(SelectionSetDelayMarshalled)
Assembly: ZwManaged (Module: ZwManaged)