Reference Library
ReferenceVector Property
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc3d »ReferenceVector
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d ReferenceVector { get; }
Public ReadOnly Property ReferenceVector As Vector3d
	Get
public:
property Vector3d ReferenceVector {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)