Reference Library
GetIsAutoScale Method (row, column, contentIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GetIsAutoScale(Int32, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool GetIsAutoScale(
	int row,
	int column,
	int contentIndex
)
Public Overridable Function GetIsAutoScale ( _
	row As Integer, _
	column As Integer, _
	contentIndex As Integer _
) As Boolean
public:
virtual bool GetIsAutoScale(
	int row,
	int column,
	int contentIndex
)
 Parameters
row(Int32)
column(Int32)
contentIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)