Reference Library
CompareTo Method (other)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectId »CompareTo(ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int CompareTo(
	ObjectId other
)
Public Function CompareTo ( _
	other As ObjectId _
) As Integer
public:
int CompareTo(
	ObjectId other
)
 Parameters
other(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)