Reference Library
GetPropertiesSupported Method
Namespaces »ZwSoft.ZwCAD.Colors »ColorConverter »GetPropertiesSupported()
 Members
Icon | Member | Description
GetPropertiesSupported()
GetPropertiesSupported(ITypeDescriptorContext)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)