Reference Library
SetFromGeCurve Method (geCurve, vec)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »SetFromGeCurve(Curve3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFromGeCurve(
	Curve3d geCurve,
	Vector3d vec
)
Public Sub SetFromGeCurve ( _
	geCurve As Curve3d, _
	vec As Vector3d _
)
public:
void SetFromGeCurve(
	Curve3d^ geCurve,
	Vector3d vec
)
 Parameters
geCurve(Curve3d)
vec(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)