Reference Library
RegAppZcadName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »RegAppZcadName
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string RegAppZcadName { get; }
Public Shared ReadOnly Property RegAppZcadName As String
	Get
public:
static property String^ RegAppZcadName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)