Reference Library
PatternDouble Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »PatternDouble
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool PatternDouble { get; set; }
Public Property PatternDouble As Boolean
	Get
	Set
public:
property bool PatternDouble {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)