Reference Library
SetInternalArray Method (col, newArray, count)
Namespaces »ZwSoft.ZwCAD.Runtime »Marshaler »SetInternalArray(DoubleCollection, Double[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static void SetInternalArray(
	DoubleCollection col,
	double[] newArray,
	int count
)
Public Shared Sub SetInternalArray ( _
	col As DoubleCollection, _
	newArray As Double(), _
	count As Integer _
)
public:
static void SetInternalArray(
	DoubleCollection^ col,
	array<double>^ newArray,
	int count
)
 Parameters
col(DoubleCollection)
newArray(Double[])
count(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)