Reference Library
CreateLoftedSurface Method (crossSections, guideCurves, pathCurve, loftOptions)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LoftedSurface »CreateLoftedSurface(Entity[], Entity[], Entity, LoftOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void CreateLoftedSurface(
	Entity[] crossSections,
	Entity[] guideCurves,
	Entity pathCurve,
	LoftOptions loftOptions
)
Public Overridable Sub CreateLoftedSurface ( _
	crossSections As Entity(), _
	guideCurves As Entity(), _
	pathCurve As Entity, _
	loftOptions As LoftOptions _
)
public:
virtual void CreateLoftedSurface(
	array<Entity^>^ crossSections,
	array<Entity^>^ guideCurves,
	Entity^ pathCurve,
	LoftOptions^ loftOptions
)
 Parameters
crossSections(Entity[])
guideCurves(Entity[])
pathCurve(Entity)
loftOptions(LoftOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)