Reference Library
Dimtzin Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimtzin
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Dimtzin { get; set; }
Public Overridable Property Dimtzin As Integer
	Get
	Set
public:
virtual property int Dimtzin {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)