Reference Library
ToArray Method
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2dCollection »ToArray()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector2d[] ToArray()
Public Function ToArray As Vector2d()
public:
virtual array<Vector2d>^ ToArray() sealed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)