Reference Library
Result Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionResultEventArgs »Result
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptSelectionResult Result { get; }
Public ReadOnly Property Result As PromptSelectionResult
	Get
public:
property PromptSelectionResult^ Result {
	PromptSelectionResult^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)