Reference Library
GetTangent Method (point, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc2d »GetTangent(Point2d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Line2d GetTangent(
	Point2d point,
	Tolerance tolerance
)
Public Function GetTangent ( _
	point As Point2d, _
	tolerance As Tolerance _
) As Line2d
public:
Line2d^ GetTangent(
	Point2d point,
	Tolerance tolerance
)
 Parameters
point(Point2d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)