Reference Library
CenterMarkType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »CenterMarkType
 Declaration Syntax
C# | Visual Basic | Visual C++
public DimensionCenterMarkType CenterMarkType { get; }
Public ReadOnly Property CenterMarkType As DimensionCenterMarkType
	Get
public:
property DimensionCenterMarkType CenterMarkType {
	DimensionCenterMarkType get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)