Reference Library
SetPerspectiveCamera Method (fromPoint)
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »SpatialFilter »SetPerspectiveCamera(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetPerspectiveCamera(
	Point3d fromPoint
)
Public Sub SetPerspectiveCamera ( _
	fromPoint As Point3d _
)
public:
void SetPerspectiveCamera(
	Point3d fromPoint
)
 Parameters
fromPoint(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)