Reference Library
String Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Variant »String
 Declaration Syntax
C# | Visual Basic | Visual C++
public string String { get; set; }
Public Property String As String
	Get
	Set
public:
property String^ String {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)