Reference Library
Options Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptPointOptionsEventArgs »Options
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptPointOptions Options { get; }
Public ReadOnly Property Options As PromptPointOptions
	Get
public:
property PromptPointOptions^ Options {
	PromptPointOptions^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)