Reference Library
Elements Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MlineStyle »Elements
 Declaration Syntax
C# | Visual Basic | Visual C++
public MlineStyleElementCollection Elements { get; }
Public ReadOnly Property Elements As MlineStyleElementCollection
	Get
public:
property MlineStyleElementCollection^ Elements {
	MlineStyleElementCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)