Reference Library
ModelType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettings »ModelType
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool ModelType { get; }
Public ReadOnly Property ModelType As Boolean
	Get
public:
property bool ModelType {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)