Reference Library
Add Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObjectCollection »Add(DBObject)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Add(
	DBObject value
)
Public Function Add ( _
	value As DBObject _
) As Integer
public:
int Add(
	DBObject^ value
)
 Parameters
value(DBObject)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)