Reference Library
PointOnCurve2d Constructor (curve, parameter)
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve2d »PointOnCurve2d(Curve2d, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnCurve2d(
	Curve2d curve,
	double parameter
)
Public Sub New ( _
	curve As Curve2d, _
	parameter As Double _
)
public:
PointOnCurve2d(
	Curve2d^ curve,
	double parameter
)
 Parameters
curve(Curve2d)
parameter(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)