Reference Library
XrefPreXrefLockFile Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »XrefPreXrefLockFile
 Declaration Syntax
C# | Visual Basic | Visual C++
public event XrefPreXrefLockFileEventHandler XrefPreXrefLockFile
Public Event XrefPreXrefLockFile As XrefPreXrefLockFileEventHandler
public:
 event XrefPreXrefLockFileEventHandler^ XrefPreXrefLockFile {
	void add (XrefPreXrefLockFileEventHandler^ value);
	void remove (XrefPreXrefLockFileEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)