Reference Library
DockEnabled Property
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »DockEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public DockSides DockEnabled { get; set; }
Public Property DockEnabled As DockSides
	Get
	Set
public:
property DockSides DockEnabled {
	DockSides get ();
	void set (DockSides value);
}
Assembly: ZwManaged (Module: ZwManaged)