Reference Library
CubicSplineCurve2d Constructor (curve, epsilon)
Namespaces »ZwSoft.ZwCAD.Geometry »CubicSplineCurve2d »CubicSplineCurve2d(Curve2d, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CubicSplineCurve2d(
	Curve2d curve,
	double epsilon
)
Public Sub New ( _
	curve As Curve2d, _
	epsilon As Double _
)
public:
CubicSplineCurve2d(
	Curve2d^ curve,
	double epsilon
)
 Parameters
curve(Curve2d)
epsilon(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)