Reference Library
Value Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellContent »Value
 Declaration Syntax
C# | Visual Basic | Visual C++
public Object Value { get; set; }
Public Property Value As Object
	Get
	Set
public:
property Object^ Value {
	Object^ get ();
	void set (Object^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)