Reference Library
LoftOptions Constructor (opts)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LoftOptions »LoftOptions(LoftOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LoftOptions(
	LoftOptions opts
)
Public Sub New ( _
	opts As LoftOptions _
)
public:
LoftOptions(
	LoftOptions^ opts
)
 Parameters
opts(LoftOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)