Reference Library
FieldId Method (row, col)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »FieldId(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId FieldId(
	int row,
	int col
)
Public Overridable Function FieldId ( _
	row As Integer, _
	col As Integer _
) As ObjectId
public:
virtual ObjectId FieldId(
	int row,
	int col
)
 Parameters
row(Int32)
col(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)