Reference Library
AddKnot Method (newKnot)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »AddKnot(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AddKnot(
	double newKnot
)
Public Sub AddKnot ( _
	newKnot As Double _
)
public:
void AddKnot(
	double newKnot
)
 Parameters
newKnot(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)