Reference Library
IndexOf Method (p)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3dCollection »IndexOf(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int IndexOf(
	Point3d p
)
Public Function IndexOf ( _
	p As Point3d _
) As Integer
public:
int IndexOf(
	Point3d p
)
 Parameters
p(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)