Reference Library
AddSubEntity Method (value)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptForSelectionEndingEventArgs »AddSubEntity(SelectedSubObject)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AddSubEntity(
	SelectedSubObject value
)
Public Sub AddSubEntity ( _
	value As SelectedSubObject _
)
public:
void AddSubEntity(
	SelectedSubObject^ value
)
 Parameters
value(SelectedSubObject)
Assembly: ZwManaged (Module: ZwManaged)