Reference Library
GetSelection Method
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »GetSelection()
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptSelectionResult GetSelection()
Public Function GetSelection As PromptSelectionResult
public:
PromptSelectionResult^ GetSelection()
Assembly: ZwManaged (Module: ZwManaged)