Reference Library
AddFirstVertex Method (leaderLineIndex, point)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »AddFirstVertex(Int32, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AddFirstVertex(
	int leaderLineIndex,
	Point3d point
)
Public Sub AddFirstVertex ( _
	leaderLineIndex As Integer, _
	point As Point3d _
)
public:
void AddFirstVertex(
	int leaderLineIndex,
	Point3d point
)
 Parameters
leaderLineIndex(Int32)
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)