Reference Library
AppendAttribute Method (attributeToAddToBlockReference)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AttributeCollection »AppendAttribute(AttributeReference)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId AppendAttribute(
	AttributeReference attributeToAddToBlockReference
)
Public Function AppendAttribute ( _
	attributeToAddToBlockReference As AttributeReference _
) As ObjectId
public:
ObjectId AppendAttribute(
	AttributeReference^ attributeToAddToBlockReference
)
 Parameters
attributeToAddToBlockReference(AttributeReference)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)