Reference Library
PatternSpace Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »PatternSpace
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public double PatternSpace { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Property PatternSpace As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
property double PatternSpace {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)