Reference Library
Zoom Method (factor)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »Zoom(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Zoom(
	double factor
)
Public Sub Zoom ( _
	factor As Double _
)
public:
void Zoom(
	double factor
)
 Parameters
factor(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)