Reference Library
GetEntity Method (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »GetEntity(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptEntityResult GetEntity(
	string message
)
Public Function GetEntity ( _
	message As String _
) As PromptEntityResult
public:
PromptEntityResult^ GetEntity(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)