Reference Library
SetMargin Method (row, column, margin, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetMargin(Int32, Int32, CellMargins, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetMargin(
	int row,
	int column,
	CellMargins margin,
	double value
)
Public Overridable Sub SetMargin ( _
	row As Integer, _
	column As Integer, _
	margin As CellMargins, _
	value As Double _
)
public:
virtual void SetMargin(
	int row,
	int column,
	CellMargins margin,
	double value
)
 Parameters
row(Int32)
column(Int32)
margin(CellMargins)
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)