Reference Library
GetFileNameForOpen Method (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »GetFileNameForOpen(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptFileNameResult GetFileNameForOpen(
	string message
)
Public Function GetFileNameForOpen ( _
	message As String _
) As PromptFileNameResult
public:
PromptFileNameResult^ GetFileNameForOpen(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)