Reference Library
WrappedClass Property
Namespaces »ZwSoft.ZwCAD.Runtime »WrapperAttribute »WrappedClass
 Declaration Syntax
C# | Visual Basic | Visual C++
public string WrappedClass { get; set; }
Public Property WrappedClass As String
	Get
	Set
public:
property String^ WrappedClass {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)