Reference Library
VisualStyleId Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »VisualStyleId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId VisualStyleId { get; set; }
Public Property VisualStyleId As ObjectId
	Get
	Set
public:
property ObjectId VisualStyleId {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)