Reference Library
LightTraits Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »LightTraits
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiLightTraits")]
public abstract class LightTraits : NonEntityTraits
<WrapperAttribute("ZcGiLightTraits")> _
Public MustInherit Class LightTraits _
	Inherits NonEntityTraits
[WrapperAttribute(L"ZcGiLightTraits")]
public ref class LightTraits abstract : public NonEntityTraits
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
LightTraits(IntPtr, Boolean)
LightTraits()
On
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | DrawableTraits
|  |  |  | SubEntityTraits
|  |  |  |  | NonEntityTraits
|  |  |  |  |  | LightTraits
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)