Reference Library
SystemVariableChanged Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »SystemVariableChanged
 Declaration Syntax
C# | Visual Basic | Visual C++
public static event SystemVariableChangedEventHandler SystemVariableChanged
Public Shared Event SystemVariableChanged As SystemVariableChangedEventHandler
public:
static  event SystemVariableChangedEventHandler^ SystemVariableChanged {
	void add (SystemVariableChangedEventHandler^ value);
	void remove (SystemVariableChangedEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)