Reference Library
GetClipBoundary Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImage »GetClipBoundary()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Point2dCollection GetClipBoundary()
Public Overridable Function GetClipBoundary As Point2dCollection
public:
virtual Point2dCollection^ GetClipBoundary()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)