Reference Library
NumSections Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionManager »NumSections
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumSections { get; }
Public ReadOnly Property NumSections As Integer
	Get
public:
property int NumSections {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)