Reference Library
GetParameterOf Method
Namespaces »ZwSoft.ZwCAD.Geometry »Line2d »GetParameterOf()
 Members
Icon | Member | Description
GetParameterOf(Point2d, Tolerance)
GetParameterOf(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)