Reference Library
GlobalToLocalParameter Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »CompositeCurve2d »GlobalToLocalParameter(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CompositeParameter GlobalToLocalParameter(
	double value
)
Public Function GlobalToLocalParameter ( _
	value As Double _
) As CompositeParameter
public:
CompositeParameter GlobalToLocalParameter(
	double value
)
 Parameters
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)