Reference Library
IsEqualTo Method (a)
Namespaces »ZwSoft.ZwCAD.Geometry »CoordinateSystem3d »IsEqualTo(CoordinateSystem3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	CoordinateSystem3d a
)
Public Function IsEqualTo ( _
	a As CoordinateSystem3d _
) As Boolean
public:
bool IsEqualTo(
	CoordinateSystem3d a
)
 Parameters
a(CoordinateSystem3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)