Reference Library
NurbsData Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Spline »NurbsData
 Declaration Syntax
C# | Visual Basic | Visual C++
public NurbsData NurbsData { get; set; }
Public Property NurbsData As NurbsData
	Get
	Set
public:
property NurbsData NurbsData {
	NurbsData get ();
	void set (NurbsData value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)