Reference Library
SubViewportDrawLogicalFlags Method (vd)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Drawable »SubViewportDrawLogicalFlags(ViewportDraw)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal abstract int SubViewportDrawLogicalFlags(
	ViewportDraw vd
)
Protected Friend MustOverride Function SubViewportDrawLogicalFlags ( _
	vd As ViewportDraw _
) As Integer
protected public:
virtual int SubViewportDrawLogicalFlags(
	ViewportDraw^ vd
) abstract
 Parameters
vd(ViewportDraw)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)