Reference Library
GetLength Method (fromParameter, toParameter)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »GetLength(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetLength(
	double fromParameter,
	double toParameter
)
Public Function GetLength ( _
	fromParameter As Double, _
	toParameter As Double _
) As Double
public:
double GetLength(
	double fromParameter,
	double toParameter
)
 Parameters
fromParameter(Double)
toParameter(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)