Reference Library
GetXrefNode Method (db)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefGraph »GetXrefNode(Database)
 Declaration Syntax
C# | Visual Basic | Visual C++
public XrefGraphNode GetXrefNode(
	Database db
)
Public Function GetXrefNode ( _
	db As Database _
) As XrefGraphNode
public:
XrefGraphNode^ GetXrefNode(
	Database^ db
)
 Parameters
db(Database)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)