Reference Library
Dimadec Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimadec
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Dimadec { get; set; }
Public Overridable Property Dimadec As Integer
	Get
	Set
public:
virtual property int Dimadec {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)