Reference Library
Planar Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolveOptionsCheckRevolveCurveOut »Planar
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Planar { get; }
Public ReadOnly Property Planar As Boolean
	Get
public:
property bool Planar {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)