Reference Library
Filter Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »Filter
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbFilter")]
public abstract class Filter : DBObject
<WrapperAttribute("AcDbFilter")> _
Public MustInherit Class Filter _
	Inherits DBObject
[WrapperAttribute(L"AcDbFilter")]
public ref class Filter abstract : public DBObject
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Filter(IntPtr, Boolean)
IndexClass
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Filter
|  |  |  |  |  | LayerFilter
|  |  |  |  |  | SpatialFilter
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)