Reference Library
setRGB Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PixelFormatInfo »setRGB()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void setRGB()
Public Sub setRGB
public:
void setRGB()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)