Reference Library
TextHeight Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »TextHeight
 Declaration Syntax
C# | Visual Basic | Visual C++
public Nullable<double> TextHeight { get; set; }
Public Property TextHeight As Nullable(Of Double)
	Get
	Set
public:
property Nullable<double> TextHeight {
	Nullable<double> get ();
	void set (Nullable<double> value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)