Reference Library
Remove Method (index)
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionAddedEventArgs »Remove(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Remove(
	int index
)
Public Sub Remove ( _
	index As Integer _
)
public:
void Remove(
	int index
)
 Parameters
index(Int32)
Assembly: ZwManaged (Module: ZwManaged)