Reference Library
Scale2d Structure
Namespaces »ZwSoft.ZwCAD.Geometry »Scale2d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeScale2d")]
public struct Scale2d
<WrapperAttribute("ZcGeScale2d")> _
Public Structure Scale2d
[WrapperAttribute(L"ZcGeScale2d")]
public value class Scale2d
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Scale2d(Double, Double)
Scale2d(Double)
Scale2d(Double[])
Coordinate[Int32]
Equality(Scale2d, Scale2d)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
ExtractScale(Matrix2d)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
GetMatrix()
Inequality(Scale2d, Scale2d)
Inverse()
IsEqualTo(Scale2d, Tolerance)
IsEqualTo(Scale2d)
IsProportional(Tolerance)
IsProportional()
Multiply(Double, Scale2d)
Multiply(Scale2d, Double)
Multiply(Scale2d, Scale2d)
MultiplyBy(Double)
PostMultiplyBy(Scale2d)
PreMultiplyBy(Scale2d)
RemoveScale(Matrix2d)
ToArray()
ToString(IFormatProvider)
ToString() |  (Overrides ValueType.ToString().)
X
Y
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)