Reference Library
Bulge Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BulgeVertex »Bulge
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Unitless)]
public double Bulge { get; set; }
<UnitTypeAttribute(UnitType.Unitless)> _
Public Property Bulge As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Unitless)]
public:
property double Bulge {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)