Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionSetDelayMarshalled »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed IEnumerator GetEnumerator()
Public Overrides NotOverridable Function GetEnumerator As IEnumerator
public:
virtual IEnumerator^ GetEnumerator() override sealed
Assembly: ZwManaged (Module: ZwManaged)