Reference Library
GetPoint Method (surface, point)
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnSurface »GetPoint(Surface, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Point3d GetPoint(
	Surface surface,
	Point2d point
)
Public Shared Function GetPoint ( _
	surface As Surface, _
	point As Point2d _
) As Point3d
public:
static Point3d GetPoint(
	Surface^ surface,
	Point2d point
)
 Parameters
surface(Surface)
point(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)