Reference Library
NumberOfControlPoints Property
Namespaces »ZwSoft.ZwCAD.Geometry »SplineEntity3d »NumberOfControlPoints
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumberOfControlPoints { get; }
Public ReadOnly Property NumberOfControlPoints As Integer
	Get
public:
property int NumberOfControlPoints {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)