Reference Library
Set Method (firstCorner, secondCorner)
Namespaces »ZwSoft.ZwCAD.Geometry »ClipBoundary2d »Set(Point2d, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ClipError Set(
	Point2d firstCorner,
	Point2d secondCorner
)
Public Function Set ( _
	firstCorner As Point2d, _
	secondCorner As Point2d _
) As ClipError
public:
ClipError Set(
	Point2d firstCorner,
	Point2d secondCorner
)
 Parameters
firstCorner(Point2d)
secondCorner(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)