Reference Library
Post Method (dimId, dimAssocId, isActive)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimAssoc »Post(ObjectId, ObjectId, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Post(
	ObjectId dimId,
	ObjectId dimAssocId,
	bool isActive
)
Public Sub Post ( _
	dimId As ObjectId, _
	dimAssocId As ObjectId, _
	isActive As Boolean _
)
public:
void Post(
	ObjectId dimId,
	ObjectId dimAssocId,
	bool isActive
)
 Parameters
dimId(ObjectId)
dimAssocId(ObjectId)
isActive(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)