Reference Library
Solid3d Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »Solid3d(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal Solid3d(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
protected public:
Solid3d(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)