Reference Library
Mode Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Mode
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum Mode
Public Enumeration Mode
public enum class Mode
 Members
Member | Description
Advanced
Realistic
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)