Reference Library
PointMonitor Event
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »PointMonitor
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PointMonitorEventHandler PointMonitor
Public Event PointMonitor As PointMonitorEventHandler
public:
 event PointMonitorEventHandler^ PointMonitor {
	void add (PointMonitorEventHandler^ value);
	void remove (PointMonitorEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)