Reference Library
OpenImage Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImageDef »OpenImage()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual IntPtr OpenImage()
Public Overridable Function OpenImage As IntPtr
public:
virtual IntPtr OpenImage()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)