Reference Library
FindCycles Method (start)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Graph »FindCycles(GraphNode)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool FindCycles(
	GraphNode start
)
Public Overridable Function FindCycles ( _
	start As GraphNode _
) As Boolean
public:
virtual bool FindCycles(
	GraphNode^ start
)
 Parameters
start(GraphNode)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)