Reference Library
AddNewlyCreatedDBObject Method (obj, add)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Transaction »AddNewlyCreatedDBObject(DBObject, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void AddNewlyCreatedDBObject(
	DBObject obj,
	bool add
)
Public Overridable Sub AddNewlyCreatedDBObject ( _
	obj As DBObject, _
	add As Boolean _
)
public:
virtual void AddNewlyCreatedDBObject(
	DBObject^ obj,
	bool add
)
 Parameters
obj(DBObject)
add(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)