Reference Library
BlockId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DrawOrderTable »BlockId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId BlockId { get; set; }
Public Property BlockId As ObjectId
	Get
	Set
public:
property ObjectId BlockId {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)