Reference Library
AmbientLightColor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »AmbientLightColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color AmbientLightColor { get; set; }
Public Property AmbientLightColor As Color
	Get
	Set
public:
property Color^ AmbientLightColor {
	Color^ get ();
	void set (Color^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)