Reference Library
SetTrait Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBVisualStyle »SetTrait()
 Members
Icon | Member | Description
SetTrait(VisualStyleProperty, Double, Double, Double, VisualStyleOperation)
SetTrait(VisualStyleProperty, Int32, VisualStyleOperation)
SetTrait(VisualStyleProperty, Double, VisualStyleOperation)
SetTrait(VisualStyleProperty, Boolean, VisualStyleOperation)
SetTrait(VisualStyleProperty, Variant, VisualStyleOperation)
SetTrait(VisualStyleProperty, Color, VisualStyleOperation)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)