Reference Library
LayerFilter Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »LayerFilter »LayerFilter()
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerFilter()
Public Sub New
public:
LayerFilter()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)