Reference Library
MaterialDictionaryId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »MaterialDictionaryId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId MaterialDictionaryId { get; }
Public ReadOnly Property MaterialDictionaryId As ObjectId
	Get
public:
property ObjectId MaterialDictionaryId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)