Reference Library
HasHookLine Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Leader »HasHookLine
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool HasHookLine { get; }
Public Overridable ReadOnly Property HasHookLine As Boolean
	Get
public:
virtual property bool HasHookLine {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)