Reference Library
MaterialId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »MaterialId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId MaterialId { get; set; }
Public Property MaterialId As ObjectId
	Get
	Set
public:
property ObjectId MaterialId {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)