Reference Library
WriteScale3d Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »WriteScale3d(Scale3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void WriteScale3d(
	Scale3d value
)
Public MustOverride Sub WriteScale3d ( _
	value As Scale3d _
)
public:
virtual void WriteScale3d(
	Scale3d value
) abstract
 Parameters
value(Scale3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)