Reference Library
IntersectWith Method (entityPointer, intersectType, points, thisGraphicSystemMarker, otherGraphicSystemMarker)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »IntersectWith(Entity, Intersect, Point3dCollection, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use the overload taking IntPtr instead.")]
public virtual void IntersectWith(
	Entity entityPointer,
	Intersect intersectType,
	Point3dCollection points,
	int thisGraphicSystemMarker,
	int otherGraphicSystemMarker
)
<ObsoleteAttribute("Use the overload taking IntPtr instead.")> _
Public Overridable Sub IntersectWith ( _
	entityPointer As Entity, _
	intersectType As Intersect, _
	points As Point3dCollection, _
	thisGraphicSystemMarker As Integer, _
	otherGraphicSystemMarker As Integer _
)
[ObsoleteAttribute(L"Use the overload taking IntPtr instead.")]
public:
virtual void IntersectWith(
	Entity^ entityPointer,
	Intersect intersectType,
	Point3dCollection^ points,
	int thisGraphicSystemMarker,
	int otherGraphicSystemMarker
)
 Parameters
entityPointer(Entity)
intersectType(Intersect)
points(Point3dCollection)
thisGraphicSystemMarker(Int32)
otherGraphicSystemMarker(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)