Reference Library
HaloGap Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »HaloGap
 Declaration Syntax
C# | Visual Basic | Visual C++
public int HaloGap { get; set; }
Public Property HaloGap As Integer
	Get
	Set
public:
property int HaloGap {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)