Reference Library
CreateExtrudedSolid Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »CreateExtrudedSolid()
 Members
Icon | Member | Description
CreateExtrudedSolid(Entity, SubentityId, Double, SweepOptions)
CreateExtrudedSolid(Entity, SubentityId, Vector3d, SweepOptions)
CreateExtrudedSolid(Entity, Vector3d, SweepOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)