Reference Library
MergeStyle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »MergeStyle
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual DuplicateRecordCloning MergeStyle { get; set; }
Public Overridable Property MergeStyle As DuplicateRecordCloning
	Get
	Set
public:
virtual property DuplicateRecordCloning MergeStyle {
	DuplicateRecordCloning get ();
	void set (DuplicateRecordCloning value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)