Reference Library
PlotViewportBorders Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettings »PlotViewportBorders
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool PlotViewportBorders { get; set; }
Public Property PlotViewportBorders As Boolean
	Get
	Set
public:
property bool PlotViewportBorders {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)