Reference Library
OriginalFileSavedByVersion Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »OriginalFileSavedByVersion
 Declaration Syntax
C# | Visual Basic | Visual C++
public DwgVersion OriginalFileSavedByVersion { get; }
Public ReadOnly Property OriginalFileSavedByVersion As DwgVersion
	Get
public:
property DwgVersion OriginalFileSavedByVersion {
	DwgVersion get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)