Reference Library
StackBottom Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MTextFragment »StackBottom
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool StackBottom { get; }
Public ReadOnly Property StackBottom As Boolean
	Get
public:
property bool StackBottom {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)