Reference Library
CustomPrintScale Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettings »CustomPrintScale
 Declaration Syntax
C# | Visual Basic | Visual C++
public CustomScale CustomPrintScale { get; }
Public ReadOnly Property CustomPrintScale As CustomScale
	Get
public:
property CustomScale CustomPrintScale {
	CustomScale get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)