Reference Library
PaletteSetStateEventArgs Class
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSetStateEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PaletteSetStateEventArgs : EventArgs
Public NotInheritable Class PaletteSetStateEventArgs _
	Inherits EventArgs
public ref class PaletteSetStateEventArgs sealed : public EventArgs
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PaletteSetStateEventArgs(StateEventIndex)
NewState
 Inheritance Hierarchy
Object
EventArgs
| PaletteSetStateEventArgs
Assembly: ZwManaged (Module: ZwManaged)