Reference Library
Blue Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PixelBGRA32 »Blue
 Declaration Syntax
C# | Visual Basic | Visual C++
public byte Blue { get; set; }
Public Property Blue As Byte
	Get
	Set
public:
property unsigned char Blue {
	unsigned char get ();
	void set (unsigned char value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)