Reference Library
IsLinetypeOverridden Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerViewportProperties »IsLinetypeOverridden
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsLinetypeOverridden { get; set; }
Public Property IsLinetypeOverridden As Boolean
	Get
	Set
public:
property bool IsLinetypeOverridden {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)