Reference Library
DispSilh Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »DispSilh
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool DispSilh { get; set; }
Public Property DispSilh As Boolean
	Get
	Set
public:
property bool DispSilh {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)