Reference Library
Set Method (majorRadius, minorRadius, origin, axisOfSymmetry)
Namespaces »ZwSoft.ZwCAD.Geometry »Torus »Set(Double, Double, Point3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	double majorRadius,
	double minorRadius,
	Point3d origin,
	Vector3d axisOfSymmetry
)
Public Sub Set ( _
	majorRadius As Double, _
	minorRadius As Double, _
	origin As Point3d, _
	axisOfSymmetry As Vector3d _
)
public:
void Set(
	double majorRadius,
	double minorRadius,
	Point3d origin,
	Vector3d axisOfSymmetry
)
 Parameters
majorRadius(Double)
minorRadius(Double)
origin(Point3d)
axisOfSymmetry(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)