Reference Library
Style Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »Style
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Style { get; set; }
Public Property Style As String
	Get
	Set
public:
property String^ Style {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)