Reference Library
IsDefined Property
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalBoundedSurface »IsDefined
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsDefined { get; }
Public ReadOnly Property IsDefined As Boolean
	Get
public:
property bool IsDefined {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)