Reference Library
GetField Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LineAngularDimension2 »GetField()
 Members
Icon | Member | Description
GetField(String)
GetField()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)