Reference Library
GetSourceObjects Method (nSecType, ids)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »GetSourceObjects(SectionType, ObjectIdCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void GetSourceObjects(
	SectionType nSecType,
	ObjectIdCollection ids
)
Public Sub GetSourceObjects ( _
	nSecType As SectionType, _
	ids As ObjectIdCollection _
)
public:
void GetSourceObjects(
	SectionType nSecType,
	ObjectIdCollection^ ids
)
 Parameters
nSecType(SectionType)
ids(ObjectIdCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)