Reference Library
TemporaryDwfFileName Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishEventArgs »TemporaryDwfFileName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string TemporaryDwfFileName { get; }
Public ReadOnly Property TemporaryDwfFileName As String
	Get
public:
property String^ TemporaryDwfFileName {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)