Reference Library
DocumentDestroyedEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentDestroyedEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void DocumentDestroyedEventHandler(
	Object sender,
	DocumentDestroyedEventArgs e
)
Public Delegate Sub DocumentDestroyedEventHandler ( _
	sender As Object, _
	e As DocumentDestroyedEventArgs _
)
public delegate void DocumentDestroyedEventHandler(
	Object^ sender,
	DocumentDestroyedEventArgs^ e
)
 Parameters
sender(Object)
e(DocumentDestroyedEventArgs)
Assembly: ZwManaged (Module: ZwManaged)