Reference Library
UcsName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AbstractViewTableRecord »UcsName
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId UcsName { get; }
Public ReadOnly Property UcsName As ObjectId
	Get
public:
property ObjectId UcsName {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)