Reference Library
Description Property
Namespaces »ZwSoft.ZwCAD.Colors »Color »Description
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Description { get; }
Public ReadOnly Property Description As String
	Get
public:
property String^ Description {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)