Reference Library
PlotStyleMode Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »PlotStyleMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool PlotStyleMode { get; }
Public ReadOnly Property PlotStyleMode As Boolean
	Get
public:
property bool PlotStyleMode {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)