Reference Library
LispDataType Enumeration
Namespaces »ZwSoft.ZwCAD.Runtime »LispDataType
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum LispDataType
Public Enumeration LispDataType
public enum class LispDataType
 Members
Member | Description
SelectionSet
Text
Point3d
ObjectId
Angle
Point2d
T_atom
Nil
DottedPair
ListEnd
ListBegin
Void
Int32
Orientation
Int16
Double
None
Assembly: ZwManaged (Module: ZwManaged)