Reference Library
IntersectPoint Method (number)
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersector »IntersectPoint(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d IntersectPoint(
	int number
)
Public Function IntersectPoint ( _
	number As Integer _
) As Point3d
public:
Point3d IntersectPoint(
	int number
)
 Parameters
number(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)