Reference Library
IsDynamicBlock Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockTableRecord »IsDynamicBlock
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsDynamicBlock { get; }
Public ReadOnly Property IsDynamicBlock As Boolean
	Get
public:
property bool IsDynamicBlock {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)