Reference Library
LayerViewportProperties Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerViewportProperties
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class LayerViewportProperties
Public NotInheritable Class LayerViewportProperties
public ref class LayerViewportProperties sealed
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Color
IsColorOverridden
IsLinetypeOverridden
IsLineWeightOverridden
IsPlotStyleOverridden
LinetypeObjectId
LineWeight
PlotStyleName
PlotStyleNameId
RemoveOverrides()
 Inheritance Hierarchy
Object
LayerViewportProperties
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)