Reference Library
LinetypeObjectId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerTableRecord »LinetypeObjectId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId LinetypeObjectId { get; set; }
Public Property LinetypeObjectId As ObjectId
	Get
	Set
public:
property ObjectId LinetypeObjectId {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)