Reference Library
LoftedSurface Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LoftedSurface »LoftedSurface()
 Declaration Syntax
C# | Visual Basic | Visual C++
public LoftedSurface()
Public Sub New
public:
LoftedSurface()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)