Reference Library
GetHalfAngles Method
Namespaces »ZwSoft.ZwCAD.Geometry »Cone »GetHalfAngles()
 Declaration Syntax
C# | Visual Basic | Visual C++
public double[] GetHalfAngles()
Public Function GetHalfAngles As Double()
public:
array<double>^ GetHalfAngles()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)