Reference Library
Float Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Variant »Float
 Declaration Syntax
C# | Visual Basic | Visual C++
public float Float { get; set; }
Public Property Float As Single
	Get
	Set
public:
property float Float {
	float get ();
	void set (float value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)