Reference Library
ToolTipText Property
Namespaces »ZwSoft.ZwCAD.Windows »StatusBarItem »ToolTipText
 Declaration Syntax
C# | Visual Basic | Visual C++
public string ToolTipText { get; set; }
Public Property ToolTipText As String
	Get
	Set
public:
property String^ ToolTipText {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwManaged (Module: ZwManaged)