Reference Library
GetNearestLineWeight Method (weight)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »GetNearestLineWeight(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LineWeight GetNearestLineWeight(
	int weight
)
Public Function GetNearestLineWeight ( _
	weight As Integer _
) As LineWeight
public:
LineWeight GetNearestLineWeight(
	int weight
)
 Parameters
weight(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)