Reference Library
IsReadOnly Property
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3dCollection »IsReadOnly
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool IsReadOnly { get; }
Public Overridable ReadOnly Property IsReadOnly As Boolean
	Get
public:
virtual property bool IsReadOnly {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)