Reference Library
IsInverse Method (inv)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »IsInverse(Matrix3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsInverse(
	Matrix3d inv
)
Public Function IsInverse ( _
	inv As Matrix3d _
) As Boolean
public:
bool IsInverse(
	Matrix3d inv
)
 Parameters
inv(Matrix3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)