Reference Library
HasContext Method (contextName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectContextCollection »HasContext(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool HasContext(
	string contextName
)
Public Overridable Function HasContext ( _
	contextName As String _
) As Boolean
public:
virtual bool HasContext(
	String^ contextName
)
 Parameters
contextName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)