Reference Library
m_pLayoutToBeCopied Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »m_pLayoutToBeCopied
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayoutEventHandler m_pLayoutToBeCopied
Public m_pLayoutToBeCopied As LayoutEventHandler
public:
LayoutEventHandler^ m_pLayoutToBeCopied
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)