Reference Library
Message Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »PreTranslateMessageEventArgs »Message
 Declaration Syntax
C# | Visual Basic | Visual C++
public MSG Message { get; set; }
Public Property Message As MSG
	Get
	Set
public:
property MSG Message {
	MSG get ();
	void set (MSG value);
}
Assembly: ZwManaged (Module: ZwManaged)