Reference Library
InsertView Method (viewIndex, pView)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ImpDevice »InsertView(Int32, View)
 Declaration Syntax
C# | Visual Basic | Visual C++
public override void InsertView(
	int viewIndex,
	View pView
)
Public Overrides Sub InsertView ( _
	viewIndex As Integer, _
	pView As View _
)
public:
virtual void InsertView(
	int viewIndex,
	View^ pView
) override
 Parameters
viewIndex(Int32)
pView(View)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)