Reference Library
DataLinkOption Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataLink »DataLinkOption
 Declaration Syntax
C# | Visual Basic | Visual C++
public DataLinkOption DataLinkOption { get; set; }
Public Property DataLinkOption As DataLinkOption
	Get
	Set
public:
property DataLinkOption DataLinkOption {
	DataLinkOption get ();
	void set (DataLinkOption value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)