Reference Library
LispFunctionAttribute Class
Namespaces »ZwSoft.ZwCAD.Runtime »LispFunctionAttribute
 Declaration Syntax
C# | Visual Basic | Visual C++
[AttributeUsageAttribute(AttributeTargets.Method, AllowMultiple = true, Inherited = false)]
public sealed class LispFunctionAttribute : Attribute,
	ICommandLineCallable
<AttributeUsageAttribute(AttributeTargets.Method, AllowMultiple := True, Inherited := False)> _
Public NotInheritable Class LispFunctionAttribute _
	Inherits Attribute _
	Implements ICommandLineCallable
[AttributeUsageAttribute(AttributeTargets::Method, AllowMultiple = true, Inherited = false)]
public ref class LispFunctionAttribute sealed : public Attribute,
	ICommandLineCallable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
LispFunctionAttribute(String, String, String, String)
LispFunctionAttribute(String, String, String)
LispFunctionAttribute(String, String)
LispFunctionAttribute(String)
ContextMenuExtensionType
Flags
GlobalName
GroupName
HelpFileName
HelpTopic
LocalizedNameId
 Inheritance Hierarchy
Object
Attribute
| LispFunctionAttribute
Assembly: ZwManaged (Module: ZwManaged)