Reference Library
Dimtad Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimtad
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Dimtad { get; set; }
Public Property Dimtad As Integer
	Get
	Set
public:
property int Dimtad {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)