Reference Library
LeaderType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LeaderType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbMLeaderStyle::LeaderType")]
public enum LeaderType
<WrapperAttribute("ZcDbMLeaderStyle::LeaderType")> _
Public Enumeration LeaderType
[WrapperAttribute(L"ZcDbMLeaderStyle::LeaderType")]
public enum class LeaderType
 Members
Member | Description
SplineLeader
StraightLeader
InVisibleLeader
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)