Reference Library
FieldEvaluationStatus Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldEvaluationStatus
 Declaration Syntax
C# | Visual Basic | Visual C++
[FlagsAttribute]
public enum FieldEvaluationStatus
<FlagsAttribute> _
Public Enumeration FieldEvaluationStatus
[FlagsAttribute]
public enum class FieldEvaluationStatus
 Members
Member | Description
InvalidContext
OtherError
InvalidCode
SyntaxError
EvaluatorNotFound
Success
NotYetEvaluated
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)