Reference Library
RevisionNumber Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DatabaseSummaryInfo »RevisionNumber
 Declaration Syntax
C# | Visual Basic | Visual C++
public string RevisionNumber { get; }
Public ReadOnly Property RevisionNumber As String
	Get
public:
property String^ RevisionNumber {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)