Reference Library
GetFitPointAt Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Spline »GetFitPointAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d GetFitPointAt(
	int index
)
Public Function GetFitPointAt ( _
	index As Integer _
) As Point3d
public:
Point3d GetFitPointAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)