Reference Library
GetCustomData Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GetCustomData(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int GetCustomData(
	int row,
	int column
)
Public Overridable Function GetCustomData ( _
	row As Integer, _
	column As Integer _
) As Integer
public:
virtual int GetCustomData(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)