Reference Library
Solid Constructor (point1, point2, point3, point4)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid »Solid(Point3d, Point3d, Point3d, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Solid(
	Point3d point1,
	Point3d point2,
	Point3d point3,
	Point3d point4
)
Public Sub New ( _
	point1 As Point3d, _
	point2 As Point3d, _
	point3 As Point3d, _
	point4 As Point3d _
)
public:
Solid(
	Point3d point1,
	Point3d point2,
	Point3d point3,
	Point3d point4
)
 Parameters
point1(Point3d)
point2(Point3d)
point3(Point3d)
point4(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)