Reference Library
OrdinateDimension Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »OrdinateDimension »OrdinateDimension()
 Members
Icon | Member | Description
OrdinateDimension(Boolean, Point3d, Point3d, String, ObjectId)
OrdinateDimension(IntPtr, Boolean)
OrdinateDimension()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)