Reference Library
PushModelTransform Method (matrix)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »PushModelTransform(Matrix3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool PushModelTransform(
	Matrix3d matrix
)
Public MustOverride Function PushModelTransform ( _
	matrix As Matrix3d _
) As Boolean
public:
virtual bool PushModelTransform(
	Matrix3d matrix
) abstract
 Parameters
matrix(Matrix3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)