Reference Library
AppendColumn Method (type, columnName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataTable »AppendColumn(CellType, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void AppendColumn(
	CellType type,
	string columnName
)
Public Overridable Sub AppendColumn ( _
	type As CellType, _
	columnName As String _
)
public:
virtual void AppendColumn(
	CellType type,
	String^ columnName
)
 Parameters
type(CellType)
columnName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)