Reference Library
Add Method (value)
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerFilterCollection »Add(LayerFilter)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Add(
	LayerFilter value
)
Public Sub Add ( _
	value As LayerFilter _
)
public:
void Add(
	LayerFilter^ value
)
 Parameters
value(LayerFilter)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)