Reference Library
PlotInfoValidator Constructor
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotInfoValidator »PlotInfoValidator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlotInfoValidator()
Public Sub New
public:
PlotInfoValidator()
Assembly: ZwManaged (Module: ZwManaged)