Reference Library
SetTextStyle Method (row, col, id)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetTextStyle(Int32, Int32, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetTextStyle(
	int row,
	int col,
	ObjectId id
)
Public Overridable Sub SetTextStyle ( _
	row As Integer, _
	col As Integer, _
	id As ObjectId _
)
public:
virtual void SetTextStyle(
	int row,
	int col,
	ObjectId id
)
 Parameters
row(Int32)
col(Int32)
id(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)