Reference Library
SelectionDetails Class
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionDetails
 Declaration Syntax
C# | Visual Basic | Visual C++
public class SelectionDetails
Public Class SelectionDetails
public ref class SelectionDetails
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
GetContainers()
ToString(IFormatProvider)
ToString() |  (Overrides Object.ToString().)
Transform
 Inheritance Hierarchy
Object
SelectionDetails
Assembly: ZwManaged (Module: ZwManaged)