Reference Library
IsSplined Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Leader »IsSplined
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool IsSplined { get; set; }
Public Overridable Property IsSplined As Boolean
	Get
	Set
public:
virtual property bool IsSplined {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)