Reference Library
ScanLineSize Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »GIRasterImage »ScanLineSize
 Declaration Syntax
C# | Visual Basic | Visual C++
public uint ScanLineSize { get; }
Public ReadOnly Property ScanLineSize As UInteger
	Get
public:
property unsigned int ScanLineSize {
	unsigned int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)