Reference Library
PromptStringResultEventArgs Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptStringResultEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PromptStringResultEventArgs : EventArgs
Public NotInheritable Class PromptStringResultEventArgs _
	Inherits EventArgs
public ref class PromptStringResultEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Result
 Inheritance Hierarchy
Object
EventArgs
| PromptStringResultEventArgs
Assembly: ZwManaged (Module: ZwManaged)