Reference Library
JigPromptAngleOptions Constructor (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »JigPromptAngleOptions »JigPromptAngleOptions(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public JigPromptAngleOptions(
	string message
)
Public Sub New ( _
	message As String _
)
public:
JigPromptAngleOptions(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)