Reference Library
Cone Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Cone »Cone()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Cone()
Public Sub New
public:
Cone()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)