Reference Library
SwitchToPaperSpace Method
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »SwitchToPaperSpace()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SwitchToPaperSpace()
Public Sub SwitchToPaperSpace
public:
void SwitchToPaperSpace()
Assembly: ZwManaged (Module: ZwManaged)