Reference Library
ModelToWorldTransform Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »ModelToWorldTransform
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Matrix3d ModelToWorldTransform { get; }
Public MustOverride ReadOnly Property ModelToWorldTransform As Matrix3d
	Get
public:
virtual property Matrix3d ModelToWorldTransform {
	Matrix3d get () abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)