Reference Library
SetTrait Method (vsProp, bVal, vsOp)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBVisualStyle »SetTrait(VisualStyleProperty, Boolean, VisualStyleOperation)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetTrait(
	VisualStyleProperty vsProp,
	bool bVal,
	VisualStyleOperation vsOp
)
Public Sub SetTrait ( _
	vsProp As VisualStyleProperty, _
	bVal As Boolean, _
	vsOp As VisualStyleOperation _
)
public:
void SetTrait(
	VisualStyleProperty vsProp,
	bool bVal,
	VisualStyleOperation vsOp
)
 Parameters
vsProp(VisualStyleProperty)
bVal(Boolean)
vsOp(VisualStyleOperation)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)