Reference Library
Reset Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MlineStyleElementCollectionEnumerator »Reset()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Reset()
Public Sub Reset
public:
virtual void Reset() sealed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)