Reference Library
IsMerged Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »IsMerged
 Declaration Syntax
C# | Visual Basic | Visual C++
public Nullable<bool> IsMerged { get; }
Public ReadOnly Property IsMerged As Nullable(Of Boolean)
	Get
public:
property Nullable<bool> IsMerged {
	Nullable<bool> get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)