Reference Library
ShowModalWindow Method (owner, formToShow, persistSizeAndPosition)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »ShowModalWindow(Window, Window, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Nullable<bool> ShowModalWindow(
	Window owner,
	Window formToShow,
	bool persistSizeAndPosition
)
Public Shared Function ShowModalWindow ( _
	owner As Window, _
	formToShow As Window, _
	persistSizeAndPosition As Boolean _
) As Nullable(Of Boolean)
public:
static Nullable<bool> ShowModalWindow(
	Window^ owner,
	Window^ formToShow,
	bool persistSizeAndPosition
)
 Parameters
owner(Window)
formToShow(Window)
persistSizeAndPosition(Boolean)
Assembly: ZwManaged (Module: ZwManaged)