Reference Library
LayoutCount Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »LayoutCount
 Declaration Syntax
C# | Visual Basic | Visual C++
public int LayoutCount { get; }
Public ReadOnly Property LayoutCount As Integer
	Get
public:
property int LayoutCount {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)