Reference Library
NameOfSheet Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayReference »NameOfSheet
 Declaration Syntax
C# | Visual Basic | Visual C++
public string NameOfSheet { get; set; }
Public Property NameOfSheet As String
	Get
	Set
public:
property String^ NameOfSheet {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)