Reference Library
GizmosEnabled Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripData »GizmosEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool GizmosEnabled { get; set; }
Public Property GizmosEnabled As Boolean
	Get
	Set
public:
property bool GizmosEnabled {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)