Reference Library
BlockTableRecord Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockReference »BlockTableRecord
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId BlockTableRecord { get; set; }
Public Property BlockTableRecord As ObjectId
	Get
	Set
public:
property ObjectId BlockTableRecord {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)