Reference Library
BreakSize Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeaderStyle »BreakSize
 Declaration Syntax
C# | Visual Basic | Visual C++
public double BreakSize { get; set; }
Public Property BreakSize As Double
	Get
	Set
public:
property double BreakSize {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)