Reference Library
PreMultiplyBy Method (leftSide)
Namespaces »ZwSoft.ZwCAD.Geometry »Scale2d »PreMultiplyBy(Scale2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Scale2d PreMultiplyBy(
	Scale2d leftSide
)
Public Function PreMultiplyBy ( _
	leftSide As Scale2d _
) As Scale2d
public:
Scale2d PreMultiplyBy(
	Scale2d leftSide
)
 Parameters
leftSide(Scale2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)