Reference Library
TransformToClipSpace Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ClipBoundary »TransformToClipSpace
 Declaration Syntax
C# | Visual Basic | Visual C++
public Matrix3d TransformToClipSpace { get; set; }
Public Property TransformToClipSpace As Matrix3d
	Get
	Set
public:
property Matrix3d TransformToClipSpace {
	Matrix3d get ();
	void set (Matrix3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)