Reference Library
GetTangentVector Method (vector, point)
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnSurface »GetTangentVector(Vector2d, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d GetTangentVector(
	Vector2d vector,
	Point2d point
)
Public Function GetTangentVector ( _
	vector As Vector2d, _
	point As Point2d _
) As Vector3d
public:
Vector3d GetTangentVector(
	Vector2d vector,
	Point2d point
)
 Parameters
vector(Vector2d)
point(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)