Reference Library
IsCircular Method (tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc3d »IsCircular(Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsCircular(
	Tolerance tolerance
)
Public Function IsCircular ( _
	tolerance As Tolerance _
) As Boolean
public:
bool IsCircular(
	Tolerance tolerance
)
 Parameters
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)