Reference Library
SetHatchScale Method (nSecType, nGeometry, fScale)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »SetHatchScale(SectionType, SectionGeometry, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetHatchScale(
	SectionType nSecType,
	SectionGeometry nGeometry,
	double fScale
)
Public Sub SetHatchScale ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry, _
	fScale As Double _
)
public:
void SetHatchScale(
	SectionType nSecType,
	SectionGeometry nGeometry,
	double fScale
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
fScale(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)