Reference Library
Cylinder Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Cylinder »Cylinder()
 Members
Icon | Member | Description
Cylinder(Double, Point3d, Vector3d, Vector3d, Interval, Double, Double)
Cylinder(Double, Point3d, Vector3d)
Cylinder()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)