Reference Library
GetAnglesInU Method
Namespaces »ZwSoft.ZwCAD.Geometry »Sphere »GetAnglesInU()
 Declaration Syntax
C# | Visual Basic | Visual C++
public double[] GetAnglesInU()
Public Function GetAnglesInU As Double()
public:
array<double>^ GetAnglesInU()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)