Reference Library
Wipeout Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Wipeout
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbWipeout")]
public class Wipeout : RasterImage
<WrapperAttribute("AcDbWipeout")> _
Public Class Wipeout _
	Inherits RasterImage
[WrapperAttribute(L"AcDbWipeout")]
public ref class Wipeout : public RasterImage
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Wipeout()
Wipeout(IntPtr, Boolean)
HasFrame
SetFrom(Point2dCollection, Vector3d)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Image
|  |  |  |  |  |  | RasterImage
|  |  |  |  |  |  |  | Wipeout
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)