Reference Library
GetLeaderLineIndexes Method (leaderIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »GetLeaderLineIndexes(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ArrayList GetLeaderLineIndexes(
	int leaderIndex
)
Public Function GetLeaderLineIndexes ( _
	leaderIndex As Integer _
) As ArrayList
public:
ArrayList^ GetLeaderLineIndexes(
	int leaderIndex
)
 Parameters
leaderIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)