Reference Library
Set Method (center, majorAxis, minorAxis, majorRadius, minorRadius)
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc2d »Set(Point2d, Vector2d, Vector2d, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	Point2d center,
	Vector2d majorAxis,
	Vector2d minorAxis,
	double majorRadius,
	double minorRadius
)
Public Sub Set ( _
	center As Point2d, _
	majorAxis As Vector2d, _
	minorAxis As Vector2d, _
	majorRadius As Double, _
	minorRadius As Double _
)
public:
void Set(
	Point2d center,
	Vector2d majorAxis,
	Vector2d minorAxis,
	double majorRadius,
	double minorRadius
)
 Parameters
center(Point2d)
majorAxis(Vector2d)
minorAxis(Vector2d)
majorRadius(Double)
minorRadius(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)