Reference Library
UcsSavedWithViewport Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewportTableRecord »UcsSavedWithViewport
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool UcsSavedWithViewport { get; set; }
Public Property UcsSavedWithViewport As Boolean
	Get
	Set
public:
property bool UcsSavedWithViewport {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)