Reference Library
ShowModalDialog Method (owner, formToShow)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »ShowModalDialog(IntPtr, Form)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static DialogResult ShowModalDialog(
	IntPtr owner,
	Form formToShow
)
Public Shared Function ShowModalDialog ( _
	owner As IntPtr, _
	formToShow As Form _
) As DialogResult
public:
static DialogResult ShowModalDialog(
	IntPtr owner,
	Form^ formToShow
)
 Parameters
owner(IntPtr)
formToShow(Form)
Assembly: ZwManaged (Module: ZwManaged)