Reference Library
DataType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Field »DataType
 Declaration Syntax
C# | Visual Basic | Visual C++
public DataType DataType { get; }
Public ReadOnly Property DataType As DataType
	Get
public:
property DataType DataType {
	DataType get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)