Reference Library
IDictionaryEnumeratorValue Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DbDictionaryEnumerator »IDictionaryEnumeratorValue
 Declaration Syntax
C# | Visual Basic | Visual C++
internal virtual Object IDictionaryEnumeratorValue { get; }
Friend Overridable ReadOnly Property IDictionaryEnumeratorValue As Object
	Get
internal:
virtual property Object^ IDictionaryEnumeratorValue {
	Object^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)