Reference Library
Type Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableHitTestInfo »Type
 Declaration Syntax
C# | Visual Basic | Visual C++
public TableHitTestType Type { get; }
Public ReadOnly Property Type As TableHitTestType
	Get
public:
property TableHitTestType Type {
	TableHitTestType get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)