Reference Library
PlotPaperUnit Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »PlotPaperUnit
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlotPaperUnit PlotPaperUnit { get; }
Public ReadOnly Property PlotPaperUnit As PlotPaperUnit
	Get
public:
property PlotPaperUnit PlotPaperUnit {
	PlotPaperUnit get ();
}
Assembly: ZwManaged (Module: ZwManaged)