Reference Library
TranslateBy Method (translateVector)
Namespaces »ZwSoft.ZwCAD.Geometry »Entity3d »TranslateBy(Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void TranslateBy(
	Vector3d translateVector
)
Public Sub TranslateBy ( _
	translateVector As Vector3d _
)
public:
void TranslateBy(
	Vector3d translateVector
)
 Parameters
translateVector(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)