Reference Library
ShowImage Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImage »ShowImage
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool ShowImage { get; set; }
Public Property ShowImage As Boolean
	Get
	Set
public:
property bool ShowImage {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)