Reference Library
GetCurve2ds Method
Namespaces »ZwSoft.ZwCAD.Geometry »CurveBoundaryData »GetCurve2ds()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Curve2d[] GetCurve2ds()
Public Function GetCurve2ds As Curve2d()
public:
array<Curve2d^>^ GetCurve2ds()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)