Reference Library
IsOn Method (point, parameterPoint)
Namespaces »ZwSoft.ZwCAD.Geometry »Surface »IsOn(Point3d, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsOn(
	Point3d point,
	out Point2d parameterPoint
)
Public Function IsOn ( _
	point As Point3d, _
	<OutAttribute> ByRef parameterPoint As Point2d _
) As Boolean
public:
bool IsOn(
	Point3d point,
	[OutAttribute] Point2d% parameterPoint
)
 Parameters
point(Point3d)
parameterPoint(Point2d%)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)