Reference Library
UnderlayLayerCollection Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayLayerCollection
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class UnderlayLayerCollection : ICollection
Public NotInheritable Class UnderlayLayerCollection _
	Implements ICollection
public ref class UnderlayLayerCollection sealed : ICollection
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
CopyTo(UnderlayLayer[], Int32)
Count
GetEnumerator()
ICollection.CopyTo(Array, Int32)
ICollection.IsSynchronized
Item[Int32]
ICollection.SyncRoot
 Inheritance Hierarchy
Object
UnderlayLayerCollection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)