Reference Library
CommandInvokeHandler Delegate
Namespaces »ZwSoft.ZwCAD.Runtime »CommandInvokeHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void CommandInvokeHandler()
Public Delegate Sub CommandInvokeHandler
public delegate void CommandInvokeHandler()
Assembly: ZwManaged (Module: ZwManaged)