Reference Library
SplineFit Method (value, segments)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline3d »SplineFit(Poly3dType, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SplineFit(
	Poly3dType value,
	int segments
)
Public Sub SplineFit ( _
	value As Poly3dType, _
	segments As Integer _
)
public:
void SplineFit(
	Poly3dType value,
	int segments
)
 Parameters
value(Poly3dType)
segments(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)