Reference Library
Extents2d Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Extents2d »Extents2d()
 Members
Icon | Member | Description
Extents2d(Double, Double, Double, Double)
Extents2d(Point2d, Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)