Reference Library
RadialDimensionLarge Constructor (unmanagedObjPtr, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RadialDimensionLarge »RadialDimensionLarge(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal RadialDimensionLarge(
	IntPtr unmanagedObjPtr,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedObjPtr As IntPtr, _
	autoDelete As Boolean _
)
protected public:
RadialDimensionLarge(
	IntPtr unmanagedObjPtr,
	bool autoDelete
)
 Parameters
unmanagedObjPtr(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)