Reference Library
AltSuppressTrailingZeros Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »AltSuppressTrailingZeros
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool AltSuppressTrailingZeros { get; set; }
Public Overridable Property AltSuppressTrailingZeros As Boolean
	Get
	Set
public:
virtual property bool AltSuppressTrailingZeros {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)