Reference Library
UpperRightCorner Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewportTableRecord »UpperRightCorner
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d UpperRightCorner { get; set; }
Public Property UpperRightCorner As Point2d
	Get
	Set
public:
property Point2d UpperRightCorner {
	Point2d get ();
	void set (Point2d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)