Reference Library
LoftOptionsBuilder Constructor (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LoftOptionsBuilder »LoftOptionsBuilder(LoftOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LoftOptionsBuilder(
	LoftOptions value
)
Public Sub New ( _
	value As LoftOptions _
)
public:
LoftOptionsBuilder(
	LoftOptions^ value
)
 Parameters
value(LoftOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)