Reference Library
Sphere Constructor (radius, center, northAxis, referenceAxis, startAngleU, endAngleU, startAngleV, endAngleV)
Namespaces »ZwSoft.ZwCAD.Geometry »Sphere »Sphere(Double, Point3d, Vector3d, Vector3d, Double, Double, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Sphere(
	double radius,
	Point3d center,
	Vector3d northAxis,
	Vector3d referenceAxis,
	double startAngleU,
	double endAngleU,
	double startAngleV,
	double endAngleV
)
Public Sub New ( _
	radius As Double, _
	center As Point3d, _
	northAxis As Vector3d, _
	referenceAxis As Vector3d, _
	startAngleU As Double, _
	endAngleU As Double, _
	startAngleV As Double, _
	endAngleV As Double _
)
public:
Sphere(
	double radius,
	Point3d center,
	Vector3d northAxis,
	Vector3d referenceAxis,
	double startAngleU,
	double endAngleU,
	double startAngleV,
	double endAngleV
)
 Parameters
radius(Double)
center(Point3d)
northAxis(Vector3d)
referenceAxis(Vector3d)
startAngleU(Double)
endAngleU(Double)
startAngleV(Double)
endAngleV(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)