Reference Library
PointOnSurface Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnSurface »PointOnSurface()
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnSurface()
Public Sub New
public:
PointOnSurface()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)