Reference Library
SetFitData Method
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »SetFitData()
 Members
Icon | Member | Description
SetFitData(Point3dCollection, Vector3d, Vector3d, KnotParameterizationEnum, Tolerance)
SetFitData(KnotCollection, Point3dCollection, Vector3d, Vector3d, Tolerance, Boolean)
SetFitData(KnotCollection, Point3dCollection, Vector3d, Vector3d, Boolean)
SetFitData(Point3dCollection, Vector3d, Vector3d, Tolerance)
SetFitData(Int32, Point3dCollection, Tolerance)
SetFitData(Point3dCollection, Vector3d, Vector3d)
SetFitData(Int32, Point3dCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)