Reference Library
GetCurvature Method (parameter)
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve3d »GetCurvature(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetCurvature(
	double parameter
)
Public Function GetCurvature ( _
	parameter As Double _
) As Double
public:
double GetCurvature(
	double parameter
)
 Parameters
parameter(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)