Reference Library
Region Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Region »Region()
 Members
Icon | Member | Description
Region(IntPtr, Boolean)
Region()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)