Reference Library
IsValidId Method (id)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ViewportDraw »IsValidId(IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool IsValidId(
	IntPtr id
)
Public Overridable Function IsValidId ( _
	id As IntPtr _
) As Boolean
public:
virtual bool IsValidId(
	IntPtr id
)
 Parameters
id(IntPtr)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)