Reference Library
LinetypeDialog Constructor
Namespaces »ZwSoft.ZwCAD.Windows »LinetypeDialog »LinetypeDialog()
 Declaration Syntax
C# | Visual Basic | Visual C++
public LinetypeDialog()
Public Sub New
public:
LinetypeDialog()
Assembly: ZwManaged (Module: ZwManaged)