Reference Library
Dimtxsty Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Leader »Dimtxsty
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use TextStyleId functionality instead.")]
public virtual ObjectId Dimtxsty { get; set; }
<ObsoleteAttribute("Use TextStyleId functionality instead.")> _
Public Overridable Property Dimtxsty As ObjectId
	Get
	Set
[ObsoleteAttribute(L"Use TextStyleId functionality instead.")]
public:
virtual property ObjectId Dimtxsty {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)