Reference Library
Transpose Method
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »Transpose()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Matrix3d Transpose()
Public Function Transpose As Matrix3d
public:
Matrix3d Transpose()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)