Reference Library
ViewAt Method (viewIndex)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »ViewAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract View ViewAt(
	int viewIndex
)
Public MustOverride Function ViewAt ( _
	viewIndex As Integer _
) As View
public:
virtual View^ ViewAt(
	int viewIndex
) abstract
 Parameters
viewIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)