Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicDimensionDataCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public DynamicDimensionData this[
	int index
] { get; set; }
Public Default Property Item ( _
	index As Integer _
) As DynamicDimensionData
	Get
	Set
public:
property DynamicDimensionData^ default[int index] {
	DynamicDimensionData^ get (int index);
	void set (int index, DynamicDimensionData^ value);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)