Reference Library
UpperBound Property
Namespaces »ZwSoft.ZwCAD.Geometry »Interval »UpperBound
 Declaration Syntax
C# | Visual Basic | Visual C++
public double UpperBound { get; }
Public ReadOnly Property UpperBound As Double
	Get
public:
property double UpperBound {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)