Reference Library
ScaleFactor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleTable »ScaleFactor
 Declaration Syntax
C# | Visual Basic | Visual C++
public double ScaleFactor { get; set; }
Public Property ScaleFactor As Double
	Get
	Set
public:
property double ScaleFactor {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)