Reference Library
IdMappingEventArgs Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »IdMappingEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class IdMappingEventArgs : EventArgs
Public NotInheritable Class IdMappingEventArgs _
	Inherits EventArgs
public ref class IdMappingEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
IdMapping
 Inheritance Hierarchy
Object
EventArgs
| IdMappingEventArgs
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)