Reference Library
SetDestinationFile Method (nSecType, pszFileName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »SetDestinationFile(SectionType, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetDestinationFile(
	SectionType nSecType,
	string pszFileName
)
Public Sub SetDestinationFile ( _
	nSecType As SectionType, _
	pszFileName As String _
)
public:
void SetDestinationFile(
	SectionType nSecType,
	String^ pszFileName
)
 Parameters
nSecType(SectionType)
pszFileName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)