Reference Library
GetEntry Method (fdlIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FileDependencyManager »GetEntry(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public FileDependencyInfo GetEntry(
	int fdlIndex
)
Public Function GetEntry ( _
	fdlIndex As Integer _
) As FileDependencyInfo
public:
FileDependencyInfo GetEntry(
	int fdlIndex
)
 Parameters
fdlIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)