Reference Library
DrawMLeaderOrderType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeaderStyle »DrawMLeaderOrderType
 Declaration Syntax
C# | Visual Basic | Visual C++
public DrawMLeaderOrderType DrawMLeaderOrderType { get; set; }
Public Property DrawMLeaderOrderType As DrawMLeaderOrderType
	Get
	Set
public:
property DrawMLeaderOrderType DrawMLeaderOrderType {
	DrawMLeaderOrderType get ();
	void set (DrawMLeaderOrderType value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)