Reference Library
UserScale Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterVariables »UserScale
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Unit UserScale { get; set; }
Public Overridable Property UserScale As Unit
	Get
	Set
public:
virtual property Unit UserScale {
	Unit get ();
	void set (Unit value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)