Reference Library
IsOn Method
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersector »IsOn()
 Members
Icon | Member | Description
IsOn(Point3d, Tolerance)
IsOn(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)