Reference Library
GetPickedEntities Method
Namespaces »ZwSoft.ZwCAD.EditorInput »InputPointContext »GetPickedEntities()
 Declaration Syntax
C# | Visual Basic | Visual C++
public FullSubentityPath[] GetPickedEntities()
Public Function GetPickedEntities As FullSubentityPath()
public:
array<FullSubentityPath>^ GetPickedEntities()
Assembly: ZwManaged (Module: ZwManaged)