Reference Library
IsBackgroundColorNone Method (rowType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableStyle »IsBackgroundColorNone(RowType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool IsBackgroundColorNone(
	RowType rowType
)
Public Overridable Function IsBackgroundColorNone ( _
	rowType As RowType _
) As Boolean
public:
virtual bool IsBackgroundColorNone(
	RowType rowType
)
 Parameters
rowType(RowType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)