Reference Library
PlotStyleNameId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerTableRecord »PlotStyleNameId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId PlotStyleNameId { get; set; }
Public Property PlotStyleNameId As ObjectId
	Get
	Set
public:
property ObjectId PlotStyleNameId {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)