Reference Library
OffsetCurve2d Class
Namespaces »ZwSoft.ZwCAD.Geometry »OffsetCurve2d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeOffsetCurve2d")]
public sealed class OffsetCurve2d : Curve2d
<WrapperAttribute("ZcGeOffsetCurve2d")> _
Public NotInheritable Class OffsetCurve2d _
	Inherits Curve2d
[WrapperAttribute(L"ZcGeOffsetCurve2d")]
public ref class OffsetCurve2d sealed : public Curve2d
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
OffsetCurve2d(Curve2d, Double)
Create(IntPtr, Boolean)
Curve
OffsetDistance
ParameterDirection
Transformation
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity2d
|  |  | Curve2d
|  |  |  | OffsetCurve2d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)