Reference Library
GetNormalPoint Method
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity3d »GetNormalPoint()
 Members
Icon | Member | Description
GetNormalPoint(Point3d, Tolerance)
GetNormalPoint(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)