Reference Library
IListIsReadOnly Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GraphNodeCollection »IListIsReadOnly
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual bool IListIsReadOnly { get; }
Protected Overridable ReadOnly Property IListIsReadOnly As Boolean
	Get
protected:
virtual property bool IListIsReadOnly {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)