Reference Library
PromptIntegerResultEventArgs Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptIntegerResultEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PromptIntegerResultEventArgs : EventArgs
Public NotInheritable Class PromptIntegerResultEventArgs _
	Inherits EventArgs
public ref class PromptIntegerResultEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Result
 Inheritance Hierarchy
Object
EventArgs
| PromptIntegerResultEventArgs
Assembly: ZwManaged (Module: ZwManaged)