Reference Library
SetColumnWidth Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetColumnWidth()
 Members
Icon | Member | Description
SetColumnWidth(Int32, Double)
SetColumnWidth(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)