Reference Library
Elevation Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline »Elevation
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Elevation { get; set; }
Public Property Elevation As Double
	Get
	Set
public:
property double Elevation {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)