Reference Library
SetTrueColors Method (colors)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FaceData »SetTrueColors(EntityColor[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetTrueColors(
	EntityColor[] colors
)
Public Sub SetTrueColors ( _
	colors As EntityColor() _
)
public:
void SetTrueColors(
	array<EntityColor>^ colors
)
 Parameters
colors(EntityColor[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)