Reference Library
NumRedBits Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PixelFormatInfo »NumRedBits
 Declaration Syntax
C# | Visual Basic | Visual C++
public short NumRedBits { get; set; }
Public Property NumRedBits As Short
	Get
	Set
public:
property short NumRedBits {
	short get ();
	void set (short value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)