Reference Library
EndInnerArcs Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MlineStyle »EndInnerArcs
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool EndInnerArcs { get; set; }
Public Property EndInnerArcs As Boolean
	Get
	Set
public:
property bool EndInnerArcs {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)