Reference Library
FireBeginAggregation Method (e)
Namespaces »ZwSoft.ZwCAD.Publishing »Publisher »FireBeginAggregation(BeginAggregationEventArgs)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void FireBeginAggregation(
	BeginAggregationEventArgs e
)
Public Sub FireBeginAggregation ( _
	e As BeginAggregationEventArgs _
)
public:
void FireBeginAggregation(
	BeginAggregationEventArgs^ e
)
 Parameters
e(BeginAggregationEventArgs)
Assembly: ZwManaged (Module: ZwManaged)