Reference Library
Field Constructor (fieldCode)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Field »Field(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Field(
	string fieldCode
)
Public Sub New ( _
	fieldCode As String _
)
public:
Field(
	String^ fieldCode
)
 Parameters
fieldCode(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)