Reference Library
GetSplitCurves Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »GetSplitCurves(DoubleCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual DBObjectCollection GetSplitCurves(
	DoubleCollection value
)
Public Overridable Function GetSplitCurves ( _
	value As DoubleCollection _
) As DBObjectCollection
public:
virtual DBObjectCollection^ GetSplitCurves(
	DoubleCollection^ value
)
 Parameters
value(DoubleCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)