Reference Library
CircleSides Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »CircleSides
 Declaration Syntax
C# | Visual Basic | Visual C++
public int CircleSides { get; set; }
Public Property CircleSides As Integer
	Get
	Set
public:
property int CircleSides {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)