Reference Library
TextRotation Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »TextRotation
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.AngleNotTransformed)]
public double TextRotation { get; set; }
<UnitTypeAttribute(UnitType.AngleNotTransformed)> _
Public Property TextRotation As Double
	Get
	Set
[UnitTypeAttribute(UnitType::AngleNotTransformed)]
public:
property double TextRotation {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)