Reference Library
SetValue Method (row, column, contentIndex, value, parseOption)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetValue(Int32, Int32, Int32, Object, ParseOption)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetValue(
	int row,
	int column,
	int contentIndex,
	Object value,
	ParseOption parseOption
)
Public Overridable Sub SetValue ( _
	row As Integer, _
	column As Integer, _
	contentIndex As Integer, _
	value As Object, _
	parseOption As ParseOption _
)
public:
virtual void SetValue(
	int row,
	int column,
	int contentIndex,
	Object^ value,
	ParseOption parseOption
)
 Parameters
row(Int32)
column(Int32)
contentIndex(Int32)
value(Object)
parseOption(ParseOption)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)