Reference Library
XrefNotificationStatus Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefNotificationStatus
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum XrefNotificationStatus
Public Enumeration XrefNotificationStatus
public enum class XrefNotificationStatus
 Members
Member | Description
ResolvedUpdateAvailable
ResolvedWithUpdate
ResolvedElsewhere
ResolvedMatch
None
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)