Reference Library
WorldToPlane Method
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »WorldToPlane()
 Members
Icon | Member | Description
WorldToPlane(Vector3d)
WorldToPlane(Plane)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)