Reference Library
BlockTableRecordId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefGraphNode »BlockTableRecordId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId BlockTableRecordId { get; }
Public ReadOnly Property BlockTableRecordId As ObjectId
	Get
public:
property ObjectId BlockTableRecordId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)