Reference Library
Chamferb Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Chamferb
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Chamferb { get; set; }
Public Property Chamferb As Double
	Get
	Set
public:
property double Chamferb {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)