Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Extents2d »Inequality(Extents2d, Extents2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	Extents2d a,
	Extents2d b
)
Public Shared Operator <> ( _
	a As Extents2d, _
	b As Extents2d _
) As Boolean
public:
static bool operator !=(
	Extents2d a,
	Extents2d b
)
 Parameters
a(Extents2d)
b(Extents2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)