Reference Library
GetAnglesInV Method
Namespaces »ZwSoft.ZwCAD.Geometry »Torus »GetAnglesInV()
 Declaration Syntax
C# | Visual Basic | Visual C++
public double[] GetAnglesInV()
Public Function GetAnglesInV As Double()
public:
array<double>^ GetAnglesInV()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)