Reference Library
NonBreakSpace Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »NonBreakSpace
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string NonBreakSpace { get; }
Public Shared ReadOnly Property NonBreakSpace As String
	Get
public:
static property String^ NonBreakSpace {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)