Reference Library
Overlined Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MTextFragment »Overlined
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Overlined { get; }
Public ReadOnly Property Overlined As Boolean
	Get
public:
property bool Overlined {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)