Reference Library
SymbolTableRecord Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolTableRecord
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbSymbolTableRecord")]
public abstract class SymbolTableRecord : DBObject
<WrapperAttribute("AcDbSymbolTableRecord")> _
Public MustInherit Class SymbolTableRecord _
	Inherits DBObject
[WrapperAttribute(L"AcDbSymbolTableRecord")]
public ref class SymbolTableRecord abstract : public DBObject
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
SymbolTableRecord(IntPtr, Boolean)
IsDependent
IsResolved
Name
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | SymbolTableRecord
|  |  |  |  |  | AbstractViewTableRecord
|  |  |  |  |  | BlockTableRecord
|  |  |  |  |  | DimStyleTableRecord
|  |  |  |  |  | LayerTableRecord
|  |  |  |  |  | LinetypeTableRecord
|  |  |  |  |  | RegAppTableRecord
|  |  |  |  |  | TextStyleTableRecord
|  |  |  |  |  | UcsTableRecord
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)