Reference Library
DowngradeOpen Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »DowngradeOpen()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void DowngradeOpen()
Public Sub DowngradeOpen
public:
void DowngradeOpen()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)