Reference Library
EnableFrameText Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeaderStyle »EnableFrameText
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool EnableFrameText { get; set; }
Public Property EnableFrameText As Boolean
	Get
	Set
public:
property bool EnableFrameText {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)