Reference Library
FieldLength Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AttributeReference »FieldLength
 Declaration Syntax
C# | Visual Basic | Visual C++
public int FieldLength { get; set; }
Public Property FieldLength As Integer
	Get
	Set
public:
property int FieldLength {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)