Reference Library
IntersectWith Method (arc)
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc3d »IntersectWith(CircularArc3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d[] IntersectWith(
	CircularArc3d arc
)
Public Function IntersectWith ( _
	arc As CircularArc3d _
) As Point3d()
public:
array<Point3d>^ IntersectWith(
	CircularArc3d^ arc
)
 Parameters
arc(CircularArc3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)