Reference Library
TextStyle Method (type)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »TextStyle(RowType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId TextStyle(
	RowType type
)
Public Overridable Function TextStyle ( _
	type As RowType _
) As ObjectId
public:
virtual ObjectId TextStyle(
	RowType type
)
 Parameters
type(RowType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)