Reference Library
DefaultLightingType Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »DefaultLightingType
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum DefaultLightingType
Public Enumeration DefaultLightingType
public enum class DefaultLightingType
 Members
Member | Description
TwoLights
OneLight
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)