Reference Library
IntersectWith Method (line)
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc2d »IntersectWith(LinearEntity2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d[] IntersectWith(
	LinearEntity2d line
)
Public Function IntersectWith ( _
	line As LinearEntity2d _
) As Point2d()
public:
array<Point2d>^ IntersectWith(
	LinearEntity2d^ line
)
 Parameters
line(LinearEntity2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)