Reference Library
GetAt Method (index, name)
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »LayerFilter »GetAt(Int32, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void GetAt(
	int index,
	ref string name
)
Public Sub GetAt ( _
	index As Integer, _
	ByRef name As String _
)
public:
void GetAt(
	int index,
	String^% name
)
 Parameters
index(Int32)
name(String%)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)