Reference Library
WorldGeometry Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »WorldGeometry
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiWorldGeometry")]
public abstract class WorldGeometry : Geometry
<WrapperAttribute("ZcGiWorldGeometry")> _
Public MustInherit Class WorldGeometry _
	Inherits Geometry
[WrapperAttribute(L"ZcGiWorldGeometry")]
public ref class WorldGeometry abstract : public Geometry
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
WorldGeometry(IntPtr, Boolean)
WorldGeometry()
SetExtents(Extents3d)
StartAttributesSegment()
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Geometry
|  |  |  | WorldGeometry
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)