Reference Library
getColor Method (colorIndex)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »GIRasterImage »getColor(UInt32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color getColor(
	uint colorIndex
)
Public Function getColor ( _
	colorIndex As UInteger _
) As Color
public:
Color getColor(
	unsigned int colorIndex
)
 Parameters
colorIndex(UInt32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)