Reference Library
ScanLines Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »GIRasterImage »ScanLines()
 Declaration Syntax
C# | Visual Basic | Visual C++
public byte[] ScanLines()
Public Function ScanLines As Byte()
public:
array<unsigned char>^ ScanLines()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)