Reference Library
DisplaySaveOptionsMenuItem Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSaveFileOptions »DisplaySaveOptionsMenuItem
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool DisplaySaveOptionsMenuItem { get; set; }
Public Property DisplaySaveOptionsMenuItem As Boolean
	Get
	Set
public:
property bool DisplaySaveOptionsMenuItem {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)