Reference Library
DrawingScale Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »DrawingScale
 Declaration Syntax
C# | Visual Basic | Visual C++
public double DrawingScale { get; }
Public ReadOnly Property DrawingScale As Double
	Get
public:
property double DrawingScale {
	double get ();
}
Assembly: ZwManaged (Module: ZwManaged)