Reference Library
Mapper Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »NonEntityTraits »Mapper
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed Mapper Mapper { get; set; }
Public Overrides NotOverridable Property Mapper As Mapper
	Get
	Set
public:
virtual property Mapper^ Mapper {
	Mapper^ get () override sealed;
	void set (Mapper^ value) override sealed;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)