Reference Library
ObscuredLinetype Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeStyle »ObscuredLinetype
 Declaration Syntax
C# | Visual Basic | Visual C++
public Linetype ObscuredLinetype { get; set; }
Public Property ObscuredLinetype As Linetype
	Get
	Set
public:
property Linetype ObscuredLinetype {
	Linetype get ();
	void set (Linetype value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)