Reference Library
DisplayingDraftingSettingsDialog Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »DisplayingDraftingSettingsDialog
 Declaration Syntax
C# | Visual Basic | Visual C++
public static event TabbedDialogEventHandler DisplayingDraftingSettingsDialog
Public Shared Event DisplayingDraftingSettingsDialog As TabbedDialogEventHandler
public:
static  event TabbedDialogEventHandler^ DisplayingDraftingSettingsDialog {
	void add (TabbedDialogEventHandler^ value);
	void remove (TabbedDialogEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)