Reference Library
Unhighlight Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »Unhighlight()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void Unhighlight()
Public Overridable Sub Unhighlight
public:
virtual void Unhighlight()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)