Reference Library
FenceSelectedSubObject Constructor (path, method, gsMarker, descriptors)
Namespaces »ZwSoft.ZwCAD.EditorInput »FenceSelectedSubObject »FenceSelectedSubObject(FullSubentityPath, SelectionMethod, IntPtr, PickPointDescriptor[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public FenceSelectedSubObject(
	FullSubentityPath path,
	SelectionMethod method,
	IntPtr gsMarker,
	PickPointDescriptor[] descriptors
)
Public Sub New ( _
	path As FullSubentityPath, _
	method As SelectionMethod, _
	gsMarker As IntPtr, _
	descriptors As PickPointDescriptor() _
)
public:
FenceSelectedSubObject(
	FullSubentityPath path,
	SelectionMethod method,
	IntPtr gsMarker,
	array<PickPointDescriptor>^ descriptors
)
 Parameters
path(FullSubentityPath)
method(SelectionMethod)
gsMarker(IntPtr)
descriptors(PickPointDescriptor[])
Assembly: ZwManaged (Module: ZwManaged)