Reference Library
SetFitData Method (fitKnots, fitPoints, startTangent, endTangent, fitTolerance, periodic)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »SetFitData(KnotCollection, Point3dCollection, Vector3d, Vector3d, Tolerance, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFitData(
	KnotCollection fitKnots,
	Point3dCollection fitPoints,
	Vector3d startTangent,
	Vector3d endTangent,
	Tolerance fitTolerance,
	bool periodic
)
Public Sub SetFitData ( _
	fitKnots As KnotCollection, _
	fitPoints As Point3dCollection, _
	startTangent As Vector3d, _
	endTangent As Vector3d, _
	fitTolerance As Tolerance, _
	periodic As Boolean _
)
public:
void SetFitData(
	KnotCollection^ fitKnots,
	Point3dCollection^ fitPoints,
	Vector3d startTangent,
	Vector3d endTangent,
	Tolerance fitTolerance,
	bool periodic
)
 Parameters
fitKnots(KnotCollection)
fitPoints(Point3dCollection)
startTangent(Vector3d)
endTangent(Vector3d)
fitTolerance(Tolerance)
periodic(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)