Reference Library
CheckZds Method (returnValue)
Namespaces »ZwSoft.ZwCAD.Runtime »Interop »CheckZds(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static void CheckZds(
	int returnValue
)
Public Shared Sub CheckZds ( _
	returnValue As Integer _
)
public:
static void CheckZds(
	int returnValue
)
 Parameters
returnValue(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)