Reference Library
EvalMode Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »EvalMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool EvalMode { get; }
Public ReadOnly Property EvalMode As Boolean
	Get
public:
property bool EvalMode {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)