Reference Library
Normal Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Leader »Normal
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Vector3d Normal { get; }
Public Overridable ReadOnly Property Normal As Vector3d
	Get
public:
virtual property Vector3d Normal {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)