Reference Library
PlotStyleSheet Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »PlotStyleSheet
 Declaration Syntax
C# | Visual Basic | Visual C++
public string PlotStyleSheet { get; set; }
Public Property PlotStyleSheet As String
	Get
	Set
public:
property String^ PlotStyleSheet {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)