Reference Library
Vertex2d Constructor (position, bulge, startWidth, endWidth, tangent)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Vertex2d »Vertex2d(Point3d, Double, Double, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vertex2d(
	Point3d position,
	double bulge,
	double startWidth,
	double endWidth,
	double tangent
)
Public Sub New ( _
	position As Point3d, _
	bulge As Double, _
	startWidth As Double, _
	endWidth As Double, _
	tangent As Double _
)
public:
Vertex2d(
	Point3d position,
	double bulge,
	double startWidth,
	double endWidth,
	double tangent
)
 Parameters
position(Point3d)
bulge(Double)
startWidth(Double)
endWidth(Double)
tangent(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)