Reference Library
ClosestPointToPlane Method
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc3d »ClosestPointToPlane()
 Members
Icon | Member | Description
ClosestPointToPlane(PlanarEntity, Tolerance)
ClosestPointToPlane(PlanarEntity)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)