Reference Library
AuditPass Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AuditPass
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbAuditInfo::AuditPass")]
public enum AuditPass
<WrapperAttribute("ZcDbAuditInfo::AuditPass")> _
Public Enumeration AuditPass
[WrapperAttribute(L"ZcDbAuditInfo::AuditPass")]
public enum class AuditPass
 Members
Member | Description
Pass2
Pass1
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)