Reference Library
ConnectionString Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataLink »ConnectionString
 Declaration Syntax
C# | Visual Basic | Visual C++
public string ConnectionString { get; set; }
Public Property ConnectionString As String
	Get
	Set
public:
property String^ ConnectionString {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)