Reference Library
GetNormal Method
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »GetNormal()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector2d GetNormal()
Public Function GetNormal As Vector2d
public:
Vector2d GetNormal()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)