Reference Library
ClientSignature Property
Namespaces »ZwSoft.ZwCAD.Runtime »SecuredApplicationAttribute »ClientSignature
 Declaration Syntax
C# | Visual Basic | Visual C++
public string ClientSignature { get; }
Public ReadOnly Property ClientSignature As String
	Get
public:
property String^ ClientSignature {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)