Reference Library
GetPointAtParameter Method (parameter)
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve2d »GetPointAtParameter(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d GetPointAtParameter(
	double parameter
)
Public Function GetPointAtParameter ( _
	parameter As Double _
) As Point2d
public:
Point2d GetPointAtParameter(
	double parameter
)
 Parameters
parameter(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)