Reference Library
Scale3d Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Scale3d »Scale3d()
 Members
Icon | Member | Description
Scale3d(Double, Double, Double)
Scale3d(Double)
Scale3d(Double[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)