Reference Library
ViewportGeometry Constructor
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ViewportGeometry »ViewportGeometry()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected ViewportGeometry()
Protected Sub New
protected:
ViewportGeometry()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)