Reference Library
MediaGroupWeight Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotInfoValidator »MediaGroupWeight
 Declaration Syntax
C# | Visual Basic | Visual C++
public int MediaGroupWeight { get; set; }
Public Property MediaGroupWeight As Integer
	Get
	Set
public:
property int MediaGroupWeight {
	int get ();
	void set (int value);
}
Assembly: ZwManaged (Module: ZwManaged)