Reference Library
Parameter Property
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve3d »Parameter
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Parameter { get; set; }
Public Property Parameter As Double
	Get
	Set
public:
property double Parameter {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)