Reference Library
CheckInterference Method (otherSolid)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »CheckInterference(Solid3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool CheckInterference(
	Solid3d otherSolid
)
Public Overridable Function CheckInterference ( _
	otherSolid As Solid3d _
) As Boolean
public:
virtual bool CheckInterference(
	Solid3d^ otherSolid
)
 Parameters
otherSolid(Solid3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)