Reference Library
ConfigurationSection Property
Namespaces »ZwSoft.ZwCAD.Windows »PalettePersistEventArgs »ConfigurationSection
 Declaration Syntax
C# | Visual Basic | Visual C++
public IConfigurationSection ConfigurationSection { get; }
Public ReadOnly Property ConfigurationSection As IConfigurationSection
	Get
public:
property IConfigurationSection^ ConfigurationSection {
	IConfigurationSection^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)