Reference Library
SetDataFormat Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetDataFormat()
 Members
Icon | Member | Description
SetDataFormat(Int32, Int32, Int32, String)
SetDataFormat(Int32, Int32, String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)