Reference Library
ReleaseUndoCommandSnapshot Method (bmp)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Utilities »ReleaseUndoCommandSnapshot(IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static void ReleaseUndoCommandSnapshot(
	IntPtr bmp
)
Public Shared Sub ReleaseUndoCommandSnapshot ( _
	bmp As IntPtr _
)
public:
static void ReleaseUndoCommandSnapshot(
	IntPtr bmp
)
 Parameters
bmp(IntPtr)
Assembly: ZwManaged (Module: ZwManaged)