Reference Library
HasFrame Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Wipeout »HasFrame
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool HasFrame { get; set; }
Public Property HasFrame As Boolean
	Get
	Set
public:
property bool HasFrame {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)