Reference Library
UseBasePoint Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDistanceOptions »UseBasePoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool UseBasePoint { get; set; }
Public Property UseBasePoint As Boolean
	Get
	Set
public:
property bool UseBasePoint {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)