Reference Library
WorldGeometry Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »WorldGeometry »WorldGeometry(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected WorldGeometry(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Protected Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
protected:
WorldGeometry(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)