Reference Library
AcquireDistance Method
Namespaces »ZwSoft.ZwCAD.EditorInput »JigPrompts »AcquireDistance()
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDoubleResult AcquireDistance()
Public Function AcquireDistance As PromptDoubleResult
public:
PromptDoubleResult^ AcquireDistance()
Assembly: ZwManaged (Module: ZwManaged)