Reference Library
CanConvertTo Method
Namespaces »ZwSoft.ZwCAD.Colors »ColorConverter »CanConvertTo()
 Members
Icon | Member | Description
CanConvertTo(Type)
CanConvertTo(ITypeDescriptorContext, Type)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)