Reference Library
OrthographicView Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »OrthographicView
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum OrthographicView
Public Enumeration OrthographicView
public enum class OrthographicView
 Members
Member | Description
TopView
RightView
NonOrthoView
LeftView
FrontView
BottomView
BackView
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)