Reference Library
SwapReferences Method (idMap)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »SwapReferences(IdMapping)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SwapReferences(
	IdMapping idMap
)
Public Overridable Sub SwapReferences ( _
	idMap As IdMapping _
)
public:
virtual void SwapReferences(
	IdMapping^ idMap
)
 Parameters
idMap(IdMapping)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)