Reference Library
SetHatchPattern Method (patternType, patternName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »SetHatchPattern(HatchPatternType, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetHatchPattern(
	HatchPatternType patternType,
	string patternName
)
Public Sub SetHatchPattern ( _
	patternType As HatchPatternType, _
	patternName As String _
)
public:
void SetHatchPattern(
	HatchPatternType patternType,
	String^ patternName
)
 Parameters
patternType(HatchPatternType)
patternName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)