Reference Library
CubicSplineCurve2d Constructor (fitPoints, startDerivative, endDerivative)
Namespaces »ZwSoft.ZwCAD.Geometry »CubicSplineCurve2d »CubicSplineCurve2d(Point2dCollection, Vector2d, Vector2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CubicSplineCurve2d(
	Point2dCollection fitPoints,
	Vector2d startDerivative,
	Vector2d endDerivative
)
Public Sub New ( _
	fitPoints As Point2dCollection, _
	startDerivative As Vector2d, _
	endDerivative As Vector2d _
)
public:
CubicSplineCurve2d(
	Point2dCollection^ fitPoints,
	Vector2d startDerivative,
	Vector2d endDerivative
)
 Parameters
fitPoints(Point2dCollection)
startDerivative(Vector2d)
endDerivative(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)