Reference Library
Dimldrblk Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimldrblk
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId Dimldrblk { get; set; }
Public Overridable Property Dimldrblk As ObjectId
	Get
	Set
public:
virtual property ObjectId Dimldrblk {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)