Reference Library
IdMappingEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.DatabaseServices »IdMappingEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void IdMappingEventHandler(
	Object sender,
	IdMappingEventArgs e
)
Public Delegate Sub IdMappingEventHandler ( _
	sender As Object, _
	e As IdMappingEventArgs _
)
public delegate void IdMappingEventHandler(
	Object^ sender,
	IdMappingEventArgs^ e
)
 Parameters
sender(Object)
e(IdMappingEventArgs)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)