Reference Library
PenIndex Property
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor »PenIndex
 Declaration Syntax
C# | Visual Basic | Visual C++
public short PenIndex { get; }
Public ReadOnly Property PenIndex As Short
	Get
public:
property short PenIndex {
	short get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)