Reference Library
IsReadOnly Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HyperLinkCollection »IList.IsReadOnly
 Declaration Syntax
C# | Visual Basic | Visual C++
bool IList.IsReadOnly { get; }
Private ReadOnly Property IsReadOnly As Boolean
	Implements IList.IsReadOnly
	Get
private:
virtual property bool IsReadOnly {
	bool get () sealed = IList::IsReadOnly::get;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)