Reference Library
SetWeightAt Method (index, weight)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Spline »SetWeightAt(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetWeightAt(
	int index,
	double weight
)
Public Sub SetWeightAt ( _
	index As Integer, _
	weight As Double _
)
public:
void SetWeightAt(
	int index,
	double weight
)
 Parameters
index(Int32)
weight(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)