Reference Library
RegAppTable Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RegAppTable
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbRegAppTable")]
public sealed class RegAppTable : SymbolTable
<WrapperAttribute("AcDbRegAppTable")> _
Public NotInheritable Class RegAppTable _
	Inherits SymbolTable
[WrapperAttribute(L"AcDbRegAppTable")]
public ref class RegAppTable sealed : public SymbolTable
 Members
All Members | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | SymbolTable
|  |  |  |  |  | RegAppTable
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)