Reference Library
Surface2Left Property
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersectorConfigurations »Surface2Left
 Declaration Syntax
C# | Visual Basic | Visual C++
public SurfaceSurfaceIntersectorConfiguration Surface2Left { get; }
Public ReadOnly Property Surface2Left As SurfaceSurfaceIntersectorConfiguration
	Get
public:
property SurfaceSurfaceIntersectorConfiguration Surface2Left {
	SurfaceSurfaceIntersectorConfiguration get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)