Reference Library
IDictionary_Clear Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »IDictionary_Clear()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual void IDictionary_Clear()
Protected Overridable Sub IDictionary_Clear
protected:
virtual void IDictionary_Clear()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)