Reference Library
SamplerStatus Enumeration
Namespaces »ZwSoft.ZwCAD.EditorInput »SamplerStatus
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum SamplerStatus
Public Enumeration SamplerStatus
public enum class SamplerStatus
 Members
Member | Description
Cancel
NoChange
OK
Assembly: ZwManaged (Module: ZwManaged)