Reference Library
IEnumerable_GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockTableRecord »IEnumerable_GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual IEnumerator IEnumerable_GetEnumerator()
Protected Overridable Function IEnumerable_GetEnumerator As IEnumerator
protected:
virtual IEnumerator^ IEnumerable_GetEnumerator()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)