Reference Library
CreateFromGeCurve Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »CreateFromGeCurve()
 Members
Icon | Member | Description
CreateFromGeCurve(Curve3d, Vector3d, Tolerance)
CreateFromGeCurve(Curve3d, Vector3d)
CreateFromGeCurve(Curve3d, Tolerance)
CreateFromGeCurve(Curve3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)