Reference Library
IsLemon Property
Namespaces »ZwSoft.ZwCAD.Geometry »Torus »IsLemon
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsLemon { get; }
Public ReadOnly Property IsLemon As Boolean
	Get
public:
property bool IsLemon {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)