Reference Library
Displacement Method (vector)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2d »Displacement(Vector2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Matrix2d Displacement(
	Vector2d vector
)
Public Shared Function Displacement ( _
	vector As Vector2d _
) As Matrix2d
public:
static Matrix2d Displacement(
	Vector2d vector
)
 Parameters
vector(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)