Reference Library
PolylineCurve2d Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »PolylineCurve2d »PolylineCurve2d()
 Declaration Syntax
C# | Visual Basic | Visual C++
public PolylineCurve2d()
Public Sub New
public:
PolylineCurve2d()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)