Reference Library
Format Method (type)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »Format(RowType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string Format(
	RowType type
)
Public Overridable Function Format ( _
	type As RowType _
) As String
public:
virtual String^ Format(
	RowType type
)
 Parameters
type(RowType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)