Reference Library
IDictionary_Add Method (key, value)
Namespaces »ZwSoft.ZwCAD.Runtime »Dictionary »IDictionary_Add(Object, Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual void IDictionary_Add(
	Object key,
	Object value
)
Protected Overridable Sub IDictionary_Add ( _
	key As Object, _
	value As Object _
)
protected:
virtual void IDictionary_Add(
	Object^ key,
	Object^ value
)
 Parameters
key(Object)
value(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)