Reference Library
DwgVersion Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DxfFiler »DwgVersion
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual FullDwgVersion DwgVersion { get; }
Public Overridable ReadOnly Property DwgVersion As FullDwgVersion
	Get
public:
virtual property FullDwgVersion DwgVersion {
	FullDwgVersion get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)