Reference Library
RegenLayers Method (layers, regenPending)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Utilities »RegenLayers(ObjectId[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static void RegenLayers(
	ObjectId[] layers,
	int regenPending
)
Public Shared Sub RegenLayers ( _
	layers As ObjectId(), _
	regenPending As Integer _
)
public:
static void RegenLayers(
	array<ObjectId>^ layers,
	int regenPending
)
 Parameters
layers(ObjectId[])
regenPending(Int32)
Assembly: ZwManaged (Module: ZwManaged)