Reference Library
DynamicDimensionChangedEventArgs Constructor (index, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicDimensionChangedEventArgs »DynamicDimensionChangedEventArgs(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DynamicDimensionChangedEventArgs(
	int index,
	double value
)
Public Sub New ( _
	index As Integer, _
	value As Double _
)
public:
DynamicDimensionChangedEventArgs(
	int index,
	double value
)
 Parameters
index(Int32)
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)