Reference Library
get_Color Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GradientColor »get_Color()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color get_Color()
Public Function get_Color As Color
public:
Color^ get_Color()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)