Reference Library
ExposureType Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ExposureType
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum ExposureType
Public Enumeration ExposureType
public enum class ExposureType
 Members
Member | Description
Logarithmic
Automatic
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)