Reference Library
EndDocument Method (parameters)
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotEngine »EndDocument(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void EndDocument(
	Object parameters
)
Public Sub EndDocument ( _
	parameters As Object _
)
public:
void EndDocument(
	Object^ parameters
)
 Parameters
parameters(Object)
Assembly: ZwManaged (Module: ZwManaged)