Reference Library
GetScale Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »GetScale(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double GetScale(
	int row,
	int column
)
Public Overridable Function GetScale ( _
	row As Integer, _
	column As Integer _
) As Double
public:
virtual double GetScale(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)