Reference Library
Dimcen Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimcen
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double Dimcen { get; set; }
Public Overridable Property Dimcen As Double
	Get
	Set
public:
virtual property double Dimcen {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)