Reference Library
Dimarcsym Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimarcsym
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Dimarcsym { get; set; }
Public Property Dimarcsym As Integer
	Get
	Set
public:
property int Dimarcsym {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)