Reference Library
NumEntities Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »NumEntities
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumEntities { get; }
Public ReadOnly Property NumEntities As Integer
	Get
public:
property int NumEntities {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)