Reference Library
Torus Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Torus »Torus()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Torus()
Public Sub New
public:
Torus()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)