Reference Library
Dimltex2 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimltex2
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId Dimltex2 { get; set; }
Public Overridable Property Dimltex2 As ObjectId
	Get
	Set
public:
virtual property ObjectId Dimltex2 {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)