Reference Library
LensLength Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »LensLength
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LensLength { get; set; }
Public Property LensLength As Double
	Get
	Set
public:
property double LensLength {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)