Reference Library
Clear Method (flags)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GraphNode »Clear(Byte)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Clear(
	byte flags
)
Public Sub Clear ( _
	flags As Byte _
)
public:
void Clear(
	unsigned char flags
)
 Parameters
flags(Byte)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)