Reference Library
SelectCrossingPolygon Method
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »SelectCrossingPolygon()
 Members
Icon | Member | Description
SelectCrossingPolygon(Point3dCollection, SelectionFilter)
SelectCrossingPolygon(Point3dCollection)
Assembly: ZwManaged (Module: ZwManaged)