Reference Library
IList_Insert Method (index, value)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2dCollection »IList_Insert(Int32, Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
internal void IList_Insert(
	int index,
	Object value
)
Friend Sub IList_Insert ( _
	index As Integer, _
	value As Object _
)
internal:
virtual void IList_Insert(
	int index,
	Object^ value
) sealed
 Parameters
index(Int32)
value(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)