Reference Library
CreateView Method
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ImpDevice »CreateView()
 Members
Icon | Member | Description
CreateView(ClientViewInfo, Boolean) |  (Overrides Device.CreateView(ClientViewInfo, Boolean).)
CreateView(ClientViewInfo) |  (Overrides Device.CreateView(ClientViewInfo).)
CreateView() |  (Overrides Device.CreateView().)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)