Reference Library
CopyTo Method (array, index)
Namespaces »ZwSoft.ZwCAD.Publishing »EPlotPropertyCollection »CopyTo(Array, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	Array array,
	int index
)
Public Sub CopyTo ( _
	array As Array, _
	index As Integer _
)
public:
virtual void CopyTo(
	Array^ array,
	int index
) sealed
 Parameters
array(Array)
index(Int32)
Assembly: ZwManaged (Module: ZwManaged)