Reference Library
GetTextHeight Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »GetTextHeight(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double GetTextHeight(
	int row,
	int column
)
Public Overridable Function GetTextHeight ( _
	row As Integer, _
	column As Integer _
) As Double
public:
virtual double GetTextHeight(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)