Reference Library
InsertFitPointAt Method (index, point)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Spline »InsertFitPointAt(Int32, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void InsertFitPointAt(
	int index,
	Point3d point
)
Public Sub InsertFitPointAt ( _
	index As Integer, _
	point As Point3d _
)
public:
void InsertFitPointAt(
	int index,
	Point3d point
)
 Parameters
index(Int32)
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)