Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersectorConfigurations »Inequality(SurfaceSurfaceIntersectorConfigurations, SurfaceSurfaceIntersectorConfigurations)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	SurfaceSurfaceIntersectorConfigurations a,
	SurfaceSurfaceIntersectorConfigurations b
)
Public Shared Operator <> ( _
	a As SurfaceSurfaceIntersectorConfigurations, _
	b As SurfaceSurfaceIntersectorConfigurations _
) As Boolean
public:
static bool operator !=(
	SurfaceSurfaceIntersectorConfigurations a,
	SurfaceSurfaceIntersectorConfigurations b
)
 Parameters
a(SurfaceSurfaceIntersectorConfigurations)
b(SurfaceSurfaceIntersectorConfigurations)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)