Reference Library
SetTextHeight Method (row, column, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »SetTextHeight(Int32, Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetTextHeight(
	int row,
	int column,
	double value
)
Public Overridable Sub SetTextHeight ( _
	row As Integer, _
	column As Integer, _
	value As Double _
)
public:
virtual void SetTextHeight(
	int row,
	int column,
	double value
)
 Parameters
row(Int32)
column(Int32)
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)