Reference Library
GetNormalVectors Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »VertexData »GetNormalVectors()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d[] GetNormalVectors()
Public Function GetNormalVectors As Vector3d()
public:
array<Vector3d>^ GetNormalVectors()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)