Reference Library
LinetypeCollection Constructor
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »LinetypeCollection »LinetypeCollection()
 Declaration Syntax
C# | Visual Basic | Visual C++
public LinetypeCollection()
Public Sub New
public:
LinetypeCollection()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)