Reference Library
AppendVertex Method (toAppend)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolyFaceMesh »AppendVertex(PolyFaceMeshVertex)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId AppendVertex(
	PolyFaceMeshVertex toAppend
)
Public Function AppendVertex ( _
	toAppend As PolyFaceMeshVertex _
) As ObjectId
public:
ObjectId AppendVertex(
	PolyFaceMeshVertex^ toAppend
)
 Parameters
toAppend(PolyFaceMeshVertex)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)