Reference Library
AxisDirection Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolvedSurface »AxisDirection
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d AxisDirection { get; set; }
Public Property AxisDirection As Vector3d
	Get
	Set
public:
property Vector3d AxisDirection {
	Vector3d get ();
	void set (Vector3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)