Reference Library
EntityJig Constructor (entity)
Namespaces »ZwSoft.ZwCAD.EditorInput »EntityJig »EntityJig(Entity)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal EntityJig(
	Entity entity
)
Protected Friend Sub New ( _
	entity As Entity _
)
protected public:
EntityJig(
	Entity^ entity
)
 Parameters
entity(Entity)
Assembly: ZwManaged (Module: ZwManaged)