Reference Library
GetProjectedClosestPointTo Method (curve3d, projectDirection)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »GetProjectedClosestPointTo(Curve3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnCurve3d[] GetProjectedClosestPointTo(
	Curve3d curve3d,
	Vector3d projectDirection
)
Public Function GetProjectedClosestPointTo ( _
	curve3d As Curve3d, _
	projectDirection As Vector3d _
) As PointOnCurve3d()
public:
array<PointOnCurve3d^>^ GetProjectedClosestPointTo(
	Curve3d^ curve3d,
	Vector3d projectDirection
)
 Parameters
curve3d(Curve3d)
projectDirection(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)