Reference Library
AddAllowedClass Method (type, exactMatch)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptEntityOptions »AddAllowedClass(Type, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AddAllowedClass(
	Type type,
	bool exactMatch
)
Public Sub AddAllowedClass ( _
	type As Type, _
	exactMatch As Boolean _
)
public:
void AddAllowedClass(
	Type^ type,
	bool exactMatch
)
 Parameters
type(Type)
exactMatch(Boolean)
Assembly: ZwManaged (Module: ZwManaged)