Reference Library
ShowModelessDialog Method (owner, formToShow, persistSizeAndPosition)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »ShowModelessDialog(IWin32Window, Form, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static void ShowModelessDialog(
	IWin32Window owner,
	Form formToShow,
	bool persistSizeAndPosition
)
Public Shared Sub ShowModelessDialog ( _
	owner As IWin32Window, _
	formToShow As Form, _
	persistSizeAndPosition As Boolean _
)
public:
static void ShowModelessDialog(
	IWin32Window^ owner,
	Form^ formToShow,
	bool persistSizeAndPosition
)
 Parameters
owner(IWin32Window)
formToShow(Form)
persistSizeAndPosition(Boolean)
Assembly: ZwManaged (Module: ZwManaged)