Reference Library
GetFieldCode Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Field »GetFieldCode()
 Declaration Syntax
C# | Visual Basic | Visual C++
public string GetFieldCode()
Public Function GetFieldCode As String
public:
String^ GetFieldCode()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)