Reference Library
LayerFilterDisplayImages Constructor (imageListHandle, imageIndex, selectedImageIndex)
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerFilterDisplayImages »LayerFilterDisplayImages(IntPtr, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerFilterDisplayImages(
	IntPtr imageListHandle,
	int imageIndex,
	int selectedImageIndex
)
Public Sub New ( _
	imageListHandle As IntPtr, _
	imageIndex As Integer, _
	selectedImageIndex As Integer _
)
public:
LayerFilterDisplayImages(
	IntPtr imageListHandle,
	int imageIndex,
	int selectedImageIndex
)
 Parameters
imageListHandle(IntPtr)
imageIndex(Int32)
selectedImageIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)