Reference Library
AppData Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripData »AppData
 Declaration Syntax
C# | Visual Basic | Visual C++
public IntPtr AppData { get; }
Public ReadOnly Property AppData As IntPtr
	Get
public:
property IntPtr AppData {
	IntPtr get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)