Reference Library
AlignStart Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweepOptions »AlignStart
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool AlignStart { get; }
Public ReadOnly Property AlignStart As Boolean
	Get
public:
property bool AlignStart {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)