Reference Library
IList_Contains Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2dCollection »IList_Contains(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
internal bool IList_Contains(
	Object value
)
Friend Function IList_Contains ( _
	value As Object _
) As Boolean
internal:
virtual bool IList_Contains(
	Object^ value
) sealed
 Parameters
value(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)