Reference Library
Column Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Cell »Column
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Column { get; }
Public ReadOnly Property Column As Integer
	Get
public:
property int Column {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)