Reference Library
CellType Method (row, col)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »CellType(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual TableCellType CellType(
	int row,
	int col
)
Public Overridable Function CellType ( _
	row As Integer, _
	col As Integer _
) As TableCellType
public:
virtual TableCellType CellType(
	int row,
	int col
)
 Parameters
row(Int32)
col(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)