Reference Library
IndexOf Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »IntegerCollection »IndexOf(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int IndexOf(
	int value
)
Public Overridable Function IndexOf ( _
	value As Integer _
) As Integer
public:
virtual int IndexOf(
	int value
)
 Parameters
value(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)