Reference Library
DoubleLineSpacing Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GridPropertyParameter »DoubleLineSpacing
 Declaration Syntax
C# | Visual Basic | Visual C++
public double DoubleLineSpacing
Public DoubleLineSpacing As Double
public:
double DoubleLineSpacing
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)