Reference Library
GenerationOptions Method (nSecType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »GenerationOptions(SectionType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public SectionGeneration GenerationOptions(
	SectionType nSecType
)
Public Function GenerationOptions ( _
	nSecType As SectionType _
) As SectionGeneration
public:
SectionGeneration GenerationOptions(
	SectionType nSecType
)
 Parameters
nSecType(SectionType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)