Reference Library
PlotStyleAt Method (name)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleTable »PlotStyleAt(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual PlotStyle PlotStyleAt(
	string name
)
Public Overridable Function PlotStyleAt ( _
	name As String _
) As PlotStyle
public:
virtual PlotStyle^ PlotStyleAt(
	String^ name
)
 Parameters
name(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)