Reference Library
SetHatchPatternType Method (nSecType, nGeometry, nPatternType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »SetHatchPatternType(SectionType, SectionGeometry, HatchPatternType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetHatchPatternType(
	SectionType nSecType,
	SectionGeometry nGeometry,
	HatchPatternType nPatternType
)
Public Sub SetHatchPatternType ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry, _
	nPatternType As HatchPatternType _
)
public:
void SetHatchPatternType(
	SectionType nSecType,
	SectionGeometry nGeometry,
	HatchPatternType nPatternType
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
nPatternType(HatchPatternType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)