Reference Library
KnotCollection Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »KnotCollection »KnotCollection()
 Declaration Syntax
C# | Visual Basic | Visual C++
public KnotCollection()
Public Sub New
public:
KnotCollection()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)