Reference Library
ISubObject Interface
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ISubObject
 Declaration Syntax
C# | Visual Basic | Visual C++
public interface ISubObject
Public Interface ISubObject
public interface class ISubObject
 Members
All Members | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Parent
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)