Reference Library
FromColorIndex Method (colorMethod, colorIndex)
Namespaces »ZwSoft.ZwCAD.Colors »Color »FromColorIndex(ColorMethod, Int16)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Color FromColorIndex(
	ColorMethod colorMethod,
	short colorIndex
)
Public Shared Function FromColorIndex ( _
	colorMethod As ColorMethod, _
	colorIndex As Short _
) As Color
public:
static Color^ FromColorIndex(
	ColorMethod colorMethod,
	short colorIndex
)
 Parameters
colorMethod(ColorMethod)
colorIndex(Int16)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)