Reference Library
PixelBGRA32 Structure
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PixelBGRA32
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiPixelBGRA32")]
public struct PixelBGRA32
<WrapperAttribute("ZcGiPixelBGRA32")> _
Public Structure PixelBGRA32
[WrapperAttribute(L"ZcGiPixelBGRA32")]
public value class PixelBGRA32
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PixelBGRA32(Byte, Byte, Byte, Byte)
PixelBGRA32(UInt32)
PixelBGRA32(IntPtr)
Alpha
Blue
Green
init()
Red
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)