Reference Library
Thicken Method (thickness, bothSides)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Surface »Thicken(Double, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Solid3d Thicken(
	double thickness,
	bool bothSides
)
Public Overridable Function Thicken ( _
	thickness As Double, _
	bothSides As Boolean _
) As Solid3d
public:
virtual Solid3d^ Thicken(
	double thickness,
	bool bothSides
)
 Parameters
thickness(Double)
bothSides(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)