Reference Library
CreateFrustum Method (height, radiusAlongX, radiusAlongY, topRadius)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »CreateFrustum(Double, Double, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void CreateFrustum(
	double height,
	double radiusAlongX,
	double radiusAlongY,
	double topRadius
)
Public Overridable Sub CreateFrustum ( _
	height As Double, _
	radiusAlongX As Double, _
	radiusAlongY As Double, _
	topRadius As Double _
)
public:
virtual void CreateFrustum(
	double height,
	double radiusAlongX,
	double radiusAlongY,
	double topRadius
)
 Parameters
height(Double)
radiusAlongX(Double)
radiusAlongY(Double)
topRadius(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)