Reference Library
AssociateRasterDef Method (definition)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImage »AssociateRasterDef(RasterImageDef)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void AssociateRasterDef(
	RasterImageDef definition
)
Public Overridable Sub AssociateRasterDef ( _
	definition As RasterImageDef _
)
public:
virtual void AssociateRasterDef(
	RasterImageDef^ definition
)
 Parameters
definition(RasterImageDef)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)