Reference Library
IsEqualTo Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CustomScale »IsEqualTo()
 Members
Icon | Member | Description
IsEqualTo(CustomScale, Tolerance)
IsEqualTo(CustomScale)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)