Reference Library
BigFont Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MTextFragment »BigFont
 Declaration Syntax
C# | Visual Basic | Visual C++
public string BigFont { get; }
Public ReadOnly Property BigFont As String
	Get
public:
property String^ BigFont {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)