Reference Library
RasterImageDef Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImageDef
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbImage")]
public class RasterImageDef : DBObject
<WrapperAttribute("AcDbImage")> _
Public Class RasterImageDef _
	Inherits DBObject
[WrapperAttribute(L"AcDbImage")]
public ref class RasterImageDef : public DBObject
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
RasterImageDef()
RasterImageDef(IntPtr, Boolean)
ActiveFileName
CloseImage()
ColorDepth
CreateImageDictionary(Database)
Embed()
FileDescCopy
FileType
GetEntityCount(Boolean)
GetImageDictionary(Database)
ImageCopy(Boolean)
ImageModified
IsEmbedded
IsLoaded
Load()
LocateActivePath()
OpenImage()
Organization
ResolutionMMPerPixel
ResolutionUnits
SearchForActivePath |  Obsolete.
SetImage(IntPtr, IntPtr, Boolean)
Size
SourceFileName
SuggestName(DBDictionary, String)
UndoStoreSize
Unload(Boolean)
UpdateEntities()
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | RasterImageDef
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)