Reference Library
Set Method (value)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FaceStyle »Set(FaceStyle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	FaceStyle value
)
Public Sub Set ( _
	value As FaceStyle _
)
public:
void Set(
	FaceStyle^ value
)
 Parameters
value(FaceStyle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)