Reference Library
SheetSetName Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdData »SheetSetName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string SheetSetName { get; set; }
Public Property SheetSetName As String
	Get
	Set
public:
property String^ SheetSetName {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwManaged (Module: ZwManaged)