Reference Library
IsRegAppAcadName Method (name)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »IsRegAppAcadName(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool IsRegAppAcadName(
	string name
)
Public Shared Function IsRegAppAcadName ( _
	name As String _
) As Boolean
public:
static bool IsRegAppAcadName(
	String^ name
)
 Parameters
name(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)