Reference Library
GetOrthoBoundBlockOf Method (range)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »GetOrthoBoundBlockOf(Interval)
 Declaration Syntax
C# | Visual Basic | Visual C++
public BoundBlock2d GetOrthoBoundBlockOf(
	Interval range
)
Public Function GetOrthoBoundBlockOf ( _
	range As Interval _
) As BoundBlock2d
public:
BoundBlock2d^ GetOrthoBoundBlockOf(
	Interval^ range
)
 Parameters
range(Interval)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)