Reference Library
IsByLayer Property
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor »IsByLayer
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsByLayer { get; }
Public ReadOnly Property IsByLayer As Boolean
	Get
public:
property bool IsByLayer {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)