Reference Library
RecordHistory Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »RecordHistory
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool RecordHistory { get; set; }
Public Overridable Property RecordHistory As Boolean
	Get
	Set
public:
virtual property bool RecordHistory {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)