Reference Library
MouseHasMoved Property
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »MouseHasMoved
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool MouseHasMoved { get; }
Public ReadOnly Property MouseHasMoved As Boolean
	Get
public:
property bool MouseHasMoved {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)