Reference Library
Swell Method (distance)
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock2d »Swell(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Swell(
	double distance
)
Public Sub Swell ( _
	distance As Double _
)
public:
void Swell(
	double distance
)
 Parameters
distance(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)