Reference Library
Item Property (iIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObjectReferenceCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public DBObjectReference this[
	int iIndex
] { get; set; }
Public Default Property Item ( _
	iIndex As Integer _
) As DBObjectReference
	Get
	Set
public:
property DBObjectReference default[int iIndex] {
	DBObjectReference get (int iIndex);
	void set (int iIndex, DBObjectReference value);
}
 Parameters
iIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)