Reference Library
SetDashLengthAt Method (index, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinetypeTableRecord »SetDashLengthAt(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetDashLengthAt(
	int index,
	double value
)
Public Sub SetDashLengthAt ( _
	index As Integer, _
	value As Double _
)
public:
void SetDashLengthAt(
	int index,
	double value
)
 Parameters
index(Int32)
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)