Reference Library
Interval Constructor (lower, upper, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Interval »Interval(Double, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Interval(
	double lower,
	double upper,
	double tolerance
)
Public Sub New ( _
	lower As Double, _
	upper As Double, _
	tolerance As Double _
)
public:
Interval(
	double lower,
	double upper,
	double tolerance
)
 Parameters
lower(Double)
upper(Double)
tolerance(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)