Reference Library
ConfigWasModified Event
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Manager »ConfigWasModified
 Declaration Syntax
C# | Visual Basic | Visual C++
public event ConfigWasModifiedEventHandler ConfigWasModified
Public Event ConfigWasModified As ConfigWasModifiedEventHandler
public:
 event ConfigWasModifiedEventHandler^ ConfigWasModified {
	void add (ConfigWasModifiedEventHandler^ value);
	void remove (ConfigWasModifiedEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)