Reference Library
SetVector Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCell »SetVector(Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetVector(
	Vector3d value
)
Public Sub SetVector ( _
	value As Vector3d _
)
public:
void SetVector(
	Vector3d value
)
 Parameters
value(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)