Reference Library
SizeChanged Event
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »SizeChanged
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PaletteSetSizeEventHandler SizeChanged
Public Event SizeChanged As PaletteSetSizeEventHandler
public:
 event PaletteSetSizeEventHandler^ SizeChanged {
	void add (PaletteSetSizeEventHandler^ value);
	void remove (PaletteSetSizeEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)