Reference Library
LispFunctionAttribute Constructor (globalName, localizedNameId, helpFileName, helpTopic)
Namespaces »ZwSoft.ZwCAD.Runtime »LispFunctionAttribute »LispFunctionAttribute(String, String, String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LispFunctionAttribute(
	string globalName,
	string localizedNameId,
	string helpFileName,
	string helpTopic
)
Public Sub New ( _
	globalName As String, _
	localizedNameId As String, _
	helpFileName As String, _
	helpTopic As String _
)
public:
LispFunctionAttribute(
	String^ globalName,
	String^ localizedNameId,
	String^ helpFileName,
	String^ helpTopic
)
 Parameters
globalName(String)
localizedNameId(String)
helpFileName(String)
helpTopic(String)
Assembly: ZwManaged (Module: ZwManaged)