Reference Library
NumChanges Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »NumChanges
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int NumChanges { get; }
Public Overridable ReadOnly Property NumChanges As Integer
	Get
public:
virtual property int NumChanges {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)