Reference Library
MoveBelow Method (collection, target)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DrawOrderTable »MoveBelow(ObjectIdCollection, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void MoveBelow(
	ObjectIdCollection collection,
	ObjectId target
)
Public Sub MoveBelow ( _
	collection As ObjectIdCollection, _
	target As ObjectId _
)
public:
void MoveBelow(
	ObjectIdCollection^ collection,
	ObjectId target
)
 Parameters
collection(ObjectIdCollection)
target(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)