Reference Library
VertexAt Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Mline »VertexAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d VertexAt(
	int index
)
Public Function VertexAt ( _
	index As Integer _
) As Point3d
public:
Point3d VertexAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)