Reference Library
IdAt Method (key)
Namespaces »ZwSoft.ZwCAD.Runtime »Dictionary »IdAt(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int IdAt(
	string key
)
Public Overridable Function IdAt ( _
	key As String _
) As Integer
public:
virtual int IdAt(
	String^ key
)
 Parameters
key(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)