Reference Library
Curve Property
Namespaces »ZwSoft.ZwCAD.Geometry »OffsetCurve2d »Curve
 Declaration Syntax
C# | Visual Basic | Visual C++
public Curve2d Curve { get; set; }
Public Property Curve As Curve2d
	Get
	Set
public:
property Curve2d^ Curve {
	Curve2d^ get ();
	void set (Curve2d^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)