Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionSet »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract IEnumerator GetEnumerator()
Public MustOverride Function GetEnumerator As IEnumerator
public:
virtual IEnumerator^ GetEnumerator() abstract
Assembly: ZwManaged (Module: ZwManaged)