Reference Library
ShadowFlags Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ShadowFlags
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiSubEntityTraits::ShadowFlags")]
[FlagsAttribute]
public enum ShadowFlags
<WrapperAttribute("ZcGiSubEntityTraits::ShadowFlags")> _
<FlagsAttribute> _
Public Enumeration ShadowFlags
[WrapperAttribute(L"ZcGiSubEntityTraits::ShadowFlags")]
[FlagsAttribute]
public enum class ShadowFlags
 Members
Member | Description
ShadowsIgnore
ShadowsDoesNotReceive
ShadowsDoesNotCast
ShadowsCastAndReceive
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)