Reference Library
X Property
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSetMoveEventArgs »X
 Declaration Syntax
C# | Visual Basic | Visual C++
public int X { get; }
Public ReadOnly Property X As Integer
	Get
public:
property int X {
	int get ();
}
Assembly: ZwManaged (Module: ZwManaged)