Reference Library
Load Method (password)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayDefinition »Load(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Load(
	string password
)
Public Sub Load ( _
	password As String _
)
public:
void Load(
	String^ password
)
 Parameters
password(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)