Reference Library
LinetypeByLayerName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »LinetypeByLayerName
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string LinetypeByLayerName { get; }
Public Shared ReadOnly Property LinetypeByLayerName As String
	Get
public:
static property String^ LinetypeByLayerName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)