Reference Library
GetBounds Method
Namespaces »ZwSoft.ZwCAD.Geometry »Interval »GetBounds()
 Declaration Syntax
C# | Visual Basic | Visual C++
public double[] GetBounds()
Public Function GetBounds As Double()
public:
array<double>^ GetBounds()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)