Reference Library
FitKnotParameterization Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »FitKnotParameterization
 Declaration Syntax
C# | Visual Basic | Visual C++
public KnotParameterizationEnum FitKnotParameterization { get; set; }
Public Property FitKnotParameterization As KnotParameterizationEnum
	Get
	Set
public:
property KnotParameterizationEnum FitKnotParameterization {
	KnotParameterizationEnum get ();
	void set (KnotParameterizationEnum value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)