Reference Library
PlotPageInfo Class
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotPageInfo
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcPlPlotPageInfo")]
public sealed class PlotPageInfo : RXObject
<WrapperAttribute("AcPlPlotPageInfo")> _
Public NotInheritable Class PlotPageInfo _
	Inherits RXObject
[WrapperAttribute(L"AcPlPlotPageInfo")]
public ref class PlotPageInfo sealed : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PlotPageInfo()
CopyFromUnmanagedObject(IntPtr)
EntityCount
GradientCount
OleObjectCount
RasterCount
ShadedViewportType
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | PlotPageInfo
Assembly: ZwManaged (Module: ZwManaged)