Reference Library
TitleBarLocation Property
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »TitleBarLocation
 Declaration Syntax
C# | Visual Basic | Visual C++
public PaletteSetTitleBarLocation TitleBarLocation { get; set; }
Public Property TitleBarLocation As PaletteSetTitleBarLocation
	Get
	Set
public:
property PaletteSetTitleBarLocation TitleBarLocation {
	PaletteSetTitleBarLocation get ();
	void set (PaletteSetTitleBarLocation value);
}
Assembly: ZwManaged (Module: ZwManaged)