Reference Library
ShadePlot Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettings »ShadePlot
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlotSettingsShadePlotType ShadePlot { get; set; }
Public Property ShadePlot As PlotSettingsShadePlotType
	Get
	Set
public:
property PlotSettingsShadePlotType ShadePlot {
	PlotSettingsShadePlotType get ();
	void set (PlotSettingsShadePlotType value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)