Reference Library
Subtract Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »Subtract(Vector2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d Subtract(
	Vector2d value
)
Public Function Subtract ( _
	value As Vector2d _
) As Point2d
public:
Point2d Subtract(
	Vector2d value
)
 Parameters
value(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)