Reference Library
ExtendedLightShape Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ExtendedLightShape
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum ExtendedLightShape
Public Enumeration ExtendedLightShape
public enum class ExtendedLightShape
 Members
Member | Description
Sphere
Cylinder
Disk
Linear
Rectangle
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)