Reference Library
Set Method (surface1, surface2)
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersector »Set(Surface, Surface)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	Surface surface1,
	Surface surface2
)
Public Sub Set ( _
	surface1 As Surface, _
	surface2 As Surface _
)
public:
void Set(
	Surface^ surface1,
	Surface^ surface2
)
 Parameters
surface1(Surface)
surface2(Surface)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)