Reference Library
HasArrowHead Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Leader »HasArrowHead
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool HasArrowHead { get; set; }
Public Overridable Property HasArrowHead As Boolean
	Get
	Set
public:
virtual property bool HasArrowHead {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)