Reference Library
Count Property
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionSetDelayMarshalled »Count
 Declaration Syntax
C# | Visual Basic | Visual C++
public override int Count { get; }
Public Overrides ReadOnly Property Count As Integer
	Get
public:
virtual property int Count {
	int get () override;
}
Assembly: ZwManaged (Module: ZwManaged)