Reference Library
DictionaryIterator Class
Namespaces »ZwSoft.ZwCAD.Runtime »DictionaryIterator
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcRxDictionaryIterator")]
public class DictionaryIterator : RXObject,
	IDictionaryEnumerator
<WrapperAttribute("ZcRxDictionaryIterator")> _
Public Class DictionaryIterator _
	Inherits RXObject _
	Implements IDictionaryEnumerator
[WrapperAttribute(L"ZcRxDictionaryIterator")]
public ref class DictionaryIterator : public RXObject,
	IDictionaryEnumerator
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Current
DeleteUnmanagedObject() |  (Overrides RXObject.DeleteUnmanagedObject().)
Entry
Key
MoveNext()
Reset()
Value
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | DictionaryIterator
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)