Reference Library
IntersectionLinetype Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeStyle »IntersectionLinetype
 Declaration Syntax
C# | Visual Basic | Visual C++
public Linetype IntersectionLinetype { get; set; }
Public Property IntersectionLinetype As Linetype
	Get
	Set
public:
property Linetype IntersectionLinetype {
	Linetype get ();
	void set (Linetype value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)