Reference Library
TableTemplate Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableTemplate
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbTableTemplate")]
public class TableTemplate : TableContent
<WrapperAttribute("AcDbTableTemplate")> _
Public Class TableTemplate _
	Inherits TableContent
[WrapperAttribute(L"AcDbTableTemplate")]
public ref class TableTemplate : public TableContent
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
TableTemplate(Table, TableCopyOptions)
TableTemplate(IntPtr, Boolean)
Capture(Table, TableCopyOptions)
CreateTable(TableCopyOptions)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | LinkedData
|  |  |  |  |  | LinkedTableData
|  |  |  |  |  |  | FormattedTableData
|  |  |  |  |  |  |  | TableContent
|  |  |  |  |  |  |  |  | TableTemplate
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)