Reference Library
Add Method (p)
Namespaces »ZwSoft.ZwCAD.Windows »PaneCollection »Add(Pane)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Add(
	Pane p
)
Public Function Add ( _
	p As Pane _
) As Integer
public:
int Add(
	Pane^ p
)
 Parameters
p(Pane)
Assembly: ZwManaged (Module: ZwManaged)