Reference Library
StartTangent Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3dFitData »StartTangent
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d StartTangent { get; }
Public ReadOnly Property StartTangent As Vector3d
	Get
public:
property Vector3d StartTangent {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)