Reference Library
PromptDoubleOptions Constructor (messageAndKeywords, globalKeywords)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDoubleOptions »PromptDoubleOptions(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDoubleOptions(
	string messageAndKeywords,
	string globalKeywords
)
Public Sub New ( _
	messageAndKeywords As String, _
	globalKeywords As String _
)
public:
PromptDoubleOptions(
	String^ messageAndKeywords,
	String^ globalKeywords
)
 Parameters
messageAndKeywords(String)
globalKeywords(String)
Assembly: ZwManaged (Module: ZwManaged)