Reference Library
GetGridProperty Method (row, column, gridLineType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GetGridProperty(Int32, Int32, GridLineType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual GridPropertyParameter GetGridProperty(
	int row,
	int column,
	GridLineType gridLineType
)
Public Overridable Function GetGridProperty ( _
	row As Integer, _
	column As Integer, _
	gridLineType As GridLineType _
) As GridPropertyParameter
public:
virtual GridPropertyParameter GetGridProperty(
	int row,
	int column,
	GridLineType gridLineType
)
 Parameters
row(Int32)
column(Int32)
gridLineType(GridLineType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)