Reference Library
Section Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Section
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbSection")]
public class Section : Entity
<WrapperAttribute("ZcDbSection")> _
Public Class Section _
	Inherits Entity
[WrapperAttribute(L"ZcDbSection")]
public ref class Section : public Entity
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Section(Point3dCollection, Vector3d, Vector3d)
Section(Point3dCollection, Vector3d)
Section()
Section(IntPtr, Boolean)
AddVertex(Int32, Point3d) |  Obsolete.
BottomPlane
Boundary
CreateJog(Point3d)
Elevation
GenerateSectionGeometry(Entity, Array, Array, Array, Array, Array)
GetVertex(Int32) |  Obsolete.
GetVertices(Point3dCollection) |  Obsolete.
Height(SectionHeight)
HitTest(Point3d)
IndicatorFillColor
IndicatorTransparency
IsLiveSectionEnabled
Name
Normal
NumVertices |  Obsolete.
RemoveVertex(Int32) |  Obsolete.
SetHeight(SectionHeight, Double)
Settings
SetVertex(Int32, Point3d) |  Obsolete.
State
TopPlane
VerticalDirection
Vertices |  Obsolete.
ViewingDirection
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Section
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)