Reference Library
MatchProperties Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MatchProperties
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbMatchProperties")]
public class MatchProperties : RXObject
<WrapperAttribute("AcDbMatchProperties")> _
Public Class MatchProperties _
	Inherits RXObject
[WrapperAttribute(L"AcDbMatchProperties")]
public ref class MatchProperties : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
MatchProperties(IntPtr, Boolean)
CopyProperties(Entity, Entity, Int32)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | MatchProperties
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)