Reference Library
FrontClip Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »FrontClip
 Declaration Syntax
C# | Visual Basic | Visual C++
public double FrontClip { get; set; }
Public Property FrontClip As Double
	Get
	Set
public:
property double FrontClip {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)