Reference Library
SelectionMode Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »SelectionMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum SelectionMode
Public Enumeration SelectionMode
public enum class SelectionMode
 Members
Member | Description
CPoly
WPoly
Fence
Crossing
Window
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)