Public Member Functions | List of all members
AcDbAssocObjectAndIndexPersSubentId Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocObjectAndIndexPersSubentId:
 Public Member Functions
AcDbAssocObjectAndIndexPersSubentId (const AcDbObjectId &objId, AcDb::SubentType subentType, unsigned int index)
ACRX_DECLARE_MEMBERS (AcDbAssocObjectAndIndexPersSubentId)
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *) ADESK_OVERRIDE
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const ADESK_OVERRIDE
virtual Acad::ErrorStatus  | dwgOutFieldsData (AcDbDwgFiler *) const ADESK_OVERRIDE
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *) ADESK_OVERRIDE
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const ADESK_OVERRIDE
virtual Acad::ErrorStatus  | dxfOutFieldsData (AcDbDxfFiler *) const ADESK_OVERRIDE
 AcDbObjectId  | objectId () const
bool  | operator< (const AcDbAssocObjectAndIndexPersSubentId &other) const
bool  | operator== (const AcDbAssocObjectAndIndexPersSubentId &other) const
 void  | setObjectId (const AcDbObjectId &objId)
 Public Member Functions inherited from AcDbAssocIndexPersSubentId
AcDbAssocIndexPersSubentId (AcDb::SubentType subentType=AcDb::kNullSubentType, unsigned int index=0)
ACRX_DECLARE_MEMBERS (AcDbAssocIndexPersSubentId)
 unsigned int  | index () const
 virtual bool  | isNull () const override
 bool  | operator< (const AcDbAssocIndexPersSubentId &other) const
 bool  | operator== (const AcDbAssocIndexPersSubentId &other) const
 void  | setIndex (unsigned int newIndex)
 void  | setSubentType (AcDb::SubentType subentType)
 virtual AcDb::SubentType  | subentType (const AcDbEntity *, AcDbDatabase *) const override
 Public Member Functions inherited from AcDbAssocPersSubentId
ACRX_DECLARE_MEMBERS (AcDbAssocPersSubentId)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSource) override
virtual Acad::ErrorStatus  | getTransientSubentIds (const AcDbEntity *pEntity, AcDbDatabase *pDatabase, AcArray< AcDbSubentId > &subents) const
virtual bool  | isEqualTo (const AcDbEntity *pEntity, AcDbDatabase *pDatabase, const AcDbAssocPersSubentId *pOther) const
virtual Acad::ErrorStatus  | mirror (const AcDbEntity *pMirroredEntity, AcDbDatabase *pDatabase)
virtual Acad::ErrorStatus  | release (AcDbEntity *pEntity, AcDbDatabase *pDatabase) const
virtual int  | transientSubentCount (const AcDbEntity *pEntity, AcDbDatabase *pDatabase) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcDbAssocPersSubentId
static Acad::ErrorStatus  | createObjectAndDwgInFields (AcDbDatabase *pDatabase, AcDbDwgFiler *pFiler, AcDbAssocPersSubentId *&pCreatedPersSubentId)
static Acad::ErrorStatus  | createObjectAndDxfInFields (AcDbDxfFiler *pFiler, AcDbAssocPersSubentId *&pCreatedPersSubentId)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Protected Attributes inherited from AcDbAssocIndexPersSubentId
 unsigned int  | mIndex
 AcDb::SubentType  | mSubentType
Constructor & Destructor Documentation
 AcDbAssocObjectAndIndexPersSubentId::AcDbAssocObjectAndIndexPersSubentId  |  ( |  const AcDbObjectId &  |  objId,
|  AcDb::SubentType  |  subentType,
|  unsigned int  |  index
)
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbAssocObjectAndIndexPersSubentId::dwgInFields  |  ( |  AcDbDwgFiler *  |   | )
virtual
Warning
Not implemented!
Reimplemented from AcDbAssocIndexPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocObjectAndIndexPersSubentId::dwgOutFields  |  ( |  AcDbDwgFiler *  |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbAssocIndexPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocObjectAndIndexPersSubentId::dwgOutFieldsData  |  ( |  AcDbDwgFiler *  |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbAssocIndexPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocObjectAndIndexPersSubentId::dxfInFields  |  ( |  AcDbDxfFiler *  |   | )
virtual
Warning
Not implemented!
Reimplemented from AcDbAssocIndexPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocObjectAndIndexPersSubentId::dxfOutFields  |  ( |  AcDbDxfFiler *  |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbAssocIndexPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocObjectAndIndexPersSubentId::dxfOutFieldsData  |  ( |  AcDbDxfFiler *  |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbAssocIndexPersSubentId.
 bool AcDbAssocObjectAndIndexPersSubentId::operator<  |  ( |  const AcDbAssocObjectAndIndexPersSubentId &  |  other | ) |   const
Warning
Not implemented!
 bool AcDbAssocObjectAndIndexPersSubentId::operator==  |  ( |  const AcDbAssocObjectAndIndexPersSubentId &  |  other | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocIndexPersSubentId.h