Public Member Functions | Protected Member Functions | Friends | List of all members
AcApLongTransactionReactor Class Reference
AcTransaction Classes
  Inheritance diagram for AcApLongTransactionReactor:
 Public Member Functions
 virtual void  | abortLongTransaction (AcDbLongTransaction &)
ACRX_DECLARE_MEMBERS (AcApLongTransactionReactor)
 virtual void  | beginCheckIn (AcDbLongTransaction &)
 virtual void  | beginCheckOut (AcDbLongTransaction &, AcDbObjectIdArray &originList)
 virtual void  | endCheckIn (AcDbLongTransaction &)
 virtual void  | endCheckOut (AcDbLongTransaction &)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 Acad::ErrorStatus  | veto ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcApImpLongTransactionManager
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
lngtrans.h