Public Member Functions | List of all members
AcRxAttributeCollection Class Reference
AcRx Classes
  Inheritance diagram for AcRxAttributeCollection:
 Public Member Functions
ACBASE_PORT  | AcRxAttributeCollection ()
ACBASE_PORT Acad::ErrorStatus  | add (const AcRxAttribute *attribute)
ACBASE_PORT int  | count () const
ACBASE_PORT const AcRxAttribute *  | get (const AcRxClass *type) const
ACBASE_PORT AcRxAttribute *  | get (const AcRxClass *type)
ACBASE_PORT const AcRxAttribute *  | getAt (int index) const
ACBASE_PORT AcRxAttribute *  | getAt (int index)
ACBASE_PORT Acad::ErrorStatus  | override (const AcRxAttribute *attribute)
ACBASE_PORT Acad::ErrorStatus  | remove (const AcRxAttribute *attribute)
 Additional Inherited Members
 Protected Member Functions inherited from Pimpl::ApiPart< void, AcRxAttributeCollectionImp >
ApiPart (AcRxAttributeCollectionImp *pImp) throw ()
Constructor & Destructor Documentation
 ACBASE_PORT AcRxAttributeCollection::AcRxAttributeCollection  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT Acad::ErrorStatus AcRxAttributeCollection::add  |  ( |  const AcRxAttribute *  |  attribute | )
Warning
Not implemented!
 ACBASE_PORT int AcRxAttributeCollection::count  |  ( |   | ) |   const
Warning
Not implemented!
 ACBASE_PORT const AcRxAttribute* AcRxAttributeCollection::get  |  ( |  const AcRxClass *  |  type | ) |   const
Warning
Not implemented!
 ACBASE_PORT AcRxAttribute* AcRxAttributeCollection::get  |  ( |  const AcRxClass *  |  type | )
Warning
Not implemented!
 ACBASE_PORT const AcRxAttribute* AcRxAttributeCollection::getAt  |  ( |  int  |  index | ) |   const
Warning
Not implemented!
 ACBASE_PORT AcRxAttribute* AcRxAttributeCollection::getAt  |  ( |  int  |  index | )
Warning
Not implemented!
 ACBASE_PORT Acad::ErrorStatus AcRxAttributeCollection::override  |  ( |  const AcRxAttribute *  |  attribute | )
Warning
Not implemented!
 ACBASE_PORT Acad::ErrorStatus AcRxAttributeCollection::remove  |  ( |  const AcRxAttribute *  |  attribute | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxattrib.h