Public Member Functions | List of all members
AcGeOffsetCurve3d Class Reference
AcGe Classes
  Inheritance diagram for AcGeOffsetCurve3d:
 Public Member Functions
AcGeOffsetCurve3d (const AcGeCurve3d &baseCurve, const AcGeVector3d &planeNormal, double offsetDistance)
AcGeOffsetCurve3d (const AcGeOffsetCurve3d &offsetCurve)
 const AcGeCurve3d *  | curve () const
 AcGeVector3d  | normal () const
 double  | offsetDistance () const
 AcGeOffsetCurve3d &  | operator= (const AcGeOffsetCurve3d &offsetCurve)
 Adesk::Boolean  | paramDirection () const
 AcGeOffsetCurve3d &  | setCurve (const AcGeCurve3d &baseCurve)
 AcGeOffsetCurve3d &  | setNormal (const AcGeVector3d &planeNormal)
 AcGeOffsetCurve3d &  | setOffsetDistance (double offsetDistance)
 AcGeMatrix3d  | transformation () const
 Public Member Functions inherited from AcGeCurve3d
 Adesk::Boolean  | area (double startParam, double endParam, double &value, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeBoundBlock3d  | boundBlock () const
 AcGeBoundBlock3d  | boundBlock (const AcGeInterval &range) const
 AcGePoint3d  | closestPointTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | closestPointTo (const AcGeCurve3d &curve3d, AcGePoint3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGeCurve3d &curve, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | evalPoint (double param) const
 AcGePoint3d  | evalPoint (double param, int numDeriv, AcGeVector3dArray &derivArray) const
 Adesk::Boolean  | explode (AcGeVoidPointerArray &explodedCurves, AcGeIntArray &newExplodedCurves, const AcGeInterval *intrvl=NULL) const
 void  | getClosestPointTo (const AcGePoint3d &pnt, AcGePointOnCurve3d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getClosestPointTo (const AcGeCurve3d &curve3d, AcGePointOnCurve3d &pntOnThisCrv, AcGePointOnCurve3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getInterval (AcGeInterval &intrvl) const
 void  | getInterval (AcGeInterval &intrvl, AcGePoint3d &start, AcGePoint3d &end) const
 void  | getLocalClosestPoints (const AcGePoint3d &point, AcGePointOnCurve3d &approxPnt, const AcGeInterval *nbhd=0, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getLocalClosestPoints (const AcGeCurve3d &otherCurve, AcGePointOnCurve3d &approxPntOnThisCrv, AcGePointOnCurve3d &approxPntOnOtherCrv, const AcGeInterval *nbhd1=0, const AcGeInterval *nbhd2=0, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | getNormalPoint (const AcGePoint3d &pnt, AcGePointOnCurve3d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getProjClosestPointTo (const AcGePoint3d &pnt, const AcGeVector3d &projectDirection, AcGePointOnCurve3d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getProjClosestPointTo (const AcGeCurve3d &curve3d, const AcGeVector3d &projectDirection, AcGePointOnCurve3d &pntOnThisCrv, AcGePointOnCurve3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getSamplePoints (double fromParam, double toParam, double approxEps, AcGePoint3dArray &pointArray, AcGeDoubleArray &paramArray, bool forceResampling=false) const
 void  | getSamplePoints (int numSample, AcGePoint3dArray &pointArray) const
 void  | getSamplePoints (int numSample, AcGePoint3dArray &pointArray, AcGeDoubleArray &paramArray) const
 void  | getSplitCurves (double param, AcGeCurve3d *&piece1, AcGeCurve3d *&piece2) const
 void  | getTrimmedOffset (double distance, const AcGeVector3d &planeNormal, AcGeVoidPointerArray &offsetCurveList, AcGe::OffsetCrvExtType extensionType=AcGe::kFillet, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | hasEndPoint (AcGePoint3d &endPnt) const
 Adesk::Boolean  | hasStartPoint (AcGePoint3d &startPnt) const
 Adesk::Boolean  | isClosed (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isCoplanarWith (const AcGeCurve3d &curve3d, AcGePlane &plane, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isDegenerate (AcGe::EntityId &degenerateType, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isDegenerate (AcGeEntity3d *&pConvertedEntity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isLinear (AcGeLine3d &line, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, double &param, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (double param, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isPeriodic (double &period) const
 Adesk::Boolean  | isPlanar (AcGePlane &plane, const AcGeTol &tol=AcGeContext::gTol) const
 double  | length (double fromParam, double toParam, double tol=AcGeContext::gTol.equalPoint()) const
 AcGeCurve3d &  | operator= (const AcGeCurve3d &curve)
 AcGeBoundBlock3d  | orthoBoundBlock () const
 AcGeBoundBlock3d  | orthoBoundBlock (const AcGeInterval &range) const
 AcGeEntity3d *  | orthoProject (const AcGePlane &projectionPlane, const AcGeTol &tol=AcGeContext::gTol) const
 double  | paramAtLength (double datumParam, double length, Adesk::Boolean posParamDir=Adesk::kTrue, double tol=AcGeContext::gTol.equalPoint()) const
 double  | paramOf (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | projClosestPointTo (const AcGePoint3d &pnt, const AcGeVector3d &projectDirection, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | projClosestPointTo (const AcGeCurve3d &curve3d, const AcGeVector3d &projectDirection, AcGePoint3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d *  | project (const AcGePlane &projectionPlane, const AcGeVector3d &projectDirection, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeCurve3d &  | reverseParam ()
 AcGeCurve3d &  | setInterval ()
 Adesk::Boolean  | setInterval (const AcGeInterval &intrvl)
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeCurve3d
AcGeCurve3d (const AcGeCurve3d &)
 Protected Member Functions inherited from AcGeEntity3d
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 class AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
geoffc3d.h