Public Member Functions | List of all members
AcGiVisualStyleTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiVisualStyleTraits:
 Public Member Functions
 virtual const AcGiVisualStyle &  | acgiVisualStyle (void) const =0
ACRX_DECLARE_MEMBERS (AcGiVisualStyleTraits)
 virtual void  | setAcGiVisualStyle (const AcGiVisualStyle &visualStyle)=0
 Public Member Functions inherited from AcGiDrawableTraits
ACRX_DECLARE_MEMBERS (AcGiDrawableTraits)
 virtual void  | addLight (const AcDbObjectId &lightId)
 virtual AcGiContext *  | context (void) const
 virtual AcGiVariant  | highlightProperty (HighlightProperty property) const
 virtual AcGiLineType  | linePattern (void) const
 virtual SelectionFlags  | selectionFlags (void) const
 virtual Acad::ErrorStatus  | setHighlightProperty (HighlightProperty property, AcGiVariant &value)
 virtual void  | setLinePattern (const AcGiLineType linePattern)
 virtual Acad::ErrorStatus  | setSelectionFlags (const SelectionFlags flags)
 virtual void  | setupForEntity (AcDbEntity *pEntity)
 Public Member Functions inherited from AcGiSubEntityTraits
ACRX_DECLARE_MEMBERS (AcGiSubEntityTraits)
 virtual void  | clearMarkerOverride (void)
 virtual Adesk::UInt16  | color (void) const =0
 virtual Adesk::UInt32  | drawFlags (void) const
virtual const AcGiFill *  | fill (void) const
 virtual AcGiFillType  | fillType (void) const =0
virtual AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
 virtual AcDbObjectId  | layerId (void) const =0
 virtual AcDbObjectId  | lineTypeId (void) const =0
 virtual double  | lineTypeScale (void) const =0
 virtual AcDb::LineWeight  | lineWeight (void) const =0
 virtual const AcGiMapper *  | mapper (void) const
 virtual AcDbObjectId  | materialId (void) const
 virtual void  | popMarkerOverride (void)
 virtual void  | pushMarkerOverride (bool, const Adesk::LongPtr)
 virtual bool  | sectionable (void) const
 virtual bool  | selectionGeom (void) const
 virtual void  | setColor (const Adesk::UInt16 color)=0
 virtual Acad::ErrorStatus  | setDrawFlags (Adesk::UInt32 flags)
virtual void  | setFill (const AcGiFill *pFill)
 virtual void  | setFillType (const AcGiFillType)=0
 virtual void  | setLayer (const AcDbObjectId layerId)=0
 virtual void  | setLineType (const AcDbObjectId linetypeId)=0
 virtual void  | setLineTypeScale (double dScale=1.0)=0
 virtual void  | setLineWeight (const AcDb::LineWeight lw)=0
 virtual void  | setMapper (const AcGiMapper *mapper)
 virtual void  | setMaterial (const AcDbObjectId materialId)
 virtual void  | setPlotStyleName (AcDb::PlotStyleNameType, const AcDbObjectId &=AcDbObjectId::kNull)
 virtual void  | setSectionable (bool bSectionable)
 virtual void  | setSelectionGeom (bool bSelectionflag)
 virtual void  | setSelectionMarker (const Adesk::LongPtr markerId)=0
 virtual Acad::ErrorStatus  | setShadowFlags (ShadowFlags flags)
 virtual void  | setThickness (double dThickness)=0
virtual void  | setTransparency (const AcCmTransparency &transparency)
 virtual void  | setTrueColor (const AcCmEntityColor &color)=0
 virtual void  | setVisualStyle (const AcDbObjectId visualStyleId)
 virtual ShadowFlags  | shadowFlags (void) const
 virtual double  | thickness (void) const =0
virtual AcCmTransparency  | transparency (void) const
 virtual AcCmEntityColor  | trueColor (void) const =0
 virtual AcDbObjectId  | visualStyle (void) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcGiDrawableTraits
enum  | HighlightProperty { kVertexRolloverHighlightSize }
 Public Types inherited from AcGiSubEntityTraits
enum  | DrawFlags {
 kNoDrawFlags = 0, kDrawBackfaces = 1, kDrawHatchGroup = 2, kDrawFrontfacesOnly = 4,
 kDrawGradientFill = 8, kDrawSolidFill = 16, kDrawNoLineWeight = 32, kDrawNoOptimization = 64,
 kDrawUseAcGiEntityForDgnLineType = 128, kDrawFillTextBoundaryStart = 256, kDrawFillTextBoundaryEnd = 512, kDrawFillSelectionWindow = 1024,
 kDrawNoForceByLayer = 2048
 }
enum  | SelectionFlags { kNoSelectionFlags = 0x00, kSelectionIgnore = 0x01 }
enum  | ShadowFlags { kShadowsCastAndReceive = 0x00, kShadowsDoesNotCast = 0x01, kShadowsDoesNotReceive = 0x02, kShadowsIgnore = kShadowsDoesNotCast | kShadowsDoesNotReceive }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Types inherited from AcGiDrawableTraits
enum  | LayerFlags {
 kNone = 0x00, kOff = 0x01, kFrozen = 0x02, kZero = 0x04,
 kLocked = 0x08
 }
 Protected Member Functions inherited from AcGiDrawableTraits
 virtual void  | setLayerFlags (Adesk::UInt8)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgivisualstyle.h