Public Member Functions | Friends | List of all members
AcDbXrecordIterator Class Reference
AcDb Classes
  Inheritance diagram for AcDbXrecordIterator:
 Public Member Functions
AcDbXrecordIterator (const AcDbXrecord *pXrecord)
ACRX_DECLARE_MEMBERS (AcDbXrecordIterator)
 int  | curRestype () const
 bool  | done () const
 Acad::ErrorStatus  | getCurResbuf (resbuf &outItem, AcDbDatabase *db) const
ACDBCORE2D_PORT Acad::ErrorStatus  | insertRbChain (const resbuf &pRb)
ACDBCORE2D_PORT Acad::ErrorStatus  | modifyCurResbuf (const resbuf &item)
 Acad::ErrorStatus  | next ()
ACDBCORE2D_PORT Acad::ErrorStatus  | removeCurResbuf ()
 void  | start ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpXrecord
 class  | AcDbXrecord
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbXrecordIterator::insertRbChain  |  ( |  const resbuf &  |  pRb | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbXrecordIterator::modifyCurResbuf  |  ( |  const resbuf &  |  item | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbXrecordIterator::removeCurResbuf  |  ( |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbxrecrd.h