Public Member Functions | Protected Attributes | List of all members
AcGiGenericTexture Class Reference
AcGi Classes
  Inheritance diagram for AcGiGenericTexture:
 Public Member Functions
AcGiGenericTexture (const AcGiGenericTexture &texture)
ACRX_DECLARE_MEMBERS (AcGiGenericTexture)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other) override
 AcGiVariant  | definition (void) const
 void  | definition (AcGiVariant *&pDefinition)
 AcGiGenericTexture &  | operator= (const AcGiGenericTexture &texture)
 virtual bool  | operator== (const AcGiMaterialTexture &texture) const override
 void  | setDefinition (const AcGiVariant &definition)
 Public Member Functions inherited from AcGiProceduralTexture
ACRX_DECLARE_MEMBERS (AcGiProceduralTexture)
 Public Member Functions inherited from AcGiMaterialTexture
ACRX_DECLARE_MEMBERS (AcGiMaterialTexture)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Attributes
 AcGiVariant  | m_definition
 Additional Inherited Members
 Public Types inherited from AcGiProceduralTexture
enum  | Type { kWood = 0, kMarble, kGeneric }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgimaterial.h