Public Member Functions | List of all members
AcDbEdgeRef Class Reference
AcDb Classes
  Inheritance diagram for AcDbEdgeRef:
 Public Member Functions
AcDbEdgeRef ()
AcDbEdgeRef (const AcDbEdgeRef &)
AcDbEdgeRef (const AcDbCompoundObjectId &, const AcDbSubentId &edgeSubentId=kNullSubentId, const AcDbSubentId &faceSubentId=kNullSubentId, const AcGeCurve3d *pCurve=NULL)
AcDbEdgeRef (const AcDbFullSubentPath &)
AcDbEdgeRef (const AcDbEntity *pEntity)
AcDbEdgeRef (const AcGeCurve3d *pGeCurve)
ACRX_DECLARE_MEMBERS (AcDbEdgeRef)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *) override
virtual AcDbEntity *  | createEntity () const override
 const AcGeCurve3d *  | curve () const
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry () override
virtual Acad::ErrorStatus  | evaluateCurve (AcGeCurve3d *&) const
 AcDbSubentId  | faceSubentId () const
 virtual bool  | isEmpty () const override
virtual bool  | isValid () const override
AcDbEdgeRef &  | operator= (const AcDbEdgeRef &)
virtual void  | reset () override
void  | setFaceSubentity (const AcDbSubentId &faceSubentId)
virtual  | ~AcDbEdgeRef ()
 Public Member Functions inherited from AcDbSubentRef
AcDbSubentRef (const AcDbCompoundObjectId &, const AcDbSubentId &=kNullSubentId)
ACRX_DECLARE_MEMBERS (AcDbSubentRef)
virtual const AcDbCompoundObjectId &  | entity () const
AcDbSubentRef &  | operator= (const AcDbSubentRef &)
virtual AcDbSubentId  | subentId () const
 Public Member Functions inherited from AcDbGeomRef
ACRX_DECLARE_MEMBERS (AcDbGeomRef)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcDbSubentRef
 void  | setEntity (const AcDbCompoundObjectId &entityId)
void  | setFromSubentPath (const AcDbFullSubentPath &)
 void  | setSubent (const AcDbSubentId &subentId)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbEdgeRef::AcDbEdgeRef  |  ( |   | )
Warning
Not implemented!
 AcDbEdgeRef::AcDbEdgeRef  |  ( |  const AcDbEdgeRef &  |   | )
Warning
Not implemented!
 virtual AcDbEdgeRef::~AcDbEdgeRef  |  ( |   | )
virtual
Warning
Not implemented!
 AcDbEdgeRef::AcDbEdgeRef  |  ( |  const AcDbCompoundObjectId &  |  ,
|  const AcDbSubentId &  |  edgeSubentId = kNullSubentId,
|  const AcDbSubentId &  |  faceSubentId = kNullSubentId,
|  const AcGeCurve3d *  |  pCurve = NULL
)
explicit
Warning
Not implemented!
 AcDbEdgeRef::AcDbEdgeRef  |  ( |  const AcDbFullSubentPath &  |   | )
explicit
Warning
Not implemented!
 AcDbEdgeRef::AcDbEdgeRef  |  ( |  const AcDbEntity *  |  pEntity | )
explicit
Warning
Not implemented!
 AcDbEdgeRef::AcDbEdgeRef  |  ( |  const AcGeCurve3d *  |  pGeCurve | )
explicit
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbEdgeRef::copyFrom  |  ( |  const AcRxObject *  |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 virtual AcDbEntity* AcDbEdgeRef::createEntity  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 virtual Acad::ErrorStatus AcDbEdgeRef::evaluateAndCacheGeometry  |  ( |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 virtual Acad::ErrorStatus AcDbEdgeRef::evaluateCurve  |  ( |  AcGeCurve3d *&  |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcDbEdgeRef::isValid  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 AcDbEdgeRef& AcDbEdgeRef::operator=  |  ( |  const AcDbEdgeRef &  |   | )
Warning
Not implemented!
 virtual void AcDbEdgeRef::reset  |  ( |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 void AcDbEdgeRef::setFaceSubentity  |  ( |  const AcDbSubentId &  |  faceSubentId | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbGeomRef.h