Public Member Functions | List of all members
AcDbLayoutManagerReactor Class Reference
AcDb Classes
  Inheritance diagram for AcDbLayoutManagerReactor:
 Public Member Functions
 virtual void  | abortLayoutCopied (const ACHAR *layoutName, const AcDbObjectId &layoutId)
 virtual void  | abortLayoutRemoved (const ACHAR *layoutName, const AcDbObjectId &layoutId)
 virtual void  | abortLayoutRename (const ACHAR *oldName, const ACHAR *newName, const AcDbObjectId &layoutId)
ACRX_DECLARE_MEMBERS (AcDbLayoutManagerReactor)
 virtual void  | layoutCopied (const ACHAR *oldLayoutName, const AcDbObjectId &oldLayoutId, const ACHAR *newLayoutname, const AcDbObjectId &newLayoutId)
 virtual void  | layoutCreated (const ACHAR *newLayoutName, const AcDbObjectId &layoutId)
 virtual void  | layoutRemoved (const ACHAR *layoutName, const AcDbObjectId &layoutId)
 virtual void  | layoutRenamed (const ACHAR *oldName, const ACHAR *newName, const AcDbObjectId &layoutId)
 virtual void  | layoutsReordered ()
 virtual void  | layoutSwitched (const ACHAR *newLayoutname, const AcDbObjectId &newLayoutId)
 virtual void  | layoutToBeCopied (const ACHAR *layoutName, const AcDbObjectId &oldLayoutId)
 virtual void  | layoutToBeRemoved (const ACHAR *layoutName, const AcDbObjectId &layoutId)
 virtual void  | layoutToBeRenamed (const ACHAR *oldName, const ACHAR *newName, const AcDbObjectId &layoutId)
 virtual void  | plotStyleTableChanged (const ACHAR *newTableName, const AcDbObjectId &layoutId)
virtual void  | refreshLayoutTabs ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual void AcDbLayoutManagerReactor::refreshLayoutTabs  |  ( |   | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dblaymgrrctr.h