Public Member Functions | List of all members
AcDbRasterImageDefFileAccessReactor Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbRasterImageDefFileAccessReactor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbRasterImageDefFileAccessReactor)
 virtual void  | onAttach (const AcDbRasterImageDef *, const ACHAR *pPath)=0
 virtual void  | onClose (const AcDbRasterImageDef *, const ACHAR *pPath)=0
 virtual void  | onDetach (const AcDbRasterImageDef *, const ACHAR *pPath)=0
 virtual void  | onDialog (AcDbRasterImageDef *, const ACHAR *pCaption, const ACHAR *pFileExtensions)=0
 virtual Adesk::Boolean  | onOpen (const AcDbRasterImageDef *, const ACHAR *pPath, const ACHAR *pActivePath, Adesk::Boolean &replacePath, ACHAR *&replacementPath)=0
 virtual Adesk::Boolean  | onPathChange (const AcDbRasterImageDef *, const ACHAR *pPath, const ACHAR *pActivePath, Adesk::Boolean &replacePath, ACHAR *&replacementPath)=0
virtual  | ~AcDbRasterImageDefFileAccessReactor ()
 Public Member Functions inherited from AcDbObjectReactor
ACRX_DECLARE_MEMBERS (AcDbObjectReactor)
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 virtual void  | openedForModify (const AcDbObject *dbObj)
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual void  | unappended (const AcDbObject *dbObj)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 virtual AcDbRasterImageDefFileAccessReactor::~AcDbRasterImageDefFileAccessReactor  |  ( |   | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
imgdef.h