Public Member Functions | List of all members
AcDbFaceRef Class Reference
AcDb Classes
  Inheritance diagram for AcDbFaceRef:
 Public Member Functions
AcDbFaceRef ()
AcDbFaceRef (const AcDbFaceRef &)
AcDbFaceRef (const AcDbCompoundObjectId &, const AcDbSubentId &=kNullSubentId, class BODY *=NULL)
ACRX_DECLARE_MEMBERS (AcDbFaceRef)
 class BODY *  | asmBody () const
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *) override
virtual AcDbEntity *  | createEntity () const override
 virtual Acad::ErrorStatus  | evaluateAndCacheGeometry () override
 virtual bool  | isEmpty () const override
virtual bool  | isValid () const override
AcDbFaceRef &  | operator= (const AcDbFaceRef &)
virtual void  | reset () override
virtual  | ~AcDbFaceRef ()
 Public Member Functions inherited from AcDbSubentRef
AcDbSubentRef (const AcDbCompoundObjectId &, const AcDbSubentId &=kNullSubentId)
ACRX_DECLARE_MEMBERS (AcDbSubentRef)
virtual const AcDbCompoundObjectId &  | entity () const
AcDbSubentRef &  | operator= (const AcDbSubentRef &)
virtual AcDbSubentId  | subentId () const
 Public Member Functions inherited from AcDbGeomRef
ACRX_DECLARE_MEMBERS (AcDbGeomRef)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcDbSubentRef
 void  | setEntity (const AcDbCompoundObjectId &entityId)
void  | setFromSubentPath (const AcDbFullSubentPath &)
 void  | setSubent (const AcDbSubentId &subentId)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbFaceRef::AcDbFaceRef  |  ( |   | )
Warning
Not implemented!
 AcDbFaceRef::AcDbFaceRef  |  ( |  const AcDbFaceRef &  |   | )
Warning
Not implemented!
 virtual AcDbFaceRef::~AcDbFaceRef  |  ( |   | )
virtual
Warning
Not implemented!
 AcDbFaceRef::AcDbFaceRef  |  ( |  const AcDbCompoundObjectId &  |  ,
|  const AcDbSubentId &  |   = kNullSubentId,
|  class BODY *  |   = NULL
)
explicit
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbFaceRef::copyFrom  |  ( |  const AcRxObject *  |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 virtual AcDbEntity* AcDbFaceRef::createEntity  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 virtual bool AcDbFaceRef::isValid  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 AcDbFaceRef& AcDbFaceRef::operator=  |  ( |  const AcDbFaceRef &  |   | )
Warning
Not implemented!
 virtual void AcDbFaceRef::reset  |  ( |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 The documentation for this class was generated from the following file:
AcDbGeomRef.h