Public Member Functions | List of all members
AcDbAssocDependencyPE Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocDependencyPE:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbAssocDependencyPE)
virtual bool  | allowsDependencies (const AcDbObject *pObject, bool isWriteDependency, const AcRxClass *pActionBodyOrActionClass, const AcDbAssocDependency *pDependency, const AcRxObject *pContext) const
 virtual Acad::ErrorStatus  | redirectDependencyAttachment (AcDbObject *pObject, const AcDbCompoundObjectId &compoundObjectId, AcDbAssocDependency *pDependency, AcDbCompoundObjectId &redirectedCompoundObjectId)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual bool AcDbAssocDependencyPE::allowsDependencies  |  ( |  const AcDbObject *  |  pObject,
|  bool  |  isWriteDependency,
|  const AcRxClass *  |  pActionBodyOrActionClass,
|  const AcDbAssocDependency *  |  pDependency,
|  const AcRxObject *  |  pContext
) |   |  const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocDependencyPE.h