Classes | Public Member Functions | Static Public Member Functions | List of all members
AcRxMemberOverrule Class Reference
AcRx Classes
  Inheritance diagram for AcRxMemberOverrule:
 Classes
struct  | Record
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxMemberOverrule, ACBASE_PORT)
 Public Member Functions inherited from AcRxOverruleBase
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxOverruleBase, ACBASE_PORT)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static ACBASE_PORT Acad::ErrorStatus  | addOverrule (AcRxMember *pOverruledSubject, AcRxMemberOverrule *pOverrule, bool bAddAtLast=false)
static ACBASE_PORT Acad::ErrorStatus  | removeOverrule (AcRxMember *pOverruledSubject, AcRxMemberOverrule *pOverrule)
static ACBASE_PORT Acad::ErrorStatus  | removeOverrules (const AcArray< Record > &overrules)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 static ACBASE_PORT Acad::ErrorStatus AcRxMemberOverrule::addOverrule  |  ( |  AcRxMember *  |  pOverruledSubject,
|  AcRxMemberOverrule *  |  pOverrule,
|  bool  |  bAddAtLast = false
)
static
Warning
Not implemented!
 static ACBASE_PORT Acad::ErrorStatus AcRxMemberOverrule::removeOverrule  |  ( |  AcRxMember *  |  pOverruledSubject,
|  AcRxMemberOverrule *  |  pOverrule
)
static
Warning
Not implemented!
 static ACBASE_PORT Acad::ErrorStatus AcRxMemberOverrule::removeOverrules  |  ( |  const AcArray< Record > &  |  overrules | )
static
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxmember.h