Public Member Functions | List of all members
AcFdFieldResult Class Reference
AcFd Classes
  Inheritance diagram for AcFdFieldResult:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcFdFieldResult)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | setEvaluationStatus (int nStatus, int dwErrCode=0, const ACHAR *pszMsg=NULL)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | setFieldValue (const AcValue *pValue)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcFdFieldResult::setEvaluationStatus  |  ( |  int  |  nStatus,
|  int  |  dwErrCode = 0,
|  const ACHAR *  |  pszMsg = NULL
)
virtual
Warning
Not implemented!
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcFdFieldResult::setFieldValue  |  ( |  const AcValue *  |  pValue | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcField.h