Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcDbAnnotationScale Class Reference
AcDb Classes
  Inheritance diagram for AcDbAnnotationScale:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbAnnotationScale)
 virtual AcString  | collectionName () const override
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pOther) override
 virtual Acad::ErrorStatus  | getDrawingUnits (double &dDrawingUnits) const
 virtual Acad::ErrorStatus  | getIsTemporaryScale (bool &bTemporary) const
 virtual Acad::ErrorStatus  | getName (AcString &name) const override
 virtual Acad::ErrorStatus  | getPaperUnits (double &dPaperUnits) const
 virtual Acad::ErrorStatus  | getScale (double &dScale) const
 virtual bool  | matchScaleId (Adesk::LongPtr id) const
 virtual Acad::ErrorStatus  | setDrawingUnits (const double dDrawingUnits)
 virtual Acad::ErrorStatus  | setName (const AcString &name) override
 virtual Acad::ErrorStatus  | setPaperUnits (double dPaperUnits)
 virtual Adesk::LongPtr  | uniqueIdentifier () const override
 Public Member Functions inherited from AcDbObjectContext
ACRX_DECLARE_MEMBERS (AcDbObjectContext)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
AcDbAnnotationScale (bool)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Protected Attributes
 AcDbImpAnnotationScale *  | mpImp
 Friends
 class  | AcDbSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
Constructor & Destructor Documentation
 AcDbAnnotationScale::AcDbAnnotationScale  |  ( |  bool  |   | )
protected
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbAnnotationScale.h