Public Member Functions | Friends | List of all members
AcGiImageFileTexture Class Reference
AcGi Classes
  Inheritance diagram for AcGiImageFileTexture:
 Public Member Functions
AcGiImageFileTexture (const AcGiImageFileTexture &texture)
ACRX_DECLARE_MEMBERS (AcGiImageFileTexture)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other) override
 AcGiImageFileTexture &  | operator= (const AcGiImageFileTexture &texture)
 virtual bool  | operator== (const AcGiMaterialTexture &texture) const override
 virtual void  | setSourceFileName (const ACHAR *fileName)
 virtual const ACHAR *  | sourceFileName (void) const
 Public Member Functions inherited from AcGiImageTexture
ACRX_DECLARE_MEMBERS (AcGiImageTexture)
 Public Member Functions inherited from AcGiMaterialTexture
ACRX_DECLARE_MEMBERS (AcGiMaterialTexture)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcGiImpImageFileTexture
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgimaterial.h