Public Types | Public Member Functions | Static Public Member Functions | List of all members
AcApDocument Class Referenceabstract
AcAp Classes
  Inheritance diagram for AcApDocument:
 Public Types
enum  | SaveFormat {
 kUnknown = -1, kR12_dxf = 1, kR13_dwg = 4, kR13_dxf = 5,
 kR14_dwg = 8, kR14_dxf = 9, k2000_dwg = 12, k2000_dxf = 13,
 k2000_Template = 14, k2000_Standard = 15, k2000_xml = 16, k2004_dwg = 24,
 k2004_dxf = 25, k2004_Template = 26, k2004_Standard = 27, k2007_dwg = 36,
 k2007_dxf = 37, k2007_Template = 38, k2007_Standard = 39, k2010_dwg = 48,
 k2010_dxf = 49, k2010_Template = 50, k2010_Standard = 51, k2013_dwg = 60,
 k2013_dxf = 61, k2013_Template = 62, k2013_Standard = 63, k2018_dwg = 64,
 k2018_dxf = 65, k2018_Template = 66, k2018_Standard = 67, kNative = k2018_dwg,
 kNative_Template = k2018_Template
 }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcApDocument)
 virtual CDocument *  | cDoc () const =0
ACCORE_PORT AcApCommandLineEditor *  | commandLineEditor () const
 virtual void *  | contextPtr () const =0
 virtual AcDbDatabase *  | database () const =0
 virtual const ACHAR *  | docTitle () const =0
Acad::ErrorStatus  | downgradeDocOpen (bool bPromptForSave)
 virtual AcApStatusBar *  | drawingStatusBar () const =0
 virtual const ACHAR *  | fileName () const =0
 virtual SaveFormat  | formatForSave () const =0
 virtual int  | GetCountOfLispList () const =0
 virtual IDispatch *  | GetIDispatch (bool bAddRef)=0
 virtual AcLispAppInfo *  | GetItemOfLispList (int nIndex) const =0
 virtual AcEdInputPointManager *  | inputPointManager ()=0
 virtual bool  | isCommandInputInactive () const =0
ACCORE_PORT bool  | isNamedDrawing () const
 virtual bool  | isQuiescent () const =0
 virtual bool  | isReadOnly () const =0
 virtual AcAp::DocLockMode  | lockMode (bool bIncludeMyLocks=false) const =0
 virtual AcAp::DocLockMode  | myLockMode () const =0
 Acad::ErrorStatus  | popDbmod ()
 void  | pushDbmod ()
ACCORE_PORT void  | setDocTitle (const ACHAR *title)
ACCORE_PORT void  | setHost (IAcApDocumentHost *pHost)
 virtual AcTransactionManager *  | transactionManager () const =0
Acad::ErrorStatus  | upgradeDocOpen ()
ACCORE_PORT AcApView *  | view () const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
 static ACCORE_PORT Acad::ErrorStatus  | getDwgVersionFromSaveFormat (SaveFormat docFormat, AcDb::AcDbDwgVersion &dwgVer, AcDb::MaintenanceReleaseVersion &dwgMaintVer)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 ACCORE_PORT AcApCommandLineEditor* AcApDocument::commandLineEditor  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcApDocument::downgradeDocOpen  |  ( |  bool  |  bPromptForSave | )
Warning
Not implemented!
 ACCORE_PORT bool AcApDocument::isNamedDrawing  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT void AcApDocument::setDocTitle  |  ( |  const ACHAR *  |  title | )
Warning
Not implemented!
 ACCORE_PORT void AcApDocument::setHost  |  ( |  IAcApDocumentHost *  |  pHost | )
Warning
Not implemented!
 Acad::ErrorStatus AcApDocument::upgradeDocOpen  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT AcApView* AcApDocument::view  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acdocman.h