Classes | Public Member Functions | Static Public Member Functions | Friends | List of all members
AcRxValue Class Reference
AcRx Classes
 Public Member Functions
AcRxValue (const AcRxValue &rhs) throw ()
AcRxValue (const AcRxValueType &type, const AcRxValue &value) throw ()
 template<typename ValueType >
AcRxValue (const ValueType &value) throw ()
 template<>
AcRxValue (const ACHAR *const &value) throw ()
 template<>
ACBASE_PORT  | AcRxValue (const AcString &str) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcGeMatrix3d &m) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcCmColor &clr) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcDbDate &str) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcUnderlayLayer &str) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcGiMaterialColor &clr) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcGiMaterialMap &clr) throw ()
 template<>
ACDB_PORT  | AcRxValue (const AcDbSweepOptions &sweepOptions) throw ()
 template<>
ACDB_PORT  | AcRxValue (const AcDbLoftOptions &loftOptions) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcGiShadowParameters &v) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcGiSkyParameters &v) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcGiToneOperatorParameters &v) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcGiPhotographicExposureParameters &v) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcGiLightAttenuation &v) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (AcDbMText *const &pMText) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcDbTableCellBlockReference &tableCellBlkRef) throw ()
 template<>
ACDB_PORT  | AcRxValue (const AcDbBlockParamValueSet &blcParamValueSet) throw ()
 template<>
ACDB_PORT  | AcRxValue (const AcDbBlkParamValueSetValuesArray &blockParamValueSetArr) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcDbIntArray &intArr) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const DimFillColor &dimFillColor) throw ()
 template<>
ACDBCORE2D_PORT  | AcRxValue (const AcStringArray &stringArray) throw ()
ACBASE_PORT const AcRxEnumTag *  | getEnumTag () const throw ()
 bool  | isEmpty () const throw ()
 bool  | isVaries () const throw ()
 const AcRxValue &  | operator= (const AcRxValue &rhs) throw ()
 template<typename ValueType >
AcRxValue &  | operator= (const ValueType &rhs) throw ()
 template<>
AcRxValue &  | operator= (const ACHAR *const &rhs) throw ()
 ACBASE_PORT bool  | operator== (const AcRxValue &value) const throw ()
ACBASE_PORT size_t  | serializeIn (const void *pBytes, size_t maxBytesToRead) throw ()
ACBASE_PORT size_t  | serializeOut (void *pBytes, size_t &maxBytesToWrite) const throw ()
ACBASE_PORT int  | toString (ACHAR *buffer, size_t sizeInACHARs, AcRxValueType::StringFormat format=AcRxValueType::kStringFormatGlobal) const throw ()
 const AcRxValueType &  | type () const throw ()
 Static Public Member Functions
static ACBASE_PORT const AcRxValue &  | empty () throw ()
static ACBASE_PORT const AcRxValue *  | unbox (const AcRxObject *pO) throw ()
static ACBASE_PORT AcRxValue *  | unbox (AcRxObject *pO) throw ()
static ACBASE_PORT const AcRxValue &  | varies () throw ()
 Friends
 template<typename ValueType >
ValueType *  | rxenum_cast (AcRxValue *value) throw ()
 template<typename ValueType >
const ValueType *  | rxenum_cast (const AcRxValue *value) throw ()
 template<typename ValueType >
ValueType *  | rxvalue_cast (AcRxValue *value) throw ()
 template<typename ValueType >
const ValueType *  | rxvalue_cast (const AcRxValue *value) throw ()
Member Function Documentation
 static ACBASE_PORT const AcRxValue& AcRxValue::empty  |  ( |   | )
 throw  | (
)
static
Warning
Not implemented!
 ACBASE_PORT const AcRxEnumTag* AcRxValue::getEnumTag  |  ( |   | ) |   const
 throw  | (
)
Warning
Not implemented!
 ACBASE_PORT size_t AcRxValue::serializeIn  |  ( |  const void *  |  pBytes,
|  size_t  |  maxBytesToRead
)
 throw  | (
)
Warning
Not implemented!
 ACBASE_PORT size_t AcRxValue::serializeOut  |  ( |  void *  |  pBytes,
|  size_t &  |  maxBytesToWrite
) |   |  const
 throw  | (
)
Warning
Not implemented!
 ACBASE_PORT int AcRxValue::toString  |  ( |  ACHAR *  |  buffer,
|  size_t  |  sizeInACHARs,
|  AcRxValueType::StringFormat  |  format = AcRxValueType::kStringFormatGlobal
) |   |  const
 throw  | (
)
Warning
Not implemented!
 static ACBASE_PORT const AcRxValue* AcRxValue::unbox  |  ( |  const AcRxObject *  |  pO | )
 throw  | (
)
static
Warning
Not implemented!
 static ACBASE_PORT AcRxValue* AcRxValue::unbox  |  ( |  AcRxObject *  |  pO | )
 throw  | (
)
static
Warning
Not implemented!
 static ACBASE_PORT const AcRxValue& AcRxValue::varies  |  ( |   | )
 throw  | (
)
static
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxvalue.h