Public Member Functions | List of all members
AcEdSelectionSetService Class Referenceabstract
AcEd Classes
 Public Member Functions
 virtual Acad::ErrorStatus  | add (resbuf *ssnameXList, const AcDbFullSubentPath *pPath=NULL, const AcDbObjectId *pEntselSubent=NULL)=0
 virtual Acad::ErrorStatus  | add (const AcArray< resbuf * > &ssnameXList, const AcArray< AcDbFullSubentPath * > *pPath, bool bAddsAreUnique)=0
 virtual Acad::ErrorStatus  | addSubentities (resbuf *ssnameXList, const AcArray< AcDbFullSubentPath > &subEntities, bool bAddsAreUnique)=0
 virtual Acad::ErrorStatus  | addSubentity (resbuf *ssnameXList, const AcDbFullSubentPath &subEntity)=0
 virtual Acad::ErrorStatus  | getSubSelectionPoints (AcGePoint3dArray &points)=0
 virtual Acad::ErrorStatus  | highlight (int subSelectionIndex, const AcDbFullSubentPath &path)=0
 virtual Acad::ErrorStatus  | remove (int index)=0
 virtual Acad::ErrorStatus  | remove (const AcArray< int > &indices)=0
 virtual Acad::ErrorStatus  | removeSubentities (int entityIndex, const AcArray< int > &subEntityIndices)=0
 virtual Acad::ErrorStatus  | removeSubentity (int entityIndex, int subEntityIndex)=0
 virtual Acad::ErrorStatus  | ssNameSubentities (bool bIsSubSelectionIndex, int index, AcDbFullSubentPathArray &subEntities)=0
 virtual Acad::ErrorStatus  | ssNameSubentityX (bool bIsSubSelectionIndex, int index, int subentityIndex, resbuf *&result)=0
 virtual Acad::ErrorStatus  | ssNameX (bool bIsSubSelectionIndex, int index, resbuf *&result)=0
 virtual int  | subSelectionMode ()=0
 The documentation for this class was generated from the following file:
acssgetfilter.h