Public Member Functions | List of all members
IAdHostWindow Class Referenceabstract
Misc Classes
  Inheritance diagram for IAdHostWindow:
 Public Member Functions
 virtual HWND  | windowHandle ()=0
 The documentation for this class was generated from the following file:
IAdHostWindow.h