Public Member Functions | Friends | List of all members
AcApDocWindowIterator Class Reference
AcAp Classes
 Public Member Functions
ACAD_PORT AcApDocWindow *  | current ()
warning Not implemented! More...
ACAD_PORT bool  | done () const
warning Not implemented! More...
ACAD_PORT void  | step ()
warning Not implemented! More...
ACAD_PORT  | ~AcApDocWindowIterator ()
warning Not implemented! More...
 Friends
 class  | AcApDocWindowManagerImp
Constructor & Destructor Documentation
 ACAD_PORT AcApDocWindowIterator::~AcApDocWindowIterator  |  ( |   | )
warning Not implemented!
Member Function Documentation
 ACAD_PORT AcApDocWindow* AcApDocWindowIterator::current  |  ( |   | )
warning Not implemented!
 ACAD_PORT bool AcApDocWindowIterator::done  |  ( |   | ) |   const
warning Not implemented!
 ACAD_PORT void AcApDocWindowIterator::step  |  ( |   | )
warning Not implemented!
 The documentation for this class was generated from the following file:
AcApDocWindow.h