Public Types | Public Member Functions | List of all members
AcGiSubEntityTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiSubEntityTraits:
 Public Types
enum  | DrawFlags {
 kNoDrawFlags = 0, kDrawBackfaces = 1, kDrawHatchGroup = 2, kDrawFrontfacesOnly = 4,
 kDrawGradientFill = 8, kDrawSolidFill = 16, kDrawNoLineWeight = 32, kDrawNoOptimization = 64,
 kDrawUseAcGiEntityForDgnLineType = 128, kDrawFillTextBoundaryStart = 256, kDrawFillTextBoundaryEnd = 512, kDrawFillSelectionWindow = 1024,
 kDrawNoForceByLayer = 2048
 }
enum  | SelectionFlags { kNoSelectionFlags = 0x00, kSelectionIgnore = 0x01 }
enum  | ShadowFlags { kShadowsCastAndReceive = 0x00, kShadowsDoesNotCast = 0x01, kShadowsDoesNotReceive = 0x02, kShadowsIgnore = kShadowsDoesNotCast | kShadowsDoesNotReceive }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiSubEntityTraits)
 virtual void  | clearMarkerOverride (void)
 virtual Adesk::UInt16  | color (void) const =0
 virtual Adesk::UInt32  | drawFlags (void) const
virtual const AcGiFill *  | fill (void) const
 virtual AcGiFillType  | fillType (void) const =0
virtual AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &) const
 virtual AcDbObjectId  | layerId (void) const =0
 virtual AcDbObjectId  | lineTypeId (void) const =0
 virtual double  | lineTypeScale (void) const =0
 virtual AcDb::LineWeight  | lineWeight (void) const =0
 virtual const AcGiMapper *  | mapper (void) const
 virtual AcDbObjectId  | materialId (void) const
 virtual void  | popMarkerOverride (void)
 virtual void  | pushMarkerOverride (bool, const Adesk::LongPtr)
 virtual bool  | sectionable (void) const
 virtual bool  | selectionGeom (void) const
 virtual void  | setColor (const Adesk::UInt16 color)=0
 virtual Acad::ErrorStatus  | setDrawFlags (Adesk::UInt32 flags)
virtual void  | setFill (const AcGiFill *pFill)
 virtual void  | setFillType (const AcGiFillType)=0
 virtual void  | setLayer (const AcDbObjectId layerId)=0
 virtual void  | setLineType (const AcDbObjectId linetypeId)=0
 virtual void  | setLineTypeScale (double dScale=1.0)=0
 virtual void  | setLineWeight (const AcDb::LineWeight lw)=0
 virtual void  | setMapper (const AcGiMapper *mapper)
 virtual void  | setMaterial (const AcDbObjectId materialId)
 virtual void  | setPlotStyleName (AcDb::PlotStyleNameType, const AcDbObjectId &=AcDbObjectId::kNull)
 virtual void  | setSectionable (bool bSectionable)
 virtual void  | setSelectionGeom (bool bSelectionflag)
 virtual void  | setSelectionMarker (const Adesk::LongPtr markerId)=0
 virtual Acad::ErrorStatus  | setShadowFlags (ShadowFlags flags)
 virtual void  | setThickness (double dThickness)=0
virtual void  | setTransparency (const AcCmTransparency &transparency)
 virtual void  | setTrueColor (const AcCmEntityColor &color)=0
 virtual void  | setVisualStyle (const AcDbObjectId visualStyleId)
 virtual ShadowFlags  | shadowFlags (void) const
 virtual double  | thickness (void) const =0
virtual AcCmTransparency  | transparency (void) const
 virtual AcCmEntityColor  | trueColor (void) const =0
 virtual AcDbObjectId  | visualStyle (void) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 const AcGiFill * AcGiSubEntityTraits::fill  |  ( |  void  |   | ) |   const
inlinevirtual
Warning
Not implemented!
 virtual AcDb::PlotStyleNameType AcGiSubEntityTraits::getPlotStyleNameId  |  ( |  AcDbObjectId &  |   | ) |   const
inlinevirtual
Warning
Not implemented!
 void AcGiSubEntityTraits::setFill  |  ( |  const AcGiFill *  |  pFill | )
inlinevirtual
Warning
Not implemented!
 void AcGiSubEntityTraits::setTransparency  |  ( |  const AcCmTransparency &  |  transparency | )
inlinevirtual
Warning
Not implemented!
 AcCmTransparency AcGiSubEntityTraits::transparency  |  ( |  void  |   | ) |   const
inlinevirtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acgi.h