Public Member Functions | List of all members
AcGeTorus Class Reference
AcGe Classes
  Inheritance diagram for AcGeTorus:
 Public Member Functions
AcGeTorus (double majorRadius, double minorRadius, const AcGePoint3d &origin, const AcGeVector3d &axisOfSymmetry)
AcGeTorus (double majorRadius, double minorRadius, const AcGePoint3d &origin, const AcGeVector3d &axisOfSymmetry, const AcGeVector3d &refAxis, double startAngleU, double endAngleU, double startAngleV, double endAngleV)
AcGeTorus (const AcGeTorus &torus)
 AcGeVector3d  | axisOfSymmetry () const
 AcGePoint3d  | center () const
 void  | getAnglesInU (double &start, double &end) const
 void  | getAnglesInV (double &start, double &end) const
 Adesk::Boolean  | intersectWith (const AcGeLinearEnt3d &linEnt, int &intn, AcGePoint3d &p1, AcGePoint3d &p2, AcGePoint3d &p3, AcGePoint3d &p4, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isApple () const
 Adesk::Boolean  | isDegenerate () const
 Adesk::Boolean  | isDoughnut () const
 Adesk::Boolean  | isHollow () const
 Adesk::Boolean  | isLemon () const
 Adesk::Boolean  | isOuterNormal () const
 Adesk::Boolean  | isVortex () const
 double  | majorRadius () const
 double  | minorRadius () const
 AcGeTorus &  | operator= (const AcGeTorus &torus)
 AcGeVector3d  | refAxis () const
 AcGeTorus &  | set (double majorRadius, double minorRadius, const AcGePoint3d &origin, const AcGeVector3d &axisOfSymmetry)
 AcGeTorus &  | set (double majorRadius, double minorRadius, const AcGePoint3d &origin, const AcGeVector3d &axisOfSymmetry, const AcGeVector3d &refAxis, double startAngleU, double endAngleU, double startAngleV, double endAngleV)
 AcGeTorus &  | set (const AcGePoint3d &cent, const AcGeVector3d &nrm, const AcGeVector3d &refVec, double radius, double startAngle, double endAngle)
 AcGeTorus &  | set (const AcGePoint3d &cent, const AcGeVector3d &nrm, double radius)
 AcGeTorus &  | setAnglesInU (double start, double end)
 AcGeTorus &  | setAnglesInV (double start, double end)
 AcGeTorus &  | setMajorRadius (double radius)
 AcGeTorus &  | setMinorRadius (double radius)
 Public Member Functions inherited from AcGeSurface
 AcGePoint3d  | closestPointTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param, int derivOrd, AcGeVector3dArray &derivatives) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param, int derivOrd, AcGeVector3dArray &derivatives, AcGeVector3d &normal) const
 void  | getClosestPointTo (const AcGePoint3d &pnt, AcGePointOnSurface &result, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getEnvelope (AcGeInterval &intrvlX, AcGeInterval &intrvlY) const
 Adesk::Boolean  | isClosedInU (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isClosedInV (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isNormalReversed () const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, AcGePoint2d &paramPoint, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeSurface &  | operator= (const AcGeSurface &otherSurface)
 AcGePoint2d  | paramOf (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeSurface &  | reverseNormal ()
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeSurface
AcGeSurface (const AcGeSurface &)
 Protected Member Functions inherited from AcGeEntity3d
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 class AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
getorus.h