Public Member Functions | List of all members
AcEdSubSelectFilterService Class Referenceabstract
AcEd Classes
 Public Member Functions
 virtual Acad::ErrorStatus  | add (resbuf *ssnameXList, const AcDbFullSubentPath &path)=0
 virtual Acad::ErrorStatus  | remove (bool bIsSubSelectionIndex, int index)=0
 virtual Acad::ErrorStatus  | ssNameX (bool bIsSubSelectionIndex, int index, resbuf *&result)=0
 The documentation for this class was generated from the following file:
acssgetfilter.h