Public Member Functions | List of all members
AcApProfileManagerReactor Class Reference
AcAp Classes
 Public Member Functions
virtual void  | currentProfileChanged (const ACHAR *newProfile)
virtual void  | currentProfileReset (const ACHAR *currentProfile)
virtual void  | currentProfileSaved (const ACHAR *currentProfile)
virtual void  | currentProfileWillBeReset (const ACHAR *currentProfile)
virtual void  | currentProfileWillBeSaved (const ACHAR *currentProfile)
virtual void  | currentProfileWillChange (const ACHAR *newProfile)
virtual void  | profileReset (const ACHAR *profileName)
virtual void  | profileSaved (const ACHAR *profileName)
virtual void  | profileWillBeSaved (const ACHAR *profileName)
virtual void  | profileWillReset (const ACHAR *profileName)
virtual  | ~AcApProfileManagerReactor ()
Constructor & Destructor Documentation
 virtual AcApProfileManagerReactor::~AcApProfileManagerReactor  |  ( |   | )
inlinevirtual
Warning
Not implemented!
Member Function Documentation
 virtual void AcApProfileManagerReactor::currentProfileChanged  |  ( |  const ACHAR *  |  newProfile | )
virtual
Warning
Not implemented!
 virtual void AcApProfileManagerReactor::currentProfileReset  |  ( |  const ACHAR *  |  currentProfile | )
virtual
Warning
Not implemented!
 virtual void AcApProfileManagerReactor::currentProfileSaved  |  ( |  const ACHAR *  |  currentProfile | )
virtual
Warning
Not implemented!
 virtual void AcApProfileManagerReactor::currentProfileWillBeReset  |  ( |  const ACHAR *  |  currentProfile | )
virtual
Warning
Not implemented!
 virtual void AcApProfileManagerReactor::currentProfileWillBeSaved  |  ( |  const ACHAR *  |  currentProfile | )
virtual
Warning
Not implemented!
 virtual void AcApProfileManagerReactor::currentProfileWillChange  |  ( |  const ACHAR *  |  newProfile | )
virtual
Warning
Not implemented!
 virtual void AcApProfileManagerReactor::profileReset  |  ( |  const ACHAR *  |  profileName | )
virtual
Warning
Not implemented!
 virtual void AcApProfileManagerReactor::profileSaved  |  ( |  const ACHAR *  |  profileName | )
virtual
Warning
Not implemented!
 virtual void AcApProfileManagerReactor::profileWillBeSaved  |  ( |  const ACHAR *  |  profileName | )
virtual
Warning
Not implemented!
 virtual void AcApProfileManagerReactor::profileWillReset  |  ( |  const ACHAR *  |  profileName | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acprofile-reactor.h