Public Types | Public Member Functions | Protected Member Functions | Friends | List of all members
AcDbDimension Class Reference
AcDb Classes
  Inheritance diagram for AcDbDimension:
 Public Types
enum  | CenterMarkType { kMark = 0, kLine = 1, kNone = 2 }
enum  | DimInspect {
 kShapeRemove = 0, kShapeRound = 1, kShapeAngular = 2, kShapeNone = 4,
 kShapeLabel = 0x10, kShapeRate = 0x20
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbDimension)
ACDBCORE2D_PORT Acad::ErrorStatus  | alternatePrefix (AcString &) const
ACDBCORE2D_PORT Acad::ErrorStatus  | alternateSuffix (AcString &) const
ACDBCORE2D_PORT bool  | altSuppressLeadingZeros () const
ACDBCORE2D_PORT bool  | altSuppressTrailingZeros () const
ACDBCORE2D_PORT bool  | altSuppressZeroFeet () const
ACDBCORE2D_PORT bool  | altSuppressZeroInches () const
ACDBCORE2D_PORT bool  | altToleranceSuppressLeadingZeros () const
ACDBCORE2D_PORT bool  | altToleranceSuppressTrailingZeros () const
ACDBCORE2D_PORT bool  | altToleranceSuppressZeroFeet () const
ACDBCORE2D_PORT bool  | altToleranceSuppressZeroInches () const
 AcGeMatrix3d  | blockTransform () const
ACDBCORE2D_PORT double  | centerMarkSize () const
ACDBCORE2D_PORT AcDbDimension::CenterMarkType  | centerMarkType () const
 AcDbObjectId  | dimBlockId () const
 AcGePoint3d  | dimBlockPosition () const
 AcDbObjectId  | dimensionStyle () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | dimensionText (AcString &sDimText) const
 ACHAR *  | dimensionText () const
 AcDbObjectId  | dimExt1Linetype () const
 AcDbObjectId  | dimExt2Linetype () const
 int  | dimfit () const
 AcDbObjectId  | dimLineLinetype () const
 int  | dimunit () const
virtual void  | dragStatus (const AcDb::DragStat status) override
 double  | elevation () const
 virtual void  | erased (AcDbObject *dbObj, Adesk::Boolean bErasing)
 Acad::ErrorStatus  | fieldFromMText (AcDbMText *pDimMText)
 Acad::ErrorStatus  | fieldToMText (AcDbMText *pDimMText)
 ACDBCORE2D_PORT Acad::ErrorStatus  | formatMeasurement (AcString &sMTextContent, double measurement, const ACHAR *dimensionText=nullptr)
Acad::ErrorStatus  | formatMeasurement (ACHAR *MTextContentBuffer, size_t contentBufferLen, double measurement, ACHAR *dimensionText)
 Acad::ErrorStatus  | generateLayout ()
 bool  | getArrowFirstIsFlipped () const
 bool  | getArrowSecondIsFlipped () const
 Acad::ErrorStatus  | getDimstyleData (AcDbDimStyleTableRecord *&pRecord) const
 Acad::ErrorStatus  | getOsnapPointsAtSubentPath (AcDb::OsnapMode osnapMode, const AcDbFullSubentPath &subentId, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const override
 double  | horizontalRotation () const
 bool  | inspection () const
 int  | inspectionFrame () const
 const ACHAR *  | inspectionLabel () const
 const ACHAR *  | inspectionRate () const
bool  | isConstraintDynamic (void) const
bool  | isConstraintObject () const
bool  | isConstraintObject (bool &hasExpression, bool &isReferenceConstraint) const
 bool  | isDynamicDimension () const
bool  | isHorizontalRefTextRotation () const
 virtual Adesk::Boolean  | isPlanar () const override
 Adesk::Boolean  | isUsingDefaultTextPosition () const
 Acad::ErrorStatus  | measurement (double &val)
 AcGeVector3d  | normal () const
 virtual void  | objectClosed (const AcDbObjectId dbObj) override
ACDBCORE2D_PORT Acad::ErrorStatus  | prefix (AcString &sPrefix) const
 Acad::ErrorStatus  | recomputeDimBlock (bool forceUpdate=true)
 Acad::ErrorStatus  | removeTextField ()
ACDBCORE2D_PORT void  | resetTextDefinedSize ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setAlternatePrefix (const AcString &)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAlternateSuffix (const AcString &)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAltSuppressLeadingZeros (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAltSuppressTrailingZeros (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAltSuppressZeroFeet (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAltSuppressZeroInches (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAltToleranceSuppressLeadingZeros (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAltToleranceSuppressTrailingZeros (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAltToleranceSuppressZeroFeet (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAltToleranceSuppressZeroInches (bool)
 Acad::ErrorStatus  | setArrowFirstIsFlipped (bool bIsFlipped)
 Acad::ErrorStatus  | setArrowSecondIsFlipped (bool bIsFlipped)
Acad::ErrorStatus  | setConstraintDynamic (bool bDynamic)
 Acad::ErrorStatus  | setDimBlockId (const AcDbObjectId &)
 Acad::ErrorStatus  | setDimBlockPosition (const AcGePoint3d &)
 Acad::ErrorStatus  | setDimensionStyle (AcDbObjectId)
 Acad::ErrorStatus  | setDimensionText (const ACHAR *)
 Acad::ErrorStatus  | setDimExt1Linetype (const AcDbObjectId linetype)
 Acad::ErrorStatus  | setDimExt2Linetype (const AcDbObjectId linetype)
 Acad::ErrorStatus  | setDimfit (int)
 Acad::ErrorStatus  | setDimLineLinetype (const AcDbObjectId linetype)
 Acad::ErrorStatus  | setDimstyleData (AcDbDimStyleTableRecord *pNewData)
 Acad::ErrorStatus  | setDimstyleData (AcDbObjectId newDataId)
 Acad::ErrorStatus  | setDimunit (int)
 Acad::ErrorStatus  | setDynamicDimension (bool newVal)
 Acad::ErrorStatus  | setElevation (double)
Acad::ErrorStatus  | setHorizontalRefTextRotation (bool newVal)
 Acad::ErrorStatus  | setHorizontalRotation (double newVal)
 Acad::ErrorStatus  | setInspection (bool val)
 Acad::ErrorStatus  | setInspectionFrame (int frame)
 Acad::ErrorStatus  | setInspectionLabel (const ACHAR *label)
 Acad::ErrorStatus  | setInspectionRate (const ACHAR *label)
 Acad::ErrorStatus  | setNormal (const AcGeVector3d &)
ACDBCORE2D_PORT Acad::ErrorStatus  | setPrefix (const AcString &)
void  | setShouldParticipateInOPM (bool bShouldParticipate)
ACDBCORE2D_PORT Acad::ErrorStatus  | setSuffix (const AcString &)
ACDBCORE2D_PORT Acad::ErrorStatus  | setSuppressAngularLeadingZeros (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setSuppressAngularTrailingZeros (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setSuppressLeadingZeros (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setSuppressTrailingZeros (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setSuppressZeroFeet (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setSuppressZeroInches (bool)
 Acad::ErrorStatus  | setTextAttachment (AcDbMText::AttachmentPoint eAtt)
ACDBCORE2D_PORT void  | setTextDefinedSize (double width, double height)
 Acad::ErrorStatus  | setTextLineSpacingFactor (double dFactor)
 Acad::ErrorStatus  | setTextLineSpacingStyle (AcDb::LineSpacingStyle eStyle)
 Acad::ErrorStatus  | setTextPosition (const AcGePoint3d &)
 Acad::ErrorStatus  | setTextRotation (double)
ACDBCORE2D_PORT Acad::ErrorStatus  | setToleranceSuppressLeadingZeros (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setToleranceSuppressTrailingZeros (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setToleranceSuppressZeroFeet (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setToleranceSuppressZeroInches (bool)
ACDBCORE2D_PORT Acad::ErrorStatus  | setUsingDefaultTextPosition (bool)
bool  | shouldParticipateInOPM (void) const
ACDBCORE2D_PORT Acad::ErrorStatus  | suffix (AcString &) const
ACDBCORE2D_PORT bool  | suppressAngularLeadingZeros () const
ACDBCORE2D_PORT bool  | suppressAngularTrailingZeros () const
ACDBCORE2D_PORT bool  | suppressLeadingZeros () const
ACDBCORE2D_PORT bool  | suppressTrailingZeros () const
ACDBCORE2D_PORT bool  | suppressZeroFeet () const
ACDBCORE2D_PORT bool  | suppressZeroInches () const
 AcDbMText::AttachmentPoint  | textAttachment () const
ACDBCORE2D_PORT void  | textDefinedSize (double &width, double &height) const
 double  | textLineSpacingFactor () const
 AcDb::LineSpacingStyle  | textLineSpacingStyle () const
 AcGePoint3d  | textPosition () const
 double  | textRotation () const
ACDBCORE2D_PORT bool  | toleranceSuppressLeadingZeros () const
ACDBCORE2D_PORT bool  | toleranceSuppressTrailingZeros () const
ACDBCORE2D_PORT bool  | toleranceSuppressZeroFeet () const
ACDBCORE2D_PORT bool  | toleranceSuppressZeroInches () const
 Acad::ErrorStatus  | useDefaultTextPosition ()
 Acad::ErrorStatus  | useSetTextPosition ()
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths) ADESK_SEALED
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj) override
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo) override
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual bool  | bounds (AcDbExtents &bounds) const override
 virtual bool  | castShadows () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | cloneMeForDragging () ADESK_SEALED
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths) ADESK_SEALED
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable () override
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) override
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const override
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) override
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const override
 AcCmEntityColor  | entityColor () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const ADESK_SEALED
 virtual void  | getEcs (AcGeMatrix3d &retVal) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const ADESK_SEALED
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const ADESK_SEALED
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=nullptr) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | gripStatus (const AcDb::GripStat status) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL bool  | hideMeForDragging () const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const ADESK_SEALED
AcGiHighlightStyle  | highlightState (const AcDbFullSubentPath &subId)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const ADESK_SEALED
ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL bool  | isContentSnappable () const ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | layer (AcString &sName) const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | linetype (AcString &sName) const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | list () const ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | material (AcString &sName) const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | plotStyleName (AcString &sName) const
 ACHAR *  | plotStyleName () const
Acad::ErrorStatus  | popHighlight (const AcDbFullSubentPath &subId)
Acad::ErrorStatus  | pushHighlight (const AcDbFullSubentPath &subId, AcGiHighlightStyle highlightStyle)
 virtual bool  | receiveShadows () const
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st)
 virtual void  | setCastShadows (bool newVal)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | setColor (const AcCmColor &color, bool doSubents, AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, bool doSubents=true) final
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual void  | setReceiveShadows (bool newVal)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true) ADESK_SEALED
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId visualStyleId, VisualStyleType vsType=kFullVisualStyle, Adesk::Boolean doSubents=true)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL AcDbEntity *  | subentPtr (const AcDbFullSubentPath &id) const ADESK_SEALED
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform) ADESK_SEALED
 AcCmTransparency  | transparency () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const ADESK_SEALED
 AcDb::Visibility  | visibility () const
AcDbObjectId  | visualStyleId (VisualStyleType vsType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 AcDbObjectId  | subDimensionStyle () const
Acad::ErrorStatus  | subGetDimstyleData (AcDbDimStyleTableRecord *&pRecord) const
 Acad::ErrorStatus  | subSetDimensionStyle (AcDbObjectId dimStyleId)
Acad::ErrorStatus  | subSetDimstyleData (AcDbDimStyleTableRecord *pNewData)
Acad::ErrorStatus  | subSetDimstyleData (AcDbObjectId newDataId)
 Protected Member Functions inherited from AcDbEntity
AcDbEntity (const AcDbEntity &)=delete
 AcDbEntity &  | operator= (const AcDbEntity &)=delete
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &entitySet) const
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const override
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &stretchPoints) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=nullptr) const
 virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const
 virtual void  | subGripStatus (const AcDb::GripStat status)
 virtual bool  | subHideMeForDragging () const
 virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
virtual ACDBCORE2D_PORT AcGiHighlightStyle  | subHighlightState (const AcDbFullSubentPath &subId)
 virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
virtual bool  | subIsContentSnappable () const
 virtual void  | subList () const
 virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subPopHighlight (const AcDbFullSubentPath &subId)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subPushHighlight (const AcDbFullSubentPath &subId, AcGiHighlightStyle highlightStyle)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &id) const
 virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual ACDBCORE2D_PORT AcDb::Visibility  | subVisibility () const
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbDimensionStyleOverrule
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
Member Function Documentation
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::alternatePrefix  |  ( |  AcString &  |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::alternateSuffix  |  ( |  AcString &  |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::altSuppressLeadingZeros  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::altSuppressTrailingZeros  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::altSuppressZeroFeet  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::altSuppressZeroInches  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::altToleranceSuppressLeadingZeros  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::altToleranceSuppressTrailingZeros  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::altToleranceSuppressZeroFeet  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::altToleranceSuppressZeroInches  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbDimension::centerMarkSize  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbDimension::CenterMarkType AcDbDimension::centerMarkType  |  ( |   | ) |   const
Warning
Not implemented!
 virtual void AcDbDimension::dragStatus  |  ( |  const AcDb::DragStat  |  status | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 Acad::ErrorStatus AcDbDimension::formatMeasurement  |  ( |  ACHAR *  |  MTextContentBuffer,
|  size_t  |  contentBufferLen,
|  double  |  measurement,
|  ACHAR *  |  dimensionText
)
Warning
Not implemented!
 bool AcDbDimension::isConstraintDynamic  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 bool AcDbDimension::isConstraintObject  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbDimension::isConstraintObject  |  ( |  bool &  |  hasExpression,
|  bool &  |  isReferenceConstraint
) |   |  const
Warning
Not implemented!
 bool AcDbDimension::isHorizontalRefTextRotation  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::prefix  |  ( |  AcString &  |  sPrefix | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT void AcDbDimension::resetTextDefinedSize  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setAlternatePrefix  |  ( |  const AcString &  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setAlternateSuffix  |  ( |  const AcString &  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setAltSuppressLeadingZeros  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setAltSuppressTrailingZeros  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setAltSuppressZeroFeet  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setAltSuppressZeroInches  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setAltToleranceSuppressLeadingZeros  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setAltToleranceSuppressTrailingZeros  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setAltToleranceSuppressZeroFeet  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setAltToleranceSuppressZeroInches  |  ( |  bool  |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDimension::setConstraintDynamic  |  ( |  bool  |  bDynamic | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDimension::setHorizontalRefTextRotation  |  ( |  bool  |  newVal | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setPrefix  |  ( |  const AcString &  |   | )
Warning
Not implemented!
 void AcDbDimension::setShouldParticipateInOPM  |  ( |  bool  |  bShouldParticipate | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setSuffix  |  ( |  const AcString &  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setSuppressAngularLeadingZeros  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setSuppressAngularTrailingZeros  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setSuppressLeadingZeros  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setSuppressTrailingZeros  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setSuppressZeroFeet  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setSuppressZeroInches  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT void AcDbDimension::setTextDefinedSize  |  ( |  double  |  width,
|  double  |  height
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setToleranceSuppressLeadingZeros  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setToleranceSuppressTrailingZeros  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setToleranceSuppressZeroFeet  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setToleranceSuppressZeroInches  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::setUsingDefaultTextPosition  |  ( |  bool  |   | )
Warning
Not implemented!
 bool AcDbDimension::shouldParticipateInOPM  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbDimension::subGetDimstyleData  |  ( |  AcDbDimStyleTableRecord *&  |  pRecord | ) |   const
protected
Warning
Not implemented!
 Acad::ErrorStatus AcDbDimension::subSetDimstyleData  |  ( |  AcDbDimStyleTableRecord *  |  pNewData | )
protected
Warning
Not implemented!
 Acad::ErrorStatus AcDbDimension::subSetDimstyleData  |  ( |  AcDbObjectId  |  newDataId | )
protected
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDimension::suffix  |  ( |  AcString &  |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::suppressAngularLeadingZeros  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::suppressAngularTrailingZeros  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::suppressLeadingZeros  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::suppressTrailingZeros  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::suppressZeroFeet  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::suppressZeroInches  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT void AcDbDimension::textDefinedSize  |  ( |  double &  |  width,
|  double &  |  height
) |   |  const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::toleranceSuppressLeadingZeros  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::toleranceSuppressTrailingZeros  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::toleranceSuppressZeroFeet  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDimension::toleranceSuppressZeroInches  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbdim.h