Public Member Functions | List of all members
AcPlPrecisionEntry Class Reference
AcPl Classes
  Inheritance diagram for AcPlPrecisionEntry:
 Public Member Functions
ACPL_PORT  | AcPlPrecisionEntry ()
ACPL_PORT  | AcPlPrecisionEntry (const AcPlPrecisionEntry &src)
ACPL_PORT const int  | colorResolution () const
ACPL_PORT const ACHAR *  | description () const
ACPL_PORT const double  | desiredPrecision () const
ACPL_PORT const int  | gradientResolution () const
ACPL_PORT const int  | monoResolution () const
ACPL_PORT AcPlPrecisionEntry &  | operator= (const AcPlPrecisionEntry &src)
ACPL_PORT void  | setColorResolution (int nColorResolution)
ACPL_PORT void  | setDescription (const ACHAR *pDescription)
ACPL_PORT void  | setDesiredPrecision (double dDesiredPrecision)
ACPL_PORT void  | setGradientResolution (int nGradientResolution)
ACPL_PORT void  | setMonoResolution (int nMonoResolution)
ACPL_PORT void  | setTitle (const ACHAR *pTitle)
ACPL_PORT void  | setUnitScale (const ACHAR *pUnitScale)
ACPL_PORT void  | setUnitType (const ACHAR *pUnitType)
ACPL_PORT const ACHAR *  | title () const
ACPL_PORT const ACHAR *  | unitScale () const
ACPL_PORT const ACHAR *  | unitType () const
virtual ACPL_PORT  | ~AcPlPrecisionEntry ()
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 ACPL_PORT AcPlPrecisionEntry::AcPlPrecisionEntry  |  ( |   | )
Warning
Not implemented!
 virtual ACPL_PORT AcPlPrecisionEntry::~AcPlPrecisionEntry  |  ( |   | )
virtual
Warning
Not implemented!
 ACPL_PORT AcPlPrecisionEntry::AcPlPrecisionEntry  |  ( |  const AcPlPrecisionEntry &  |  src | )
Warning
Not implemented!
Member Function Documentation
 ACPL_PORT const int AcPlPrecisionEntry::colorResolution  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT const ACHAR* AcPlPrecisionEntry::description  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT const double AcPlPrecisionEntry::desiredPrecision  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT const int AcPlPrecisionEntry::gradientResolution  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT const int AcPlPrecisionEntry::monoResolution  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT AcPlPrecisionEntry& AcPlPrecisionEntry::operator=  |  ( |  const AcPlPrecisionEntry &  |  src | )
Warning
Not implemented!
 ACPL_PORT void AcPlPrecisionEntry::setColorResolution  |  ( |  int  |  nColorResolution | )
Warning
Not implemented!
 ACPL_PORT void AcPlPrecisionEntry::setDescription  |  ( |  const ACHAR *  |  pDescription | )
Warning
Not implemented!
 ACPL_PORT void AcPlPrecisionEntry::setDesiredPrecision  |  ( |  double  |  dDesiredPrecision | )
Warning
Not implemented!
 ACPL_PORT void AcPlPrecisionEntry::setGradientResolution  |  ( |  int  |  nGradientResolution | )
Warning
Not implemented!
 ACPL_PORT void AcPlPrecisionEntry::setMonoResolution  |  ( |  int  |  nMonoResolution | )
Warning
Not implemented!
 ACPL_PORT void AcPlPrecisionEntry::setTitle  |  ( |  const ACHAR *  |  pTitle | )
Warning
Not implemented!
 ACPL_PORT void AcPlPrecisionEntry::setUnitScale  |  ( |  const ACHAR *  |  pUnitScale | )
Warning
Not implemented!
 ACPL_PORT void AcPlPrecisionEntry::setUnitType  |  ( |  const ACHAR *  |  pUnitType | )
Warning
Not implemented!
 ACPL_PORT const ACHAR* AcPlPrecisionEntry::title  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT const ACHAR* AcPlPrecisionEntry::unitScale  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT const ACHAR* AcPlPrecisionEntry::unitType  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcPlPrecisionEntry.h