Classes | Public Member Functions | List of all members
AcApDocManager Class Referenceabstract
AcAp Classes
  Inheritance diagram for AcApDocManager:
 Classes
struct  | DocOpenParams
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcApDocManager)
 virtual Acad::ErrorStatus  | activateDocument (AcApDocument *pAcTargetDocument, bool bPassScript=false)=0
 virtual void  | addReactor (AcApDocManagerReactor *)=0
ACCORE_PORT Acad::ErrorStatus  | appContextCloseDocument (AcApDocument *pDoc)
 virtual Acad::ErrorStatus  | appContextNewDocument (const ACHAR *pszTemplateName)=0
 virtual Acad::ErrorStatus  | appContextOpenDocument (const ACHAR *pszDrawingName)=0
 virtual Acad::ErrorStatus  | appContextOpenDocument (const DocOpenParams *pParams)=0
ACCORE_PORT Acad::ErrorStatus  | appContextPromptNewDocument ()
ACCORE_PORT Acad::ErrorStatus  | appContextPromptOpenDocument ()
 virtual Acad::ErrorStatus  | appContextRecoverDocument (const ACHAR *pszDrawingName)=0
ACCORE_PORT Acad::ErrorStatus  | beginExecuteInApplicationContext (void(*procAddr)(void *), void *pData)
ACCORE_PORT Acad::ErrorStatus  | beginExecuteInCommandContext (void(*procAddr)(void *), void *pData)
 virtual Acad::ErrorStatus  | closeDocument (AcApDocument *pAcTargetDocument)=0
 virtual AcApDocument *  | curDocument () const =0
 virtual AcApDocument::SaveFormat  | defaultFormatForSave () const =0
 virtual Acad::ErrorStatus  | disableDocumentActivation ()=0
 virtual AcApDocument *  | document (const AcDbDatabase *) const =0
 virtual int  | documentCount () const =0
 virtual Acad::ErrorStatus  | enableDocumentActivation ()=0
 virtual void  | executeInApplicationContext (void(*procAddr)(void *), void *pData) const =0
 virtual int  | inputPending (AcApDocument *pAcTargetDocument)=0
 virtual bool  | isApplicationContext () const =0
 virtual bool  | isDocumentActivationEnabled ()=0
 virtual Acad::ErrorStatus  | lockDocument (AcApDocument *pDoc, AcAp::DocLockMode=AcAp::kWrite, const ACHAR *pGlobalCmdName=NULL, const ACHAR *pLocalCmdName=NULL, bool prompt=true)=0
 virtual AcApDocument *  | mdiActiveDocument () const =0
 virtual AcApDocumentIterator *  | newAcApDocumentIterator ()=0
 virtual Acad::ErrorStatus  | newDocument ()=0
 virtual Acad::ErrorStatus  | openDocument ()=0
 virtual void  | popResourceHandle ()=0
 virtual void  | pushAcadResourceHandle ()=0
 virtual void  | removeReactor (AcApDocManagerReactor *)=0
 virtual Acad::ErrorStatus  | sendModelessInterrupt (AcApDocument *pAcTargetDocument)=0
 virtual Acad::ErrorStatus  | sendStringToExecute (AcApDocument *pAcTargetDocument, const ACHAR *pszExecute, bool bActivate=true, bool bWrapUpInactiveDoc=false, bool bEchoString=true)=0
 virtual Acad::ErrorStatus  | setCurDocument (AcApDocument *pDoc, AcAp::DocLockMode=AcAp::kNone, bool activate=false)=0
 virtual Acad::ErrorStatus  | setDefaultFormatForSave (AcApDocument::SaveFormat format)=0
ACCORE_PORT void  | setHost (IAcApDocManagerHost *pHost)
 virtual Acad::ErrorStatus  | unlockDocument (AcApDocument *pDoc)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 ACCORE_PORT Acad::ErrorStatus AcApDocManager::appContextCloseDocument  |  ( |  AcApDocument *  |  pDoc | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcApDocManager::appContextPromptNewDocument  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcApDocManager::appContextPromptOpenDocument  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcApDocManager::beginExecuteInApplicationContext  |  ( |  void(*)(void *)  |  procAddr,
|  void *  |  pData
)
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcApDocManager::beginExecuteInCommandContext  |  ( |  void(*)(void *)  |  procAddr,
|  void *  |  pData
)
Warning
Not implemented!
 ACCORE_PORT void AcApDocManager::setHost  |  ( |  IAcApDocManagerHost *  |  pHost | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acdocman.h