Public Member Functions | List of all members
AcAxMatrix3d Class Reference
AcAx Classes
  Inheritance diagram for AcAxMatrix3d:
 Public Member Functions
AcAxMatrix3d (const VARIANT *var) throw (HRESULT)
AcAxMatrix3d (const VARIANT &var) throw (HRESULT)
AcAxMatrix3d (const SAFEARRAY *safeArrayPt) throw (HRESULT)
 AcAxMatrix3d &  | operator= (const VARIANT *var) throw (HRESULT)
 AcAxMatrix3d &  | operator= (const VARIANT &var) throw (HRESULT)
 AcAxMatrix3d &  | operator= (const SAFEARRAY *safeArrayPt) throw (HRESULT)
 Public Member Functions inherited from AcGeMatrix3d
 GE_DLLEXPIMPORT  | AcGeMatrix3d (const AcGeMatrix3d &src)
 GE_DLLEXPIMPORT AcGeMatrix2d  | convertToLocal (AcGeVector3d &normal, double &elev) const
 GE_DLLEXPIMPORT double  | det () const
 GE_DLLEXPIMPORT void  | getCoordSystem (AcGePoint3d &origin, AcGeVector3d &xAxis, AcGeVector3d &yAxis, AcGeVector3d &zAxis) const
 GE_DLLEXPIMPORT AcGeMatrix3d  | inverse () const
GE_DLLEXPIMPORT AcGeMatrix3d  | inverse (const AcGeTol &tol) const
 GE_DLLEXPIMPORT Adesk::Boolean  | inverse (AcGeMatrix3d &inv, double tol) const
 GE_DLLEXPIMPORT AcGeMatrix3d &  | invert ()
 GE_DLLEXPIMPORT bool  | isEqualTo (const AcGeMatrix3d &mat, const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isScaledOrtho (const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isSingular (const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isUniScaledOrtho (const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT double  | norm () const
 GE_DLLEXPIMPORT bool  | operator!= (const AcGeMatrix3d &mat) const
 GE_DLLEXPIMPORT double  | operator() (unsigned int, unsigned int) const
 GE_DLLEXPIMPORT double &  | operator() (unsigned int, unsigned int)
 GE_DLLEXPIMPORT AcGeMatrix3d  | operator* (const AcGeMatrix3d &mat) const
 GE_DLLEXPIMPORT AcGeMatrix3d &  | operator*= (const AcGeMatrix3d &mat)
 GE_DLLEXPIMPORT bool  | operator== (const AcGeMatrix3d &mat) const
 GE_DLLEXPIMPORT AcGeMatrix3d &  | postMultBy (const AcGeMatrix3d &rightSide)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | preMultBy (const AcGeMatrix3d &leftSide)
 GE_DLLEXPIMPORT double  | scale (void) const
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setCoordSystem (const AcGePoint3d &origin, const AcGeVector3d &xAxis, const AcGeVector3d &yAxis, const AcGeVector3d &zAxis)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToAlignCoordSys (const AcGePoint3d &fromOrigin, const AcGeVector3d &fromXAxis, const AcGeVector3d &fromYAxis, const AcGeVector3d &fromZAxis, const AcGePoint3d &toOrigin, const AcGeVector3d &toXAxis, const AcGeVector3d &toYAxis, const AcGeVector3d &toZAxis)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToIdentity ()
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToMirroring (const AcGePlane &pln)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToMirroring (const AcGePoint3d &pnt)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToMirroring (const AcGeLine3d &line)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToPlaneToWorld (const AcGeVector3d &normal)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToPlaneToWorld (const AcGePlane &plane)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToProduct (const AcGeMatrix3d &mat1, const AcGeMatrix3d &mat2)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToProjection (const AcGePlane &projectionPlane, const AcGeVector3d &projectDir)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToRotation (double angle, const AcGeVector3d &axis, const AcGePoint3d &center=AcGePoint3d::kOrigin)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToScaling (double scaleAll, const AcGePoint3d &center=AcGePoint3d::kOrigin)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToTranslation (const AcGeVector3d &vec)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToWorldToPlane (const AcGeVector3d &normal)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setToWorldToPlane (const AcGePlane &plane)
 GE_DLLEXPIMPORT AcGeMatrix3d &  | setTranslation (const AcGeVector3d &vec)
 GE_DLLEXPIMPORT AcGeVector3d  | translation () const
 GE_DLLEXPIMPORT AcGeMatrix3d  | transpose () const
 GE_DLLEXPIMPORT AcGeMatrix3d &  | transposeIt ()
 Additional Inherited Members
 Static Public Member Functions inherited from AcGeMatrix3d
 static GE_DLLEXPIMPORT AcGeMatrix3d  | alignCoordSys (const AcGePoint3d &fromOrigin, const AcGeVector3d &fromXAxis, const AcGeVector3d &fromYAxis, const AcGeVector3d &fromZAxis, const AcGePoint3d &toOrigin, const AcGeVector3d &toXAxis, const AcGeVector3d &toYAxis, const AcGeVector3d &toZAxis)
 static GE_DLLEXPIMPORT AcGeMatrix3d  | mirroring (const AcGePlane &pln)
 static GE_DLLEXPIMPORT AcGeMatrix3d  | mirroring (const AcGePoint3d &pnt)
 static GE_DLLEXPIMPORT AcGeMatrix3d  | mirroring (const AcGeLine3d &line)
 static GE_DLLEXPIMPORT AcGeMatrix3d  | planeToWorld (const AcGeVector3d &normal)
 static GE_DLLEXPIMPORT AcGeMatrix3d  | planeToWorld (const AcGePlane &)
 static GE_DLLEXPIMPORT AcGeMatrix3d  | projection (const AcGePlane &projectionPlane, const AcGeVector3d &projectDir)
 static GE_DLLEXPIMPORT AcGeMatrix3d  | rotation (double angle, const AcGeVector3d &axis, const AcGePoint3d &center=AcGePoint3d::kOrigin)
 static GE_DLLEXPIMPORT AcGeMatrix3d  | scaling (double scaleAll, const AcGePoint3d &center=AcGePoint3d::kOrigin)
 static GE_DLLEXPIMPORT AcGeMatrix3d  | translation (const AcGeVector3d &vec)
 static GE_DLLEXPIMPORT AcGeMatrix3d  | worldToPlane (const AcGeVector3d &normal)
 static GE_DLLEXPIMPORT AcGeMatrix3d  | worldToPlane (const AcGePlane &)
 Public Attributes inherited from AcGeMatrix3d
 double  | entry [4][4]
 Static Public Attributes inherited from AcGeMatrix3d
 static GE_DLLDATAEXIMP const AcGeMatrix3d  | kIdentity
 The documentation for this class was generated from the following file:
axmat3d.h