Public Member Functions | List of all members
Scores Class Reference
Misc Classes
 Public Member Functions
void  | close_scores (const wchar_t *text, int length)
void  | draw_vector (AcGePoint3d const &p1, AcGePoint3d const &p2)
void  | over_score (const wchar_t *text, int length)
Scores (AcGiContext *pContext, TextParams const *pTextParams, LineSegmentCallback pLineSegment, void *pAction)
void  | strikethrough_score (const wchar_t *text, int length)
void  | under_score (const wchar_t *text, int length)
Constructor & Destructor Documentation
 Scores::Scores  |  ( |  AcGiContext *  |  pContext,
|  TextParams const *  |  pTextParams,
|  LineSegmentCallback  |  pLineSegment,
|  void *  |  pAction
)
Warning
Not implemented!
Member Function Documentation
 void Scores::close_scores  |  ( |  const wchar_t *  |  text,
|  int  |  length
)
Warning
Not implemented!
 void Scores::draw_vector  |  ( |  AcGePoint3d const &  |  p1,
|  AcGePoint3d const &  |  p2
)
Warning
Not implemented!
 void Scores::over_score  |  ( |  const wchar_t *  |  text,
|  int  |  length
)
Warning
Not implemented!
 void Scores::strikethrough_score  |  ( |  const wchar_t *  |  text,
|  int  |  length
)
Warning
Not implemented!
 void Scores::under_score  |  ( |  const wchar_t *  |  text,
|  int  |  length
)
Warning
Not implemented!
 The documentation for this class was generated from the following file:
truetypetext.h