Public Types | Public Member Functions | Protected Member Functions | Friends | List of all members
AcDbAssocArrayRectangularParameters Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocArrayRectangularParameters:
 Public Types
enum  | GripModes {
 kStretchGrip = 1 << 0, kRowCountGrip = 1 << 1, kRowSpacingGrip = 1 << 2, kUniformRowSpacingGrip = 1 << 3,
 kColumnCountGrip = 1 << 4, kColumnSpacingGrip = 1 << 5, kUniformColSpacingGrip = 1 << 6, kRowColumnCountGrip = 1 << 7,
 kRowColumnSpacingGrip = 1 << 8, kColumnDirectionGrip = 1 << 9, kRowDirectionGrip = 1 << 10, kLevelCountGrip = 1 << 11,
 kLevelSpacingGrip = 1 << 12, kUniformLevelSpacingGrip = 1 << 13, kRowAxisAngleGrip = 1 << 14
 }
 Public Member Functions
AcDbAssocArrayRectangularParameters (double columnSpacing=1, double rowSpacing=1, double levelSpacing=1, int columnCount=1, int rowCount=1, int levelCount=1, double rowElevation=1, double axesAngle=90)
ACRX_DECLARE_MEMBERS (AcDbAssocArrayRectangularParameters)
double  | axesAngle (AcString &expression, AcString &evaluatorId) const
double  | axesAngle () const
double  | axesAngle (AcString &expression) const
AcGeVector3d  | axisDirection (AcGeVector3d *pYAxis=NULL) const
int  | columnCount (AcString &expression, AcString &evaluatorId) const
int  | columnCount () const
int  | columnCount (AcString &expression) const
double  | columnSpacing (AcString &expression, AcString &evaluatorId) const
double  | columnSpacing () const
double  | columnSpacing (AcString &expression) const
virtual Acad::ErrorStatus  | getItemPosition (const AcDbItemLocator &locator, AcGePoint3d &position, AcGeMatrix3d &xform) const
virtual Acad::ErrorStatus  | getItems (AcArray< AcDbAssocArrayItem * > &items) const
Acad::ErrorStatus  | setAxesAngle (double axesAngle, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setAxisDirection (const AcGeVector3d &xAxis)
Acad::ErrorStatus  | setColumnCount (int nColumns, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setColumnSpacing (double offset, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
virtual  | ~AcDbAssocArrayRectangularParameters (void)
 Public Member Functions inherited from AcDbAssocArrayCommonParameters
ACRX_DECLARE_MEMBERS (AcDbAssocArrayCommonParameters)
Acad::ErrorStatus  | getBasePlane (AcDbVertexRef &basePoint, AcGeVector3d &normal, AcDbFaceRef *pFace=NULL) const
virtual AcDbItemLocator  | getCanonicalForm (const AcDbItemLocator &locator) const
int  | levelCount (AcString &expression, AcString &evaluatorId) const
 int  | levelCount () const
int  | levelCount (AcString &expression) const
double  | levelSpacing (AcString &expression, AcString &evaluatorId) const
double  | levelSpacing () const
double  | levelSpacing (AcString &expression) const
int  | rowCount (AcString &expression, AcString &evaluatorId) const
int  | rowCount () const
int  | rowCount (AcString &expression) const
double  | rowElevation (AcString &expression, AcString &evaluatorId) const
double  | rowElevation () const
double  | rowElevation (AcString &expression) const
double  | rowSpacing (AcString &expression, AcString &evaluatorId) const
double  | rowSpacing () const
double  | rowSpacing (AcString &expression) const
Acad::ErrorStatus  | setBasePlane (const AcDbVertexRef &basePoint, const AcGeVector3d &normal, const AcDbFaceRef *pFace=NULL)
Acad::ErrorStatus  | setLevelCount (int nLevels, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setLevelSpacing (double offset, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRowCount (int nRows, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRowElevation (double elevation, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRowSpacing (double offset, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
virtual  | ~AcDbAssocArrayCommonParameters (void)
 Public Member Functions inherited from AcDbAssocArrayParameters
ACRX_DECLARE_MEMBERS (AcDbAssocArrayParameters)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
Acad::ErrorStatus  | getGeomParam (const AcString &paramName, AcDbGeomRef *&pGeomRef, AcDbObjectId &paramId) const
virtual Acad::ErrorStatus  | getGripPointAt (unsigned int mode, AcDbArrayGripAppData *&pGrip) const
virtual Acad::ErrorStatus  | getGripPoints (AcArray< AcDbArrayGripAppData * > &grips) const
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints)
Acad::ErrorStatus  | getValueParam (const AcString &paramName, AcDbEvalVariant &value, AcString &expression, AcString &evaluatorId, AcValue::UnitType &unitType) const
virtual Acad::ErrorStatus  | moveGripPointAt (const AcDbArrayGripAppData *pGrip, const AcGeVector3d &offset, int &modificationBit)
void  | ownedGeomParamNames (AcArray< AcString > &paramNames) const
void  | ownedValueParamNames (AcArray< AcString > &paramNames) const
const AcDbAssocArrayActionBody *  | owner () const
AcDbAssocArrayActionBody *  | owner ()
Acad::ErrorStatus  | setGeomParam (const AcString &paramName, const AcDbGeomRef *pGeomRef, AcDbObjectId &paramId)
Acad::ErrorStatus  | setOwner (class AcDbAssocArrayActionBody *pOwner)
Acad::ErrorStatus  | setValueParam (const AcString &paramName, const AcDbEvalVariant &value, const AcString &expression, const AcString &evaluatorId, AcString &errorMessage, AcValue::UnitType *pUnitType=NULL)
virtual  | ~AcDbAssocArrayParameters (void)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
AcDbAssocArrayRectangularParameters (AcDbImpAssocArrayRectangularParameters *pSelf)
 Protected Member Functions inherited from AcDbAssocArrayCommonParameters
AcDbAssocArrayCommonParameters (AcDbImpAssocArrayCommonParameters *pSelf)
 Protected Member Functions inherited from AcDbAssocArrayParameters
AcDbAssocArrayParameters (AcDbImpAssocArrayParameters *pSelf=NULL)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpAssocArrayRectangularParameters
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Attributes inherited from AcDbAssocArrayParameters
 AcDbImpAssocArrayParameters *  | mpSelf
Constructor & Destructor Documentation
 AcDbAssocArrayRectangularParameters::AcDbAssocArrayRectangularParameters  |  ( |  double  |  columnSpacing = 1,
|  double  |  rowSpacing = 1,
|  double  |  levelSpacing = 1,
|  int  |  columnCount = 1,
|  int  |  rowCount = 1,
|  int  |  levelCount = 1,
|  double  |  rowElevation = 1,
|  double  |  axesAngle = 90
)
Warning
Not implemented!
 virtual AcDbAssocArrayRectangularParameters::~AcDbAssocArrayRectangularParameters  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 AcDbAssocArrayRectangularParameters::AcDbAssocArrayRectangularParameters  |  ( |  AcDbImpAssocArrayRectangularParameters *  |  pSelf | )
explicitprotected
Warning
Not implemented!
Member Function Documentation
 double AcDbAssocArrayRectangularParameters::axesAngle  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 double AcDbAssocArrayRectangularParameters::axesAngle  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayRectangularParameters::axesAngle  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 AcGeVector3d AcDbAssocArrayRectangularParameters::axisDirection  |  ( |  AcGeVector3d *  |  pYAxis = NULL | ) |   const
Warning
Not implemented!
 int AcDbAssocArrayRectangularParameters::columnCount  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 int AcDbAssocArrayRectangularParameters::columnCount  |  ( |   | ) |   const
inline
Warning
Not implemented!
 int AcDbAssocArrayRectangularParameters::columnCount  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayRectangularParameters::columnSpacing  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 double AcDbAssocArrayRectangularParameters::columnSpacing  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayRectangularParameters::columnSpacing  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocArrayRectangularParameters::getItemPosition  |  ( |  const AcDbItemLocator &  |  locator,
|  AcGePoint3d &  |  position,
|  AcGeMatrix3d &  |  xform
) |   |  const
virtual
Warning
Not implemented!
Implements AcDbAssocArrayParameters.
 virtual Acad::ErrorStatus AcDbAssocArrayRectangularParameters::getItems  |  ( |  AcArray< AcDbAssocArrayItem * > &  |  items | ) |   const
virtual
Warning
Not implemented!
Implements AcDbAssocArrayParameters.
 Acad::ErrorStatus AcDbAssocArrayRectangularParameters::setAxesAngle  |  ( |  double  |  axesAngle,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayRectangularParameters::setAxisDirection  |  ( |  const AcGeVector3d &  |  xAxis | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayRectangularParameters::setColumnCount  |  ( |  int  |  nColumns,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayRectangularParameters::setColumnSpacing  |  ( |  double  |  offset,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocArrayRectangularParameters.h