Public Types | Public Member Functions | List of all members
AcPlPlotErrorHandlerLock Class Reference
AcPl Classes
  Inheritance diagram for AcPlPlotErrorHandlerLock:
 Public Types
enum  | LockStatus { kLocked, kUnLocked }
 Public Member Functions
ACPL_PORT  | AcPlPlotErrorHandlerLock ()
ACPL_PORT  | AcPlPlotErrorHandlerLock (AcPlPlotErrorHandler *pAppErrHandler, const ACHAR *pAppName)
ACPL_PORT const ACHAR *  | appName () const
ACPL_PORT void  | getErrorHandler (AcPlPlotErrorHandler *&pAppErrHandler) const
ACPL_PORT bool  | lock (AcPlPlotErrorHandler *pAppErrHandler, const ACHAR *pAppName)
ACPL_PORT LockStatus  | status () const
ACPL_PORT bool  | unLock (AcPlPlotErrorHandler *pAppErrHandler)
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 ACPL_PORT AcPlPlotErrorHandlerLock::AcPlPlotErrorHandlerLock  |  ( |   | )
Warning
Not implemented!
 ACPL_PORT AcPlPlotErrorHandlerLock::AcPlPlotErrorHandlerLock  |  ( |  AcPlPlotErrorHandler *  |  pAppErrHandler,
|  const ACHAR *  |  pAppName
)
Warning
Not implemented!
Member Function Documentation
 ACPL_PORT const ACHAR* AcPlPlotErrorHandlerLock::appName  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT void AcPlPlotErrorHandlerLock::getErrorHandler  |  ( |  AcPlPlotErrorHandler *&  |  pAppErrHandler | ) |   const
Warning
Not implemented!
 ACPL_PORT bool AcPlPlotErrorHandlerLock::lock  |  ( |  AcPlPlotErrorHandler *  |  pAppErrHandler,
|  const ACHAR *  |  pAppName
)
Warning
Not implemented!
 ACPL_PORT LockStatus AcPlPlotErrorHandlerLock::status  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT bool AcPlPlotErrorHandlerLock::unLock  |  ( |  AcPlPlotErrorHandler *  |  pAppErrHandler | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acplploterrorhandlerlock.h