Public Member Functions | Static Public Member Functions | Protected Member Functions | Friends | List of all members
AcRxClass Class Reference
AcRx Classes
  Inheritance diagram for AcRxClass:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxClass, ACBASE_PORT)
 ACBASE_PORT AcRxObject *  | addX (AcRxClass *, AcRxObject *)
 ACBASE_PORT const ACHAR *  | appName () const
 ACBASE_PORT AppNameChangeFuncPtr  | appNameCallbackPtr () const
ACBASE_PORT const AcRxAttributeCollection &  | attributes () const
ACBASE_PORT AcRxAttributeCollection &  | attributes ()
 ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *) const override
 ACBASE_PORT AcRxObject *  | create ()
 ACBASE_PORT AcRxObject *  | delX (AcRxClass *)
ACBASE_PORT const AcRxSet *  | descendants () const
 ACBASE_PORT const ACHAR *  | dxfName () const
 ACBASE_PORT void  | getClassVersion (int &dwgVer, int &maintVer) const
 ACBASE_PORT AcRxObject *  | getX (const AcRxClass *)
 bool  | isDerivedFrom (const AcRxClass *) const
ACBASE_PORT AcRxMemberCollection *  | members () const
 ACBASE_PORT AcRxClass *  | myParent () const
 ACBASE_PORT const ACHAR *  | name () const
 ACBASE_PORT int  | proxyFlags () const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
 static ACBASE_PORT bool  | isDerivedFrom (const AcRxClass *pDerived, const AcRxClass *pBase)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions
AcRxClass (const ACHAR *name, const ACHAR *parent, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcRxImpClass
Member Function Documentation
 ACBASE_PORT const AcRxAttributeCollection& AcRxClass::attributes  |  ( |   | ) |   const
Warning
Not implemented!
 ACBASE_PORT AcRxAttributeCollection& AcRxClass::attributes  |  ( |   | )
Warning
Not implemented!
 ACBASE_PORT const AcRxSet* AcRxClass::descendants  |  ( |   | ) |   const
Warning
Not implemented!
 ACBASE_PORT AcRxMemberCollection* AcRxClass::members  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxclass.h