Public Member Functions | List of all members
AcRxPropertyOverrule Class Reference
AcRx Classes
  Inheritance diagram for AcRxPropertyOverrule:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxPropertyOverrule, ACBASE_PORT)
virtual ACBASE_PORT Acad::ErrorStatus  | getValue (const AcRxProperty *pProp, const AcRxObject *pO, AcRxValue &value) const
virtual ACBASE_PORT Acad::ErrorStatus  | setValue (const AcRxProperty *pProp, AcRxObject *pO, const AcRxValue &value) const
 Public Member Functions inherited from AcRxMemberOverrule
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxMemberOverrule, ACBASE_PORT)
 Public Member Functions inherited from AcRxOverruleBase
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxOverruleBase, ACBASE_PORT)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxMemberOverrule
static ACBASE_PORT Acad::ErrorStatus  | addOverrule (AcRxMember *pOverruledSubject, AcRxMemberOverrule *pOverrule, bool bAddAtLast=false)
static ACBASE_PORT Acad::ErrorStatus  | removeOverrule (AcRxMember *pOverruledSubject, AcRxMemberOverrule *pOverrule)
static ACBASE_PORT Acad::ErrorStatus  | removeOverrules (const AcArray< Record > &overrules)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual ACBASE_PORT Acad::ErrorStatus AcRxPropertyOverrule::getValue  |  ( |  const AcRxProperty *  |  pProp,
|  const AcRxObject *  |  pO,
|  AcRxValue &  |  value
) |   |  const
virtual
Warning
Not implemented!
 virtual ACBASE_PORT Acad::ErrorStatus AcRxPropertyOverrule::setValue  |  ( |  const AcRxProperty *  |  pProp,
|  AcRxObject *  |  pO,
|  const AcRxValue &  |  value
) |   |  const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxprop.h