Public Member Functions | List of all members
AcRxEnumType< ValueType > Class Template Reference
AcRx Classes
  Inheritance diagram for AcRxEnumType< ValueType >:
 Public Member Functions
AcRxEnumType (const ACHAR *name, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
 void  | append (AcRxEnumTag &tag)
 virtual int  | count () const ADESK_OVERRIDE
 virtual const AcRxEnumTag &  | getAt (int i) const ADESK_OVERRIDE
 Public Member Functions inherited from AcRxValueTypePOD< ValueType >
AcRxValueTypePOD (const ACHAR *name, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
AcRxValueTypePOD (const ACHAR *name, const IAcRxEnumeration &pEnum, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
AcRxValueTypePOD (const ACHAR *name, const IAcRxReferenceType &pRef, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
virtual bool  | subEqualTo (const void *a, const void *b) const ADESK_OVERRIDE
virtual int  | subToString (const void *instance, ACHAR *buffer, size_t sizeInACHARs, AcRxValueType::StringFormat format) const ADESK_OVERRIDE
 Public Member Functions inherited from AcRxValueType
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxValueType, ACBASE_PORT)
 const IAcRxEnumeration *  | enumeration () const
 bool  | equalTo (const void *a, const void *b) const
 bool  | isBlittable () const
 bool  | isEnum () const
 bool  | isReference () const
 const IAcRxNonBlittableType *  | nonBlittable () const
 bool  | operator!= (const AcRxValueType &rhs) const
 bool  | operator== (const AcRxValueType &rhs) const
 const IAcRxReferenceType *  | reference () const
 const IAcRxObjectValue *  | rxObjectValue () const
 unsigned int  | size () const
 int  | toString (const void *instance, ACHAR *buffer, size_t sizeInACHARs, StringFormat format) const
 Public Member Functions inherited from AcRxClass
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxClass, ACBASE_PORT)
 ACBASE_PORT AcRxObject *  | addX (AcRxClass *, AcRxObject *)
 ACBASE_PORT const ACHAR *  | appName () const
 ACBASE_PORT AppNameChangeFuncPtr  | appNameCallbackPtr () const
ACBASE_PORT const AcRxAttributeCollection &  | attributes () const
ACBASE_PORT AcRxAttributeCollection &  | attributes ()
 ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *) const override
 ACBASE_PORT AcRxObject *  | create ()
 ACBASE_PORT AcRxObject *  | delX (AcRxClass *)
ACBASE_PORT const AcRxSet *  | descendants () const
 ACBASE_PORT const ACHAR *  | dxfName () const
 ACBASE_PORT void  | getClassVersion (int &dwgVer, int &maintVer) const
 ACBASE_PORT AcRxObject *  | getX (const AcRxClass *)
 bool  | isDerivedFrom (const AcRxClass *) const
ACBASE_PORT AcRxMemberCollection *  | members () const
 ACBASE_PORT AcRxClass *  | myParent () const
 ACBASE_PORT const ACHAR *  | name () const
 ACBASE_PORT int  | proxyFlags () const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcRxValueType
enum  | StringFormat { kStringFormatGlobal = 0, kStringFormatCurrent = 1 }
 Static Public Member Functions inherited from AcRxValueType
static ACBASE_PORT void  | badCast ()
 Static Public Member Functions inherited from AcRxClass
 static ACBASE_PORT bool  | isDerivedFrom (const AcRxClass *pDerived, const AcRxClass *pBase)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxValueType
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const ACHAR *parent, const IAcRxNonBlittableType &nonBlittable, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const IAcRxNonBlittableType &pNonBlittable, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const IAcRxEnumeration &pEnum, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const IAcRxEnumeration &pEnum, const IAcRxNonBlittableType &pNonBlittable, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const IAcRxEnumeration *pEnum, const IAcRxNonBlittableType *pNonBlittable, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const IAcRxReferenceType &pRef, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const IAcRxObjectValue &rxObjValue, const IAcRxNonBlittableType &pNonBlittable, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
 Protected Member Functions inherited from AcRxClass
AcRxClass (const ACHAR *name, const ACHAR *parent, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
rxvaluetypeutil.h