Public Member Functions | List of all members
AcDbCustomOsnapInfo Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbCustomOsnapInfo:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbCustomOsnapInfo)
 virtual Acad::ErrorStatus  | getOsnapInfo (AcDbEntity *pickedObject, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcArray< AcGePoint3d > &snapPoints, AcDbIntArray &geomIdsForPts, AcArray< AcGeCurve3d * > &snapCurves, AcDbIntArray &geomIdsForLines)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbosnap.h