Public Member Functions | Protected Member Functions | List of all members
AcGiGlyph Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiGlyph:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiGlyph)
virtual AcDbObjectId  | id () const override
virtual Adesk::Boolean  | isPersistent () const override
 virtual Acad::ErrorStatus  | setLocation (const AcGePoint3d &dcsPoint)=0
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *) override
virtual void  | subViewportDraw (AcGiViewportDraw *vportDrawContext) override=0
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
Member Function Documentation
 virtual AcDbObjectId AcGiGlyph::id  |  ( |  void  |   | ) |   const
inlineoverridevirtual
Warning
Not implemented!
Implements AcGiDrawable.
 virtual Adesk::Boolean AcGiGlyph::isPersistent  |  ( |  void  |   | ) |   const
inlineoverridevirtual
Warning
Not implemented!
Implements AcGiDrawable.
 virtual Adesk::UInt32 AcGiGlyph::subSetAttributes  |  ( |  AcGiDrawableTraits *  |   | )
inlineoverrideprotectedvirtual
Warning
Not implemented!
Implements AcGiDrawable.
 virtual void AcGiGlyph::subViewportDraw  |  ( |  AcGiViewportDraw *  |  vportDrawContext | )
overrideprotectedpure virtual
Warning
Not implemented!
Implements AcGiDrawable.
 virtual Adesk::Boolean AcGiGlyph::subWorldDraw  |  ( |  AcGiWorldDraw *  |   | )
inlineoverrideprotectedvirtual
Warning
Not implemented!
Implements AcGiDrawable.
 The documentation for this class was generated from the following file:
dbosnap.h