Public Member Functions | List of all members
AcGiKernelDescriptor Class Reference
AcGi Classes
  Inheritance diagram for AcGiKernelDescriptor:
 Public Member Functions
 void  | addRequirement (const AcUniqueString *capability)
 bool  | supports (const AcUniqueString *capability) const
 bool  | supports (const AcGiKernelDescriptor &desc) const
 Public Member Functions inherited from AcArray< const AcUniqueString * >
AcArray (int initPhysicalLength=0, int initGrowLength=8)
AcArray (const AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &)
AcArray (AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &&)
 int  | append (const const AcUniqueString *&value)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | append (const AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &array)
 int  | append (const AcUniqueString *&&value)
 int  | appendMove (const AcUniqueString *&value)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | appendMove (AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &array)
 const const AcUniqueString **  | asArrayPtr () const
 const AcUniqueString **  | asArrayPtr ()
 const const AcUniqueString *&  | at (int index) const
 const AcUniqueString *&  | at (int index)
 const AcUniqueString **  | begin ()
 const const AcUniqueString **  | begin () const
 bool  | contains (const const AcUniqueString *&value, int start=0) const
 const AcUniqueString **  | end ()
 const const AcUniqueString **  | end () const
 bool  | find (const const AcUniqueString *&value, int &foundAt, int start=0) const
 int  | find (const const AcUniqueString *&value) const
 int  | findFrom (const const AcUniqueString *&value, int start) const
 const AcUniqueString *&  | first ()
 const const AcUniqueString *&  | first () const
 int  | growLength () const
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | insertAt (int index, const const AcUniqueString *&value)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | insertAt (int index, const AcUniqueString *&&value)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | insertAtMove (int index, const AcUniqueString *&value)
 bool  | isEmpty () const
 const AcUniqueString *&  | last ()
 const const AcUniqueString *&  | last () const
 int  | length () const
 int  | logicalLength () const
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | operator= (const AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | operator= (AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &&)
 bool  | operator== (const AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &) const
 const AcUniqueString *&  | operator[] (int)
 const const AcUniqueString *&  | operator[] (int) const
 int  | physicalLength () const
 bool  | remove (const const AcUniqueString *&value, int start=0)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | removeAll ()
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | removeAt (int index)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | removeFirst ()
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | removeLast ()
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | removeSubArray (int startIndex, int endIndex)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | reverse ()
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | setAll (const const AcUniqueString *&value)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | setAt (int index, const const AcUniqueString *&value)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | setGrowLength (int)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | setLogicalLength (int)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | setPhysicalLength (int)
 AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &  | swap (int i1, int i2)
 Additional Inherited Members
 Public Types inherited from AcArray< const AcUniqueString * >
enum
 typedef typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator  | Allocator
 typedef const AcUniqueString *  | Type
 Protected Member Functions inherited from AcArray< const AcUniqueString * >
 void  | copyOtherIntoThis (const AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &otherArray)
 void  | insertSpace (int nIndex)
 bool  | isValid (int) const
 void  | moveOtherIntoThis (AcArray< const AcUniqueString *, typename AcArrayItemCopierSelector< const AcUniqueString *, std::is_trivial< const AcUniqueString * >::value >::allocator > &otherArray)
 Protected Attributes inherited from AcArray< const AcUniqueString * >
 int  | mGrowLen
 int  | mLogicalLen
 const AcUniqueString **  | mpArray
 int  | mPhysicalLen
 The documentation for this class was generated from the following file:
acgi.h