Public Member Functions | List of all members
AcDbLayerStateManagerReactor Class Reference
AcDb Classes
  Inheritance diagram for AcDbLayerStateManagerReactor:
 Public Member Functions
virtual void  | abortLayerStateDelete (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
virtual void  | abortLayerStateRename (const ACHAR *oldLayerStateName, const ACHAR *newLayerStateName)
virtual void  | abortLayerStateRestore (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
ACRX_DECLARE_MEMBERS (AcDbLayerStateManagerReactor)
virtual void  | layerStateCompareFailed (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
virtual void  | layerStateCreated (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
virtual void  | layerStateDeleted (const ACHAR *layerStateName)
virtual void  | layerStateRenamed (const ACHAR *oldLayerStateName, const ACHAR *newLayerStateName)
virtual void  | layerStateRestored (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
virtual void  | layerStateToBeDeleted (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
virtual void  | layerStateToBeRenamed (const ACHAR *oldLayerStateName, const ACHAR *newLayerStateName)
virtual void  | layerStateToBeRestored (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual void AcDbLayerStateManagerReactor::abortLayerStateDelete  |  ( |  const ACHAR *  |  layerStateName,
|  const AcDbObjectId &  |  layerStateId
)
virtual
Warning
Not implemented!
 virtual void AcDbLayerStateManagerReactor::abortLayerStateRename  |  ( |  const ACHAR *  |  oldLayerStateName,
|  const ACHAR *  |  newLayerStateName
)
virtual
Warning
Not implemented!
 virtual void AcDbLayerStateManagerReactor::abortLayerStateRestore  |  ( |  const ACHAR *  |  layerStateName,
|  const AcDbObjectId &  |  layerStateId
)
virtual
Warning
Not implemented!
 virtual void AcDbLayerStateManagerReactor::layerStateCompareFailed  |  ( |  const ACHAR *  |  layerStateName,
|  const AcDbObjectId &  |  layerStateId
)
virtual
Warning
Not implemented!
 virtual void AcDbLayerStateManagerReactor::layerStateCreated  |  ( |  const ACHAR *  |  layerStateName,
|  const AcDbObjectId &  |  layerStateId
)
virtual
Warning
Not implemented!
 virtual void AcDbLayerStateManagerReactor::layerStateDeleted  |  ( |  const ACHAR *  |  layerStateName | )
virtual
Warning
Not implemented!
 virtual void AcDbLayerStateManagerReactor::layerStateRenamed  |  ( |  const ACHAR *  |  oldLayerStateName,
|  const ACHAR *  |  newLayerStateName
)
virtual
Warning
Not implemented!
 virtual void AcDbLayerStateManagerReactor::layerStateRestored  |  ( |  const ACHAR *  |  layerStateName,
|  const AcDbObjectId &  |  layerStateId
)
virtual
Warning
Not implemented!
 virtual void AcDbLayerStateManagerReactor::layerStateToBeDeleted  |  ( |  const ACHAR *  |  layerStateName,
|  const AcDbObjectId &  |  layerStateId
)
virtual
Warning
Not implemented!
 virtual void AcDbLayerStateManagerReactor::layerStateToBeRenamed  |  ( |  const ACHAR *  |  oldLayerStateName,
|  const ACHAR *  |  newLayerStateName
)
virtual
Warning
Not implemented!
 virtual void AcDbLayerStateManagerReactor::layerStateToBeRestored  |  ( |  const ACHAR *  |  layerStateName,
|  const AcDbObjectId &  |  layerStateId
)
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dblstate.h