Public Member Functions | List of all members
AcPlPlotLoggingErrorHandler Class Reference
AcPl Classes
  Inheritance diagram for AcPlPlotLoggingErrorHandler:
 Public Member Functions
ACPL_DECLARE_MEMBERS (AcPlPlotLoggingErrorHandler)
ACPL_PORT  | AcPlPlotLoggingErrorHandler ()
ACPL_PORT  | AcPlPlotLoggingErrorHandler (AcPlPlotLogger *)
virtual ACPL_PORT ErrorResult  | ariError (ULONG_PTR category, const unsigned int specific, const ACHAR *pLocation, const ACHAR *pContextData, const ACHAR *pRevision)
virtual ACPL_PORT ErrorResult  | error (ULONG_PTR category, const unsigned int specific, const ACHAR *pLocation, const ACHAR *pContextData, const ACHAR *pRevision)
virtual ACPL_PORT void  | info (ULONG_PTR category, const unsigned int specific, const ACHAR *pLocation, const ACHAR *pContextData, const ACHAR *pRevision)
virtual ACPL_PORT void  | infoMessage (const ACHAR *pMessage)
 virtual ACPL_PORT void  | logMessage (const ACHAR *pTitle, const ACHAR *pMsg)
virtual ACPL_PORT int  | messageBox (const ACHAR *pText, const ACHAR *pCaption, unsigned int uType, int defaultReturn)
virtual ACPL_PORT void  | severeError (ULONG_PTR category, const unsigned int specific, const ACHAR *pLocation, const ACHAR *pContextData, const ACHAR *pRevision)
virtual ACPL_PORT void  | terminalError (ULONG_PTR category, const unsigned int specific, const ACHAR *pLocation, const ACHAR *pContextData, const ACHAR *pRevision)
virtual ACPL_PORT ErrorResult  | warning (ULONG_PTR category, const unsigned int specific, const ACHAR *pLocation, const ACHAR *pContextData, const ACHAR *pRevision)
virtual ACPL_PORT  | ~AcPlPlotLoggingErrorHandler ()
 Public Member Functions inherited from AcPlPlotErrorHandler
ACPL_DECLARE_MEMBERS (AcPlPlotErrorHandler)
ACPL_PORT  | AcPlPlotErrorHandler ()
virtual ACPL_PORT const ACHAR *  | ariTitle () const
virtual ACPL_PORT const ACHAR *  | errorTitle () const
ACPL_PORT void  | getCompanyString (ACHAR *&pCompanyString) const
ACPL_PORT void  | getProductString (ACHAR *&pProductString) const
ACPL_PORT void  | getProgramString (ACHAR *&pProgramString) const
virtual ACPL_PORT const ACHAR *  | infoTitle () const
virtual ACPL_PORT bool  | logMode () const
virtual ACPL_PORT bool  | quietMode () const
virtual ACPL_PORT bool  | setLogHandle (const ACHAR *pFilePathName)
virtual ACPL_PORT void  | setLogMode (bool bLog)
virtual ACPL_PORT void  | setQuietMode (bool bQuiet)
virtual ACPL_PORT const ACHAR *  | severeTitle () const
virtual ACPL_PORT bool  | takeResponsibility (Handler kind)
virtual ACPL_PORT const ACHAR *  | terminalTitle () const
virtual ACPL_PORT const ACHAR *  | warningTitle () const
ACPL_PORT  | ~AcPlPlotErrorHandler ()
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcPlPlotErrorHandler
enum  | ErrorResult { kAbort, kRetry, kIgnore }
enum  | Handler {
 kInfo, kWarning, kError, kARI,
 kSevere, kTerminal, kNone
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Protected Member Functions inherited from AcPlPlotErrorHandler
ACPL_PORT ErrorResult  | appARIError (ULONG_PTR category, const unsigned int specific, const ACHAR *pLocation, const ACHAR *pContextData, const ACHAR *pRevision)
ACPL_PORT ErrorResult  | appError (ULONG_PTR category, const unsigned int specific, const ACHAR *pLocation, const ACHAR *pContextData, const ACHAR *pRevision)
ACPL_PORT void  | appInfo (ULONG_PTR category, const unsigned int specific, const ACHAR *pLocation, const ACHAR *pContextData, const ACHAR *pRevision)
ACPL_PORT void  | appInfoMessage (const ACHAR *pMessage)
ACPL_PORT void  | appLogMessage (const ACHAR *pTitle, const ACHAR *pMsg)
ACPL_PORT int  | appMessageBox (const ACHAR *pText, const ACHAR *pCaption, unsigned int uType, int defaultReturn)
ACPL_PORT bool  | appSetLogHandle (const ACHAR *pFilePathName)
ACPL_PORT void  | appSevereError (ULONG_PTR category, const unsigned int specific, const ACHAR *pLocation, const ACHAR *pContextData, const ACHAR *pRevision)
ACPL_PORT void  | appTerminalError (ULONG_PTR category, const unsigned int specific, const ACHAR *pLocation, const ACHAR *pContextData, const ACHAR *pRevision)
ACPL_PORT ErrorResult  | appWarning (ULONG_PTR category, const unsigned int specific, const ACHAR *pLocation, const ACHAR *pContextData, const ACHAR *pRevision)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 ACPL_PORT AcPlPlotLoggingErrorHandler::AcPlPlotLoggingErrorHandler  |  ( |   | )
Warning
Not implemented!
 ACPL_PORT AcPlPlotLoggingErrorHandler::AcPlPlotLoggingErrorHandler  |  ( |  AcPlPlotLogger *  |   | )
Warning
Not implemented!
 virtual ACPL_PORT AcPlPlotLoggingErrorHandler::~AcPlPlotLoggingErrorHandler  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual ACPL_PORT ErrorResult AcPlPlotLoggingErrorHandler::ariError  |  ( |  ULONG_PTR  |  category,
|  const unsigned int  |  specific,
|  const ACHAR *  |  pLocation,
|  const ACHAR *  |  pContextData,
|  const ACHAR *  |  pRevision
)
virtual
Warning
Not implemented!
Reimplemented from AcPlPlotErrorHandler.
 virtual ACPL_PORT ErrorResult AcPlPlotLoggingErrorHandler::error  |  ( |  ULONG_PTR  |  category,
|  const unsigned int  |  specific,
|  const ACHAR *  |  pLocation,
|  const ACHAR *  |  pContextData,
|  const ACHAR *  |  pRevision
)
virtual
Warning
Not implemented!
Reimplemented from AcPlPlotErrorHandler.
 virtual ACPL_PORT void AcPlPlotLoggingErrorHandler::info  |  ( |  ULONG_PTR  |  category,
|  const unsigned int  |  specific,
|  const ACHAR *  |  pLocation,
|  const ACHAR *  |  pContextData,
|  const ACHAR *  |  pRevision
)
virtual
Warning
Not implemented!
Reimplemented from AcPlPlotErrorHandler.
 virtual ACPL_PORT void AcPlPlotLoggingErrorHandler::infoMessage  |  ( |  const ACHAR *  |  pMessage | )
virtual
Warning
Not implemented!
Reimplemented from AcPlPlotErrorHandler.
 virtual ACPL_PORT int AcPlPlotLoggingErrorHandler::messageBox  |  ( |  const ACHAR *  |  pText,
|  const ACHAR *  |  pCaption,
|  unsigned int  |  uType,
|  int  |  defaultReturn
)
virtual
Warning
Not implemented!
Reimplemented from AcPlPlotErrorHandler.
 virtual ACPL_PORT void AcPlPlotLoggingErrorHandler::severeError  |  ( |  ULONG_PTR  |  category,
|  const unsigned int  |  specific,
|  const ACHAR *  |  pLocation,
|  const ACHAR *  |  pContextData,
|  const ACHAR *  |  pRevision
)
virtual
Warning
Not implemented!
Reimplemented from AcPlPlotErrorHandler.
 virtual ACPL_PORT void AcPlPlotLoggingErrorHandler::terminalError  |  ( |  ULONG_PTR  |  category,
|  const unsigned int  |  specific,
|  const ACHAR *  |  pLocation,
|  const ACHAR *  |  pContextData,
|  const ACHAR *  |  pRevision
)
virtual
Warning
Not implemented!
Reimplemented from AcPlPlotErrorHandler.
 virtual ACPL_PORT ErrorResult AcPlPlotLoggingErrorHandler::warning  |  ( |  ULONG_PTR  |  category,
|  const unsigned int  |  specific,
|  const ACHAR *  |  pLocation,
|  const ACHAR *  |  pContextData,
|  const ACHAR *  |  pRevision
)
virtual
Warning
Not implemented!
Reimplemented from AcPlPlotErrorHandler.
 The documentation for this class was generated from the following file:
acplplotloggingerrorhandler.h