Public Member Functions | Public Attributes | Static Public Attributes | Friends | List of all members
AcGeScale3d Class Reference
AcGe Classes
 Public Member Functions
 GE_DLLEXPIMPORT  | AcGeScale3d (const AcGeScale3d &src)
 GE_DLLEXPIMPORT  | AcGeScale3d (double factor)
 GE_DLLEXPIMPORT  | AcGeScale3d (double xFact, double yFact, double zFact)
 GE_DLLEXPIMPORT AcGeScale3d &  | extractScale (const AcGeMatrix3d &mat)
 GE_DLLEXPIMPORT void  | getMatrix (AcGeMatrix3d &mat) const
 GE_DLLEXPIMPORT AcGeScale3d  | inverse () const
 GE_DLLEXPIMPORT AcGeScale3d &  | invert ()
 GE_DLLEXPIMPORT bool  | isEqualTo (const AcGeScale3d &scaleVec, const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isProportional (const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT  | operator AcGeMatrix3d () const
 GE_DLLEXPIMPORT bool  | operator!= (const AcGeScale3d &sclVec) const
 GE_DLLEXPIMPORT AcGeScale3d  | operator* (const AcGeScale3d &sclVec) const
 GE_DLLEXPIMPORT AcGeScale3d  | operator* (double s) const
 GE_DLLEXPIMPORT AcGeScale3d &  | operator*= (const AcGeScale3d &scl)
 GE_DLLEXPIMPORT AcGeScale3d &  | operator*= (double s)
 GE_DLLEXPIMPORT bool  | operator== (const AcGeScale3d &sclVec) const
 GE_DLLEXPIMPORT double  | operator[] (unsigned int i) const
 GE_DLLEXPIMPORT double &  | operator[] (unsigned int i)
 GE_DLLEXPIMPORT AcGeScale3d &  | postMultBy (const AcGeScale3d &rightSide)
 GE_DLLEXPIMPORT AcGeScale3d &  | preMultBy (const AcGeScale3d &leftSide)
 GE_DLLEXPIMPORT AcGeScale3d &  | removeScale (AcGeMatrix3d &mat)
 GE_DLLEXPIMPORT AcGeScale3d &  | set (double sc0, double sc1, double sc2)
 GE_DLLEXPIMPORT AcGeScale3d &  | setToProduct (const AcGeScale3d &sclVec1, const AcGeScale3d &sclVec2)
 GE_DLLEXPIMPORT AcGeScale3d &  | setToProduct (const AcGeScale3d &sclVec, double s)
 Public Attributes
 double  | sx
 double  | sy
 double  | sz
 Static Public Attributes
 static GE_DLLDATAEXIMP const AcGeScale3d  | kIdentity
 Friends
GE_DLLEXPIMPORT AcGeScale3d  | operator* (double, const AcGeScale3d &scl)
Friends And Related Function Documentation
 GE_DLLEXPIMPORT AcGeScale3d operator*  |  ( |  double  |  ,
|  const AcGeScale3d &  |  scl
)
friend
Warning
Not implemented!
 The documentation for this class was generated from the following file:
gescl3d.h