Classes | Public Types | Public Member Functions | Static Public Member Functions | List of all members
AcGiVariant Class Reference
AcGi Classes
  Inheritance diagram for AcGiVariant:
 Classes
class  | EnumType
 Public Types
enum  | VariantType {
 kUndefined = 0, kBoolean, kInt, kDouble,
 kColor, kString, kTable
 }
 Public Member Functions
AcGiVariant (const AcGiVariant &value)
AcGiVariant (bool)
AcGiVariant (Adesk::Int32)
AcGiVariant (double)
AcGiVariant (const AcCmColor &)
AcGiVariant (const ACHAR *)
ACRX_DECLARE_MEMBERS (AcGiVariant)
 bool  | asBoolean () const
 ACDBCORE2D_PORT char  | asChar () const
 AcCmColor  | asColor () const
 double  | asDouble () const
 ACDBCORE2D_PORT EnumType  | asEnum () const
 ACDBCORE2D_PORT float  | asFloat () const
 int  | asInt () const
 ACDBCORE2D_PORT Adesk::Int32  | asLong () const
 ACDBCORE2D_PORT short  | asShort () const
 AcString  | asString () const
 ACDBCORE2D_PORT unsigned char  | asUchar () const
 ACDBCORE2D_PORT unsigned int  | asUint () const
 ACDBCORE2D_PORT Adesk::UInt32  | asUlong () const
 ACDBCORE2D_PORT unsigned short  | asUshort () const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other) override
 void  | deleteElem (const ACHAR *pKey)
 Acad::ErrorStatus  | getElem (const ACHAR *pKey, AcGiVariant &value) const
 const AcGiVariant *  | getElem (const ACHAR *pKey) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | getElemAt (int nIndex, AcString &, AcGiVariant &) const
 Acad::ErrorStatus  | getElemAt (int nIndex, ACHAR *&, AcGiVariant &) const
 ACDBCORE2D_PORT AcGiVariant *  | getElemAt (int nIndex, AcString &) const
 AcGiVariant *  | getElemAt (int nIndex, ACHAR *&) const
 int  | getElemCount () const
 AcGiVariant &  | operator= (const AcGiVariant &value)
 virtual bool  | operator== (const AcGiVariant &value) const
 void  | set (bool)
 void  | set (Adesk::Int32)
 void  | set (double)
 void  | set (const AcCmColor &)
 void  | set (const ACHAR *)
 void  | setElem (const ACHAR *pKey, const AcGiVariant &)
 VariantType  | type () const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
 static bool  | isEquivalent (const AcGiVariant *, const AcGiVariant *)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgi.h