Public Types | Public Member Functions | Protected Attributes | Friends | List of all members
AcGraph Class Reference
AcDb Classes
  Inheritance diagram for AcGraph:
 Public Types
 typedef NodeIdToPtrMap::const_iterator  | const_iterator
 typedef NodeIdToPtrMap::iterator  | iterator
enum  | PartialUndoCode { kAddNodePartialUndoCode = 0, kRemoveNodePartialUndoCode, kModifyNodePartialUndoCode, kModifyNextNewNodeIdPartialUndoCode }
 Public Member Functions
AcGraph (bool bCreateImp=true)
ACRX_DECLARE_MEMBERS (AcGraph)
Acad::ErrorStatus  | addGraphNode (AcGraphNode *pNewNode)
Acad::ErrorStatus  | addGraphNode (AcGraphNode *pNewNode, AcGraphNode::Id nodeId)
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *pUndoFiler, PartialUndoCode code, AcGraphNode::Id &nodeId)
iterator  | begin ()
const_iterator  | begin () const
void  | clear (bool bDelete)
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
iterator  | end ()
const_iterator  | end () const
AcGraphNode *  | getGraphNodePtr (AcGraphNode::Id nodeId) const
Acad::ErrorStatus  | getRelatedNodes (const AcArray< AcGraphNode * > &nodes, AcArray< AcGraphNode * > &relatedNodes) const
virtual Adesk::UInt32  | graphId () const
Acad::ErrorStatus  | merge (const AcGraph &graph)
Acad::ErrorStatus  | moveAndMerge (const AcArray< AcGraphNode * > &nodesToMove)
AcDbObject *  | owningObject () const
Acad::ErrorStatus  | removeGraphNode (AcGraphNode *pNode, bool bDelete=true)
virtual void  | setGraphId (Adesk::UInt32 id)
void  | setOwningObject (AcDbObject *pObj)
size_t  | size () const
virtual  | ~AcGraph ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Attributes
 AcImpGraph *  | mpImpGraph
 Friends
 class  | AcGraphNode
 class  | AcImpGraph
 class  | AcImpGraphNode
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcGraph::AcGraph  |  ( |  bool  |  bCreateImp = true | )
explicit
Warning
Not implemented!
 virtual AcGraph::~AcGraph  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 Acad::ErrorStatus AcGraph::addGraphNode  |  ( |  AcGraphNode *  |  pNewNode | )
Warning
Not implemented!
 Acad::ErrorStatus AcGraph::addGraphNode  |  ( |  AcGraphNode *  |  pNewNode,
|  AcGraphNode::Id  |  nodeId
)
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGraph::applyPartialUndo  |  ( |  AcDbDwgFiler *  |  pUndoFiler,
|  PartialUndoCode  |  code,
|  AcGraphNode::Id &  |  nodeId
)
virtual
Warning
Not implemented!
 iterator AcGraph::begin  |  ( |   | )
Warning
Not implemented!
 const_iterator AcGraph::begin  |  ( |   | ) |   const
Warning
Not implemented!
 void AcGraph::clear  |  ( |  bool  |  bDelete | )
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGraph::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGraph::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGraph::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGraph::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
 iterator AcGraph::end  |  ( |   | )
Warning
Not implemented!
 const_iterator AcGraph::end  |  ( |   | ) |   const
Warning
Not implemented!
 AcGraphNode* AcGraph::getGraphNodePtr  |  ( |  AcGraphNode::Id  |  nodeId | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcGraph::getRelatedNodes  |  ( |  const AcArray< AcGraphNode * > &  |  nodes,
|  AcArray< AcGraphNode * > &  |  relatedNodes
) |   |  const
Warning
Not implemented!
 virtual Adesk::UInt32 AcGraph::graphId  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcGraph::merge  |  ( |  const AcGraph &  |  graph | )
Warning
Not implemented!
 Acad::ErrorStatus AcGraph::moveAndMerge  |  ( |  const AcArray< AcGraphNode * > &  |  nodesToMove | )
Warning
Not implemented!
 AcDbObject* AcGraph::owningObject  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcGraph::removeGraphNode  |  ( |  AcGraphNode *  |  pNode,
|  bool  |  bDelete = true
)
Warning
Not implemented!
 virtual void AcGraph::setGraphId  |  ( |  Adesk::UInt32  |  id | )
virtual
Warning
Not implemented!
 void AcGraph::setOwningObject  |  ( |  AcDbObject *  |  pObj | )
Warning
Not implemented!
 size_t AcGraph::size  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcGraph.h