Public Member Functions | List of all members
AcRxDefaultValueAttribute Class Reference
AcRx Classes
  Inheritance diagram for AcRxDefaultValueAttribute:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxDefaultValueAttribute, ACBASE_PORT)
ACBASE_PORT  | AcRxDefaultValueAttribute (const AcRxValue &value)
ACBASE_PORT const AcRxValue &  | value () const
 Public Member Functions inherited from AcRxAttribute
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxAttribute, ACBASE_PORT)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxAttribute
ACBASE_PORT  | AcRxAttribute (AcRxAttributeImp *)
 Protected Member Functions inherited from Pimpl::ApiPart< AcRxObject, AcRxAttributeImp >
ApiPart (AcRxAttributeImp *pImp) throw ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 ACBASE_PORT AcRxDefaultValueAttribute::AcRxDefaultValueAttribute  |  ( |  const AcRxValue &  |  value | )
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT const AcRxValue& AcRxDefaultValueAttribute::value  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxattrib.h