Public Member Functions | Protected Member Functions | Friends | List of all members
AcRxMemberCollection Class Reference
AcRx Classes
  Inheritance diagram for AcRxMemberCollection:
 Public Member Functions
virtual int  | count () const
virtual AcRxMember *  | getAt (int index) const
virtual ACBASE_PORT  | ~AcRxMemberCollection ()
 Protected Member Functions
ACBASE_PORT  | AcRxMemberCollection ()
 Protected Member Functions inherited from Pimpl::ApiPart< void, AcRxMemberCollectionImp >
ApiPart (AcRxMemberCollectionImp *pImp) throw ()
 Friends
 class  | AcRxMemberCollectionImp
Constructor & Destructor Documentation
 virtual ACBASE_PORT AcRxMemberCollection::~AcRxMemberCollection  |  ( |   | )
virtual
Warning
Not implemented!
 ACBASE_PORT AcRxMemberCollection::AcRxMemberCollection  |  ( |   | )
protected
Warning
Not implemented!
Member Function Documentation
 virtual int AcRxMemberCollection::count  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcRxMember* AcRxMemberCollection::getAt  |  ( |  int  |  index | ) |   const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxmember.h