Public Member Functions | List of all members
AcRxPromotingQueryContext Class Reference
AcRx Classes
  Inheritance diagram for AcRxPromotingQueryContext:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxPromotingQueryContext, ACBASE_PORT)
 Public Member Functions inherited from AcRxMemberQueryContext
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxMemberQueryContext, ACBASE_PORT)
ACBASE_PORT AcRxMemberIterator *  | newMemberIterator (const AcArray< const AcRxClass * > &facets) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxMemberQueryContext
ACBASE_PORT  | AcRxMemberQueryContext ()
 virtual AcRxMemberIterator *  | subNewMemberIterator (const AcArray< const AcRxClass * > &facets) const =0
virtual ACBASE_PORT  | ~AcRxMemberQueryContext ()
 Protected Member Functions inherited from Pimpl::ApiPart< AcRxObject, AcRxMemberQueryContextImp >
ApiPart (AcRxMemberQueryContextImp *pImp) throw ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
rxprop.h