Public Types | Public Member Functions | List of all members
AcGsView Class Referenceabstract
AcGs Classes
 Public Types
enum  | DefaultLightingType { kOneLight, kTwoLights, kBackLight }
enum  | EnableIRResult { kSuccess, kOutOfMemory }
enum  | ModelCloneOption { kCloneNoModels, kCloneMainPersistentModel, kCloneAllModels }
enum  | Projection { kParallel, kPerspective }
enum  | SelectionMode {
 kWindow, kCrossing, kFence, kWPoly,
 kCPoly
 }
 Public Member Functions
 virtual bool  | add (AcGiDrawable *drawable, AcGsModel *model)=0
 virtual double  | backClip (void) const =0
 virtual AcDbObjectId  | background (void) const =0
 virtual void  | beginFastInteractivity (void)=0
 virtual EnableIRResult  | beginInteractiveRender (AcGsRenderProgressMonitor *pProgressMonitor)=0
 virtual void  | beginInteractivity (double fFrameRateInHz)=0
 virtual void  | clearFrozenLayers (void)=0
 virtual AcGsView *  | clone (bool bCloneViewParameters=true, bool bCloneGeometry=false)=0
 virtual AcGsView *  | clone (bool bCloneViewParameters, ModelCloneOption cloneOption)=0
 virtual Atil::Image *  | createSnapshot (const AcGsDCPoint &offset, const AcGsDCRect &imageDim, GS::ImageDataFormat format, GS::ImageOrientation orientation, bool bOnlyCaptureRenderedImage=false)=0
 virtual void  | dolly (const AcGeVector3d &vector)=0
 virtual void  | dolly (double x, double y, double z)=0
 virtual void  | enableDefaultLighting (bool bEnable, DefaultLightingType type=kTwoLights)=0
 virtual void  | enableStereo (bool bEnable)=0
 virtual bool  | endFastInteractivity (void)=0
 virtual void  | endInteractiveRender (void)=0
 virtual void  | endInteractivity (void)=0
 virtual bool  | erase (AcGiDrawable *drawable)=0
 virtual void  | eraseAll (void)=0
 virtual bool  | exceededBounds (void)=0
 virtual bool  | extentsInView (const AcGePoint3d &minPoint, const AcGePoint3d &maxPoint)=0
 virtual double  | fieldHeight (void) const =0
 virtual double  | fieldWidth (void) const =0
 virtual void  | flush (void)=0
 virtual void  | freezeLayer (Adesk::IntDbId layerID)=0
 virtual double  | frontClip (void) const =0
 virtual const AcGsClientViewInfo &  | getClientViewInfo () const =0
 virtual AcGsDevice *  | getDevice (void) const =0
 virtual AcGsModel *  | getModel (AcGiDrawable *) const =0
 virtual void  | getModelList (AcArray< AcGsModel * > &) const =0
 virtual void  | getNumPixelsInUnitSquare (const AcGePoint3d &givenWorldpt, AcGePoint2d &pixelArea, bool includePerspective=true) const =0
 virtual void  | getSnapShot (Atil::Image *pOutput, AcGsDCPoint const &offset)=0
 virtual void  | getStereoParameters (double &magnitude, double &parallax) const =0
 virtual void  | getViewport (AcGePoint2d &lowerLeft, AcGePoint2d &upperRight) const =0
 virtual void  | getViewport (AcGsDCRect &screen_rect) const =0
 virtual void  | getViewportBorderProperties (AcGsColor &color, int &weight) const =0
 virtual AcGsGraphicsKernel &  | graphicsKernel (void)=0
 virtual void  | hide (void)=0
 virtual void  | invalidate (void)=0
 virtual void  | invalidate (const AcGsDCRect &rect)=0
 virtual void  | invalidateCachedViewportGeometry (void)=0
 virtual void  | invalidateCachedViewportGeometry (AcGiDrawable *pDrawable)=0
 virtual bool  | isBackClipped (void) const =0
 virtual bool  | isFastInteractivity (void)=0
 virtual bool  | isFrontClipped (void) const =0
 virtual bool  | isInteractive (void) const =0
 virtual bool  | isPerspective (void) const =0
 virtual bool  | isPointInViewport (const Adesk::Int32 x, const Adesk::Int32 y)=0
 virtual bool  | isRendering (void) const =0
 virtual bool  | isStereoEnabled (void) const =0
 virtual bool  | isValid (void) const =0
 virtual bool  | isViewportBorderVisible (void) const =0
 virtual bool  | isVisible (void)=0
 virtual int  | maximumUpgrade (void)=0
 virtual int  | minimumDegrade (void)=0
 virtual RenderMode  | mode (void) const =0
 virtual AcGeMatrix3d  | objectToDeviceMatrix (void) const =0
 virtual void  | orbit (double x, double y)=0
 virtual void  | pan (double x, double y)=0
 virtual bool  | pointInView (const AcGePoint3d &pnt)=0
 virtual AcGePoint3d  | position (void) const =0
 virtual AcGeMatrix3d  | projectionMatrix (void) const =0
 virtual void  | removeViewportClipRegion (void)=0
 virtual bool  | renderToImage (Atil::Image *pOutput, AcGiDrawable *pSettings, AcGsRenderProgressMonitor *pProgressMonitor, const AcGsDCRect &rectScreen, bool bReuseScene=false)=0
 virtual void  | roll (double angle)=0
 virtual AcGeMatrix3d  | screenMatrix (void) const =0
 virtual void  | setBackClip (double distance)=0
 virtual void  | setBackground (const AcDbObjectId backgroundId)=0
 virtual void  | setEnableBackClip (bool enable)=0
 virtual void  | setEnableFrontClip (bool enable)=0
 virtual void  | setFrontClip (double distance)=0
 virtual void  | setMaximumUpgrade (int step)=0
 virtual void  | setMinimumDegrade (int step)=0
 virtual void  | setMode (RenderMode mode)=0
 virtual void  | setStereoParameters (double magnitude, double parallax)=0
 virtual void  | setView (const AcGePoint3d &position, const AcGePoint3d &target, const AcGeVector3d &upVector, double fieldWidth, double fieldHeight, Projection projection=kParallel)=0
 virtual void  | setViewport (const AcGePoint2d &lowerLeft, const AcGePoint2d &upperRight)=0
 virtual void  | setViewport (const AcGsDCRect &screen_rect)=0
 virtual void  | setViewportBorderProperties (AcGsColor const &color, int weight)=0
 virtual void  | setViewportBorderVisibility (bool bVisible)=0
 virtual void  | setViewportClipRegion (int contours, int const *counts, AcGsDCPoint const *points)=0
 virtual void  | setVisualStyle (const AcDbObjectId visualStyleId)=0
 virtual void  | setVisualStyle (const AcGiVisualStyle &visualStyle)=0
 virtual void  | show (void)=0
 virtual AcGePoint3d  | target (void) const =0
 virtual void  | thawLayer (Adesk::IntDbId layerID)=0
 virtual void  | update (void)=0
 virtual void  | update (GS::SyncBehavior sync)=0
 virtual AcGeVector3d  | upVector (void) const =0
 virtual AcGeMatrix3d  | viewingMatrix (void) const =0
 virtual AcDbObjectId  | visualStyle (void) const =0
 virtual bool  | visualStyle (AcGiVisualStyle &visualStyle) const =0
 virtual AcGeMatrix3d  | worldToDeviceMatrix (void) const =0
 virtual void  | zoom (double factor)=0
 virtual void  | zoomExtents (const AcGePoint3d &minPoint, const AcGePoint3d &maxPoint)=0
 virtual void  | zoomWindow (const AcGePoint2d &lowerLeft, const AcGePoint2d &upperRight)=0
 The documentation for this class was generated from the following file:
gs.h