Public Member Functions | Protected Member Functions | Friends | List of all members
AcDbAssocArrayCommonParameters Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocArrayCommonParameters:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbAssocArrayCommonParameters)
Acad::ErrorStatus  | getBasePlane (AcDbVertexRef &basePoint, AcGeVector3d &normal, AcDbFaceRef *pFace=NULL) const
virtual AcDbItemLocator  | getCanonicalForm (const AcDbItemLocator &locator) const
int  | levelCount (AcString &expression, AcString &evaluatorId) const
 int  | levelCount () const
int  | levelCount (AcString &expression) const
double  | levelSpacing (AcString &expression, AcString &evaluatorId) const
double  | levelSpacing () const
double  | levelSpacing (AcString &expression) const
int  | rowCount (AcString &expression, AcString &evaluatorId) const
int  | rowCount () const
int  | rowCount (AcString &expression) const
double  | rowElevation (AcString &expression, AcString &evaluatorId) const
double  | rowElevation () const
double  | rowElevation (AcString &expression) const
double  | rowSpacing (AcString &expression, AcString &evaluatorId) const
double  | rowSpacing () const
double  | rowSpacing (AcString &expression) const
Acad::ErrorStatus  | setBasePlane (const AcDbVertexRef &basePoint, const AcGeVector3d &normal, const AcDbFaceRef *pFace=NULL)
Acad::ErrorStatus  | setLevelCount (int nLevels, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setLevelSpacing (double offset, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRowCount (int nRows, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRowElevation (double elevation, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRowSpacing (double offset, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
virtual  | ~AcDbAssocArrayCommonParameters (void)
 Public Member Functions inherited from AcDbAssocArrayParameters
ACRX_DECLARE_MEMBERS (AcDbAssocArrayParameters)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
Acad::ErrorStatus  | getGeomParam (const AcString &paramName, AcDbGeomRef *&pGeomRef, AcDbObjectId &paramId) const
virtual Acad::ErrorStatus  | getGripPointAt (unsigned int mode, AcDbArrayGripAppData *&pGrip) const
virtual Acad::ErrorStatus  | getGripPoints (AcArray< AcDbArrayGripAppData * > &grips) const
 virtual Acad::ErrorStatus  | getItemPosition (const AcDbItemLocator &locator, AcGePoint3d &position, AcGeMatrix3d &xform) const =0
 virtual Acad::ErrorStatus  | getItems (AcArray< AcDbAssocArrayItem * > &items) const =0
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints)
Acad::ErrorStatus  | getValueParam (const AcString &paramName, AcDbEvalVariant &value, AcString &expression, AcString &evaluatorId, AcValue::UnitType &unitType) const
virtual Acad::ErrorStatus  | moveGripPointAt (const AcDbArrayGripAppData *pGrip, const AcGeVector3d &offset, int &modificationBit)
void  | ownedGeomParamNames (AcArray< AcString > &paramNames) const
void  | ownedValueParamNames (AcArray< AcString > &paramNames) const
const AcDbAssocArrayActionBody *  | owner () const
AcDbAssocArrayActionBody *  | owner ()
Acad::ErrorStatus  | setGeomParam (const AcString &paramName, const AcDbGeomRef *pGeomRef, AcDbObjectId &paramId)
Acad::ErrorStatus  | setOwner (class AcDbAssocArrayActionBody *pOwner)
Acad::ErrorStatus  | setValueParam (const AcString &paramName, const AcDbEvalVariant &value, const AcString &expression, const AcString &evaluatorId, AcString &errorMessage, AcValue::UnitType *pUnitType=NULL)
virtual  | ~AcDbAssocArrayParameters (void)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
AcDbAssocArrayCommonParameters (AcDbImpAssocArrayCommonParameters *pSelf)
 Protected Member Functions inherited from AcDbAssocArrayParameters
AcDbAssocArrayParameters (AcDbImpAssocArrayParameters *pSelf=NULL)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpAssocArrayCommonParameters
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Attributes inherited from AcDbAssocArrayParameters
 AcDbImpAssocArrayParameters *  | mpSelf
Constructor & Destructor Documentation
 virtual AcDbAssocArrayCommonParameters::~AcDbAssocArrayCommonParameters  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 AcDbAssocArrayCommonParameters::AcDbAssocArrayCommonParameters  |  ( |  AcDbImpAssocArrayCommonParameters *  |  pSelf | )
explicitprotected
Warning
Not implemented!
Member Function Documentation
 Acad::ErrorStatus AcDbAssocArrayCommonParameters::getBasePlane  |  ( |  AcDbVertexRef &  |  basePoint,
|  AcGeVector3d &  |  normal,
|  AcDbFaceRef *  |  pFace = NULL
) |   |  const
Warning
Not implemented!
 virtual AcDbItemLocator AcDbAssocArrayCommonParameters::getCanonicalForm  |  ( |  const AcDbItemLocator &  |  locator | ) |   const
virtual
Warning
Not implemented!
Implements AcDbAssocArrayParameters.
 int AcDbAssocArrayCommonParameters::levelCount  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 int AcDbAssocArrayCommonParameters::levelCount  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayCommonParameters::levelSpacing  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 double AcDbAssocArrayCommonParameters::levelSpacing  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayCommonParameters::levelSpacing  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 int AcDbAssocArrayCommonParameters::rowCount  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 int AcDbAssocArrayCommonParameters::rowCount  |  ( |   | ) |   const
inline
Warning
Not implemented!
 int AcDbAssocArrayCommonParameters::rowCount  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayCommonParameters::rowElevation  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 double AcDbAssocArrayCommonParameters::rowElevation  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayCommonParameters::rowElevation  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayCommonParameters::rowSpacing  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 double AcDbAssocArrayCommonParameters::rowSpacing  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayCommonParameters::rowSpacing  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayCommonParameters::setBasePlane  |  ( |  const AcDbVertexRef &  |  basePoint,
|  const AcGeVector3d &  |  normal,
|  const AcDbFaceRef *  |  pFace = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayCommonParameters::setLevelCount  |  ( |  int  |  nLevels,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayCommonParameters::setLevelSpacing  |  ( |  double  |  offset,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayCommonParameters::setRowCount  |  ( |  int  |  nRows,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayCommonParameters::setRowElevation  |  ( |  double  |  elevation,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayCommonParameters::setRowSpacing  |  ( |  double  |  offset,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocArrayCommonParameters.h