Public Member Functions | List of all members
AcGiStandardLightTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiStandardLightTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiStandardLightTraits)
 virtual double  | intensity () const =0
 virtual AcCmColor  | lightColor () const =0
 virtual void  | setIntensity (double inten)=0
 virtual void  | setLightColor (const AcCmColor &color)=0
 virtual void  | setShadowParameters (const AcGiShadowParameters &params)=0
 virtual void  | shadowParameters (AcGiShadowParameters &params) const =0
 Public Member Functions inherited from AcGiLightTraits
ACRX_DECLARE_MEMBERS (AcGiLightTraits)
 virtual bool  | isOn () const =0
 virtual void  | setOn (bool on)=0
 The documentation for this class was generated from the following file:
AcGiLightTraits.h