Public Member Functions | List of all members
AcGiIBLBackgroundTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiIBLBackgroundTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiIBLBackgroundTraits)
 virtual bool  | displayImage (void) const =0
 virtual bool  | enable (void) const =0
 virtual AcString  | IBLImageName (void) const =0
 virtual double  | rotation (void) const =0
 virtual AcDbObjectId  | secondaryBackground (void) const =0
 virtual void  | setDisplayImage (const bool bdisplay)=0
 virtual void  | setEnable (const bool bEnable)=0
 virtual void  | setIBLImageName (const AcString &name)=0
 virtual void  | setRotation (const double rotation)=0
 virtual void  | setSecondaryBackground (const AcDbObjectId bg)=0
 The documentation for this class was generated from the following file:
AcGiEnvironment.h