Public Member Functions | Friends | List of all members
AcRxMemberCollectionBuilder Class Reference
AcRx Classes
  Inheritance diagram for AcRxMemberCollectionBuilder:
 Public Member Functions
ACBASE_PORT Acad::ErrorStatus  | add (AcRxMember *member)
ACBASE_PORT const AcRxClass *  | owner () const
 Friends
 class  | AcRxMemberCollectionImp
 Additional Inherited Members
 Protected Member Functions inherited from Pimpl::ApiPart< void, AcRxMemberCollectionImp >
ApiPart (AcRxMemberCollectionImp *pImp) throw ()
Member Function Documentation
 ACBASE_PORT Acad::ErrorStatus AcRxMemberCollectionBuilder::add  |  ( |  AcRxMember *  |  member | )
Warning
Not implemented!
 ACBASE_PORT const AcRxClass* AcRxMemberCollectionBuilder::owner  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxmember.h