Public Member Functions | Friends | List of all members
AcApDwgDocWindow Class Reference
AcAp Classes
  Inheritance diagram for AcApDwgDocWindow:
 Public Member Functions
ACAD_PORT AcApDocument *  | document ()
warning Not implemented! More...
 Public Member Functions inherited from AcApDocWindow
ACAD_PORT  | AcApDocWindow ()
warning Not implemented! More...
ACAD_PORT void  | activate ()
warning Not implemented! More...
ACAD_PORT void  | addReactor (AcApDocWindowReactor *reactor)
warning Not implemented! More...
ACAD_PORT bool  | canClose () const
warning Not implemented! More...
ACAD_PORT void  | close ()
warning Not implemented! More...
ACAD_PORT AcRxObject *  | document ()
warning Not implemented! More...
ACAD_PORT void  | enable (bool bEnable)
warning Not implemented! More...
ACAD_PORT void  | removeReactor (AcApDocWindowReactor *reactor)
warning Not implemented! More...
ACAD_PORT void  | setCanClose (bool bCanClose)
warning Not implemented! More...
ACAD_PORT void  | setTitle (const ACHAR *title)
warning Not implemented! More...
ACAD_PORT const ACHAR *  | title () const
warning Not implemented! More...
virtual ACAD_PORT HWND  | windowHandle () ADESK_OVERRIDE
warning Not implemented! More...
virtual ACAD_PORT  | ~AcApDocWindow ()
warning Not implemented! More...
 Public Member Functions inherited from AcApWindow
ACCORE_PORT bool  | postRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
ACCORE_PORT bool  | preRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
ACCORE_PORT bool  | routeMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
 Friends
 class  | AcApDocWindowImp
 Additional Inherited Members
 Protected Member Functions inherited from AcApDocWindow
virtual ACAD_PORT void  | onActivate ()
warning Not implemented! More...
virtual ACAD_PORT void  | onCreate (HWND hWnd)
warning Not implemented! More...
virtual ACAD_PORT void  | onDestroy ()
warning Not implemented! More...
virtual ACAD_PORT void  | onLoad ()
warning Not implemented! More...
virtual ACAD_PORT void  | onUpdate ()
warning Not implemented! More...
virtual ACAD_PORT void  | setDocument (AcRxObject *document)
warning Not implemented! More...
 Protected Member Functions inherited from AcApWindow
ACCORE_PORT  | AcApWindow ()
virtual ACCORE_PORT bool  | subPostRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
virtual ACCORE_PORT bool  | subPreRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
virtual ACCORE_PORT bool  | subRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
virtual ACCORE_PORT  | ~AcApWindow ()
 Protected Attributes inherited from AcApWindow
 AcApWindowImp *  | m_pImp
Member Function Documentation
 ACAD_PORT AcApDocument* AcApDwgDocWindow::document  |  ( |   | )
warning Not implemented!
 The documentation for this class was generated from the following file:
AcApDocWindow.h