Public Member Functions | List of all members
AcGePointOnCurve2d Class Reference
AcGe Classes
  Inheritance diagram for AcGePointOnCurve2d:
 Public Member Functions
AcGePointOnCurve2d (const AcGeCurve2d &crv)
AcGePointOnCurve2d (const AcGeCurve2d &crv, double param)
AcGePointOnCurve2d (const AcGePointOnCurve2d &src)
 Adesk::Boolean  | curvature (double &res)
 Adesk::Boolean  | curvature (double param, double &res)
 const AcGeCurve2d *  | curve () const
 AcGeVector2d  | deriv (int order) const
 AcGeVector2d  | deriv (int order, double param)
 AcGeVector2d  | deriv (int order, const AcGeCurve2d &crv, double param)
 Adesk::Boolean  | isSingular (const AcGeTol &tol=AcGeContext::gTol) const
 AcGePointOnCurve2d &  | operator= (const AcGePointOnCurve2d &src)
 double  | parameter () const
 AcGePoint2d  | point () const
 AcGePoint2d  | point (double param)
 AcGePoint2d  | point (const AcGeCurve2d &crv, double param)
 AcGePointOnCurve2d &  | setCurve (const AcGeCurve2d &crv)
 AcGePointOnCurve2d &  | setParameter (double param)
 Public Member Functions inherited from AcGePointEnt2d
operator AcGePoint2d () const
 AcGePointEnt2d &  | operator= (const AcGePointEnt2d &pnt)
 AcGePoint2d  | point2d () const
 Public Member Functions inherited from AcGeEntity2d
 AcGeEntity2d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity2d &entity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity2d &  | mirror (const AcGeLine2d &line)
 Adesk::Boolean  | operator!= (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | operator= (const AcGeEntity2d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | rotateBy (double angle, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | scaleBy (double scaleFactor, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | transformBy (const AcGeMatrix2d &xfm)
 AcGeEntity2d &  | translateBy (const AcGeVector2d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGePointEnt2d
AcGePointEnt2d (const AcGePointEnt2d &)
 Protected Member Functions inherited from AcGeEntity2d
AcGeEntity2d (const AcGeEntity2d &)
AcGeEntity2d (AcGeImpEntity3d &, int)
AcGeEntity2d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 Protected Attributes inherited from AcGeEntity2d
 int  | mDelEnt
 class AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
geponc2d.h