Public Member Functions | List of all members
AcGeNurbCurve2d Class Reference
AcGe Classes
  Inheritance diagram for AcGeNurbCurve2d:
 Public Member Functions
AcGeNurbCurve2d (const AcGeNurbCurve2d &src)
AcGeNurbCurve2d (int degree, const AcGeKnotVector &knots, const AcGePoint2dArray &cntrlPnts, Adesk::Boolean isPeriodic=Adesk::kFalse)
AcGeNurbCurve2d (int degree, const AcGeKnotVector &knots, const AcGePoint2dArray &cntrlPnts, const AcGeDoubleArray &weights, Adesk::Boolean isPeriodic=Adesk::kFalse)
AcGeNurbCurve2d (int degree, const AcGePolyline2d &fitPolyline, Adesk::Boolean isPeriodic=Adesk::kFalse)
AcGeNurbCurve2d (const AcGePoint2dArray &fitPoints, const AcGeVector2d &startTangent, const AcGeVector2d &endTangent, Adesk::Boolean startTangentDefined=Adesk::kTrue, Adesk::Boolean endTangentDefined=Adesk::kTrue, const AcGeTol &fitTolerance=AcGeContext::gTol)
AcGeNurbCurve2d (const AcGePoint2dArray &fitPoints, const AcGeVector2d &startTangent, const AcGeVector2d &endTangent, Adesk::Boolean startTangentDefined, Adesk::Boolean endTangentDefined, AcGe::KnotParameterization knotParam, const AcGeTol &fitTolerance=AcGeContext::gTol)
AcGeNurbCurve2d (const AcGePoint2dArray &fitPoints, const AcGeTol &fitTolerance=AcGeContext::gTol)
AcGeNurbCurve2d (const AcGePoint2dArray &fitPoints, const AcGeVector2dArray &fitTangents, const AcGeTol &fitTolerance=AcGeContext::gTol, Adesk::Boolean isPeriodic=Adesk::kFalse)
AcGeNurbCurve2d (const AcGeEllipArc2d &ellipse)
AcGeNurbCurve2d (const AcGeLineSeg2d &linSeg)
AcGeNurbCurve2d (const AcGeCurve2d &curve, double epsilon=AcGeContext::gTol.equalPoint())
Adesk::Boolean  | addControlPointAt (double newKnot, const AcGePoint2d &point, double weight=1.0)
 Adesk::Boolean  | addFitPointAt (int index, const AcGePoint2d &point)
 AcGeNurbCurve2d &  | addKnot (double newKnot)
Adesk::Boolean  | buildFitData ()
Adesk::Boolean  | buildFitData (KnotParameterization kp)
Adesk::Boolean  | deleteControlPointAt (int index)
 Adesk::Boolean  | deleteFitPointAt (int index)
 AcGeNurbCurve2d &  | elevateDegree (int plusDegree)
 Adesk::Boolean  | evalMode () const
 void  | getDefinitionData (int &degree, Adesk::Boolean &rational, Adesk::Boolean &periodic, AcGeKnotVector &knots, AcGePoint2dArray &controlPoints, AcGeDoubleArray &weights) const
 Adesk::Boolean  | getFitData (AcGePoint2dArray &fitPoints, AcGeTol &fitTolerance, Adesk::Boolean &tangentsExist, AcGeVector2d &startTangent, AcGeVector2d &endTangent) const
Adesk::Boolean  | getFitData (AcGePoint2dArray &fitPoints, AcGeTol &fitTolerance, Adesk::Boolean &tangentsExist, AcGeVector2d &startTangent, AcGeVector2d &endTangent, KnotParameterization &knotParam) const
Adesk::Boolean  | getFitKnotParameterization (KnotParameterization &knotParam) const
 Adesk::Boolean  | getFitPointAt (int index, AcGePoint2d &point) const
 Adesk::Boolean  | getFitTangents (AcGeVector2d &startTangent, AcGeVector2d &endTangent) const
 Adesk::Boolean  | getFitTolerance (AcGeTol &fitTolerance) const
 Adesk::Boolean  | getParamsOfC1Discontinuity (AcGeDoubleArray &params, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | getParamsOfG1Discontinuity (AcGeDoubleArray &params, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeNurbCurve2d &  | hardTrimByParams (double newStartParam, double newEndParam)
 AcGeNurbCurve2d &  | insertKnot (double newKnot)
 AcGeNurbCurve2d &  | joinWith (const AcGeNurbCurve2d &curve)
 AcGeNurbCurve2d &  | makeClosed ()
 AcGeNurbCurve2d &  | makeNonPeriodic ()
 AcGeNurbCurve2d &  | makeOpen ()
 AcGeNurbCurve2d &  | makePeriodic ()
 AcGeNurbCurve2d &  | makeRational (double weight=1.0)
 int  | numFitPoints () const
 int  | numWeights () const
AcGeNurbCurve2d &  | operator= (const AcGeNurbCurve2d &spline)
 Adesk::Boolean  | purgeFitData ()
 AcGeNurbCurve2d &  | setEvalMode (Adesk::Boolean evalMode=Adesk::kFalse)
 AcGeNurbCurve2d &  | setFitData (const AcGePoint2dArray &fitPoints, const AcGeVector2d &startTangent, const AcGeVector2d &endTangent, const AcGeTol &fitTol=AcGeContext::gTol)
AcGeNurbCurve2d &  | setFitData (const AcGePoint2dArray &fitPoints, const AcGeVector2d &startTangent, const AcGeVector2d &endTangent, KnotParameterization knotParam, const AcGeTol &fitTol=AcGeContext::gTol)
 AcGeNurbCurve2d &  | setFitData (const AcGeKnotVector &fitKnots, const AcGePoint2dArray &fitPoints, const AcGeVector2d &startTangent, const AcGeVector2d &endTangent, const AcGeTol &fitTol=AcGeContext::gTol, Adesk::Boolean isPeriodic=Adesk::kFalse)
 AcGeNurbCurve2d &  | setFitData (int degree, const AcGePoint2dArray &fitPoints, const AcGeTol &fitTol=AcGeContext::gTol)
Adesk::Boolean  | setFitKnotParameterization (KnotParameterization knotParam)
 Adesk::Boolean  | setFitPointAt (int index, const AcGePoint2d &point)
 Adesk::Boolean  | setFitTangents (const AcGeVector2d &startTangent, const AcGeVector2d &endTangent)
 Adesk::Boolean  | setFitTolerance (const AcGeTol &fitTol=AcGeContext::gTol)
 AcGeSplineEnt2d &  | setWeightAt (int idx, double val)
 double  | weightAt (int idx) const
 Public Member Functions inherited from AcGeSplineEnt2d
 int  | continuityAtKnot (int idx, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint2d  | controlPointAt (int idx) const
 int  | degree () const
 double  | endParam () const
 AcGePoint2d  | endPoint () const
 Adesk::Boolean  | hasFitData () const
 Adesk::Boolean  | isRational () const
 double  | knotAt (int idx) const
 const AcGeKnotVector &  | knots () const
 int  | numControlPoints () const
 int  | numKnots () const
AcGeSplineEnt2d &  | operator= (const AcGeSplineEnt2d &spline)
 int  | order () const
 AcGeSplineEnt2d &  | setControlPointAt (int idx, const AcGePoint2d &pnt)
 AcGeSplineEnt2d &  | setKnotAt (int idx, double val)
 double  | startParam () const
 AcGePoint2d  | startPoint () const
 Public Member Functions inherited from AcGeCurve2d
 Adesk::Boolean  | area (double startParam, double endParam, double &value, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeBoundBlock2d  | boundBlock () const
 AcGeBoundBlock2d  | boundBlock (const AcGeInterval &range) const
 AcGePoint2d  | closestPointTo (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint2d  | closestPointTo (const AcGeCurve2d &curve2d, AcGePoint2d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGePoint2d &pnt, const AcGeTol &=AcGeContext::gTol) const
 double  | distanceTo (const AcGeCurve2d &, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint2d  | evalPoint (double param) const
 AcGePoint2d  | evalPoint (double param, int numDeriv, AcGeVector2dArray &derivArray) const
 Adesk::Boolean  | explode (AcGeVoidPointerArray &explodedCurves, AcGeIntArray &newExplodedCurve, const AcGeInterval *intrvl=NULL) const
 void  | getClosestPointTo (const AcGePoint2d &pnt, AcGePointOnCurve2d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getClosestPointTo (const AcGeCurve2d &curve2d, AcGePointOnCurve2d &pntOnThisCrv, AcGePointOnCurve2d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getInterval (AcGeInterval &intrvl) const
 void  | getInterval (AcGeInterval &intrvl, AcGePoint2d &start, AcGePoint2d &end) const
 void  | getLocalClosestPoints (const AcGePoint2d &point, AcGePointOnCurve2d &approxPnt, const AcGeInterval *nbhd=0, const AcGeTol &=AcGeContext::gTol) const
 void  | getLocalClosestPoints (const AcGeCurve2d &otherCurve, AcGePointOnCurve2d &approxPntOnThisCrv, AcGePointOnCurve2d &approxPntOnOtherCrv, const AcGeInterval *nbhd1=0, const AcGeInterval *nbhd2=0, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | getNormalPoint (const AcGePoint2d &pnt, AcGePointOnCurve2d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getSamplePoints (double fromParam, double toParam, double approxEps, AcGePoint2dArray &pointArray, AcGeDoubleArray &paramArray) const
 void  | getSamplePoints (int numSample, AcGePoint2dArray &) const
 void  | getSplitCurves (double param, AcGeCurve2d *&piece1, AcGeCurve2d *&piece2) const
 void  | getTrimmedOffset (double distance, AcGeVoidPointerArray &offsetCurveList, AcGe::OffsetCrvExtType extensionType=AcGe::kFillet, const AcGeTol &=AcGeContext::gTol) const
 Adesk::Boolean  | hasEndPoint (AcGePoint2d &endPoint) const
 Adesk::Boolean  | hasStartPoint (AcGePoint2d &startPoint) const
 Adesk::Boolean  | isClosed (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isDegenerate (AcGe::EntityId &degenerateType, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isDegenerate (AcGeEntity2d *&pConvertedEntity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isLinear (AcGeLine2d &line, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint2d &pnt, double &param, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (double param, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isPeriodic (double &period) const
 double  | length (double fromParam, double toParam, double tol=AcGeContext::gTol.equalPoint()) const
 AcGeCurve2d &  | operator= (const AcGeCurve2d &curve)
 AcGeBoundBlock2d  | orthoBoundBlock () const
 AcGeBoundBlock2d  | orthoBoundBlock (const AcGeInterval &range) const
 double  | paramAtLength (double datumParam, double length, Adesk::Boolean posParamDir=Adesk::kTrue, double tol=AcGeContext::gTol.equalPoint()) const
 double  | paramOf (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeCurve2d &  | reverseParam ()
 AcGeCurve2d &  | setInterval ()
 Adesk::Boolean  | setInterval (const AcGeInterval &intrvl)
 Public Member Functions inherited from AcGeEntity2d
 AcGeEntity2d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity2d &entity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity2d &  | mirror (const AcGeLine2d &line)
 Adesk::Boolean  | operator!= (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | operator= (const AcGeEntity2d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | rotateBy (double angle, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | scaleBy (double scaleFactor, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | transformBy (const AcGeMatrix2d &xfm)
 AcGeEntity2d &  | translateBy (const AcGeVector2d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeSplineEnt2d
AcGeSplineEnt2d (const AcGeSplineEnt2d &)
 Protected Member Functions inherited from AcGeCurve2d
AcGeCurve2d (const AcGeCurve2d &)
 Protected Member Functions inherited from AcGeEntity2d
AcGeEntity2d (const AcGeEntity2d &)
AcGeEntity2d (AcGeImpEntity3d &, int)
AcGeEntity2d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 Protected Attributes inherited from AcGeEntity2d
 int  | mDelEnt
 class AcGeImpEntity3d *  | mpImpEnt
Constructor & Destructor Documentation
 AcGeNurbCurve2d::AcGeNurbCurve2d  |  ( |  const AcGePoint2dArray &  |  fitPoints,
|  const AcGeVector2d &  |  startTangent,
|  const AcGeVector2d &  |  endTangent,
|  Adesk::Boolean  |  startTangentDefined,
|  Adesk::Boolean  |  endTangentDefined,
|  AcGe::KnotParameterization  |  knotParam,
|  const AcGeTol &  |  fitTolerance = AcGeContext::gTol
)
Warning
Not implemented!
 AcGeNurbCurve2d::AcGeNurbCurve2d  |  ( |  const AcGeCurve2d &  |  curve,
|  double  |  epsilon = AcGeContext::gTol.equalPoint()
)
Warning
Not implemented!
Member Function Documentation
 Adesk::Boolean AcGeNurbCurve2d::addControlPointAt  |  ( |  double  |  newKnot,
|  const AcGePoint2d &  |  point,
|  double  |  weight = 1.0
)
Warning
Not implemented!
 Adesk::Boolean AcGeNurbCurve2d::buildFitData  |  ( |   | )
Warning
Not implemented!
 Adesk::Boolean AcGeNurbCurve2d::buildFitData  |  ( |  KnotParameterization  |  kp | )
Warning
Not implemented!
 Adesk::Boolean AcGeNurbCurve2d::deleteControlPointAt  |  ( |  int  |  index | )
Warning
Not implemented!
 Adesk::Boolean AcGeNurbCurve2d::getFitData  |  ( |  AcGePoint2dArray &  |  fitPoints,
|  AcGeTol &  |  fitTolerance,
|  Adesk::Boolean &  |  tangentsExist,
|  AcGeVector2d &  |  startTangent,
|  AcGeVector2d &  |  endTangent,
|  KnotParameterization &  |  knotParam
) |   |  const
Warning
Not implemented!
 Adesk::Boolean AcGeNurbCurve2d::getFitKnotParameterization  |  ( |  KnotParameterization &  |  knotParam | ) |   const
Warning
Not implemented!
 AcGeNurbCurve2d& AcGeNurbCurve2d::operator=  |  ( |  const AcGeNurbCurve2d &  |  spline | )
Warning
Not implemented!
 AcGeNurbCurve2d& AcGeNurbCurve2d::setFitData  |  ( |  const AcGePoint2dArray &  |  fitPoints,
|  const AcGeVector2d &  |  startTangent,
|  const AcGeVector2d &  |  endTangent,
|  KnotParameterization  |  knotParam,
|  const AcGeTol &  |  fitTol = AcGeContext::gTol
)
Warning
Not implemented!
 Adesk::Boolean AcGeNurbCurve2d::setFitKnotParameterization  |  ( |  KnotParameterization  |  knotParam | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
genurb2d.h