Public Types | Public Member Functions | Static Public Member Functions | Friends | List of all members
AcDbDatabase Class Reference
AcDb Classes
  Inheritance diagram for AcDbDatabase:
 Public Types
enum  | EraseMask { kZeroLengthCurve = 0x01, kEmptyText = 0x02, kAllEmptyObj = 0xFFFFFFFF }
enum  | OpenMode { kForReadAndReadShare = 1, kForReadAndWriteNoShare = 2, kForReadAndAllShare = 3, kTryForReadShare = 4 }
 Public Member Functions
 void  | abortDeepClone (AcDbIdMapping &idMap)
 ACDBCORE2D_PORT  | AcDbDatabase (bool buildDefaultDrawing=true, bool noDocument=false)
ACRX_DECLARE_MEMBERS (AcDbDatabase)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addAcDbObject (AcDbObjectId &id, AcDbObject *pObj)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addAcDbObject (AcDbObject *pObj)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbDatabaseReactor *pReactor) const
 double  | angbase () const
 bool  | angdir () const
bool  | annoAllVisible () const
bool  | annotativeDwg () const
 Acad::ErrorStatus  | applyPartialOpenFilters (const AcDbSpatialFilter *pSpatialFilter, const AcDbLayerFilter *pLayerFilter)
 int  | approxNumObjects () const
 bool  | attdia () const
 Adesk::Int16  | attmode () const
 bool  | attreq () const
 Acad::ErrorStatus  | auditXData (AcDbAuditInfo *pInfo)
 Adesk::Int16  | aunits () const
 Adesk::Int16  | auprec () const
 bool  | blipmode () const
 ACDBCORE2D_PORT AcDbObjectId  | blockTableId () const
 AcDbObjectId  | byBlockLinetype () const
 AcDbObjectId  | byBlockMaterial () const
 AcDbObjectId  | byLayerLinetype () const
 AcDbObjectId  | byLayerMaterial () const
bool  | cameraDisplay () const
double  | cameraHeight () const
AcDbAnnotationScale *  | cannoscale () const
Adesk::Int16  | cDynDisplayMode () const
 AcCmColor  | cecolor () const
 double  | celtscale () const
 AcDbObjectId  | celtype () const
 AcDb::LineWeight  | celweight () const
AcCmTransparency  | cetransparency () const
 double  | chamfera () const
 double  | chamferb () const
 double  | chamferc () const
 double  | chamferd () const
 const ACHAR *  | classDxfName (const AcRxClass *pClass)
 AcDbObjectId  | clayer () const
 const SecurityParams *  | cloneSecurityParams ()
 Acad::ErrorStatus  | closeInput (bool bCloseFile)
AcDbObjectId  | cmaterial () const
 Adesk::Int16  | cmljust () const
 double  | cmlscale () const
 AcDbObjectId  | cmlstyleID () const
 ACDBCORE2D_PORT AcDbObjectId  | colorDictionaryId () const
 AcDbObjectId  | continuousLinetype () const
 Adesk::Int16  | coords () const
Adesk::UInt32  | countEmptyObjects (const Adesk::UInt32 flags)
 Acad::ErrorStatus  | countHardReferences (const AcDbObjectIdArray &ids, Adesk::UInt32 *pCount)
Adesk::UInt8  | cshadow () const
 AcDbObjectId  | currentSpaceId () const
 AcDbObjectId  | dataLinkDictionaryId (void) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | deepCloneObjects (const AcDbObjectIdArray &objectIds, const AcDbObjectId &owner, AcDbIdMapping &idMap, bool deferXlation=false)
 Adesk::Int16  | delUsedObj () const
ACDBCORE2D_PORT AcDbObjectId  | detailViewStyle () const
ACDBCORE2D_PORT AcDbObjectId  | detailViewStyleDictionaryId () const
Adesk::UInt8  | dgnframe () const
 bool  | dimaso () const
 Adesk::UInt8  | dimAssoc () const
 int  | dimfit () const
 bool  | dimsho () const
 AcDbObjectId  | dimstyle () const
 ACDBCORE2D_PORT AcDbObjectId  | dimStyleTableId () const
 int  | dimunit () const
 void  | disablePartialOpen ()
 void  | disableUndoRecording (bool disable)
 bool  | dispSilh () const
 Adesk::Int16  | dragmode () const
AcDbObjectId  | dragVisStyle () const
 Adesk::UInt8  | drawOrderCtl () const
Adesk::UInt8  | dwfframe () const
 bool  | dwgFileWasSavedByAutodeskSoftware () const
Adesk::Int16  | dxeVal () const
 Acad::ErrorStatus  | dxfIn (const ACHAR *dxfFilename, const ACHAR *logFilename=nullptr)
Acad::ErrorStatus  | dxfIn (IAcReadStream *pInputStream, const ACHAR *logFilename=nullptr)
 Acad::ErrorStatus  | dxfOut (const ACHAR *fileName, int precision=16, AcDb::AcDbDwgVersion dwgVer=AcDb::kDHL_CURRENT, bool saveThumbnailImage=false)
 double  | elevation () const
 AcDb::EndCaps  | endCaps () const
Adesk::UInt32  | eraseEmptyObjects (const Adesk::UInt32 flags)
 Acad::ErrorStatus  | evaluateFields (int nContext, const ACHAR *pszPropName=nullptr, AcDbDatabase *pDb=nullptr, int *pNumFound=nullptr, int *pNumEvaluated=nullptr)
 AcGePoint3d  | extmax () const
 AcGePoint3d  | extmin () const
 double  | facetres () const
 double  | filletrad () const
 bool  | fillmode () const
 void  | forceWblockDatabaseCopy ()
ACDBCORE2D_PORT AcString  | geoCoordinateSystemId () const
bool  | geoMarkerVisibility () const
double  | get3dDwfPrec () const
 Acad::ErrorStatus  | getAcDbObjectId (AcDbObjectId &retId, bool createIfNotFound, const AcDbHandle &objHandle, Adesk::UInt32 xRefId=0)
 Acad::ErrorStatus  | getBlockTable (AcDbSymbolTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getBlockTable (AcDbBlockTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 AcDb::PlotStyleNameType  | getCePlotStyleNameId (AcDbObjectId &id) const
 Acad::ErrorStatus  | getColorDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getDataLinkDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
 AcDbDataLinkManager *  | getDataLinkManager (void) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getDetailViewStyleDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getDimapost (ACHAR *&pOutput) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getDimblk (AcString &sOutput) const
 Acad::ErrorStatus  | getDimblk (ACHAR *&pOutput) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getDimblk1 (AcString &sOutput) const
 Acad::ErrorStatus  | getDimblk1 (ACHAR *&pOutput) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getDimblk2 (AcString &sOutput) const
 Acad::ErrorStatus  | getDimblk2 (ACHAR *&pOutput) const
 Acad::ErrorStatus  | getDimpost (ACHAR *&pOutput) const
 Acad::ErrorStatus  | getDimRecentStyleList (AcDbObjectIdArray &objIds) const
 Acad::ErrorStatus  | getDimstyleChildData (const AcRxClass *pDimClass, AcDbDimStyleTableRecord *&pRec, AcDbObjectId &style) const
 AcDbObjectId  | getDimstyleChildId (const AcRxClass *pDimClass, AcDbObjectId &parentStyle) const
 Acad::ErrorStatus  | getDimstyleData (AcDbDimStyleTableRecord *&pRec) const
 AcDbObjectId  | getDimstyleParentId (AcDbObjectId &childStyle) const
 Acad::ErrorStatus  | getDimStyleTable (AcDbSymbolTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getDimStyleTable (AcDbDimStyleTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getFilename (const ACHAR *&pOutput) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getFingerprintGuid (AcString &guidString) const
 Acad::ErrorStatus  | getFingerprintGuid (ACHAR *&guidString) const
 Acad::ErrorStatus  | getGroupDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
ACDBCORE2D_PORT Acad::ErrorStatus  | getHyperlinkBase (AcString &sHyperlinkBase) const
 Acad::ErrorStatus  | getHyperlinkBase (ACHAR *&pOutput) const
 AcDbLayerStateManager *  | getLayerStateManager () const
 Acad::ErrorStatus  | getLayerTable (AcDbSymbolTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getLayerTable (AcDbLayerTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getLayoutDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getLinetypeTable (AcDbSymbolTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getLinetypeTable (AcDbLinetypeTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getMaterialDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
ACDBCORE2D_PORT Acad::ErrorStatus  | getMenu (AcString &sMenuName) const
 Acad::ErrorStatus  | getMenu (ACHAR *&pOutput) const
 Acad::ErrorStatus  | getMLeaderStyleDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getMLStyleDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getNamedObjectsDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getPlotSettingsDictionary (AcDbDictionary *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getPlotStyleNameDictionary (AcDbDictionaryWithDefault *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
ACDBCORE2D_PORT Acad::ErrorStatus  | getProjectName (AcString &sProjectName) const
 Acad::ErrorStatus  | getProjectName (ACHAR *&pOutput) const
 Acad::ErrorStatus  | getRegAppTable (AcDbSymbolTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getRegAppTable (AcDbRegAppTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getScaleListDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
 AcDbObjectId  | getSectionManager (void) const
 Acad::ErrorStatus  | getSectionManager (AcDbSectionManager *&pMgr, AcDb::OpenMode mode=AcDb::kForRead) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getSectionViewStyleDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
ACDBCORE2D_PORT Acad::ErrorStatus  | getStyleSheet (AcString &sStyleSheet) const
 Acad::ErrorStatus  | getStyleSheet (ACHAR *&pOutput) const
 Acad::ErrorStatus  | getSymbolTable (AcDbBlockTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getSymbolTable (AcDbLayerTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getSymbolTable (AcDbTextStyleTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getSymbolTable (AcDbLinetypeTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getSymbolTable (AcDbViewTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getSymbolTable (AcDbUCSTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getSymbolTable (AcDbViewportTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getSymbolTable (AcDbRegAppTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getSymbolTable (AcDbDimStyleTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
template<class TableType >
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 template<>
AcDbObjectId  | getSymbolTableId () const
 Acad::ErrorStatus  | getTableStyleDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getTextStyleTable (AcDbSymbolTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getTextStyleTable (AcDbTextStyleTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
Acad::ErrorStatus  | getTimeZoneInfo (AcDb::TimeZone tz, double &offset, AcString &desc) const
 Acad::ErrorStatus  | getUCSTable (AcDbSymbolTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getUCSTable (AcDbUCSTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
ACDBCORE2D_PORT Acad::ErrorStatus  | getVersionGuid (AcString &guidString) const
 Acad::ErrorStatus  | getVersionGuid (ACHAR *&guidString) const
 Acad::ErrorStatus  | getViewportArray (AcDbObjectIdArray &vportIds, bool bGetPaperspaceVports=true) const
 Acad::ErrorStatus  | getViewportTable (AcDbSymbolTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getViewportTable (AcDbViewportTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getViewTable (AcDbSymbolTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getViewTable (AcDbViewTable *&pTable, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getVisualStyleDictionary (AcDbDictionary *&pDict, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getVisualStyleList (AcArray< const ACHAR * > &vstyleList)
 AcDbObjectId  | globalMaterial () const
 ACDBCORE2D_PORT AcDbObjectId  | groupDictionaryId () const
 Adesk::UInt8  | haloGap () const
 AcDbHandle  | handseed () const
bool  | hasClass (const AcRxClass *pClass) const
 Adesk::UInt8  | hideText () const
bool  | hpInherit () const
AcGePoint2d  | hpOrigin () const
Adesk::UInt8  | indexctl () const
 AcDwgFileHandle *  | inputFiler () const
 AcGePoint3d  | insbase () const
 Acad::ErrorStatus  | insert (AcDbObjectId &blockId, const ACHAR *pBlockName, AcDbDatabase *pDb, bool preserveSourceDatabase=true)
 Acad::ErrorStatus  | insert (const AcGeMatrix3d &xform, AcDbDatabase *pDb, bool preserveSourceDatabase=true)
 Acad::ErrorStatus  | insert (AcDbObjectId &blockId, const ACHAR *pSourceBlockName, const ACHAR *pDestinationBlockName, AcDbDatabase *pDb, bool preserveSourceDatabase=true)
 AcDb::UnitsValue  | insunits () const
AcCmColor  | interfereColor () const
AcDbObjectId  | interfereObjVisStyle () const
AcDbObjectId  | interfereVpVisStyle () const
 Adesk::UInt16  | intersectColor () const
 Adesk::UInt8  | intersectDisplay () const
ACDBCORE2D_PORT bool  | isBeingDestroyed () const
 bool  | isEMR () const
 Adesk::Int16  | isolines () const
 bool  | isPartiallyOpened () const
 bool  | isPucsOrthographic (AcDb::OrthographicView &orthoView) const
 bool  | isUcsOrthographic (AcDb::OrthographicView &orthoView) const
 AcDb::JoinStyle  | joinStyle () const
 AcDb::MaintenanceReleaseVersion  | lastSavedAsMaintenanceVersion () const
 AcDb::AcDbDwgVersion  | lastSavedAsVersion () const
 double  | latitude () const
Adesk::UInt8  | layerEval () const
Adesk::Int16  | layerNotify () const
 ACDBCORE2D_PORT AcDbObjectId  | layerTableId () const
 AcDbObjectId  | layerZero () const
 ACDBCORE2D_PORT AcDbObjectId  | layoutDictionaryId () const
double  | lensLength () const
Adesk::UInt8  | lightGlyphDisplay () const
Adesk::UInt8  | lightingUnits () const
bool  | lightsInBlocks () const
 bool  | limcheck () const
 AcGePoint2d  | limmax () const
 AcGePoint2d  | limmin () const
 ACDBCORE2D_PORT AcDbObjectId  | linetypeTableId () const
 bool  | lineWeightDisplay () const
 Acad::ErrorStatus  | loadLineTypeFile (const ACHAR *ltn, const ACHAR *filename)
double  | loftAng1 () const
double  | loftAng2 () const
double  | loftMag1 () const
double  | loftMag2 () const
Adesk::UInt8  | loftNormals () const
Adesk::UInt16  | loftParam () const
double  | longitude () const
 double  | ltscale () const
 Adesk::Int16  | lunits () const
 Adesk::Int16  | luprec () const
 AcDb::MaintenanceReleaseVersion  | maintenanceReleaseVersion () const
 ACDBCORE2D_PORT AcDbObjectId  | materialDictionaryId () const
 Adesk::Int16  | maxactvp () const
 AcDb::MeasurementValue  | measurement () const
 bool  | mirrtext () const
double  | mleaderscale () const
 AcDbObjectId  | mleaderstyle () const
 AcDbObjectId  | mleaderStyleDictionaryId () const
 ACDBCORE2D_PORT AcDbObjectId  | mLStyleDictionaryId () const
bool  | msltscale () const
double  | msOleScale () const
 ACDBCORE2D_PORT AcDbObjectId  | namedObjectsDictionaryId () const
ACDBCORE2D_PORT bool  | needsRecovery () const
double  | northDirection () const
 Adesk::Int32  | numberOfSaves () const
 AcDbObjectContextManager *  | objectContextManager () const
 Adesk::UInt16  | obscuredColor () const
 Adesk::UInt8  | obscuredLineType () const
 bool  | oleStartUp () const
 AcDb::MaintenanceReleaseVersion  | originalFileMaintenanceVersion () const
 const ACHAR *  | originalFileName () const
 AcDb::MaintenanceReleaseVersion  | originalFileSavedByMaintenanceVersion () const
 AcDb::AcDbDwgVersion  | originalFileSavedByVersion () const
 AcDb::AcDbDwgVersion  | originalFileVersion () const
 bool  | orthomode () const
AcDwgFileHandle *  | outputFiler () const
 AcDbObjectId  | paperSpaceVportId () const
Adesk::Int8  | pdfframe () const
 Adesk::Int16  | pdmode () const
 double  | pdsize () const
 double  | pelevation () const
 AcGePoint3d  | pextmax () const
 AcGePoint3d  | pextmin () const
 Adesk::Int16  | pickstyle () const
 AcGePoint3d  | pinsbase () const
 bool  | plimcheck () const
 AcGePoint2d  | plimmax () const
 AcGePoint2d  | plimmin () const
 bool  | plineEllipse () const
 bool  | plinegen () const
 double  | plinewid () const
 ACDBCORE2D_PORT AcDbObjectId  | plotSettingsDictionaryId () const
 bool  | plotStyleMode () const
 ACDBCORE2D_PORT AcDbObjectId  | plotStyleNameDictionaryId () const
Adesk::Int16  | previewType () const
 bool  | psltscale () const
double  | psolHeight () const
double  | psolWidth () const
 AcDbObjectId  | pucsBase () const
 AcDbObjectId  | pucsname () const
 AcGePoint3d  | pucsorg () const
 AcGeVector3d  | pucsxdir () const
 AcGeVector3d  | pucsydir () const
 Acad::ErrorStatus  | purge (AcDbObjectIdArray &ids)
 Acad::ErrorStatus  | purge (AcDbObjectIdGraph &idGraph)
 bool  | qtextmode () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | readDwgFile (const ACHAR *fileName, OpenMode shmode=kForReadAndReadShare, bool bAllowCPConversion=false, const wchar_t *wszPassword=nullptr)
 ACDBCORE2D_PORT Acad::ErrorStatus  | readDwgFile (AcDwgFileHandle *pDwgFile, bool bAllowCPConversion=false, const wchar_t *wszPassword=nullptr)
bool  | realWorldScale () const
 Acad::ErrorStatus  | reclaimMemoryFromErasedObjects (const AcDbObjectIdArray &erasedObjects)
 ACDBCORE2D_PORT AcDbObjectId  | regAppTableId () const
 bool  | regenmode () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbDatabaseReactor *pReactor) const
Acad::ErrorStatus  | resetTimes ()
 Acad::ErrorStatus  | restoreForwardingXrefSymbols ()
 Acad::ErrorStatus  | restoreOriginalXrefSymbols ()
 bool  | retainOriginalThumbnailBitmap () const
 Acad::ErrorStatus  | save ()
 Acad::ErrorStatus  | saveAs (const ACHAR *fileName, const SecurityParams *pSecParams=0)
 ACDBCORE2D_PORT Acad::ErrorStatus  | saveAs (const ACHAR *fileName, const bool bBakAndRename, const AcDb::AcDbDwgVersion dwgVer=AcDb::kDHL_CURRENT, const SecurityParams *pSecParams=0)
ACDBCORE2D_PORT Acad::ErrorStatus  | saveAs (AcDwgFileHandle *pOutputFiler, const SecurityParams *pSecParams=0, bool crashing=false)
 Adesk::Int16  | saveproxygraphics () const
 ACDBCORE2D_PORT AcDbObjectId  | scaleListDictionaryId () const
ACDBCORE2D_PORT AcDbObjectId  | sectionViewStyle () const
ACDBCORE2D_PORT AcDbObjectId  | sectionViewStyleDictionaryId () const
Acad::ErrorStatus  | set3dDwfPrec (double DwfPrec)
 Acad::ErrorStatus  | setAngbase (double angle)
 Acad::ErrorStatus  | setAngdir (bool dir)
Acad::ErrorStatus  | setAnnoAllVisible (bool allvis)
Acad::ErrorStatus  | setAnnotativeDwg (bool anno)
 Acad::ErrorStatus  | setAttdia (bool dia)
 Acad::ErrorStatus  | setAttmode (Adesk::Int16 mode)
 Acad::ErrorStatus  | setAttreq (bool req)
 Acad::ErrorStatus  | setAunits (Adesk::Int16 aunits)
 Acad::ErrorStatus  | setAuprec (Adesk::Int16 auprec)
 Acad::ErrorStatus  | setBlipmode (bool mode)
Acad::ErrorStatus  | setCameraDisplay (const bool cameraDisplay)
Acad::ErrorStatus  | setCameraHeight (const double cameraHeight)
Acad::ErrorStatus  | setCannoscale (AcDbAnnotationScale *)
Acad::ErrorStatus  | setCDynDisplayMode (Adesk::Int16 val)
 Acad::ErrorStatus  | setCecolor (const AcCmColor &color)
 Acad::ErrorStatus  | setCeltscale (double scale)
 Acad::ErrorStatus  | setCeltype (AcDbObjectId objId)
 Acad::ErrorStatus  | setCelweight (AcDb::LineWeight weight)
 Acad::ErrorStatus  | setCePlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull)
Acad::ErrorStatus  | setCetransparency (const AcCmTransparency &transparency)
 Acad::ErrorStatus  | setChamfera (double val)
 Acad::ErrorStatus  | setChamferb (double val)
 Acad::ErrorStatus  | setChamferc (double val)
 Acad::ErrorStatus  | setChamferd (double val)
 Acad::ErrorStatus  | setClayer (AcDbObjectId objId)
Acad::ErrorStatus  | setCmaterial (AcDbObjectId objId)
 Acad::ErrorStatus  | setCmljust (Adesk::Int16 just)
 Acad::ErrorStatus  | setCmlscale (double scale)
 Acad::ErrorStatus  | setCmlstyleID (AcDbObjectId objId)
 Acad::ErrorStatus  | setCoords (Adesk::Int16 coords)
Acad::ErrorStatus  | setCshadow (Adesk::UInt8 val)
 Acad::ErrorStatus  | setDelUsedObj (Adesk::Int16 deleteObj)
ACDBCORE2D_PORT Acad::ErrorStatus  | setDetailViewStyle (AcDbObjectId objId)
Acad::ErrorStatus  | setDgnframe (Adesk::UInt8)
 Acad::ErrorStatus  | setDimaso (bool aso)
 Acad::ErrorStatus  | setDimAssoc (Adesk::UInt8 val)
 Acad::ErrorStatus  | setDimfit (int fit)
 Acad::ErrorStatus  | setDimsho (bool sho)
 Acad::ErrorStatus  | setDimstyle (AcDbObjectId styleId)
 Acad::ErrorStatus  | setDimstyleData (AcDbDimStyleTableRecord *pRec)
 Acad::ErrorStatus  | setDimstyleData (AcDbObjectId id)
 Acad::ErrorStatus  | setDimunit (int unit)
 Acad::ErrorStatus  | setDispSilh (bool silh)
 Acad::ErrorStatus  | setDragmode (Adesk::Int16 mode)
Acad::ErrorStatus  | setDragVisStyle (AcDbObjectId id)
 Acad::ErrorStatus  | setDrawOrderCtl (Adesk::UInt8 val)
Acad::ErrorStatus  | setDwfframe (Adesk::UInt8)
Acad::ErrorStatus  | setDxeVal (Adesk::Int16 val)
 Acad::ErrorStatus  | setElevation (double elev)
 Acad::ErrorStatus  | setEndCaps (AcDb::EndCaps type)
 Acad::ErrorStatus  | setExtmax (const AcGePoint3d &max)
 Acad::ErrorStatus  | setExtmin (const AcGePoint3d &min)
 Acad::ErrorStatus  | setFacetres (double facetres)
 Acad::ErrorStatus  | setFilletrad (double radius)
 Acad::ErrorStatus  | setFillmode (bool mode)
 Acad::ErrorStatus  | setFingerprintGuid (const ACHAR *pNewGuid)
ACDBCORE2D_PORT void  | setFullSaveRequired ()
Acad::ErrorStatus  | setGeoMarkerVisibility (bool value)
 Acad::ErrorStatus  | setHaloGap (Adesk::UInt8 val)
 Acad::ErrorStatus  | setHandseed (const AcDbHandle &handle)
 Acad::ErrorStatus  | setHideText (Adesk::UInt8 val)
Acad::ErrorStatus  | setHpInherit (const bool inherit)
Acad::ErrorStatus  | setHpOrigin (const AcGePoint2d &origin)
 Acad::ErrorStatus  | setHyperlinkBase (const ACHAR *)
Acad::ErrorStatus  | setIndexctl (Adesk::UInt8 val)
 Acad::ErrorStatus  | setInsbase (const AcGePoint3d &base)
 Acad::ErrorStatus  | setInsunits (const AcDb::UnitsValue units)
Acad::ErrorStatus  | setInterfereColor (const AcCmColor &color)
Acad::ErrorStatus  | setInterfereObjVisStyle (AcDbObjectId id)
Acad::ErrorStatus  | setInterfereVpVisStyle (AcDbObjectId id)
 Acad::ErrorStatus  | setIntersectColor (Adesk::UInt16 val)
 Acad::ErrorStatus  | setIntersectDisplay (Adesk::UInt8 val)
 Acad::ErrorStatus  | setIsolines (Adesk::Int16 isolines)
 Acad::ErrorStatus  | setJoinStyle (AcDb::JoinStyle style)
Acad::ErrorStatus  | setLatitude (double lat)
Acad::ErrorStatus  | setLayerEval (Adesk::UInt8 val)
Acad::ErrorStatus  | setLayerNotify (Adesk::Int16 val)
Acad::ErrorStatus  | setLensLength (const double lensLength)
Acad::ErrorStatus  | setLightGlyphDisplay (Adesk::UInt8 val)
Acad::ErrorStatus  | setLightingUnits (Adesk::UInt8 val)
Acad::ErrorStatus  | setLightsInBlocks (bool val)
 Acad::ErrorStatus  | setLimcheck (bool check)
 Acad::ErrorStatus  | setLimmax (const AcGePoint2d &max)
 Acad::ErrorStatus  | setLimmin (const AcGePoint2d &min)
 Acad::ErrorStatus  | setLineWeightDisplay (bool display)
Acad::ErrorStatus  | setLoftAng1 (double ang1)
Acad::ErrorStatus  | setLoftAng2 (double ang2)
Acad::ErrorStatus  | setLoftMag1 (double mag1)
Acad::ErrorStatus  | setLoftMag2 (double mag2)
Acad::ErrorStatus  | setLoftNormals (Adesk::UInt8 value)
Acad::ErrorStatus  | setLoftParam (Adesk::UInt16 flags)
Acad::ErrorStatus  | setLongitude (double lng)
 Acad::ErrorStatus  | setLtscale (double scale)
 Acad::ErrorStatus  | setLunits (Adesk::Int16 lunits)
 Acad::ErrorStatus  | setLuprec (Adesk::Int16 prec)
 Acad::ErrorStatus  | setMaxactvp (Adesk::Int16 max)
 Acad::ErrorStatus  | setMeasurement (AcDb::MeasurementValue type)
 Acad::ErrorStatus  | setMirrtext (bool mirror)
Acad::ErrorStatus  | setMLeaderscale (double scale)
Acad::ErrorStatus  | setMLeaderstyle (AcDbObjectId objId)
Acad::ErrorStatus  | setMsltscale (bool val)
Acad::ErrorStatus  | setMsOleScale (double val)
Acad::ErrorStatus  | setNorthDirection (double northdir)
 Acad::ErrorStatus  | setObscuredColor (Adesk::UInt16 val)
 Acad::ErrorStatus  | setObscuredLineType (Adesk::UInt8 val)
 Acad::ErrorStatus  | setOleStartUp (bool val)
 Acad::ErrorStatus  | setOrthomode (bool mode)
Acad::ErrorStatus  | setPdfframe (Adesk::Int8 val)
 Acad::ErrorStatus  | setPdmode (Adesk::Int16 mode)
 Acad::ErrorStatus  | setPdsize (double size)
 Acad::ErrorStatus  | setPelevation (double elev)
 Acad::ErrorStatus  | setPextmax (const AcGePoint3d &max)
 Acad::ErrorStatus  | setPextmin (const AcGePoint3d &min)
 Acad::ErrorStatus  | setPickstyle (Adesk::Int16 style)
 Acad::ErrorStatus  | setPinsbase (const AcGePoint3d &base)
 Acad::ErrorStatus  | setPlimcheck (bool check)
 Acad::ErrorStatus  | setPlimmax (const AcGePoint2d &max)
 Acad::ErrorStatus  | setPlimmin (const AcGePoint2d &min)
 Acad::ErrorStatus  | setPlineEllipse (bool pline)
 Acad::ErrorStatus  | setPlinegen (bool gen)
 Acad::ErrorStatus  | setPlinewid (double width)
Acad::ErrorStatus  | setPreviewType (Adesk::Int16 val)
 Acad::ErrorStatus  | setProjectName (const ACHAR *)
 Acad::ErrorStatus  | setPsltscale (bool scale)
Acad::ErrorStatus  | setPsolHeight (double height)
Acad::ErrorStatus  | setPsolWidth (double width)
ACDBCORE2D_PORT Acad::ErrorStatus  | setPucs (const AcGePoint3d &ucsOrigin, const AcGeVector3d &ucsXDir, const AcGeVector3d &ucsYDir)
 Acad::ErrorStatus  | setPucsBase (const AcDbObjectId &ucsid)
ACDBCORE2D_PORT Acad::ErrorStatus  | setPucsname (const AcDbObjectId &ucsRecId)
 Acad::ErrorStatus  | setQtextmode (bool mode)
Acad::ErrorStatus  | setRealWorldScale (const bool realWorldScale)
 Acad::ErrorStatus  | setRegenmode (bool mode)
 void  | setRetainOriginalThumbnailBitmap (bool retain)
 Acad::ErrorStatus  | setSaveproxygraphics (Adesk::Int16 saveimg)
ACDBCORE2D_PORT Acad::ErrorStatus  | setSectionViewStyle (AcDbObjectId objId)
 bool  | setSecurityParams (const SecurityParams *pSecParams, bool bSetDbMod=true)
 Acad::ErrorStatus  | setShadedge (Adesk::Int16 mode)
 Acad::ErrorStatus  | setShadedif (Adesk::Int16 dif)
Acad::ErrorStatus  | setShadowPlaneLocation (double val)
Acad::ErrorStatus  | setShowHist (Adesk::UInt8 val)
 Acad::ErrorStatus  | setSketchinc (double inc)
 Acad::ErrorStatus  | setSkpoly (bool asPoly)
Acad::ErrorStatus  | setSolidHist (Adesk::UInt8 val)
 Acad::ErrorStatus  | setSortEnts (Adesk::UInt8 sortEnts)
 Acad::ErrorStatus  | setSplframe (bool disp)
 Acad::ErrorStatus  | setSplinesegs (Adesk::Int16 segs)
 Acad::ErrorStatus  | setSplinetype (Adesk::Int16 type)
Acad::ErrorStatus  | setStepSize (double stepSize)
Acad::ErrorStatus  | setStepsPerSec (double stepsPerSec)
 Acad::ErrorStatus  | setStyleSheet (const ACHAR *)
 Acad::ErrorStatus  | setSurftab1 (Adesk::Int16 tab1)
 Acad::ErrorStatus  | setSurftab2 (Adesk::Int16 tab2)
 Acad::ErrorStatus  | setSurftype (Adesk::Int16 type)
 Acad::ErrorStatus  | setSurfu (Adesk::Int16 u)
 Acad::ErrorStatus  | setSurfv (Adesk::Int16 v)
 Acad::ErrorStatus  | setTablestyle (AcDbObjectId objId)
 Acad::ErrorStatus  | setTextsize (double size)
 Acad::ErrorStatus  | setTextstyle (AcDbObjectId objId)
 Acad::ErrorStatus  | setThickness (double thickness)
 Acad::ErrorStatus  | setThumbnailBitmap (void *pBmp)
Acad::ErrorStatus  | setThumbnailImage (const Atil::Image *pPreviewImage)
 Acad::ErrorStatus  | setTilemode (bool mode)
Acad::ErrorStatus  | setTileModeLightSynch (Adesk::UInt8 val)
Acad::ErrorStatus  | setTimeZone (AcDb::TimeZone tz)
Acad::ErrorStatus  | setTimeZoneAsUtcOffset (double offset)
 Acad::ErrorStatus  | setTracewid (double width)
 Acad::ErrorStatus  | setTreedepth (Adesk::Int16 depth)
 Acad::ErrorStatus  | setTStackAlign (int val)
 Acad::ErrorStatus  | setTStackSize (int val)
ACDBCORE2D_PORT Acad::ErrorStatus  | setUcs (const AcGePoint3d &ucsOrigin, const AcGeVector3d &ucsXDir, const AcGeVector3d &ucsYDir)
 Acad::ErrorStatus  | setUcsBase (AcDbObjectId ucsid)
ACDBCORE2D_PORT Acad::ErrorStatus  | setUcsname (const AcDbObjectId &ucsRecId)
 Acad::ErrorStatus  | setUnitmode (Adesk::Int16 mode)
Acad::ErrorStatus  | setUpdateThumbnail (Adesk::UInt8 val)
 Acad::ErrorStatus  | setUseri1 (Adesk::Int16 val)
 Acad::ErrorStatus  | setUseri2 (Adesk::Int16 val)
 Acad::ErrorStatus  | setUseri3 (Adesk::Int16 val)
 Acad::ErrorStatus  | setUseri4 (Adesk::Int16 val)
 Acad::ErrorStatus  | setUseri5 (Adesk::Int16 val)
 Acad::ErrorStatus  | setUserr1 (double val)
 Acad::ErrorStatus  | setUserr2 (double val)
 Acad::ErrorStatus  | setUserr3 (double val)
 Acad::ErrorStatus  | setUserr4 (double val)
 Acad::ErrorStatus  | setUserr5 (double val)
 Acad::ErrorStatus  | setUsrtimer (bool timer)
 Acad::ErrorStatus  | setVersionGuid (const ACHAR *pNewGuid)
 Acad::ErrorStatus  | setViewportScaleDefault (double newDefaultVPScale)
 Acad::ErrorStatus  | setVisretain (bool retain)
 Acad::ErrorStatus  | setWorldPucsBaseOrigin (const AcGePoint3d &origin, AcDb::OrthographicView orthoView)
 Acad::ErrorStatus  | setWorldUcsBaseOrigin (const AcGePoint3d &origin, AcDb::OrthographicView orthoView)
 Acad::ErrorStatus  | setWorldview (bool view)
Acad::ErrorStatus  | setXclipFrame (Adesk::UInt8 disp)
 Acad::ErrorStatus  | setXrefEditEnabled (bool enable)
 Adesk::Int16  | shadedge () const
 Adesk::Int16  | shadedif () const
double  | shadowPlaneLocation () const
Adesk::UInt8  | showHist () const
 double  | sketchinc () const
 bool  | skpoly () const
Adesk::UInt8  | solidHist () const
 Adesk::UInt8  | sortEnts () const
 bool  | splframe () const
 Adesk::Int16  | splinesegs () const
 Adesk::Int16  | splinetype () const
double  | stepSize () const
double  | stepsPerSec () const
 Adesk::Int16  | surftab1 () const
 Adesk::Int16  | surftab2 () const
 Adesk::Int16  | surftype () const
 Adesk::Int16  | surfu () const
 Adesk::Int16  | surfv () const
 AcDbObjectId  | tablestyle () const
 AcDbObjectId  | tableStyleDictionaryId () const
 const AcDbDate  | tdcreate () const
 const AcDbDate  | tdindwg () const
 const AcDbDate  | tducreate () const
 const AcDbDate  | tdupdate () const
 const AcDbDate  | tdusrtimer () const
 const AcDbDate  | tduupdate () const
 double  | textsize () const
 AcDbObjectId  | textstyle () const
 ACDBCORE2D_PORT AcDbObjectId  | textStyleTableId () const
 double  | thickness () const
 void *  | thumbnailBitmap () const
Acad::ErrorStatus  | thumbnailImage (Atil::Image *&pPreviewImage) const
 bool  | tilemode () const
Adesk::UInt8  | tileModeLightSynch () const
AcDb::TimeZone  | timeZone () const
 double  | tracewid () const
 AcDbTransactionManager *  | transactionManager () const
 Adesk::Int16  | treedepth () const
 int  | tstackalign () const
 int  | tstacksize () const
 AcDbObjectId  | ucsBase () const
 AcDbObjectId  | ucsname () const
 AcGePoint3d  | ucsorg () const
 ACDBCORE2D_PORT AcDbObjectId  | UCSTableId () const
 AcGeVector3d  | ucsxdir () const
 AcGeVector3d  | ucsydir () const
 AcDbUndoController *  | undoController () const
 bool  | undoRecording () const
 Adesk::Int16  | unitmode () const
 Acad::ErrorStatus  | updateDataLink (AcDb::UpdateDirection nDir, AcDb::UpdateOption nOption)
 Acad::ErrorStatus  | updateExt (bool doBestFit=false)
Adesk::UInt8  | updateThumbnail () const
 Adesk::Int16  | useri1 () const
 Adesk::Int16  | useri2 () const
 Adesk::Int16  | useri3 () const
 Adesk::Int16  | useri4 () const
 Adesk::Int16  | useri5 () const
 double  | userr1 () const
 double  | userr2 () const
 double  | userr3 () const
 double  | userr4 () const
 double  | userr5 () const
 bool  | usrtimer () const
 double  | viewportScaleDefault () const
 ACDBCORE2D_PORT AcDbObjectId  | viewportTableId () const
 ACDBCORE2D_PORT AcDbObjectId  | viewTableId () const
 bool  | visretain () const
 ACDBCORE2D_PORT AcDbObjectId  | visualStyleDictionaryId () const
 Acad::ErrorStatus  | wblock (AcDbDatabase *&pOutputDb, const AcDbObjectIdArray &outObjIds, const AcGePoint3d &basePoint)
 Acad::ErrorStatus  | wblock (AcDbDatabase *pOutputDb, const AcDbObjectIdArray &outObjIds, const AcGePoint3d &basePoint, AcDb::DuplicateRecordCloning drc)
 Acad::ErrorStatus  | wblock (AcDbDatabase *&pOutputDb, AcDbObjectId blockId)
 Acad::ErrorStatus  | wblock (AcDbDatabase *&pOutputDb)
 ACDBCORE2D_PORT Acad::ErrorStatus  | wblockCloneObjects (const AcDbObjectIdArray &objectIds, const AcDbObjectId &owner, AcDbIdMapping &idMap, AcDb::DuplicateRecordCloning drc, bool deferXlation=false)
 AcGePoint3d  | worldPucsBaseOrigin (AcDb::OrthographicView orthoView) const
 AcGePoint3d  | worldUcsBaseOrigin (AcDb::OrthographicView orthoView) const
 bool  | worldview () const
Adesk::UInt8  | xclipFrame () const
 AcDbObjectId  | xrefBlockId () const
 bool  | xrefEditEnabled () const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
 static void  | disposeSecurityParams (const SecurityParams *pSecParams)
 static AcDb::LineWeight  | getNearestLineWeight (int weight)
 static bool  | isObjectNonPersistent (AcDbObjectId id)
 static bool  | isValidLineWeight (int weight)
 static Acad::ErrorStatus  | markObjectNonPersistent (AcDbObjectId id, bool value)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Friends
 class  | AcDbSystemInternals
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 bool AcDbDatabase::annoAllVisible  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbDatabase::annotativeDwg  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbDatabase::cameraDisplay  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::cameraHeight  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbAnnotationScale* AcDbDatabase::cannoscale  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::Int16 AcDbDatabase::cDynDisplayMode  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmTransparency AcDbDatabase::cetransparency  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbDatabase::cmaterial  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt32 AcDbDatabase::countEmptyObjects  |  ( |  const Adesk::UInt32  |  flags | )
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::cshadow  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbObjectId AcDbDatabase::detailViewStyle  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbObjectId AcDbDatabase::detailViewStyleDictionaryId  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::dgnframe  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbDatabase::dragVisStyle  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::dwfframe  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::Int16 AcDbDatabase::dxeVal  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::dxfIn  |  ( |  IAcReadStream *  |  pInputStream,
|  const ACHAR *  |  logFilename = nullptr
)
Warning
Not implemented!
 Adesk::UInt32 AcDbDatabase::eraseEmptyObjects  |  ( |  const Adesk::UInt32  |  flags | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcString AcDbDatabase::geoCoordinateSystemId  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbDatabase::geoMarkerVisibility  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::get3dDwfPrec  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::getDetailViewStyleDictionary  |  ( |  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode = AcDb::kForRead
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::getDimblk  |  ( |  AcString &  |  sOutput | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::getDimblk1  |  ( |  AcString &  |  sOutput | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::getDimblk2  |  ( |  AcString &  |  sOutput | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::getFingerprintGuid  |  ( |  AcString &  |  guidString | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::getHyperlinkBase  |  ( |  AcString &  |  sHyperlinkBase | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::getMenu  |  ( |  AcString &  |  sMenuName | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::getProjectName  |  ( |  AcString &  |  sProjectName | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::getSectionViewStyleDictionary  |  ( |  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode = AcDb::kForRead
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::getStyleSheet  |  ( |  AcString &  |  sStyleSheet | ) |   const
Warning
Not implemented!
 template<class TableType >
 AcDbObjectId AcDbDatabase::getSymbolTableId  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::getTimeZoneInfo  |  ( |  AcDb::TimeZone  |  tz,
|  double &  |  offset,
|  AcString &  |  desc
) |   |  const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::getVersionGuid  |  ( |  AcString &  |  guidString | ) |   const
Warning
Not implemented!
 bool AcDbDatabase::hasClass  |  ( |  const AcRxClass *  |  pClass | ) |   const
Warning
Not implemented!
 bool AcDbDatabase::hpInherit  |  ( |   | ) |   const
Warning
Not implemented!
 AcGePoint2d AcDbDatabase::hpOrigin  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::indexctl  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcDbDatabase::interfereColor  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbDatabase::interfereObjVisStyle  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbDatabase::interfereVpVisStyle  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDatabase::isBeingDestroyed  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::layerEval  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::Int16 AcDbDatabase::layerNotify  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::lensLength  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::lightGlyphDisplay  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::lightingUnits  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbDatabase::lightsInBlocks  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::loftAng1  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::loftAng2  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::loftMag1  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::loftMag2  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::loftNormals  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt16 AcDbDatabase::loftParam  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::longitude  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::mleaderscale  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbDatabase::msltscale  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::msOleScale  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbDatabase::needsRecovery  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::northDirection  |  ( |   | ) |   const
Warning
Not implemented!
 AcDwgFileHandle* AcDbDatabase::outputFiler  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::Int8 AcDbDatabase::pdfframe  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::Int16 AcDbDatabase::previewType  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::psolHeight  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::psolWidth  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbDatabase::realWorldScale  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::resetTimes  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::saveAs  |  ( |  AcDwgFileHandle *  |  pOutputFiler,
|  const SecurityParams *  |  pSecParams = 0,
|  bool  |  crashing = false
)
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbObjectId AcDbDatabase::sectionViewStyle  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbObjectId AcDbDatabase::sectionViewStyleDictionaryId  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::set3dDwfPrec  |  ( |  double  |  DwfPrec | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setAnnoAllVisible  |  ( |  bool  |  allvis | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setAnnotativeDwg  |  ( |  bool  |  anno | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setCameraDisplay  |  ( |  const bool  |  cameraDisplay | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setCameraHeight  |  ( |  const double  |  cameraHeight | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setCannoscale  |  ( |  AcDbAnnotationScale *  |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setCDynDisplayMode  |  ( |  Adesk::Int16  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setCetransparency  |  ( |  const AcCmTransparency &  |  transparency | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setCmaterial  |  ( |  AcDbObjectId  |  objId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setCshadow  |  ( |  Adesk::UInt8  |  val | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::setDetailViewStyle  |  ( |  AcDbObjectId  |  objId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setDgnframe  |  ( |  Adesk::UInt8  |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setDragVisStyle  |  ( |  AcDbObjectId  |  id | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setDwfframe  |  ( |  Adesk::UInt8  |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setDxeVal  |  ( |  Adesk::Int16  |  val | )
Warning
Not implemented!
 ACDBCORE2D_PORT void AcDbDatabase::setFullSaveRequired  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setGeoMarkerVisibility  |  ( |  bool  |  value | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setHpInherit  |  ( |  const bool  |  inherit | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setHpOrigin  |  ( |  const AcGePoint2d &  |  origin | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setIndexctl  |  ( |  Adesk::UInt8  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setInterfereColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setInterfereObjVisStyle  |  ( |  AcDbObjectId  |  id | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setInterfereVpVisStyle  |  ( |  AcDbObjectId  |  id | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLatitude  |  ( |  double  |  lat | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLayerEval  |  ( |  Adesk::UInt8  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLayerNotify  |  ( |  Adesk::Int16  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLensLength  |  ( |  const double  |  lensLength | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLightGlyphDisplay  |  ( |  Adesk::UInt8  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLightingUnits  |  ( |  Adesk::UInt8  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLightsInBlocks  |  ( |  bool  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLoftAng1  |  ( |  double  |  ang1 | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLoftAng2  |  ( |  double  |  ang2 | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLoftMag1  |  ( |  double  |  mag1 | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLoftMag2  |  ( |  double  |  mag2 | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLoftNormals  |  ( |  Adesk::UInt8  |  value | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLoftParam  |  ( |  Adesk::UInt16  |  flags | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setLongitude  |  ( |  double  |  lng | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setMLeaderscale  |  ( |  double  |  scale | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setMLeaderstyle  |  ( |  AcDbObjectId  |  objId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setMsltscale  |  ( |  bool  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setMsOleScale  |  ( |  double  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setNorthDirection  |  ( |  double  |  northdir | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setPdfframe  |  ( |  Adesk::Int8  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setPreviewType  |  ( |  Adesk::Int16  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setPsolHeight  |  ( |  double  |  height | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setPsolWidth  |  ( |  double  |  width | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::setPucs  |  ( |  const AcGePoint3d &  |  ucsOrigin,
|  const AcGeVector3d &  |  ucsXDir,
|  const AcGeVector3d &  |  ucsYDir
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::setPucsname  |  ( |  const AcDbObjectId &  |  ucsRecId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setRealWorldScale  |  ( |  const bool  |  realWorldScale | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::setSectionViewStyle  |  ( |  AcDbObjectId  |  objId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setShadowPlaneLocation  |  ( |  double  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setShowHist  |  ( |  Adesk::UInt8  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setSolidHist  |  ( |  Adesk::UInt8  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setStepSize  |  ( |  double  |  stepSize | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setStepsPerSec  |  ( |  double  |  stepsPerSec | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setThumbnailImage  |  ( |  const Atil::Image *  |  pPreviewImage | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setTileModeLightSynch  |  ( |  Adesk::UInt8  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setTimeZone  |  ( |  AcDb::TimeZone  |  tz | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setTimeZoneAsUtcOffset  |  ( |  double  |  offset | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::setUcs  |  ( |  const AcGePoint3d &  |  ucsOrigin,
|  const AcGeVector3d &  |  ucsXDir,
|  const AcGeVector3d &  |  ucsYDir
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbDatabase::setUcsname  |  ( |  const AcDbObjectId &  |  ucsRecId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setUpdateThumbnail  |  ( |  Adesk::UInt8  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::setXclipFrame  |  ( |  Adesk::UInt8  |  disp | )
Warning
Not implemented!
 double AcDbDatabase::shadowPlaneLocation  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::showHist  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::solidHist  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::stepSize  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDatabase::stepsPerSec  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbDatabase::thumbnailImage  |  ( |  Atil::Image *&  |  pPreviewImage | ) |   const
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::tileModeLightSynch  |  ( |   | ) |   const
Warning
Not implemented!
 AcDb::TimeZone AcDbDatabase::timeZone  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::updateThumbnail  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::UInt8 AcDbDatabase::xclipFrame  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbmain.h