Public Member Functions | Public Attributes | Static Public Attributes | Friends | List of all members
AcGeScale2d Class Reference
AcGe Classes
 Public Member Functions
 GE_DLLEXPIMPORT  | AcGeScale2d (const AcGeScale2d &src)
 GE_DLLEXPIMPORT  | AcGeScale2d (double factor)
 GE_DLLEXPIMPORT  | AcGeScale2d (double xFactor, double yFactor)
 GE_DLLEXPIMPORT AcGeScale2d &  | extractScale (const AcGeMatrix2d &mat)
 GE_DLLEXPIMPORT void  | getMatrix (AcGeMatrix2d &mat) const
 GE_DLLEXPIMPORT AcGeScale2d  | inverse () const
 GE_DLLEXPIMPORT AcGeScale2d &  | invert ()
 GE_DLLEXPIMPORT bool  | isEqualTo (const AcGeScale2d &scaleVec, const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isProportional (const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT  | operator AcGeMatrix2d () const
 GE_DLLEXPIMPORT  | operator AcGeScale3d () const
 GE_DLLEXPIMPORT bool  | operator!= (const AcGeScale2d &sclVec) const
 GE_DLLEXPIMPORT AcGeScale2d  | operator* (const AcGeScale2d &sclVec) const
 GE_DLLEXPIMPORT AcGeScale2d  | operator* (double s) const
 GE_DLLEXPIMPORT AcGeScale2d &  | operator*= (const AcGeScale2d &scl)
 GE_DLLEXPIMPORT AcGeScale2d &  | operator*= (double s)
 GE_DLLEXPIMPORT bool  | operator== (const AcGeScale2d &sclVec) const
 GE_DLLEXPIMPORT double  | operator[] (unsigned int i) const
 GE_DLLEXPIMPORT double &  | operator[] (unsigned int i)
 GE_DLLEXPIMPORT AcGeScale2d &  | postMultBy (const AcGeScale2d &rightSide)
 GE_DLLEXPIMPORT AcGeScale2d &  | preMultBy (const AcGeScale2d &leftSide)
 GE_DLLEXPIMPORT AcGeScale2d &  | removeScale (AcGeMatrix2d &mat)
 GE_DLLEXPIMPORT AcGeScale2d &  | set (double sc0, double sc1)
 GE_DLLEXPIMPORT AcGeScale2d &  | setToProduct (const AcGeScale2d &sclVec1, const AcGeScale2d &sclVec2)
 GE_DLLEXPIMPORT AcGeScale2d &  | setToProduct (const AcGeScale2d &sclVec, double s)
 Public Attributes
 double  | sx
 double  | sy
 Static Public Attributes
 static GE_DLLDATAEXIMP const AcGeScale2d  | kIdentity
 Friends
 GE_DLLEXPIMPORT AcGeScale2d  | operator* (double, const AcGeScale2d &scl)
 The documentation for this class was generated from the following file:
gescl2d.h