Public Types | Public Member Functions | List of all members
AcGiWebLightTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiWebLightTraits:
 Public Types
enum  | WebFileType { kTypeC = 1, kTypeB = 2, kTypeA = 3 }
enum  | WebSymmetry { kNoSymmetry = 0, kSingleSymmetry = 1, kDoubleSymmetry = 2, kAxialSymmetry = 3 }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiWebLightTraits)
 virtual void  | setWebFile (const ACHAR *webFile)=0
 virtual void  | setWebFileType (WebFileType type)=0
 virtual void  | setWebFlux (double flux) const =0
 virtual void  | setWebHorzAng90to270 (bool bIs90to270)=0
 virtual void  | setWebRotation (AcGeVector3d rotation)=0
 virtual void  | setWebSymmetry (WebSymmetry symmetry)=0
 virtual void  | webFile (AcString &webFile) const =0
 virtual WebFileType  | webFileType (void) const =0
 virtual double  | webFlux () const =0
 virtual bool  | webHorzAng90to270 (void) const =0
 virtual void  | webRotation (AcGeVector3d &rotation) const =0
 virtual WebSymmetry  | webSymmetry (void) const =0
 Public Member Functions inherited from AcGiPointLightTraits
ACRX_DECLARE_MEMBERS (AcGiPointLightTraits)
 virtual bool  | hasTarget (void) const =0
 virtual void  | lampColor (AcGiColorRGB &rgbColor) const =0
 virtual void  | lightAttenuation (AcGiLightAttenuation &atten) const =0
 virtual double  | physicalIntensity () const =0
 virtual AcGePoint3d  | position () const =0
 virtual void  | setAttenuation (const AcGiLightAttenuation &atten)=0
 virtual void  | setHasTarget (bool bHasTarget)=0
 virtual void  | setLampColor (const AcGiColorRGB &rgbColor)=0
 virtual void  | setPhysicalIntensity (double physicalIntensity)=0
 virtual void  | setPosition (const AcGePoint3d &pos)=0
 virtual void  | setTargetLocation (const AcGePoint3d &loc)=0
 virtual AcGePoint3d  | targetLocation () const =0
 Public Member Functions inherited from AcGiStandardLightTraits
ACRX_DECLARE_MEMBERS (AcGiStandardLightTraits)
 virtual double  | intensity () const =0
 virtual AcCmColor  | lightColor () const =0
 virtual void  | setIntensity (double inten)=0
 virtual void  | setLightColor (const AcCmColor &color)=0
 virtual void  | setShadowParameters (const AcGiShadowParameters &params)=0
 virtual void  | shadowParameters (AcGiShadowParameters &params) const =0
 Public Member Functions inherited from AcGiLightTraits
ACRX_DECLARE_MEMBERS (AcGiLightTraits)
 virtual bool  | isOn () const =0
 virtual void  | setOn (bool on)=0
 The documentation for this class was generated from the following file:
AcGiLightTraits.h