Public Member Functions | Static Public Member Functions | List of all members
AcDbAssocValueProviderPE Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbAssocValueProviderPE:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbAssocValueProviderPE)
 virtual bool  | canGetValue (const AcDbObject *pObject, const AcString &valueName)
 virtual bool  | canSetValue (const AcDbObject *pObject, const AcString &valueName)
 virtual Acad::ErrorStatus  | getValue (const AcDbObject *pObject, const AcString &valueName, AcDbEvalVariant &value)=0
 virtual Acad::ErrorStatus  | setValue (AcDbObject *pObject, const AcString &valueName, const AcDbEvalVariant &newValue)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static Acad::ErrorStatus  | getObjectValue (const AcDbObjectId &, const AcString &valueName, AcDbEvalVariant &value)
static Acad::ErrorStatus  | setObjectValue (const AcDbObjectId &, const AcString &valueName, const AcDbEvalVariant &value)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 static Acad::ErrorStatus AcDbAssocValueProviderPE::getObjectValue  |  ( |  const AcDbObjectId &  |  ,
|  const AcString &  |  valueName,
|  AcDbEvalVariant &  |  value
)
static
Warning
Not implemented!
 static Acad::ErrorStatus AcDbAssocValueProviderPE::setObjectValue  |  ( |  const AcDbObjectId &  |  ,
|  const AcString &  |  valueName,
|  const AcDbEvalVariant &  |  value
)
static
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocValueProviderPE.h