Public Member Functions | List of all members
AcGiContextualColors Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiContextualColors:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiContextualColors)
 virtual Adesk::UInt32  | cameraClipping () const =0
 virtual Adesk::UInt32  | cameraFrustrum () const =0
 virtual Adesk::UInt32  | cameraGlyphs () const =0
 virtual bool  | flagsSet (Adesk::UInt32 flg) const =0
 virtual Adesk::UInt32  | gridAxisLines () const =0
 virtual int  | gridAxisLineTintXYZ () const =0
 virtual Adesk::UInt32  | gridMajorLines () const =0
 virtual int  | gridMajorLineTintXYZ () const =0
 virtual Adesk::UInt32  | gridMinorLines () const =0
 virtual int  | gridMinorLineTintXYZ () const =0
 virtual Adesk::UInt32  | lightEndLimit () const =0
 virtual Adesk::UInt32  | lightFalloff () const =0
 virtual Adesk::UInt32  | lightGlyphs () const =0
 virtual Adesk::UInt32  | lightHotspot () const =0
 virtual Adesk::UInt32  | lightStartLimit () const =0
 virtual void  | setContextFlags (Adesk::UInt32 flg, bool set=true)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgi.h