Public Member Functions | List of all members
AcFdFieldReactor Class Reference
AcFd Classes
  Inheritance diagram for AcFdFieldReactor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcFdFieldReactor)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | beginEvaluateFields (int nContext, AcDbDatabase *pDb)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | endEvaluateFields (int nContext, AcDbDatabase *pDb)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcFdFieldReactor::beginEvaluateFields  |  ( |  int  |  nContext,
|  AcDbDatabase *  |  pDb
)
virtual
Warning
Not implemented!
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcFdFieldReactor::endEvaluateFields  |  ( |  int  |  nContext,
|  AcDbDatabase *  |  pDb
)
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcField.h