Public Types | Public Member Functions | Friends | List of all members
AcDbHandle Class Reference
AcDb Classes
 Public Types
enum  | { kStrSiz = 17 }
enum  | { kMaxValueBytes = 8 }
 Public Member Functions
AcDbHandle (int lo, int hi)
AcDbHandle (const ACHAR *)
AcDbHandle (Adesk::UInt64)
 int  | byte (Adesk::UInt32 i) const
 int  | compare (const AcDbHandle &) const
 void  | copyFromOldType (const Adesk::UInt8 hand[8])
 void  | copyToOldType (Adesk::UInt8 hand[8]) const
 void  | decrement (void)
 bool  | getIntoAsciiBuffer (ACHAR *pBuf, size_t nBufLen) const
 template<size_t nBufLen>
bool  | getIntoAsciiBuffer (wchar_t(&buf)[nBufLen]) const
 void  | getValueBytes (Adesk::UInt8 *, Adesk::UInt8 *) const
 Adesk::UInt32  | high () const
 void  | increment (void)
 bool  | isNull () const
 bool  | isOne (void) const
 Adesk::UInt32  | low () const
operator Adesk::UInt64 () const
 bool  | operator!= (const AcDbHandle &) const
 AcDbHandle  | operator+ (const AcDbHandle &) const
 AcDbHandle  | operator+ (Adesk::ULongPtr) const
 AcDbHandle &  | operator++ ()
 AcDbHandle  | operator++ (int)
 AcDbHandle &  | operator+= (const AcDbHandle &)
 AcDbHandle  | operator- (const AcDbHandle &) const
 AcDbHandle &  | operator-= (const AcDbHandle &)
 bool  | operator< (const AcDbHandle &) const
 bool  | operator<= (const AcDbHandle &) const
 AcDbHandle &  | operator= (const AcDbHandle &)
 AcDbHandle &  | operator= (const ACHAR *)
 AcDbHandle &  | operator= (Adesk::UInt64)
 bool  | operator== (const AcDbHandle &) const
 bool  | operator> (const AcDbHandle &) const
 bool  | operator>= (const AcDbHandle &) const
 void  | print () const
 bool  | restZeros (int i) const
 void  | setHigh (Adesk::UInt32 high)
 void  | setLow (Adesk::UInt32 low)
 void  | setNull ()
 void  | setValueBytes (Adesk::UInt8, const Adesk::UInt8 *)
AcDbHandle  | slowOperatorPlus (const AcDbHandle &) const
 Friends
 class  | AcDbHandleTable
 class  | HandleDataBase
Member Function Documentation
 AcDbHandle AcDbHandle::slowOperatorPlus  |  ( |  const AcDbHandle &  |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbhandle.h