Public Types | Public Member Functions | List of all members
AcEdSymbolUtilities::Services Class Referenceabstract
AcEd Classes
 Public Types
enum  | { kCurrentVersion = ACEDSYMUTIL_SERVICES_CURRENT_VERSION }
 Public Member Functions
 virtual Acad::PromptStatus  | getCompatibleSymbolString (ACHAR *&pResponse, const ACHAR *prompt, AcDbDatabase *pDb) const =0
 virtual Acad::PromptStatus  | getSymbolString (ACHAR *&pResponse, const ACHAR *prompt, bool onlyCrEndsInput, bool preserveCase) const =0
 virtual unsigned  | version () const =0
 The documentation for this class was generated from the following file:
acsymutl.h