Public Member Functions | Friends | List of all members
AcGiWoodTexture Class Reference
AcGi Classes
  Inheritance diagram for AcGiWoodTexture:
 Public Member Functions
AcGiWoodTexture (const AcGiWoodTexture &texture)
ACRX_DECLARE_MEMBERS (AcGiWoodTexture)
 virtual double  | axialNoise (void) const
 virtual const AcGiMaterialColor &  | color1 (void) const
 virtual const AcGiMaterialColor &  | color2 (void) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other) override
 virtual double  | grainThickness (void) const
 AcGiWoodTexture &  | operator= (const AcGiWoodTexture &texture)
 virtual bool  | operator== (const AcGiMaterialTexture &texture) const override
 virtual double  | radialNoise (void) const
 virtual void  | setAxialNoise (double axialNoise)
 virtual void  | setColor1 (const AcGiMaterialColor &woodColor1)
 virtual void  | setColor2 (const AcGiMaterialColor &woodColor2)
 virtual void  | setGrainThickness (double grainThickness)
 virtual void  | setRadialNoise (double radialNoise)
 Public Member Functions inherited from AcGiProceduralTexture
ACRX_DECLARE_MEMBERS (AcGiProceduralTexture)
 Public Member Functions inherited from AcGiMaterialTexture
ACRX_DECLARE_MEMBERS (AcGiMaterialTexture)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcGiImpWoodTexture
 Additional Inherited Members
 Public Types inherited from AcGiProceduralTexture
enum  | Type { kWood = 0, kMarble, kGeneric }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgimaterial.h