Public Member Functions | Protected Member Functions | List of all members
AcDbRevolvedSurface Class Reference
AcDb Classes
  Inheritance diagram for AcDbRevolvedSurface:
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbRevolvedSurface)
 virtual Acad::ErrorStatus  | createRevolvedSurface (AcDbEntity *pRevEnt, const AcGePoint3d &axisPnt, const AcGeVector3d &axisDir, double revAngle, double startAngle, AcDbRevolveOptions &revolveOptions)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *filer) override
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *filer) const override
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *filer) override
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *filer) const override
 AcGePoint3d  | getAxisPnt () const
 AcGeVector3d  | getAxisVec () const
 double  | getRevolveAngle () const
 AcDbEntity *  | getRevolveEntity () const
 void  | getRevolveOptions (AcDbRevolveOptions &revolveOptions) const
 double  | getStartAngle () const
virtual bool  | isDependent () const
ACDB_PORT AcDb3dProfile *  | revolveProfile () const
 Acad::ErrorStatus  | setAxisPnt (const AcGePoint3d &pnt)
 Acad::ErrorStatus  | setAxisVec (const AcGeVector3d &vec)
 Acad::ErrorStatus  | setRevolve (const AcGePoint3d &axisPnt, const AcGeVector3d &axisVec, double revAngle, const AcDbRevolveOptions &revolveOptions)
 Acad::ErrorStatus  | setRevolveAngle (double ang)
 Acad::ErrorStatus  | setRevolveOptions (const AcDbRevolveOptions &revolveOptions)
 Public Member Functions inherited from AcDbSurface
ACDB_DECLARE_MEMBERS (AcDbSurface)
virtual void *  | ASMBodyCopy (bool bDeepCopy=false) const
virtual Acad::ErrorStatus  | booleanIntersect (const AcDbSurface *pSurface2, AcArray< AcDbEntity * > &intersectionEntities)
virtual Acad::ErrorStatus  | booleanIntersect (const AcDb3dSolid *pSolid, AcArray< AcDbEntity * > &intersectionEntities)
virtual Acad::ErrorStatus  | booleanSubtract (const AcDbSurface *pSurface2, AcDbSurface *&pNewSurface)
virtual Acad::ErrorStatus  | booleanSubtract (const AcDb3dSolid *pSolid, AcDbSurface *&pNewSurface)
virtual Acad::ErrorStatus  | booleanUnion (const AcDbSurface *pSurface2, AcDbSurface *&pNewSurface)
virtual Acad::ErrorStatus  | chamferEdges (const AcArray< AcDbSubentId * > &edgeSubentIds, const AcDbSubentId &baseFaceSubentId, double baseDist, double otherDist)
ACDB_PORT Acad::ErrorStatus  | chamferEdges (const AcArray< AcDbSubentId * > &edgeSubentIds, const AcDbSubentId &baseFaceSubentId, double baseDist, double otherDist, bool bAssociativeEnabled)
virtual void  | commitWritableASMBody ()
Acad::ErrorStatus ACDB_PORT  | convertToNurbSurface (AcDbNurbSurfaceArray &nsArray)
 virtual Acad::ErrorStatus  | convertToRegion (AcArray< AcDbEntity * > &regions)
virtual Acad::ErrorStatus  | createInterferenceObjects (AcArray< AcDbEntity * > &interferenceObjects, AcDbEntity *pEntity, unsigned int flags) const
virtual Acad::ErrorStatus  | createSectionObjects (const AcGePlane &sectionPlane, AcArray< AcDbEntity * > &sectionObjects) const
AcDbObjectId ACDB_PORT  | creationActionBodyId () const
virtual ACDB_PORT void  | dragStatus (const AcDb::DragStat) override
ACDB_PORT Acad::ErrorStatus  | extendEdges (AcDbFullSubentPathArray &edges, double extDist, EdgeExtensionType extOption, bool bAssociativeEnabled)
virtual Acad::ErrorStatus  | filletEdges (const AcArray< AcDbSubentId * > &edgeSubentIds, const AcGeDoubleArray &radius, const AcGeDoubleArray &startSetback, const AcGeDoubleArray &endSetback)
ACDB_PORT Acad::ErrorStatus  | filletEdges (const AcArray< AcDbSubentId * > &edgeSubentIds, double radius, bool bAssociativeEnabled)
 virtual Acad::ErrorStatus  | getArea (double &area) const
virtual void const *  | getLockedASMBody ()
virtual void *  | getLockedWritableASMBody ()
ACDB_PORT Acad::ErrorStatus  | getPerimeter (double &perimeter) const
virtual Acad::ErrorStatus  | getPlane (AcGePlane &plane, AcDb::Planarity &planarity) const override
 virtual Acad::ErrorStatus  | getSubentColor (const AcDbSubentId &subentId, AcCmColor &color) const
 virtual Acad::ErrorStatus  | getSubentMaterial (const AcDbSubentId &subentId, AcDbObjectId &matId) const
virtual Acad::ErrorStatus  | getSubentMaterialMapper (const AcDbSubentId &subentId, AcGiMapper &mapper) const
ACDB_PORT WireframeType  | getWireframeType () const
virtual Acad::ErrorStatus  | imprintEntity (const AcDbEntity *pEntity)
 virtual AcDbSubentId  | internalSubentId (void *ent) const
 virtual void *  | internalSubentPtr (const AcDbSubentId &id) const
Acad::ErrorStatus ACDB_PORT  | modificationActionBodyIds (AcDbObjectIdArray &modificationActionBodyIds) const
Acad::ErrorStatus  | projectOnToSurface (const AcDbEntity *pEntityToProject, const AcGeVector3d &projectionDirection, AcArray< AcDbEntity * > &projectedEntities) const
Acad::ErrorStatus ACDB_PORT  | rayTest (const AcGePoint3d &rayBasePoint, const AcGeVector3d &rayDir, double rayRadius, AcArray< AcDbSubentId > &subEntIds, AcGeDoubleArray &parameters) const
virtual Acad::ErrorStatus  | setASMBody (const void *modelerBody)
virtual Acad::ErrorStatus  | setSubentColor (const AcDbSubentId &subentId, const AcCmColor &color)
virtual Acad::ErrorStatus  | setSubentMaterial (const AcDbSubentId &subentId, const AcDbObjectId &matId)
virtual Acad::ErrorStatus  | setSubentMaterialMapper (const AcDbSubentId &subentId, const AcGiMapper &mapper)
 virtual Acad::ErrorStatus  | setUIsolineDensity (Adesk::UInt16 numIsolines)
 virtual Acad::ErrorStatus  | setVIsolineDensity (Adesk::UInt16 numIsolines)
ACDB_PORT Acad::ErrorStatus  | setWireframeType (WireframeType type)
virtual Acad::ErrorStatus  | sliceByPlane (const AcGePlane &slicePlane, AcDbSurface *&pNegHalfSurface, AcDbSurface *&pNewSurface)
virtual Acad::ErrorStatus  | sliceBySurface (const AcDbSurface *pSlicingSurface, AcDbSurface *&pNegHalfSurface, AcDbSurface *&pNewSurface)
virtual Acad::ErrorStatus  | thicken (double thickness, bool bBothSides, AcDb3dSolid *&pSolid) const
 virtual Adesk::UInt16  | uIsolineDensity () const
virtual void  | unlockASMBody ()
virtual ACDB_PORT bool  | usesGraphicsCache ()
 virtual Adesk::UInt16  | vIsolineDensity () const
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths) ADESK_SEALED
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj) override
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo) override
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual bool  | bounds (AcDbExtents &bounds) const override
 virtual bool  | castShadows () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | cloneMeForDragging () ADESK_SEALED
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths) ADESK_SEALED
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable () override
 AcCmEntityColor  | entityColor () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const ADESK_SEALED
 virtual void  | getEcs (AcGeMatrix3d &retVal) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const ADESK_SEALED
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const ADESK_SEALED
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=nullptr) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | gripStatus (const AcDb::GripStat status) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL bool  | hideMeForDragging () const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const ADESK_SEALED
AcGiHighlightStyle  | highlightState (const AcDbFullSubentPath &subId)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const ADESK_SEALED
ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL bool  | isContentSnappable () const ADESK_SEALED
 virtual Adesk::Boolean  | isPlanar () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | layer (AcString &sName) const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | linetype (AcString &sName) const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | list () const ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | material (AcString &sName) const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | plotStyleName (AcString &sName) const
 ACHAR *  | plotStyleName () const
Acad::ErrorStatus  | popHighlight (const AcDbFullSubentPath &subId)
Acad::ErrorStatus  | pushHighlight (const AcDbFullSubentPath &subId, AcGiHighlightStyle highlightStyle)
 virtual bool  | receiveShadows () const
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st)
 virtual void  | setCastShadows (bool newVal)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | setColor (const AcCmColor &color, bool doSubents, AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, bool doSubents=true) final
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual void  | setReceiveShadows (bool newVal)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true) ADESK_SEALED
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId visualStyleId, VisualStyleType vsType=kFullVisualStyle, Adesk::Boolean doSubents=true)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL AcDbEntity *  | subentPtr (const AcDbFullSubentPath &id) const ADESK_SEALED
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform) ADESK_SEALED
 AcCmTransparency  | transparency () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const ADESK_SEALED
 AcDb::Visibility  | visibility () const
AcDbObjectId  | visualStyleId (VisualStyleType vsType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const override
 Protected Member Functions inherited from AcDbEntity
AcDbEntity (const AcDbEntity &)=delete
 AcDbEntity &  | operator= (const AcDbEntity &)=delete
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &entitySet) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &stretchPoints) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=nullptr) const
 virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const
 virtual void  | subGripStatus (const AcDb::GripStat status)
 virtual bool  | subHideMeForDragging () const
 virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
virtual ACDBCORE2D_PORT AcGiHighlightStyle  | subHighlightState (const AcDbFullSubentPath &subId)
 virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
virtual bool  | subIsContentSnappable () const
 virtual void  | subList () const
 virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subPopHighlight (const AcDbFullSubentPath &subId)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subPushHighlight (const AcDbFullSubentPath &subId, AcGiHighlightStyle highlightStyle)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &id) const
 virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual ACDBCORE2D_PORT AcDb::Visibility  | subVisibility () const
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcDbSurface
enum  | EdgeExtensionType { kExtendEdge = 0x000, kStretchEdge = 0x001 }
enum  | WireframeType { kIsolines = 0, kIsoparms = 1 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Static Public Member Functions inherited from AcDbSurface
static ACDB_PORT Acad::ErrorStatus  | createBlendSurface (AcDbLoftProfile *startProfile, AcDbLoftProfile *endProfile, AcDbBlendOptions *blendOptions, AcDbSurface *&blendSurface)
static ACDB_PORT Acad::ErrorStatus  | createBlendSurface (AcDbLoftProfile *startProfile, AcDbLoftProfile *endProfile, AcDbBlendOptions *blendOptions, bool bAssociativeEnabled, AcDbObjectId &blendSurfaceId)
static ACDB_PORT Acad::ErrorStatus  | createExtendSurface (AcDbObjectId sourceSurface, const AcArray< AcDbSubentId > &edges, double extDist, EdgeExtensionType extOption, bool bAssociativeEnabled, AcDbObjectId &newExtendSurfaceId)
static ACDB_PORT Acad::ErrorStatus  | createExtrudedSurface (AcDb3dProfile *pSweep, const AcGeVector3d &directionVec, AcDbSweepOptions &sweepOptions, AcDbExtrudedSurface *&newExtrudedSurface)
static ACDB_PORT Acad::ErrorStatus  | createExtrudedSurface (AcDb3dProfile *pSweep, const AcGeVector3d &directionVec, AcDbSweepOptions &sweepOptions, bool bAssociativeEnabled, AcDbObjectId &newExtrudedSurfaceId)
static ACDB_PORT Acad::ErrorStatus  | createFilletSurface (const AcDbObjectId &surfId1, const AcGePoint3d &pickPt1, const AcDbObjectId &surfId2, const AcGePoint3d &pickPt2, double radius, AcDb::FilletTrimMode trimMode, const AcGeVector3d &projDir, AcDbSurface *&filletSurface)
static ACDB_PORT Acad::ErrorStatus  | createFilletSurface (const AcDbObjectId &surfId1, const AcGePoint3d &pickPt1, const AcDbObjectId &surfId2, const AcGePoint3d &pickPt2, double radius, AcDb::FilletTrimMode trimMode, const AcGeVector3d &projDir, bool bAssociativeEnabled, AcDbObjectId &filletSurfaceId)
 static Acad::ErrorStatus  | createFrom (const AcDbEntity *pFromEntity, AcDbSurface *&pNewSurface)
static ACDB_PORT Acad::ErrorStatus  | createLoftedSurface (const AcArray< AcDbLoftProfile * > &crossSections, const AcArray< AcDbLoftProfile * > &guides, AcDbLoftProfile *pPath, AcDbLoftOptions &loftOptions, AcDbSurface *&newSurface)
static ACDB_PORT Acad::ErrorStatus  | createLoftedSurface (const AcArray< AcDbLoftProfile * > &crossSections, const AcArray< AcDbLoftProfile * > &guides, AcDbLoftProfile *pPath, AcDbLoftOptions &loftOptions, bool bAssociativeEnabled, AcDbObjectId &newSurfaceId)
static ACDB_PORT Acad::ErrorStatus  | createNetworkSurface (const AcArray< AcDb3dProfile * > &uProfiles, const AcArray< AcDb3dProfile * > &vProfiles, AcDbSurface *&newSurface)
static ACDB_PORT Acad::ErrorStatus  | createNetworkSurface (const AcArray< AcDb3dProfile * > &uProfiles, const AcArray< AcDb3dProfile * > &vProfiles, bool bAssociativeEnabled, AcDbObjectId &newSurfaceId)
static ACDB_PORT Acad::ErrorStatus  | createOffsetSurface (AcDbEntity *pInputSurface, double offsetDistance, AcDbEntity *&offsetSurface)
static ACDB_PORT Acad::ErrorStatus  | createOffsetSurface (AcDbEntity *pInputSurface, double offsetDistance, bool bAssociativeEnabled, AcDbObjectId &offsetSurfaceId)
static ACDB_PORT Acad::ErrorStatus  | createPatchSurface (const AcDbPathRef &pathRef, const AcDbObjectIdArray &constraintIds, int continuity, double bulge, AcDbSurface *&newSurface)
static ACDB_PORT Acad::ErrorStatus  | createPatchSurface (const AcDbPathRef &pathRef, const AcDbObjectIdArray &constraintIds, int continuity, double bulge, bool bAssociativeEnabled, AcDbObjectId &newSurfaceId)
static ACDB_PORT Acad::ErrorStatus  | createRevolvedSurface (AcDb3dProfile *pRev, const AcGePoint3d &axisPnt, const AcGeVector3d &axisDir, double revAngle, double startAngle, AcDbRevolveOptions &revolveOptions, AcDbRevolvedSurface *&newRevolvedSurface)
static ACDB_PORT Acad::ErrorStatus  | createRevolvedSurface (AcDb3dProfile *pRev, const AcGePoint3d &axisPnt, const AcGeVector3d &axisDir, double revAngle, double startAngle, AcDbRevolveOptions &revolveOptions, bool bAssociativeEnabled, AcDbObjectId &newSurfaceId)
static ACDB_PORT Acad::ErrorStatus  | createRevolvedSurface (AcDb3dProfile *pRev, AcDb3dProfile *pAxis, bool flipAxisDirection, double revAngle, double startAngle, AcDbRevolveOptions &revolveOptions, AcDbRevolvedSurface *&newRevolvedSurface)
static ACDB_PORT Acad::ErrorStatus  | createRevolvedSurface (AcDb3dProfile *pRev, AcDb3dProfile *pAxis, bool flipAxisDirection, double revAngle, double startAngle, AcDbRevolveOptions &revolveOptions, bool bAssociativeEnabled, AcDbObjectId &newRevolvedSurfaceId)
static ACDB_PORT Acad::ErrorStatus  | createSweptSurface (AcDb3dProfile *pSweep, AcDb3dProfile *pPath, AcDbSweepOptions &sweepOptions, AcDbSweptSurface *&newSweptSurface)
static ACDB_PORT Acad::ErrorStatus  | createSweptSurface (AcDb3dProfile *pSweep, AcDb3dProfile *pPath, AcDbSweepOptions &sweepOptions, bool bAssociativeEnabled, AcDbObjectId &newSurfaceId)
static ACDB_PORT Acad::ErrorStatus  | trimSurface (const AcDbObjectId &blankSurfaceId, const AcDbObjectIdArray &toolIds, const AcDbObjectIdArray &toolCurveIds, const AcArray< AcGeVector3d > projVectors, const AcGePoint3d &pickPoint, const AcGeVector3d &viewVector, bool bAutoExtend, bool bAssociativeEnabled)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
Member Function Documentation
 virtual bool AcDbRevolvedSurface::isDependent  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 ACDB_PORT AcDb3dProfile* AcDbRevolvedSurface::revolveProfile  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbrevolvedsurf.h