Public Member Functions | List of all members
AcEdInputPointMonitor Class Reference
AcEd Classes
  Inheritance diagram for AcEdInputPointMonitor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcEdInputPointMonitor)
 virtual bool  | excludeFromOsnapCalculation (const AcArray< AcDbObjectId > &, Adesk::GsMarker)
virtual ADESK_DEPRECATED Acad::ErrorStatus  | monitorInputPoint (bool &, ACHAR *&, AcGiViewportDraw *, AcApDocument *, bool, int, const AcGePoint3d &, const AcGePoint3d &, const AcGePoint3d &, const AcGePoint3d &, const AcGePoint3d &, AcDb::OsnapMask, const AcArray< AcDbCustomOsnapMode * > &, AcDb::OsnapMask, const AcArray< AcDbCustomOsnapMode * > &, const AcArray< AcDbObjectId > &, const AcArray< AcDbObjectIdArray, AcArrayObjectCopyReallocator< AcDbObjectIdArray > > &, const AcArray< Adesk::GsMarker > &, const AcArray< AcDbObjectId > &, const AcArray< AcDbObjectIdArray, AcArrayObjectCopyReallocator< AcDbObjectIdArray > > &, const AcArray< Adesk::GsMarker > &, const AcArray< AcGeCurve3d * > &, const AcGePoint3d &, const ACHAR *)
 virtual ACAD_PORT Acad::ErrorStatus  | monitorInputPoint (const AcEdInputPoint &input, AcEdInputPointMonitorResult &output)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual ADESK_DEPRECATED Acad::ErrorStatus AcEdInputPointMonitor::monitorInputPoint  |  ( |  bool &  |  ,
|  ACHAR *&  |  ,
|  AcGiViewportDraw *  |  ,
|  AcApDocument *  |  ,
|  bool  |  ,
|  int  |  ,
|  const AcGePoint3d &  |  ,
|  const AcGePoint3d &  |  ,
|  const AcGePoint3d &  |  ,
|  const AcGePoint3d &  |  ,
|  const AcGePoint3d &  |  ,
|  AcDb::OsnapMask  |  ,
|  const AcArray< AcDbCustomOsnapMode * > &  |  ,
|  AcDb::OsnapMask  |  ,
|  const AcArray< AcDbCustomOsnapMode * > &  |  ,
|  const AcArray< AcDbObjectId > &  |  ,
|  const AcArray< AcDbObjectIdArray, AcArrayObjectCopyReallocator< AcDbObjectIdArray > > &  |  ,
|  const AcArray< Adesk::GsMarker > &  |  ,
|  const AcArray< AcDbObjectId > &  |  ,
|  const AcArray< AcDbObjectIdArray, AcArrayObjectCopyReallocator< AcDbObjectIdArray > > &  |  ,
|  const AcArray< Adesk::GsMarker > &  |  ,
|  const AcArray< AcGeCurve3d * > &  |  ,
|  const AcGePoint3d &  |  ,
|  const ACHAR *
)
inlinevirtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acedinpt.h