Public Member Functions | List of all members
AcDbGripOverrule Class Reference
AcDb Classes
  Inheritance diagram for AcDbGripOverrule:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbGripOverrule)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getGripPoints (const AcDbEntity *pSubject, AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getGripPoints (const AcDbEntity *pSubject, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getStretchPoints (const AcDbEntity *pSubject, AcGePoint3dArray &stretchPoints)
 virtual ACDBCORE2D_PORT void  | gripStatus (AcDbEntity *pSubject, const AcDb::GripStat status)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | moveGripPointsAt (AcDbEntity *pSubject, const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | moveGripPointsAt (AcDbEntity *pSubject, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | moveStretchPointsAt (AcDbEntity *pSubject, const AcDbIntArray &indices, const AcGeVector3d &offset)
 Public Member Functions inherited from AcRxOverrule
ACRX_DECLARE_MEMBERS (AcRxOverrule)
 virtual bool  | isApplicable (const AcRxObject *pOverruledSubject) const =0
 Public Member Functions inherited from AcRxOverruleBase
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxOverruleBase, ACBASE_PORT)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxOverrule
 static Acad::ErrorStatus  | addOverrule (AcRxClass *pClass, AcRxOverrule *pOverrule, bool bAddAtLast=false)
 static bool  | hasOverrule (const AcRxObject *pSubject, AcRxClass *pOverruleClass)
 static bool  | isOverruling (void)
 static Acad::ErrorStatus  | removeOverrule (AcRxClass *pClass, AcRxOverrule *pOverrule)
 static void  | setIsOverruling (bool bIsOverruling)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbentityoverrule.h