Public Member Functions | List of all members
AcEdCommand Class Referenceabstract
AcEd Classes
  Inheritance diagram for AcEdCommand:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcEdCommand)
void  | addReactor (AcEdCommandReactor *pReactor)
 virtual void *  | commandApp () const =0
 virtual Adesk::Int32  | commandFlags () const =0
 virtual void  | commandUndef (bool undefIt)=0
Adesk::UInt8  | defaultCommandVersion () const
 virtual AcRxFunctionPtr  | functionAddr () const =0
 virtual void  | functionAddr (AcRxFunctionPtr fhdl)=0
 virtual int  | functionCode () const =0
 virtual void  | functionCode (int fcode)=0
 virtual const ACHAR *  | globalName () const =0
 virtual const ACHAR *  | localName () const =0
void  | removeReactor (AcEdCommandReactor *pReactor)
virtual const AcRxResourceInstance &  | resourceInstance () const =0
 virtual AcEdUIContext *  | UIContext () const =0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 void AcEdCommand::addReactor  |  ( |  AcEdCommandReactor *  |  pReactor | )
Warning
Not implemented!
 Adesk::UInt8 AcEdCommand::defaultCommandVersion  |  ( |   | ) |   const
Warning
Not implemented!
 void AcEdCommand::removeReactor  |  ( |  AcEdCommandReactor *  |  pReactor | )
Warning
Not implemented!
 virtual const AcRxResourceInstance& AcEdCommand::resourceInstance  |  ( |   | ) |   const
pure virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
accmd.h