Public Types | Public Member Functions | List of all members
AcEdSteeringWheel Class Referenceabstract
AcEd Classes
 Public Types
enum  | MenuType {
 kMenuNone = 0, kMenuInterior, kMenuExterior, kMenuFull,
 kMenu2D
 }
enum  | WheelType {
 kExterior = 0, kInterior, kFull, k2D,
 kMini, kMiniOther, kMiniEight, kTotalCount,
 kWheelNone
 }
 Public Member Functions
 virtual void  | addReactor (AcEdSteeringWheelReactor *pReactor)=0
 virtual bool  | attachView (HWND hDevice, AcGsView *pGsView)=0
 virtual void  | detachView ()=0
 virtual void  | enableWheel (bool enable)=0
 virtual WheelType  | getActiveWheel ()=0
 virtual HWND  | getDeviceHandle ()=0
 virtual int  | getLargeWheelOpacity ()=0
 virtual int  | getMiniWheelOpacity ()=0
 virtual AcGsModel *  | getModel ()=0
 virtual AcGsView *  | getView ()=0
 virtual double  | getWalkSpeed ()=0
 virtual bool  | isWheelEnabled ()=0
 virtual void  | onKeyDown (UINT nChar, UINT nRepCount, UINT nFlags)=0
 virtual void  | onKeyUp (UINT nChar, UINT nRepCount, UINT nFlags)=0
 virtual void  | onLButtonDown (UINT nFlags, POINT pt)=0
 virtual void  | onLButtonUp (UINT nFlags, POINT pt)=0
 virtual void  | onMButtonDown (UINT nFlags, POINT pt)=0
 virtual void  | onMButtonUp (UINT nFlags, POINT pt)=0
 virtual void  | onMouseMove (UINT nFlags, POINT pt)=0
 virtual bool  | onMouseWheel (UINT nFlags, short zDelta, POINT pt)=0
 virtual void  | onRButtonDown (UINT nFlags, POINT pt)=0
 virtual void  | onRButtonUp (UINT nFlags, POINT pt)=0
 virtual void  | removeReactor (AcEdSteeringWheelReactor *pReactor)=0
 virtual bool  | setActiveWheel (WheelType type)=0
 virtual void  | setHomeCamera (const AcDbHomeView &home)=0
 virtual bool  | setLargeWheelOpacity (int nOpacity)=0
 virtual bool  | setMiniWheelOpacity (int nOpacity)=0
 virtual bool  | setWalkSpeed (double speed)=0
 The documentation for this class was generated from the following file:
AcEdSteeringWheel.h