Public Types | Public Member Functions | Static Public Member Functions | Friends | List of all members
AcGiVisualStyle Class Reference
AcGi Classes
  Inheritance diagram for AcGiVisualStyle:
 Public Types
 typedef AcGiVisualStyleOperations::Operation  | Operation
 typedef AcGiVisualStyleProperties::Property  | Property
enum  | Type {
 kFlat, kFlatWithEdges, kGouraud, kGouraudWithEdges,
 k2DWireframe, k3DWireframe, kHidden, kBasic,
 kRealistic, kConceptual, kCustom, kDim,
 kBrighten, kThicken, kLinePattern, kFacePattern,
 kColorChange, kFaceOnly, kEdgeOnly, kDisplayOnly,
 kJitterOff, kOverhangOff, kEdgeColorOff, kShadesOfGray,
 kSketchy, kXRay, kShadedWithEdges, kShaded,
 kByViewport, kByLayer, kByBlock, kEmptyStyle
 }
 Public Member Functions
AcGiVisualStyle (Type type)
AcGiVisualStyle (const AcGiVisualStyle &visualStyle)
ACRX_DECLARE_MEMBERS (AcGiVisualStyle)
 virtual ACDBCORE2D_PORT Operation  | operation (Property prop) const
 AcGiVisualStyle &  | operator= (const AcGiVisualStyle &visualStyle)
 bool  | operator== (const AcGiVisualStyle &visualStyle) const
 virtual ACDBCORE2D_PORT bool  | setTrait (Property prop, Operation op)
 virtual ACDBCORE2D_PORT bool  | setTrait (Property prop, const AcGiVariant *pVal, Operation op=AcGiVisualStyleOperations::kSet)
 virtual ACDBCORE2D_PORT bool  | setTrait (Property prop, int nVal, Operation op=AcGiVisualStyleOperations::kSet)
 virtual ACDBCORE2D_PORT bool  | setTrait (Property prop, bool bVal, Operation op=AcGiVisualStyleOperations::kSet)
 virtual ACDBCORE2D_PORT bool  | setTrait (Property prop, double dVal, Operation op=AcGiVisualStyleOperations::kSet)
 virtual ACDBCORE2D_PORT bool  | setTrait (Property prop, double red, double green, double blue, Operation op=AcGiVisualStyleOperations::kSet)
 virtual ACDBCORE2D_PORT bool  | setTrait (Property prop, const AcCmColor *pColor, Operation op=AcGiVisualStyleOperations::kSet)
 virtual ACDBCORE2D_PORT bool  | setTrait (AcGiVisualStyleProperties::Property prop, const AcString *pStr, AcGiVisualStyleOperations::Operation op=AcGiVisualStyleOperations::kSet)
 virtual ACDBCORE2D_PORT bool  | setTraitFlag (Property flagProp, Adesk::UInt32 flagVal, bool bEnable=true)
 ACDBCORE2D_PORT bool  | setType (Type type)
 virtual ACDBCORE2D_PORT const AcGiVariant &  | trait (Property prop, Operation *pOp=NULL) const
 virtual ACDBCORE2D_PORT bool  | traitFlag (Property flagProp, Adesk::UInt32 flagVal) const
 ACDBCORE2D_PORT Type  | type (void) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
 static ACDBCORE2D_PORT AcGiVariant::VariantType  | propertyType (Property prop)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Friends
 class  | AcDbImpVisualStyle
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgivisualstyle.h