Public Member Functions | List of all members
AcGiGradientBackgroundTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiGradientBackgroundTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiGradientBackgroundTraits)
 virtual AcCmEntityColor  | colorBottom (void) const =0
 virtual AcCmEntityColor  | colorMiddle (void) const =0
 virtual AcCmEntityColor  | colorTop (void) const =0
 virtual double  | height (void) const =0
 virtual double  | horizon (void) const =0
 virtual double  | rotation (void) const =0
 virtual void  | setColorBottom (const AcCmEntityColor &color)=0
 virtual void  | setColorMiddle (const AcCmEntityColor &color)=0
 virtual void  | setColorTop (const AcCmEntityColor &color)=0
 virtual void  | setHeight (double height)=0
 virtual void  | setHorizon (double horizon)=0
 virtual void  | setRotation (double rotation)=0
 The documentation for this class was generated from the following file:
AcGiEnvironment.h