Public Member Functions | List of all members
AcPlDSDData Class Reference
AcPl Classes
  Inheritance diagram for AcPlDSDData:
 Public Member Functions
 ACPL_PORT  | AcPlDSDData (const AcPlDSDData &src)
 ACPL_PORT const ACHAR *  | categoryName () const
ACPL_PORT const ACHAR *  | currentPrecision () const
 ACPL_PORT const ACHAR *  | destinationName () const
 ACPL_PORT AcPlDSDEntry &  | DSDEntryAt (int idx)
 ACPL_PORT const AcPl3dDwfOptions &  | get3dDwfOptions () const
 ACPL_PORT void  | getDSDEntries (AcPlDSDEntries &val) const
 ACPL_PORT void  | getUnrecognizedData (AcArray< ACHAR * > &sectionArray, AcArray< ACHAR * > &dataArray) const
ACPL_PORT void  | getUnrecognizedData (AcStringArray &sectionArray, AcStringArray &dataArray) const
 ACPL_PORT bool  | includeLayerInfo () const
 ACPL_PORT bool  | isHomogeneous () const
 ACPL_PORT bool  | isSheetSet () const
ACPL_PORT bool  | lineMerge () const
 ACPL_PORT const ACHAR *  | logFilePath () const
 ACPL_PORT unsigned int  | majorVersion () const
 ACPL_PORT unsigned int  | minorVersion () const
 ACPL_PORT unsigned int  | noOfCopies () const
 ACPL_PORT int  | numberOfDSDEntries () const
 ACPL_PORT AcPlDSDData &  | operator= (const AcPlDSDData &src)
 ACPL_PORT const ACHAR *  | password () const
 ACPL_PORT bool  | plotStampOn () const
 ACPL_PORT const ACHAR *  | projectPath () const
 ACPL_PORT bool  | promptForDwfName () const
 ACPL_PORT bool  | promptForPassword () const
 ACPL_PORT bool  | pwdProtectPublishedDWF () const
 ACPL_PORT bool  | readDSD (const ACHAR *pName)
 ACPL_PORT const ACHAR *  | selectionSetName () const
 ACPL_PORT void  | set3dDwfOptions (const AcPl3dDwfOptions &val)
 ACPL_PORT void  | setCategoryName (const ACHAR *pCategoryName)
ACPL_PORT void  | setCurrentPrecision (const ACHAR *pCurrentPrecision)
 ACPL_PORT void  | setDestinationName (const ACHAR *pVal)
 ACPL_PORT void  | setDSDEntries (const AcPlDSDEntries &val)
 ACPL_PORT void  | setIncludeLayerInfo (bool bOn)
 ACPL_PORT void  | setIsHomogeneous (bool bHomogeneous)
 ACPL_PORT void  | setIsSheetSet (bool bSheetSet)
ACPL_PORT void  | setLineMerge (bool bOn)
 ACPL_PORT void  | setLogFilePath (const ACHAR *pLogFilePath)
 ACPL_PORT void  | setMajorVersion (unsigned int majorVersion)
 ACPL_PORT void  | setMinorVersion (unsigned int minorVersion)
 ACPL_PORT void  | setNoOfCopies (unsigned int copies)
 ACPL_PORT void  | setPassword (const ACHAR *pVal)
 ACPL_PORT void  | setPlotStampOn (bool bOn)
ACPL_PORT void  | setPrecisionEntries (const AcPlPrecisionEntries &val)
 ACPL_PORT void  | setProjectPath (const ACHAR *pVal)
 ACPL_PORT void  | setPromptForDwfName (bool bPromptForDwfName)
 ACPL_PORT void  | setPromptForPassword (bool bPromptForPassword)
 ACPL_PORT void  | setPwdProtectPublishedDWF (bool bPwdProtectPublishedDWF)
 ACPL_PORT void  | setSelectionSetName (const ACHAR *pSelSetName)
 ACPL_PORT void  | setSheetSetName (const ACHAR *pSheetSetName)
 ACPL_PORT void  | setSheetType (AcPlDSDEntry::SheetType val)
 ACPL_PORT void  | setUnrecognizedData (const AcArray< ACHAR * > &sectionArray, const AcArray< ACHAR * > &dataArray)
 ACPL_PORT void  | setUnrecognizedData (const ACHAR *pSectionName, const ACHAR *pSectionData)
ACPL_PORT void  | setUnrecognizedData (const AcStringArray &sectionArray, const AcStringArray &dataArray)
ACPL_PORT void  | setViewFile (bool bViewFile)
 ACPL_PORT const ACHAR *  | sheetSetName () const
 ACPL_PORT AcPlDSDEntry::SheetType  | sheetType () const
ACPL_PORT bool  | viewFile () const
 ACPL_PORT bool  | writeDSD (const ACHAR *pName)
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 ACPL_PORT const ACHAR* AcPlDSDData::currentPrecision  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT void AcPlDSDData::getUnrecognizedData  |  ( |  AcStringArray &  |  sectionArray,
|  AcStringArray &  |  dataArray
) |   |  const
Warning
Not implemented!
 ACPL_PORT bool AcPlDSDData::lineMerge  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT void AcPlDSDData::setCurrentPrecision  |  ( |  const ACHAR *  |  pCurrentPrecision | )
Warning
Not implemented!
 ACPL_PORT void AcPlDSDData::setLineMerge  |  ( |  bool  |  bOn | )
Warning
Not implemented!
 ACPL_PORT void AcPlDSDData::setPrecisionEntries  |  ( |  const AcPlPrecisionEntries &  |  val | )
Warning
Not implemented!
 ACPL_PORT void AcPlDSDData::setUnrecognizedData  |  ( |  const AcStringArray &  |  sectionArray,
|  const AcStringArray &  |  dataArray
)
Warning
Not implemented!
 ACPL_PORT void AcPlDSDData::setViewFile  |  ( |  bool  |  bViewFile | )
Warning
Not implemented!
 ACPL_PORT bool AcPlDSDData::viewFile  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acpldsddata.h