Public Member Functions | Protected Member Functions | Friends | List of all members
AcRxValueIterator Class Reference
AcRx Classes
  Inheritance diagram for AcRxValueIterator:
 Public Member Functions
virtual ACBASE_PORT AcRxValue  | current () const
virtual ACBASE_PORT bool  | done ()
virtual ACBASE_PORT bool  | next ()
virtual ACBASE_PORT  | ~AcRxValueIterator ()
 Protected Member Functions
ACBASE_PORT  | AcRxValueIterator ()
 Protected Member Functions inherited from Pimpl::ApiPart< void, AcRxValueIteratorImp >
ApiPart (AcRxValueIteratorImp *pImp) throw ()
 Friends
 class  | AcRxValueIteratorImp
Constructor & Destructor Documentation
 virtual ACBASE_PORT AcRxValueIterator::~AcRxValueIterator  |  ( |   | )
virtual
Warning
Not implemented!
 ACBASE_PORT AcRxValueIterator::AcRxValueIterator  |  ( |   | )
protected
Warning
Not implemented!
Member Function Documentation
 virtual ACBASE_PORT AcRxValue AcRxValueIterator::current  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual ACBASE_PORT bool AcRxValueIterator::done  |  ( |   | )
virtual
Warning
Not implemented!
 virtual ACBASE_PORT bool AcRxValueIterator::next  |  ( |   | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxprop.h