Public Member Functions | List of all members
AcGsModelReactor Class Reference
AcGs Classes
 Public Member Functions
 virtual bool  | onAdded (AcGsModel *, AcGiDrawable *, AcGiDrawable *)
 virtual bool  | onAdded (AcGsModel *, AcGiDrawable *, Adesk::IntDbId)
 virtual bool  | onErased (AcGsModel *, AcGiDrawable *, AcGiDrawable *)
 virtual bool  | onErased (AcGsModel *, AcGiDrawable *, Adesk::IntDbId)
 virtual bool  | onModified (AcGsModel *, AcGiDrawable *, AcGiDrawable *)
 virtual bool  | onModified (AcGsModel *, AcGiDrawable *, Adesk::IntDbId)
 virtual bool  | onSceneGraphRootAdded (AcGsModel *, AcGiDrawable *)
 virtual bool  | onSceneGraphRootErased (AcGsModel *, AcGiDrawable *)
 The documentation for this class was generated from the following file:
gs.h