Public Member Functions | Static Public Member Functions | Protected Member Functions | Friends | List of all members
AcRxObject Class Reference
AcRx Classes
Inherited by Ac3dDwfNavTreeNode, AcadAppInfo, AcApDocManager, AcApDocManagerReactor, AcApDocument, AcApDocumentIterator, AcApLongTransactionManager, AcApLongTransactionReactor, AcDb3dProfile, AcDbAlignment, AcDbAnnotationScaleReactor, AcDbAnnotativeObjectPE, AcDbArrayGripAppData, AcDbAssocArrayItem, AcDbAssocArrayParameters, AcDbAssocDependencyPE, AcDbAssocPersSubentId, AcDbAssocPersSubentIdPE, AcDbAssocValueProviderPE, AcDbAuditRecreatePE, AcDbCompoundObjectId, AcDbCustomOsnapInfo, AcDbDatabase, AcDbDatabaseReactor, AcDbDatabaseSummaryInfo, AcDbDataCell, AcDbDataColumn, AcDbDataLinkManager, AcDbDictionaryIterator, AcDbDoubleClickEdit, AcDbDwgFiler, AcDbDxfFiler, AcDbDynamicUCSPE, AcDbEmbeddedASMEntPropsPE, AcDbEntityHyperlinkPE, AcDbEvalContext, AcDbEvalContextIterator, AcDbEvalVariant, AcDbGeomRef, AcDbGroupIterator, AcDbHostApplicationServices, AcDbIdMapping, AcDbIdMappingIter, AcDbInterferencePE, AcDbJoinEntityPE, AcDbLayerStateManager, AcDbLayerStateManagerReactor, AcDbLayoutManager, AcDbLayoutManagerReactor, AcDbLongTransWorkSetIterator, AcDbMatchProperties, AcDbMultiModesGripPE, AcDbNonSubEntDynamicUCSPE, AcDbObjectContext, AcDbObjectContextCollection, AcDbObjectContextCollectionIterator, AcDbObjectContextInterface, AcDbObjectContextManager, AcDbObjectIterator, AcDbObjectReactor, AcDbPaperOrientationPE, AcDbParentTransformOfChildPE, AcDbPointRef, AcDbPropertyFilterCustomizationPE, AcDbSectionablePE, AcDbSelectGrip, AcDbTransactionManager, AcDbXObject, AcDbXrecordIterator, AcDMMReactor, AcEdCommand, AcEdCommandIterator, AcEdCommandReactor, AcEdCommandStack, AcEdCommandStackReactor, AcEdInputPointFilter, AcEdInputPointMonitor, AcEdJig, AcEdUIContext, AcFdFieldEngine, AcFdFieldEvaluator, AcFdFieldEvaluatorLoader, AcFdFieldReactor, AcFdFieldResult, AcGiCommonDraw, AcGiContext, AcGiContextualColors, AcGiDrawable, AcGiDrawableEvent, AcGiDrawableReactor, AcGiLightAttenuation, AcGiLinetypeEngine, AcGiMaterialColor, AcGiMaterialMap, AcGiMaterialTexture, AcGiShadowParameters, AcGiSkyParameters, AcGiSubEntityTraits, AcGiToneOperatorParameters, AcGiVariant, AcGiViewport, AcGiVisualStyle, AcGraph, AcGraphNode, AcLyLayerFilter, AcMgObjectFactoryBase, AcPlObject, AcPlPlotReactor, AcPublishReactor, AcPublishUIReactor, AcRxBoxedValue, AcRxClass, AcRxCopyOnWriteObject, AcRxDictionary, AcRxDLinkerReactor, AcRxDynamicLinker, AcRxEvent, AcRxEventReactor, AcRxFacetProvider, AcRxIterator, AcRxOverruleBase, AcRxProtocolReactor, AcRxProtocolReactorIterator, AcRxProtocolReactorList, AcRxProtocolReactorListIterator, AcRxProtocolReactorManager, AcRxResourceLoader, AcRxService, AcRxVariableReactor, AcTransaction, AcTransactionReactor, AcValue, Pimpl::ApiPart< AcRxObject, AcRxAttributeImp >, Pimpl::ApiPart< AcRxObject, AcRxMemberImp >, Pimpl::ApiPart< AcRxObject, AcRxMemberQueryContextImp >, OPMPerInstancePropertyExtension, OPMPerInstancePropertyExtensionFactory, OPMPerInstancePropertySources, OPMPropertyExtension, and OPMPropertyExtensionFactory.
 Public Member Functions
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcRxQueryXOverrule
Member Function Documentation
 virtual ACBASE_PORT AcRxObject* AcRxObject::subQueryX  |  ( |  const AcRxClass *  |  protocolClass | ) |   const
protectedvirtual
Warning
Not implemented!
 The documentation for this class was generated from the following files:
rxobject.h
rxclass.h