Public Member Functions | List of all members
AcDbDatabaseReactor Class Reference
AcDb Classes
  Inheritance diagram for AcDbDatabaseReactor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbDatabaseReactor)
 virtual void  | goodbye (const AcDbDatabase *dwg)
 virtual void  | headerSysVarChanged (const AcDbDatabase *dwg, const ACHAR *name, Adesk::Boolean bSuccess)
 virtual void  | headerSysVarWillChange (const AcDbDatabase *dwg, const ACHAR *name)
 virtual void  | objectAppended (const AcDbDatabase *dwg, const AcDbObject *dbObj)
 virtual void  | objectErased (const AcDbDatabase *dwg, const AcDbObject *dbObj, Adesk::Boolean bErased)
 virtual void  | objectModified (const AcDbDatabase *dwg, const AcDbObject *dbObj)
 virtual void  | objectOpenedForModify (const AcDbDatabase *dwg, const AcDbObject *dbObj)
 virtual void  | objectReAppended (const AcDbDatabase *dwg, const AcDbObject *dbObj)
 virtual void  | objectUnAppended (const AcDbDatabase *dwg, const AcDbObject *dbObj)
 virtual void  | proxyResurrectionCompleted (const AcDbDatabase *dwg, const ACHAR *appname, AcDbObjectIdArray &objects)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbmain.h