Public Member Functions | Static Public Member Functions | Friends | List of all members
AcDbTextEditorWipeout Class Reference
AcDb Classes
 Public Member Functions
ACDBCORE2D_PORT bool  | enableBackgroundFill () const
ACDBCORE2D_PORT AcCmColor  | getBackgroundFillColor () const
ACDBCORE2D_PORT double  | getBackgroundScaleFactor () const
ACDBCORE2D_PORT Acad::ErrorStatus  | setBackgroundFillColor (AcCmColor color)
ACDBCORE2D_PORT Acad::ErrorStatus  | setBackgroundScaleFactor (double factor)
ACDBCORE2D_PORT Acad::ErrorStatus  | setEnableBackgroundFill (bool bEnable)
ACDBCORE2D_PORT Acad::ErrorStatus  | setUseBackgroundColor (bool bUse)
ACDBCORE2D_PORT bool  | useBackgroundColor () const
 Static Public Member Functions
static ACDBCORE2D_PORT double  | maxBackgroundScaleFactor ()
static ACDBCORE2D_PORT double  | minBackgroundScaleFactor ()
 Friends
 class  | TextEditor
Member Function Documentation
 ACDBCORE2D_PORT bool AcDbTextEditorWipeout::enableBackgroundFill  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcCmColor AcDbTextEditorWipeout::getBackgroundFillColor  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbTextEditorWipeout::getBackgroundScaleFactor  |  ( |   | ) |   const
Warning
Not implemented!
 static ACDBCORE2D_PORT double AcDbTextEditorWipeout::maxBackgroundScaleFactor  |  ( |   | )
static
Warning
Not implemented!
 static ACDBCORE2D_PORT double AcDbTextEditorWipeout::minBackgroundScaleFactor  |  ( |   | )
static
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorWipeout::setBackgroundFillColor  |  ( |  AcCmColor  |  color | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorWipeout::setBackgroundScaleFactor  |  ( |  double  |  factor | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorWipeout::setEnableBackgroundFill  |  ( |  bool  |  bEnable | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorWipeout::setUseBackgroundColor  |  ( |  bool  |  bUse | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorWipeout::useBackgroundColor  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbtexteditor.h