Public Types | Public Member Functions | List of all members
AcPlDSDEntry Class Reference
AcPl Classes
  Inheritance diagram for AcPlDSDEntry:
 Public Types
enum  | SetupType {
 kOriginalPS = 0, kNPSSameDWG = 1, kNPSOtherDWG = 2, k3dDwf = 3,
 kOverridePS = 4
 }
enum  | SheetType {
 kSingleDWF = 0, kMultiDWF = 1, kOriginalDevice = 2, kSingleDWFx = 3,
 kMultiDWFx = 4, kSinglePDF = 5, kMultiPDF = 6, kSingleSVF = 7,
 kMultiSVF = 8
 }
 Public Member Functions
 ACPL_PORT  | AcPlDSDEntry (const AcPlDSDEntry &src)
 ACPL_PORT const ACHAR *  | dwgName () const
 ACPL_PORT bool  | has3dDwfSetup () const
 ACPL_PORT const ACHAR *  | layout () const
 ACPL_PORT const ACHAR *  | NPS () const
 ACPL_PORT const ACHAR *  | NPSSourceDWG () const
 ACPL_PORT AcPlDSDEntry &  | operator= (const AcPlDSDEntry &src)
ACPL_PORT const ACHAR *  | orgSheetPath () const
 ACPL_PORT void  | setDwgName (const ACHAR *pName)
 ACPL_PORT void  | setHas3dDwfSetup (bool b3dDwfSetup)
 ACPL_PORT void  | setLayout (const ACHAR *pLayoutName)
 ACPL_PORT void  | setNPS (const ACHAR *pNPSName)
 ACPL_PORT void  | setNPSSourceDWG (const ACHAR *pNPWDWGName)
ACPL_PORT void  | setSetupType (AcPlDSDEntry::SetupType eType)
 ACPL_PORT void  | setTitle (const ACHAR *pTitle)
ACPL_PORT AcPlDSDEntry::SetupType  | setupType () const
 ACPL_PORT const ACHAR *  | title () const
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 ACPL_PORT const ACHAR* AcPlDSDEntry::orgSheetPath  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT void AcPlDSDEntry::setSetupType  |  ( |  AcPlDSDEntry::SetupType  |  eType | )
Warning
Not implemented!
 ACPL_PORT AcPlDSDEntry::SetupType AcPlDSDEntry::setupType  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acpldsdentry.h