Classes | Public Types | Public Member Functions | Friends | List of all members
AcRxVariable Class Reference
AcRx Classes
 Classes
struct  | Range
 Public Types
enum  | SecondaryType {
 kSecondaryTypeNone = 0, kSecondaryTypeBoolean = 1, kSecondaryTypeSymbolName = 2, kSecondaryTypeArea = 3,
 kSecondaryTypeDistance = 4, kSecondaryTypeAngle = 5, kSecondaryTypeUnitlessReal = 6, kSecondaryTypeLast = 6
 }
enum  | StorageType {
 kStoragePerSession = 0, kStoragePerUser = 1, kStoragePerProfile = 2, kStoragePerDatabase = 3,
 kStoragePerViewport = 4
 }
enum  | TypeFlags {
 kTypeFlagsNone = 0, kTypeFlagSpacesAllowed = 1, kTypeFlagDotMeansEmpty = 2, kTypeFlagNoUndo = 4,
 kTypeFlagsChatty = 8, kTypeDeprecated = 16
 }
 Public Member Functions
ACDBCORE2D_PORT void  | addReactor (AcRxVariableReactor *reactor)
ACDBCORE2D_PORT Acad::ErrorStatus  | getValue (resbuf &value) const
ACDBCORE2D_PORT bool  | isLocked () const
ACDBCORE2D_PORT bool  | isReadOnly (AcString *reason=NULL) const
ACDBCORE2D_PORT const ACHAR *  | name () const
ACDBCORE2D_PORT short  | primaryType () const
ACDBCORE2D_PORT const Range *  | range () const
ACDBCORE2D_PORT void  | removeReactor (AcRxVariableReactor *reactor)
ACDBCORE2D_PORT Acad::ErrorStatus  | reset ()
ACDBCORE2D_PORT AcRxVariable::SecondaryType  | secondaryType () const
ACDBCORE2D_PORT Acad::ErrorStatus  | setIsReadOnly (bool value, void *ownerId, const AcString *reason=NULL)
ACDBCORE2D_PORT Acad::ErrorStatus  | setValue (const resbuf &value, void *ownerId=NULL, AcString *failReason=NULL)
ACDBCORE2D_PORT AcRxVariable::StorageType  | storageType () const
ACDBCORE2D_PORT short  | typeFlags () const
ACDBCORE2D_PORT  | ~AcRxVariable ()
 Friends
 class  | AcRxImpVariable
Constructor & Destructor Documentation
 ACDBCORE2D_PORT AcRxVariable::~AcRxVariable  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 ACDBCORE2D_PORT void AcRxVariable::addReactor  |  ( |  AcRxVariableReactor *  |  reactor | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariable::getValue  |  ( |  resbuf &  |  value | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcRxVariable::isLocked  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcRxVariable::isReadOnly  |  ( |  AcString *  |  reason = NULL | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT const ACHAR* AcRxVariable::name  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT short AcRxVariable::primaryType  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT const Range* AcRxVariable::range  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT void AcRxVariable::removeReactor  |  ( |  AcRxVariableReactor *  |  reactor | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariable::reset  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcRxVariable::SecondaryType AcRxVariable::secondaryType  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariable::setIsReadOnly  |  ( |  bool  |  value,
|  void *  |  ownerId,
|  const AcString *  |  reason = NULL
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariable::setValue  |  ( |  const resbuf &  |  value,
|  void *  |  ownerId = NULL,
|  AcString *  |  failReason = NULL
)
Warning
Not implemented!
 ACDBCORE2D_PORT AcRxVariable::StorageType AcRxVariable::storageType  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT short AcRxVariable::typeFlags  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxvar.h