Public Member Functions | List of all members
AcRxDLinkerReactor Class Reference
AcRx Classes
  Inheritance diagram for AcRxDLinkerReactor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcRxDLinkerReactor)
 virtual void  | rxAppLoadAborted (const ACHAR *moduleName)
 virtual void  | rxAppLoaded (const ACHAR *moduleName)
 virtual void  | rxAppUnloadAborted (const ACHAR *moduleName)
 virtual void  | rxAppUnloaded (const ACHAR *moduleName)
 virtual void  | rxAppWillBeLoaded (const ACHAR *moduleName)
 virtual void  | rxAppWillBeUnloaded (const ACHAR *moduleName)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
rxdlinkr.h