Public Member Functions | Friends | List of all members
AcDbPointCloudColorRamp Class Reference
AcDb Classes
 Public Member Functions
AcDbPointCloudColorRamp ()
AcCmEntityColor  | color (int c) const
const AcString  | name () const
Adesk::Int32  | numColors () const
void  | setColor (int c, AcCmEntityColor color)
void  | setFrom (const AcDbPointCloudColorRamp *source)
Acad::ErrorStatus  | setName (const AcString &name)
Acad::ErrorStatus  | setNumColors (Adesk::Int32 count)
void  | setVisibility (int c, bool visibility)
bool  | visibility (int c) const
~AcDbPointCloudColorRamp ()
 Friends
 class  | PointCloudColorMapImp
Constructor & Destructor Documentation
 AcDbPointCloudColorRamp::AcDbPointCloudColorRamp  |  ( |   | )
Warning
Not implemented!
 AcDbPointCloudColorRamp::~AcDbPointCloudColorRamp  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 AcCmEntityColor AcDbPointCloudColorRamp::color  |  ( |  int  |  c | ) |   const
Warning
Not implemented!
 const AcString AcDbPointCloudColorRamp::name  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::Int32 AcDbPointCloudColorRamp::numColors  |  ( |   | ) |   const
Warning
Not implemented!
 void AcDbPointCloudColorRamp::setColor  |  ( |  int  |  c,
|  AcCmEntityColor  |  color
)
Warning
Not implemented!
 void AcDbPointCloudColorRamp::setFrom  |  ( |  const AcDbPointCloudColorRamp *  |  source | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudColorRamp::setName  |  ( |  const AcString &  |  name | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudColorRamp::setNumColors  |  ( |  Adesk::Int32  |  count | )
Warning
Not implemented!
 void AcDbPointCloudColorRamp::setVisibility  |  ( |  int  |  c,
|  bool  |  visibility
)
Warning
Not implemented!
 bool AcDbPointCloudColorRamp::visibility  |  ( |  int  |  c | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbPointCloudColorMap.h