Public Member Functions | Static Public Member Functions | List of all members
AcGsManager Class Referenceabstract
AcGi Classes
 Public Member Functions
 virtual AcGsDevice *  | createAutoCADDevice (AcGsGraphicsKernel &kernel, AcGsWindowingSystemID id)=0
 virtual AcGsModel *  | createAutoCADModel (AcGsGraphicsKernel &kernel)=0
 virtual AcGsDevice *  | createAutoCADOffScreenDevice (AcGsGraphicsKernel &kernel)=0
 virtual AcGsView *  | createAutoCADView (AcGsGraphicsKernel &kernel, AcGiDrawable *pDrawable)=0
 virtual AcGsView *  | createAutoCADViewport (AcGsGraphicsKernel &kernel, AcDbViewportTableRecord *pVTR)=0
 virtual AcGsView *  | createView (AcGsDevice *pDevice)=0
 virtual AcGsView *  | createViewport (AcGsDevice *pDevice, AcDbViewportTableRecord *pVTR)=0
 virtual void  | destroyAutoCADDevice (AcGsDevice *pDevice)=0
 virtual void  | destroyAutoCADModel (AcGsModel *pModel)=0
 virtual void  | destroyAutoCADView (AcGsView *pView)=0
 virtual void  | destroyView (AcGsView *, AcDbViewportTableRecord *pVTR=nullptr)=0
 virtual AcGsModel *  | getDBModel (AcGsGraphicsKernel &kernel)=0
 virtual AcGsDevice *  | getGUIDevice (AcGsGraphicsKernel &kernel)=0
 virtual AcGsDevice *  | getOffScreenDevice (AcGsGraphicsKernel &kernel)=0
 virtual AcGsView *  | getOffScreenView (AcGsGraphicsKernel &kernel, AcGsClientViewInfo &clientViewInfo)=0
 virtual AcGsModel *  | gsHighlightModel (const AcDbDatabase *pDb) const =0
 virtual AcGsModel *  | gsModel (const AcDbDatabase *pDb) const =0
 virtual bool  | hasGsModel (const AcDbDatabase *pDb) const =0
 virtual bool  | invalidateGsModel (const AcDbDatabase *pDb)=0
 virtual void  | setGsHighlightModel (const AcDbDatabase *pDb, AcGsModel *pModel)=0
 virtual void  | setGsModel (const AcDbDatabase *pDb, AcGsModel *pModel)=0
 Static Public Member Functions
static DRAWBRIDGE_API AcGsGraphicsKernel *  | acquireGraphicsKernel (const AcGsKernelDescriptor &descriptor)
static DRAWBRIDGE_API AcGsConfig *  | getConfig (void)
static DRAWBRIDGE_API void  | releaseGraphicsKernel (AcGsGraphicsKernel *pKernel)
Member Function Documentation
 static DRAWBRIDGE_API AcGsGraphicsKernel* AcGsManager::acquireGraphicsKernel  |  ( |  const AcGsKernelDescriptor &  |  descriptor | )
static
Warning
Not implemented!
 static DRAWBRIDGE_API AcGsConfig* AcGsManager::getConfig  |  ( |  void  |   | )
static
Warning
Not implemented!
 static DRAWBRIDGE_API void AcGsManager::releaseGraphicsKernel  |  ( |  AcGsGraphicsKernel *  |  pKernel | )
static
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcGsManager.h