Public Member Functions | Static Public Member Functions | List of all members
AcRxLocalizedNameAttribute Class Reference
AcRx Classes
  Inheritance diagram for AcRxLocalizedNameAttribute:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxLocalizedNameAttribute, ACBASE_PORT)
ACBASE_PORT  | AcRxLocalizedNameAttribute (unsigned int id)
ACBASE_PORT  | AcRxLocalizedNameAttribute (unsigned int id, unsigned int sourceHint)
ACBASE_PORT unsigned int  | id () const
ACBASE_PORT unsigned int  | sourceHint () const
 Public Member Functions inherited from AcRxAttribute
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxAttribute, ACBASE_PORT)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static ACBASE_PORT AcString  | getLocalizedName (const AcRxObject *pO)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Protected Member Functions inherited from AcRxAttribute
ACBASE_PORT  | AcRxAttribute (AcRxAttributeImp *)
 Protected Member Functions inherited from Pimpl::ApiPart< AcRxObject, AcRxAttributeImp >
ApiPart (AcRxAttributeImp *pImp) throw ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 ACBASE_PORT AcRxLocalizedNameAttribute::AcRxLocalizedNameAttribute  |  ( |  unsigned int  |  id | )
Warning
Not implemented!
 ACBASE_PORT AcRxLocalizedNameAttribute::AcRxLocalizedNameAttribute  |  ( |  unsigned int  |  id,
|  unsigned int  |  sourceHint
)
Warning
Not implemented!
Member Function Documentation
 static ACBASE_PORT AcString AcRxLocalizedNameAttribute::getLocalizedName  |  ( |  const AcRxObject *  |  pO | )
static
Warning
Not implemented!
 ACBASE_PORT unsigned int AcRxLocalizedNameAttribute::id  |  ( |   | ) |   const
Warning
Not implemented!
 ACBASE_PORT unsigned int AcRxLocalizedNameAttribute::sourceHint  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxattrib.h