Public Member Functions | List of all members
AcDbObjectContextInterface Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbObjectContextInterface:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbObjectContextInterface)
 virtual Acad::ErrorStatus  | addContext (AcDbObject *pObject, const AcDbObjectContext &context) const =0
 virtual bool  | hasContext (const AcDbObject *pObject, const AcDbObjectContext &context) const =0
 virtual Acad::ErrorStatus  | removeContext (AcDbObject *pObject, const AcDbObjectContext &context) const =0
 virtual bool  | supportsCollection (const AcDbObject *pObject, const AcString &collectionName) const =0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbObjectContextInterface.h