Public Member Functions | Protected Member Functions | Friends | List of all members
AcRxCollectionProperty Class Reference
AcRx Classes
  Inheritance diagram for AcRxCollectionProperty:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxCollectionProperty, ACBASE_PORT)
ACBASE_PORT AcRxValueIterator *  | newValueIterator (const AcRxObject *pO) const
ACBASE_PORT Acad::ErrorStatus  | tryGetCount (const AcRxObject *pO, int &count) const
 Public Member Functions inherited from AcRxPropertyBase
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxPropertyBase, ACBASE_PORT)
ACBASE_PORT bool  | isReadOnly (const AcRxObject *pO) const
 Public Member Functions inherited from AcRxMember
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxMember, ACBASE_PORT)
ACBASE_PORT const AcRxAttributeCollection &  | attributes () const throw ()
ACBASE_PORT AcRxAttributeCollection &  | attributes () throw ()
ACBASE_PORT const AcArray< const AcRxMember * > *  | children () const throw ()
ACBASE_PORT AcString  | localName () const throw ()
ACBASE_PORT const ACHAR *  | name () const throw ()
ACBASE_PORT const AcRxObject *  | owner () const throw ()
ACBASE_PORT const AcRxValueType &  | type () const throw ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
ACBASE_PORT  | AcRxCollectionProperty (const ACHAR *name, const AcRxValueType &type, const AcRxObject *owner=NULL)
AcRxCollectionProperty (AcRxCollectionPropertyImp *pImp)
virtual ACBASE_PORT AcRxValueIterator *  | subNewValueIterator (const AcRxObject *pO) const
virtual ACBASE_PORT Acad::ErrorStatus  | subTryGetCount (const AcRxObject *pO, int &count) const
ACBASE_PORT  | ~AcRxCollectionProperty ()
 Protected Member Functions inherited from AcRxPropertyBase
ACBASE_PORT  | AcRxPropertyBase (AcRxPropertyBaseImp *)
ACBASE_PORT  | ~AcRxPropertyBase ()
 Protected Member Functions inherited from AcRxMember
ACBASE_PORT  | AcRxMember (AcRxMemberImp *) throw ()
virtual ACBASE_PORT Acad::ErrorStatus  | subChildren (AcArray< const AcRxMember * > &children) const
virtual ACBASE_PORT AcString  | subLocalName () const
virtual ACBASE_PORT  | ~AcRxMember () throw ()
 Protected Member Functions inherited from Pimpl::ApiPart< AcRxObject, AcRxMemberImp >
ApiPart (AcRxMemberImp *pImp) throw ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcRxCollectionPropertyImp
 class  | AcRxCollectionPropertyOverrule
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxMember
static ACBASE_PORT void  | deleteMember (const AcRxMember *pMember) throw ()
static ACBASE_PORT void *  | operator new (size_t size)
static ACBASE_PORT void *  | operator new (size_t size, const char *pFName, int nLine)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Protected Member Functions inherited from AcRxMember
static ACBASE_PORT void  | operator delete (void *p)
static ACBASE_PORT void  | operator delete (void *p, const char *pFName, int nLine)
static ACBASE_PORT void  | operator delete[] (void *p)
static ACBASE_PORT void  | operator delete[] (void *p, const char *pFName, int nLine)
Constructor & Destructor Documentation
 ACBASE_PORT AcRxCollectionProperty::~AcRxCollectionProperty  |  ( |   | )
protected
Warning
Not implemented!
 ACBASE_PORT AcRxCollectionProperty::AcRxCollectionProperty  |  ( |  const ACHAR *  |  name,
|  const AcRxValueType &  |  type,
|  const AcRxObject *  |  owner = NULL
)
protected
Warning
Not implemented!
 AcRxCollectionProperty::AcRxCollectionProperty  |  ( |  AcRxCollectionPropertyImp *  |  pImp | )
protected
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT AcRxValueIterator* AcRxCollectionProperty::newValueIterator  |  ( |  const AcRxObject *  |  pO | ) |   const
Warning
Not implemented!
 virtual ACBASE_PORT AcRxValueIterator* AcRxCollectionProperty::subNewValueIterator  |  ( |  const AcRxObject *  |  pO | ) |   const
protectedvirtual
Warning
Not implemented!
 virtual ACBASE_PORT Acad::ErrorStatus AcRxCollectionProperty::subTryGetCount  |  ( |  const AcRxObject *  |  pO,
|  int &  |  count
) |   |  const
protectedvirtual
Warning
Not implemented!
 ACBASE_PORT Acad::ErrorStatus AcRxCollectionProperty::tryGetCount  |  ( |  const AcRxObject *  |  pO,
|  int &  |  count
) |   |  const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxprop.h