Public Types | Public Member Functions | Friends | List of all members
AcEdDragStyle Class Reference
AcEd Classes
 Public Types
enum  | StyleType {
 kNone = 0, kHide, kTransparent25, kTransparent75,
 kDeletedEffect, kHighlight, kNotSet
 }
 Public Member Functions
AcEdDragStyle ()
AcEdDragStyle (StyleType styleTypeForOriginal, StyleType styleTypeForDragged)
AcEdDragStyle (const AcEdDragStyle &dragStyle)
bool  | operator!= (const AcEdDragStyle &other) const
AcEdDragStyle &  | operator= (const AcEdDragStyle &src)
bool  | operator== (const AcEdDragStyle &other) const
Acad::ErrorStatus  | setStyleTypeForDragged (StyleType styleType)
Acad::ErrorStatus  | setStyleTypeForOriginal (StyleType styleType)
StyleType  | styleTypeForDragged () const
StyleType  | styleTypeForOriginal () const
~AcEdDragStyle ()
 Friends
 class  | AcEdImpDragStyle
Constructor & Destructor Documentation
 AcEdDragStyle::AcEdDragStyle  |  ( |   | )
Warning
Not implemented!
 AcEdDragStyle::AcEdDragStyle  |  ( |  StyleType  |  styleTypeForOriginal,
|  StyleType  |  styleTypeForDragged
)
Warning
Not implemented!
 AcEdDragStyle::AcEdDragStyle  |  ( |  const AcEdDragStyle &  |  dragStyle | )
Warning
Not implemented!
 AcEdDragStyle::~AcEdDragStyle  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 bool AcEdDragStyle::operator!=  |  ( |  const AcEdDragStyle &  |  other | ) |   const
Warning
Not implemented!
 AcEdDragStyle& AcEdDragStyle::operator=  |  ( |  const AcEdDragStyle &  |  src | )
Warning
Not implemented!
 bool AcEdDragStyle::operator==  |  ( |  const AcEdDragStyle &  |  other | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcEdDragStyle::setStyleTypeForDragged  |  ( |  StyleType  |  styleType | )
Warning
Not implemented!
 Acad::ErrorStatus AcEdDragStyle::setStyleTypeForOriginal  |  ( |  StyleType  |  styleType | )
Warning
Not implemented!
 StyleType AcEdDragStyle::styleTypeForDragged  |  ( |   | ) |   const
Warning
Not implemented!
 StyleType AcEdDragStyle::styleTypeForOriginal  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbjig.h