Public Member Functions | Protected Member Functions | List of all members
AcGePlanarEnt Class Reference
AcGe Classes
  Inheritance diagram for AcGePlanarEnt:
 Public Member Functions
 AcGePoint3d  | closestPointToLinearEnt (const AcGeLinearEnt3d &line, AcGePoint3d &pointOnLine, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | closestPointToPlanarEnt (const AcGePlanarEnt &otherPln, AcGePoint3d &pointOnOtherPln, const AcGeTol &tol=AcGeContext::gTol) const
 void  | get (AcGePoint3d &, AcGeVector3d &uVec, AcGeVector3d &vVec) const
 void  | get (AcGePoint3d &, AcGePoint3d &origin, AcGePoint3d &) const
 void  | getCoefficients (double &a, double &b, double &c, double &d) const
 void  | getCoordSystem (AcGePoint3d &origin, AcGeVector3d &axis1, AcGeVector3d &axis2) const
 Adesk::Boolean  | intersectWith (const AcGeLinearEnt3d &linEnt, AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isCoplanarTo (const AcGePlanarEnt &otherPlnEnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isParallelTo (const AcGeLinearEnt3d &linEnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isParallelTo (const AcGePlanarEnt &otherPlnEnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isPerpendicularTo (const AcGeLinearEnt3d &linEnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isPerpendicularTo (const AcGePlanarEnt &linEnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeVector3d  | normal () const
 AcGePlanarEnt &  | operator= (const AcGePlanarEnt &src)
 AcGePoint3d  | pointOnPlane () const
 Public Member Functions inherited from AcGeSurface
 AcGePoint3d  | closestPointTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param, int derivOrd, AcGeVector3dArray &derivatives) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param, int derivOrd, AcGeVector3dArray &derivatives, AcGeVector3d &normal) const
 void  | getClosestPointTo (const AcGePoint3d &pnt, AcGePointOnSurface &result, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getEnvelope (AcGeInterval &intrvlX, AcGeInterval &intrvlY) const
 Adesk::Boolean  | isClosedInU (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isClosedInV (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isNormalReversed () const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, AcGePoint2d &paramPoint, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeSurface &  | operator= (const AcGeSurface &otherSurface)
 AcGePoint2d  | paramOf (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeSurface &  | reverseNormal ()
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Protected Member Functions
AcGePlanarEnt (const AcGePlanarEnt &)
 Protected Member Functions inherited from AcGeSurface
AcGeSurface (const AcGeSurface &)
 Protected Member Functions inherited from AcGeEntity3d
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Additional Inherited Members
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 class AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
geplanar.h