Public Member Functions | Protected Member Functions | List of all members
AcDbOsnapPointRef Class Reference
AcDb Classes
  Inheritance diagram for AcDbOsnapPointRef:
 Public Member Functions
AcDbOsnapPointRef (const AcGePoint3d &refPt)
AcDbOsnapPointRef (AcDbPointRef::OsnapType osnapType, const AcDbFullSubentPath *objPath, const AcDbFullSubentPath *intObjPath=NULL, const AcGePoint3d *refPt=NULL, AcDbPointRef *lastPtRef=NULL)
AcDbOsnapPointRef (const AcDbOsnapPointRef &src)
ACRX_DECLARE_MEMBERS (AcDbOsnapPointRef)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *filer, AcDbDatabase *pDb) override
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *filer, AcDbDatabase *pDb) const override
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *filer, AcDbDatabase *pDb) override
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *filer, AcDbDatabase *pDb) const override
 virtual Acad::ErrorStatus  | evalPoint (AcGePoint3d &pt) override
ACDBCORE2D_PORT Acad::ErrorStatus  | evalPoint (AcDbPointRef::OsnapType ospType, const AcGePoint3d &lastPt, AcGePoint3d &pt)
 virtual Acad::ErrorStatus  | getEntities (AcDbFullSubentPathArray &ents, bool getLastPtRef=true) const override
 Acad::ErrorStatus  | getIdPath (AcDbFullSubentPath &idPath) const
 Acad::ErrorStatus  | getIntIdPath (AcDbFullSubentPath &intIdPath) const
 Acad::ErrorStatus  | getXrefHandles (AcDbHandleArrayPtRef &xrefHandles) const
 Acad::ErrorStatus  | getXrefIntHandles (AcDbHandleArrayPtRef &xrefHandles) const
 virtual bool  | isGeomErased () const override
 virtual bool  | isXrefObj (AcDbObjectIdArray &ids1, AcDbObjectIdArray &ids2, bool isMainObj=true) const override
 AcDbPointRef *  | lastPointRef () const
 double  | nearPointParam () const
 virtual AcDbPointRef &  | operator= (const AcDbPointRef &src) override
 AcDbOsnapPointRef &  | operator= (const AcDbOsnapPointRef &src)
 AcDbPointRef::OsnapType  | osnapType () const
 AcGePoint3d  | point () const
 Acad::ErrorStatus  | setIdPath (const AcDbFullSubentPath &idPath)
 Acad::ErrorStatus  | setIntIdPath (const AcDbFullSubentPath &intIdPath)
 Acad::ErrorStatus  | setLastPointRef (AcDbPointRef *ptRef)
 Acad::ErrorStatus  | setNearPointParam (double newVal)
 Acad::ErrorStatus  | setOsnapType (AcDbPointRef::OsnapType osnType)
 Acad::ErrorStatus  | setPoint (const AcGePoint3d &pt)
 Acad::ErrorStatus  | setXrefHandles (const AcDbHandleArrayPtRef &xrefHandles)
 Acad::ErrorStatus  | setXrefIntHandles (const AcDbHandleArrayPtRef &xrefHandles)
virtual void  | updateDueToMirror (bool inMirror=false) override
virtual Acad::ErrorStatus  | updateSubentPath (AcDbIdMapping &idMap) override
 virtual Acad::ErrorStatus  | updateXrefSubentPath () override
 Public Member Functions inherited from AcDbPointRef
ACRX_DECLARE_MEMBERS (AcDbPointRef)
 virtual Acad::ErrorStatus  | deepClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &, Adesk::Boolean isPrimary=Adesk::kTrue) const
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &, Adesk::Boolean isPrimary=Adesk::kTrue) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 Acad::ErrorStatus  | evalPointGuts (AcDbPointRef::OsnapType ospType, const AcGePoint3d &pickPt, const AcGePoint3d &lastPt, AcGePoint3d &pt)
 double  | findNearPointParam (const AcGePoint3d &pt) const
 bool  | getEllipseParams (double &sP, double &eP) const
 Acad::ErrorStatus  | getIntPoints (const AcDbEntity *pEnt, const AcDbEntity *pIntEnt, AcDb::Intersect intType, AcGePoint3dArray &intPts, int gsMarker1=0, int gsMarker2=0) const
 bool  | isTransSpatial (bool isMainObj=true) const
 AcGePoint3d  | nearPoint ()
Acad::ErrorStatus  | updateSubentPathGuts (AcDbFullSubentPath &path, AcDbIdMapping &idMap)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcDbPointRef
enum  | OsnapType {
 kOsnapNone = 0, kOsnapEnd = 1, kOsnapMid = 2, kOsnapCen = 3,
 kOsnapNode = 4, kOsnapQuad = 5, kOsnapInt = 6, kOsnapIns = 7,
 kOsnapPerp = 8, kOsnapTan = 9, kOsnapNear = 10, kOsnapApint = 11,
 kOsnapStart = 13
 }
 Static Public Member Functions inherited from AcDbPointRef
 static bool  | calcTransform (const AcDbObjectIdArray &ids, AcGeMatrix3d &A_Ecs2Wcs)
 static Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *filer, AcDbDatabase *pDb, AcDbPointRef *&pPointRef)
 static Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *filer, AcDbDatabase *pDb, const AcDbPointRef *pPointRef)
 static Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *filer, AcDbDatabase *pDb, AcDbPointRef *&pPointRef)
 static Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *filer, AcDbDatabase *pDb, const AcDbPointRef *pPointRef)
 static AcGeMatrix3d  | mswcsToPswcs (const AcDbViewport *pVPort)
 static AcDbEntity *  | subentPtr (const AcDbFullSubentPath &objPath, bool &isCloned, bool &reverseArc, bool &isStandAloneArc)
 static AcGeMatrix3d  | wcsToDcsMatrix (const AcDbViewport *pVPort)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
Member Function Documentation
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbOsnapPointRef::evalPoint  |  ( |  AcDbPointRef::OsnapType  |  ospType,
|  const AcGePoint3d &  |  lastPt,
|  AcGePoint3d &  |  pt
)
Warning
Not implemented!
 virtual void AcDbOsnapPointRef::updateDueToMirror  |  ( |  bool  |  inMirror = false | )
overridevirtual
Warning
Not implemented!
Implements AcDbPointRef.
 virtual Acad::ErrorStatus AcDbOsnapPointRef::updateSubentPath  |  ( |  AcDbIdMapping &  |  idMap | )
overridevirtual
Warning
Not implemented!
Implements AcDbPointRef.
 Acad::ErrorStatus AcDbOsnapPointRef::updateSubentPathGuts  |  ( |  AcDbFullSubentPath &  |  path,
|  AcDbIdMapping &  |  idMap
)
protected
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbdimptref.h