Public Types | Public Member Functions | Static Public Attributes | List of all members
AcGiMaterialColor Class Reference
AcGi Classes
  Inheritance diagram for AcGiMaterialColor:
 Public Types
enum  | Method { kInherit = 0, kOverride }
 Public Member Functions
AcGiMaterialColor (const AcGiMaterialColor &matColor)
ACRX_DECLARE_MEMBERS (AcGiMaterialColor)
 virtual const AcCmEntityColor &  | color (void) const
 virtual double  | factor (void) const
 virtual Method  | method (void) const
 AcGiMaterialColor &  | operator= (const AcGiMaterialColor &matColor)
 bool  | operator== (const AcGiMaterialColor &matColor) const
 virtual void  | set (const AcGiMaterialColor &matColor)
 virtual void  | setColor (const AcCmEntityColor &color)
 virtual void  | setFactor (double dFactor)
 virtual void  | setMethod (Method method)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Attributes
 static ACGIMAT_IMPEXP const AcGiMaterialColor  | kNull
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgimaterial.h