Public Member Functions | Static Public Member Functions | Friends | List of all members
AcRxMemberQueryEngine Class Reference
AcRx Classes
  Inheritance diagram for AcRxMemberQueryEngine:
 Public Member Functions
ACBASE_PORT Acad::ErrorStatus  | addFacetProvider (AcRxFacetProvider *pProvider)
ACBASE_PORT void  | addReactor (AcRxMemberReactor *pReactor)
ACBASE_PORT const AcRxMemberQueryContext *  | defaultContext ()
ACBASE_PORT AcRxMember *  | find (const AcRxObject *pO, const ACHAR *name, const AcRxMemberQueryContext *pContext=NULL) const
ACBASE_PORT AcRxMemberIterator *  | newMemberIterator (const AcRxObject *pO, const AcRxMemberQueryContext *pContext=NULL) const
ACBASE_PORT const AcRxPromotingQueryContext *  | promotingContext ()
ACBASE_PORT Acad::ErrorStatus  | removeFacetProvider (AcRxFacetProvider *pProvider)
ACBASE_PORT void  | removeReactor (AcRxMemberReactor *pReactor)
 Static Public Member Functions
static ACBASE_PORT AcRxMemberQueryEngine *  | theEngine ()
 Friends
 class  | AcRxMemberQueryEngineImp
 Additional Inherited Members
 Protected Member Functions inherited from Pimpl::ApiPart< void, AcRxMemberQueryEngineImp >
ApiPart (AcRxMemberQueryEngineImp *pImp) throw ()
Member Function Documentation
 ACBASE_PORT Acad::ErrorStatus AcRxMemberQueryEngine::addFacetProvider  |  ( |  AcRxFacetProvider *  |  pProvider | )
Warning
Not implemented!
 ACBASE_PORT void AcRxMemberQueryEngine::addReactor  |  ( |  AcRxMemberReactor *  |  pReactor | )
Warning
Not implemented!
 ACBASE_PORT const AcRxMemberQueryContext* AcRxMemberQueryEngine::defaultContext  |  ( |   | )
Warning
Not implemented!
 ACBASE_PORT AcRxMember* AcRxMemberQueryEngine::find  |  ( |  const AcRxObject *  |  pO,
|  const ACHAR *  |  name,
|  const AcRxMemberQueryContext *  |  pContext = NULL
) |   |  const
Warning
Not implemented!
 ACBASE_PORT AcRxMemberIterator* AcRxMemberQueryEngine::newMemberIterator  |  ( |  const AcRxObject *  |  pO,
|  const AcRxMemberQueryContext *  |  pContext = NULL
) |   |  const
Warning
Not implemented!
 ACBASE_PORT const AcRxPromotingQueryContext* AcRxMemberQueryEngine::promotingContext  |  ( |   | )
Warning
Not implemented!
 ACBASE_PORT Acad::ErrorStatus AcRxMemberQueryEngine::removeFacetProvider  |  ( |  AcRxFacetProvider *  |  pProvider | )
Warning
Not implemented!
 ACBASE_PORT void AcRxMemberQueryEngine::removeReactor  |  ( |  AcRxMemberReactor *  |  pReactor | )
Warning
Not implemented!
 static ACBASE_PORT AcRxMemberQueryEngine* AcRxMemberQueryEngine::theEngine  |  ( |   | )
static
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxmember.h