Public Types | Public Member Functions | Friends | List of all members
AcDbLayerStateManager Class Reference
AcDb Classes
  Inheritance diagram for AcDbLayerStateManager:
 Public Types
enum  | { kUndefDoNothing = 0, kUndefTurnOff = 1, kUndefFreeze = 2, kRestoreAsOverrides = 4 }
enum  | LayerStateMask {
 kNone = 0x0000, kOn = 0x0001, kFrozen = 0x0002, kLocked = 0x0004,
 kPlot = 0x0008, kNewViewport = 0x0010, kColor = 0x0020, kLineType = 0x0040,
 kLineWeight = 0x0080, kPlotStyle = 0x0100, kCurrentViewport = 0x0200, kTransparency = 0x0400,
 kAll, kStateIsHidden = 0x8000, kLastRestored = 0x10000, kDecomposition = kAll | 0x20000
 }
 Public Member Functions
AcDbLayerStateManager (AcDbDatabase *pHostDb)
ACRX_DECLARE_MEMBERS (AcDbLayerStateManager)
 Acad::ErrorStatus  | addLayerStateLayers (const ACHAR *sName, const AcDbObjectIdArray &layerIds)
 bool  | addReactor (AcDbLayerStateManagerReactor *pReactor)
 bool  | compareLayerStateToDb (const ACHAR *sName, const AcDbObjectId &idVp)
 Acad::ErrorStatus  | deleteLayerState (const ACHAR *sName)
 Acad::ErrorStatus  | exportLayerState (const ACHAR *sNameToExport, const ACHAR *sFilename)
 AcDbDatabase *  | getDatabase () const
 Acad::ErrorStatus  | getLastRestoredLayerState (AcString &sName, AcDbObjectId &restoredLSId)
 Acad::ErrorStatus  | getLayerStateDescription (const ACHAR *sName, ACHAR *&sDesc)
 Acad::ErrorStatus  | getLayerStateLayers (AcStringArray &layerArray, const ACHAR *sName, bool bInvert=false)
 Acad::ErrorStatus  | getLayerStateMask (const ACHAR *sName, LayerStateMask &returnMask)
 Acad::ErrorStatus  | getLayerStateNames (AcStringArray &lsArray, bool bIncludeHidden=true, bool bIncludeXref=true)
 bool  | hasLayerState (const ACHAR *sName)
 Acad::ErrorStatus  | importLayerState (const ACHAR *sFilename)
 Acad::ErrorStatus  | importLayerState (const ACHAR *sFilename, AcString &sName)
 Acad::ErrorStatus  | importLayerStateFromDb (const ACHAR *pStateName, AcDbDatabase *pDb)
 bool  | isDependentLayerState (const ACHAR *sName)
 bool  | layerStateHasViewportData (const ACHAR *sName)
 AcDbObjectId  | layerStatesDictionaryId (bool bCreateIfNotPresent=false)
 Acad::ErrorStatus  | removeLayerStateLayers (const ACHAR *sName, const AcStringArray &layerNames)
 bool  | removeReactor (AcDbLayerStateManagerReactor *pReactor)
 Acad::ErrorStatus  | renameLayerState (const ACHAR *sName, const ACHAR *sNewName)
 Acad::ErrorStatus  | restoreLayerState (const ACHAR *sName)
 Acad::ErrorStatus  | restoreLayerState (const ACHAR *sName, const AcDbObjectId &idVp, int nRestoreFlags=0, const LayerStateMask *pClientMask=NULL)
 Acad::ErrorStatus  | saveLayerState (const ACHAR *sName, LayerStateMask mask)
 Acad::ErrorStatus  | saveLayerState (const ACHAR *sName, LayerStateMask mask, const AcDbObjectId &idVp)
 Acad::ErrorStatus  | setLayerStateDescription (const ACHAR *sName, const ACHAR *sDesc)
 Acad::ErrorStatus  | setLayerStateMask (const ACHAR *sName, LayerStateMask mask)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpDatabase
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dblstate.h