Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcFdFieldEvaluator Class Reference
AcFd Classes
  Inheritance diagram for AcFdFieldEvaluator:
 Public Member Functions
ACDBCORE2D_PORT  | AcFdFieldEvaluator (void)
ACRX_DECLARE_MEMBERS (AcFdFieldEvaluator)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | compile (AcDbField *pField, AcDbDatabase *pDb, AcFdFieldResult *pResult)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | evaluate (AcDbField *pField, int nContext, AcDbDatabase *pDb, AcFdFieldResult *pResult)
virtual ACDBCORE2D_PORT const ACHAR *  | evaluatorId (void) const
virtual ACDBCORE2D_PORT const ACHAR *  | evaluatorId (AcDbField *pField)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | format (AcDbField *pField, AcString &sValue)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | format (AcDbField *pField, ACHAR *&pszValue) final
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | initialize (AcDbField *pField)
virtual ACDBCORE2D_PORT  | ~AcFdFieldEvaluator (void)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
AcFdFieldEvaluator (void *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Protected Attributes
 void *  | mpImpObj
 Friends
 class  | AcFdSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
Constructor & Destructor Documentation
 ACDBCORE2D_PORT AcFdFieldEvaluator::AcFdFieldEvaluator  |  ( |  void  |   | )
Warning
Not implemented!
 virtual ACDBCORE2D_PORT AcFdFieldEvaluator::~AcFdFieldEvaluator  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 AcFdFieldEvaluator::AcFdFieldEvaluator  |  ( |  void *  |   | )
protected
Warning
Not implemented!
Member Function Documentation
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcFdFieldEvaluator::compile  |  ( |  AcDbField *  |  pField,
|  AcDbDatabase *  |  pDb,
|  AcFdFieldResult *  |  pResult
)
virtual
Warning
Not implemented!
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcFdFieldEvaluator::evaluate  |  ( |  AcDbField *  |  pField,
|  int  |  nContext,
|  AcDbDatabase *  |  pDb,
|  AcFdFieldResult *  |  pResult
)
virtual
Warning
Not implemented!
 virtual ACDBCORE2D_PORT const ACHAR* AcFdFieldEvaluator::evaluatorId  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual ACDBCORE2D_PORT const ACHAR* AcFdFieldEvaluator::evaluatorId  |  ( |  AcDbField *  |  pField | )
virtual
Warning
Not implemented!
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcFdFieldEvaluator::initialize  |  ( |  AcDbField *  |  pField | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcField.h