Public Types | Public Member Functions | List of all members
AcPlPlotReactor Class Reference
AcPl Classes
  Inheritance diagram for AcPlPlotReactor:
 Public Types
enum  | PlotType { kPlot, kPreview, kBackgroundPackaging, kBackgroundPlot }
 Public Member Functions
virtual void  | beginDocument (AcPlPlotInfo &plotInfo, const ACHAR *pDocname, Adesk::Int32 nCopies=1, bool bPlotToFile=false, const ACHAR *pFilename=NULL)
virtual void  | beginPage (AcPlPlotPageInfo &pageInfo, AcPlPlotInfo &plotInfo, bool bLastPage)
virtual void  | beginPlot (AcPlPlotProgress *pPlotProgress, PlotType type)
virtual void  | endDocument (AcPlPlotProgress::PlotCancelStatus status)
virtual void  | endPage (AcPlPlotProgress::SheetCancelStatus status)
virtual void  | endPlot (AcPlPlotProgress::PlotCancelStatus status)
virtual void  | pageCancelled ()
virtual void  | plotCancelled ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual void AcPlPlotReactor::beginDocument  |  ( |  AcPlPlotInfo &  |  plotInfo,
|  const ACHAR *  |  pDocname,
|  Adesk::Int32  |  nCopies = 1,
|  bool  |  bPlotToFile = false,
|  const ACHAR *  |  pFilename = NULL
)
virtual
Warning
Not implemented!
 virtual void AcPlPlotReactor::beginPage  |  ( |  AcPlPlotPageInfo &  |  pageInfo,
|  AcPlPlotInfo &  |  plotInfo,
|  bool  |  bLastPage
)
virtual
Warning
Not implemented!
 virtual void AcPlPlotReactor::beginPlot  |  ( |  AcPlPlotProgress *  |  pPlotProgress,
|  PlotType  |  type
)
virtual
Warning
Not implemented!
 virtual void AcPlPlotReactor::endDocument  |  ( |  AcPlPlotProgress::PlotCancelStatus  |  status | )
virtual
Warning
Not implemented!
 virtual void AcPlPlotReactor::endPage  |  ( |  AcPlPlotProgress::SheetCancelStatus  |  status | )
virtual
Warning
Not implemented!
 virtual void AcPlPlotReactor::endPlot  |  ( |  AcPlPlotProgress::PlotCancelStatus  |  status | )
virtual
Warning
Not implemented!
 virtual void AcPlPlotReactor::pageCancelled  |  ( |   | )
virtual
Warning
Not implemented!
 virtual void AcPlPlotReactor::plotCancelled  |  ( |   | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acplplotreactor.h