Public Member Functions | Static Public Member Functions | List of all members
AcRxDisplayAsAttribute Class Reference
AcRx Classes
  Inheritance diagram for AcRxDisplayAsAttribute:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxDisplayAsAttribute, ACBASE_PORT)
ACBASE_PORT  | AcRxDisplayAsAttribute (const ACHAR *name)
ACBASE_PORT const ACHAR *  | path () const
 Public Member Functions inherited from AcRxAttribute
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxAttribute, ACBASE_PORT)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static ACDB_PORT AcString  | getDisplayValue (const AcRxDisplayAsAttribute *pAttr, const AcDbObjectId &id)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Protected Member Functions inherited from AcRxAttribute
ACBASE_PORT  | AcRxAttribute (AcRxAttributeImp *)
 Protected Member Functions inherited from Pimpl::ApiPart< AcRxObject, AcRxAttributeImp >
ApiPart (AcRxAttributeImp *pImp) throw ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 ACBASE_PORT AcRxDisplayAsAttribute::AcRxDisplayAsAttribute  |  ( |  const ACHAR *  |  name | )
Warning
Not implemented!
Member Function Documentation
 static ACDB_PORT AcString AcRxDisplayAsAttribute::getDisplayValue  |  ( |  const AcRxDisplayAsAttribute *  |  pAttr,
|  const AcDbObjectId &  |  id
)
static
Warning
Not implemented!
 ACBASE_PORT const ACHAR* AcRxDisplayAsAttribute::path  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxattrib.h