Public Member Functions | List of all members
AcRxEventReactor Class Reference
AcRx Classes
  Inheritance diagram for AcRxEventReactor:
 Public Member Functions
 virtual void  | abortAttach (AcDbDatabase *pFrom)
 virtual void  | abortDeepClone (AcDbIdMapping &)
 virtual void  | abortDxfIn (AcDbDatabase *)
 virtual void  | abortDxfOut (AcDbDatabase *)
 virtual void  | abortInsert (AcDbDatabase *pTo)
 virtual void  | abortRestore (AcDbDatabase *pTo)
 virtual void  | abortSave (AcDbDatabase *)
 virtual void  | abortWblock (AcDbDatabase *pTo)
ACRX_DECLARE_MEMBERS (AcRxEventReactor)
 virtual void  | beginAttach (AcDbDatabase *pTo, const ACHAR *, AcDbDatabase *pFrom)
 virtual void  | beginDeepClone (AcDbDatabase *pTo, AcDbIdMapping &)
 virtual void  | beginDeepCloneXlation (AcDbIdMapping &, Acad::ErrorStatus *)
 virtual void  | beginDxfIn (AcDbDatabase *)
 virtual void  | beginDxfOut (AcDbDatabase *)
 virtual void  | beginInsert (AcDbDatabase *pTo, const ACHAR *pBlockName, AcDbDatabase *pFrom)
 virtual void  | beginInsert (AcDbDatabase *pTo, const AcGeMatrix3d &xform, AcDbDatabase *pFrom)
 virtual void  | beginRestore (AcDbDatabase *pTo, const ACHAR *, AcDbDatabase *pFrom)
 virtual void  | beginSave (AcDbDatabase *, const ACHAR *pIntendedName)
 virtual void  | beginWblock (AcDbDatabase *pTo, AcDbDatabase *pFrom, const AcGePoint3d *&insertionPoint)
 virtual void  | beginWblock (AcDbDatabase *pTo, AcDbDatabase *pFrom, AcDbObjectId blockId)
 virtual void  | beginWblock (AcDbDatabase *pTo, AcDbDatabase *pFrom)
 virtual void  | beginWblockObjects (AcDbDatabase *, AcDbIdMapping &)
 virtual void  | comandeered (AcDbDatabase *pTo, AcDbObjectId id, AcDbDatabase *pFrom)
 virtual void  | databaseConstructed (AcDbDatabase *)
 virtual void  | databaseToBeDestroyed (AcDbDatabase *)
 virtual ADESK_DEPRECATED void  | dwgFileOpened (AcDbDatabase *, ACHAR *) final
 virtual void  | dwgFileOpened (AcDbDatabase *, const ACHAR *)
 virtual void  | dxfInComplete (AcDbDatabase *)
 virtual void  | dxfOutComplete (AcDbDatabase *)
 virtual void  | endAttach (AcDbDatabase *pTo)
 virtual void  | endDeepClone (AcDbIdMapping &)
 virtual void  | endInsert (AcDbDatabase *pTo)
 virtual void  | endRestore (AcDbDatabase *pTo)
 virtual void  | endWblock (AcDbDatabase *pTo)
 virtual void  | initialDwgFileOpenComplete (AcDbDatabase *)
 virtual void  | otherAttach (AcDbDatabase *pTo, AcDbDatabase *pFrom)
 virtual void  | otherInsert (AcDbDatabase *pTo, AcDbIdMapping &idMap, AcDbDatabase *pFrom)
 virtual void  | otherWblock (AcDbDatabase *pTo, AcDbIdMapping &, AcDbDatabase *pFrom)
 virtual void  | partialOpenNotice (AcDbDatabase *pDb)
 virtual void  | preXrefLockFile (AcDbDatabase *pDb, AcDbObjectId btrId)
 virtual void  | redirected (AcDbObjectId newId, AcDbObjectId oldId)
 virtual void  | saveComplete (AcDbDatabase *, const ACHAR *pActualName)
 virtual void  | wblockNotice (AcDbDatabase *pDb)
 virtual void  | xrefSubCommandAborted (AcDbDatabase *pHostDb, AcXrefSubCommand op, const AcArray< AcDbObjectId > &ids, const ACHAR *const *btrNames, const ACHAR *const *paths)
 virtual void  | xrefSubcommandAttachItem (AcDbDatabase *pHost, int activity, const ACHAR *pPath)
 virtual void  | xrefSubcommandBindItem (AcDbDatabase *pHost, int activity, AcDbObjectId blockId)
 virtual void  | xrefSubcommandDetachItem (AcDbDatabase *pHost, int activity, AcDbObjectId blockId)
 virtual void  | xrefSubCommandEnd (AcDbDatabase *pHostDb, AcXrefSubCommand op, const AcArray< AcDbObjectId > &ids, const ACHAR *const *btrNames, const ACHAR *const *paths)
 virtual void  | xrefSubcommandOverlayItem (AcDbDatabase *pHost, int activity, const ACHAR *pPath)
 virtual void  | xrefSubcommandPathItem (int activity, AcDbObjectId blockId, const ACHAR *pNewPath)
 virtual void  | xrefSubcommandReloadItem (AcDbDatabase *pHost, int activity, AcDbObjectId blockId)
 virtual void  | xrefSubCommandStart (AcDbDatabase *pHostDb, AcXrefSubCommand op, const AcArray< AcDbObjectId > &ids, const ACHAR *const *btrNames, const ACHAR *const *paths, bool &vetoOp)
 virtual void  | xrefSubcommandUnloadItem (AcDbDatabase *pHost, int activity, AcDbObjectId blockId)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
rxevent.h