Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcApWindow Class Reference
AcAp Classes
  Inheritance diagram for AcApWindow:
 Public Member Functions
ACCORE_PORT bool  | postRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
ACCORE_PORT bool  | preRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
ACCORE_PORT bool  | routeMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
 Public Member Functions inherited from IAdHostWindow
 virtual HWND  | windowHandle ()=0
 Protected Member Functions
ACCORE_PORT  | AcApWindow ()
virtual ACCORE_PORT bool  | subPostRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
virtual ACCORE_PORT bool  | subPreRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
virtual ACCORE_PORT bool  | subRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
virtual ACCORE_PORT  | ~AcApWindow ()
 Protected Attributes
 AcApWindowImp *  | m_pImp
 Friends
 class  | AcApWindowImp
Constructor & Destructor Documentation
 ACCORE_PORT AcApWindow::AcApWindow  |  ( |   | )
protected
Warning
Not implemented!
 virtual ACCORE_PORT AcApWindow::~AcApWindow  |  ( |   | )
protectedvirtual
Warning
Not implemented!
Member Function Documentation
 ACCORE_PORT bool AcApWindow::postRouteMessage  |  ( |  HWND  |  hwnd,
|  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam,
|  Adesk::LongPtr &  |  lResult
)
Warning
Not implemented!
 ACCORE_PORT bool AcApWindow::preRouteMessage  |  ( |  HWND  |  hwnd,
|  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam,
|  Adesk::LongPtr &  |  lResult
)
Warning
Not implemented!
 ACCORE_PORT bool AcApWindow::routeMessage  |  ( |  HWND  |  hwnd,
|  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam,
|  Adesk::LongPtr &  |  lResult
)
Warning
Not implemented!
 virtual ACCORE_PORT bool AcApWindow::subPostRouteMessage  |  ( |  HWND  |  hwnd,
|  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam,
|  Adesk::LongPtr &  |  lResult
)
protectedvirtual
Warning
Not implemented!
 virtual ACCORE_PORT bool AcApWindow::subPreRouteMessage  |  ( |  HWND  |  hwnd,
|  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam,
|  Adesk::LongPtr &  |  lResult
)
protectedvirtual
Warning
Not implemented!
 virtual ACCORE_PORT bool AcApWindow::subRouteMessage  |  ( |  HWND  |  hwnd,
|  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam,
|  Adesk::LongPtr &  |  lResult
)
protectedvirtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcApWindow.h