Public Member Functions | List of all members
AcGiPointLightTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiPointLightTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiPointLightTraits)
 virtual bool  | hasTarget (void) const =0
 virtual void  | lampColor (AcGiColorRGB &rgbColor) const =0
 virtual void  | lightAttenuation (AcGiLightAttenuation &atten) const =0
 virtual double  | physicalIntensity () const =0
 virtual AcGePoint3d  | position () const =0
 virtual void  | setAttenuation (const AcGiLightAttenuation &atten)=0
 virtual void  | setHasTarget (bool bHasTarget)=0
 virtual void  | setLampColor (const AcGiColorRGB &rgbColor)=0
 virtual void  | setPhysicalIntensity (double physicalIntensity)=0
 virtual void  | setPosition (const AcGePoint3d &pos)=0
 virtual void  | setTargetLocation (const AcGePoint3d &loc)=0
 virtual AcGePoint3d  | targetLocation () const =0
 Public Member Functions inherited from AcGiStandardLightTraits
ACRX_DECLARE_MEMBERS (AcGiStandardLightTraits)
 virtual double  | intensity () const =0
 virtual AcCmColor  | lightColor () const =0
 virtual void  | setIntensity (double inten)=0
 virtual void  | setLightColor (const AcCmColor &color)=0
 virtual void  | setShadowParameters (const AcGiShadowParameters &params)=0
 virtual void  | shadowParameters (AcGiShadowParameters &params) const =0
 Public Member Functions inherited from AcGiLightTraits
ACRX_DECLARE_MEMBERS (AcGiLightTraits)
 virtual bool  | isOn () const =0
 virtual void  | setOn (bool on)=0
 The documentation for this class was generated from the following file:
AcGiLightTraits.h