Static Public Member Functions | List of all members
AcPointCloudExtractor Class Reference
Misc Classes
 Static Public Member Functions
static AcDbObjectIdArray  | appendLineProfile (const AcPointCloudExtractResult &profile, AcDbObjectId spaceId, AcString layer, AcCmColor color)
static AcDbObjectIdArray  | appendPolylineProfile (const AcPointCloudExtractResult &profile, AcDbObjectId spaceId, AcString layer, AcCmColor color, double polylineWidth)
static Acad::ErrorStatus  | extract (AcDbPointCloudEx *pointCloud, const AcGeVector3d &planeZDirection, const AcGeVector3d &planeXDirection, AcGePoint3d pointPlane, const ExtractOption &extractOption, AcPointCloudExtractResult &outlineResult, IPointCloudExtracProgressCallback *progress=0)
Member Function Documentation
 static AcDbObjectIdArray AcPointCloudExtractor::appendLineProfile  |  ( |  const AcPointCloudExtractResult &  |  profile,
|  AcDbObjectId  |  spaceId,
|  AcString  |  layer,
|  AcCmColor  |  color
)
static
Warning
Not implemented!
 static AcDbObjectIdArray AcPointCloudExtractor::appendPolylineProfile  |  ( |  const AcPointCloudExtractResult &  |  profile,
|  AcDbObjectId  |  spaceId,
|  AcString  |  layer,
|  AcCmColor  |  color,
|  double  |  polylineWidth
)
static
Warning
Not implemented!
 static Acad::ErrorStatus AcPointCloudExtractor::extract  |  ( |  AcDbPointCloudEx *  |  pointCloud,
|  const AcGeVector3d &  |  planeZDirection,
|  const AcGeVector3d &  |  planeXDirection,
|  AcGePoint3d  |  pointPlane,
|  const ExtractOption &  |  extractOption,
|  AcPointCloudExtractResult &  |  outlineResult,
|  IPointCloudExtracProgressCallback *  |  progress = 0
)
static
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcPointCloudExtractor.h