Public Member Functions | Static Public Attributes | List of all members
AcCmColor Class Reference
AcCm Classes
  Inheritance diagram for AcCmColor:
 Public Member Functions
AcCmColor (const AcCmColor &)
AcCmColor (const AcCmColorBase &)
 Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 virtual Adesk::UInt8  | blue () const override
 virtual const ACHAR *  | bookName (void) const override
 virtual Adesk::UInt32  | color () const override
 virtual Adesk::UInt16  | colorIndex () const override
 virtual AcCmEntityColor::ColorMethod  | colorMethod () const override
 virtual const ACHAR *  | colorName (void) const override
 virtual const ACHAR *  | colorNameForDisplay (void) override
 int  | dictionaryKeyLength (void) const
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pInputFiler)
 Acad::ErrorStatus  | dwgInAsTrueColor (AcDbDwgFiler *pInputFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pOutputFiler) const
 Acad::ErrorStatus  | dwgOutAsTrueColor (AcDbDwgFiler *pOutputFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler, int groupCodeOffset=0)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, int groupCodeOffset=0) const
 AcCmEntityColor  | entityColor (void) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getDescription (AcString &desc) const
 Acad::ErrorStatus  | getDescription (ACHAR *&desc) const
Acad::ErrorStatus  | getDictionaryKey (AcString &sKey) const
 Acad::ErrorStatus  | getDictionaryKey (ACHAR *pKey, size_t nLen) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getExplanation (AcString &expl) const
 Acad::ErrorStatus  | getExplanation (ACHAR *&expl) const
 virtual Adesk::UInt8  | green () const override
 virtual bool  | hasBookName (void) const override
 virtual bool  | hasColorName (void) const override
 virtual bool  | isByACI () const override
 virtual bool  | isByBlock () const override
 virtual bool  | isByColor () const override
 virtual bool  | isByLayer () const override
 virtual bool  | isByPen () const override
 virtual bool  | isForeground () const override
 bool  | isNone () const
 bool  | operator!= (const AcCmColor &color) const
 bool  | operator!= (const AcCmColorBase &color) const
 AcCmColor &  | operator= (const AcCmColor &inputColor)
 AcCmColor &  | operator= (const AcCmColorBase &inputColor)
 bool  | operator== (const AcCmColor &color) const
 bool  | operator== (const AcCmColorBase &color) const
 virtual Adesk::UInt16  | penIndex () const override
 virtual Adesk::UInt8  | red () const override
 Acad::ErrorStatus  | serializeIn (const void *pBuff, int *pBuflen)
 Acad::ErrorStatus  | serializeOut (void *pBuff, int *pBuflen, AcDb::AcDbDwgVersion ver=AcDb::kDHL_CURRENT) const
 virtual Acad::ErrorStatus  | setBlue (Adesk::UInt8 blue) override
 virtual Acad::ErrorStatus  | setColor (Adesk::UInt32 color) override
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 colorIndex) override
 virtual Acad::ErrorStatus  | setColorMethod (AcCmEntityColor::ColorMethod eColorMethod) override
 virtual Acad::ErrorStatus  | setGreen (Adesk::UInt8 green) override
 virtual Acad::ErrorStatus  | setNames (const ACHAR *colorName, const ACHAR *bookName=nullptr) override
 Acad::ErrorStatus  | setNamesFromDictionaryKey (const ACHAR *pKey)
 virtual Acad::ErrorStatus  | setPenIndex (Adesk::UInt16 penIndex) override
 virtual Acad::ErrorStatus  | setRed (Adesk::UInt8 red) override
 virtual Acad::ErrorStatus  | setRGB (Adesk::UInt8 red, Adesk::UInt8 green, Adesk::UInt8 blue) override
 Static Public Attributes
 static const Adesk::UInt16  | MaxColorIndex
Member Function Documentation
 ACDBCORE2D_PORT Acad::ErrorStatus AcCmColor::getDescription  |  ( |  AcString &  |  desc | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcCmColor::getDictionaryKey  |  ( |  AcString &  |  sKey | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcCmColor::getExplanation  |  ( |  AcString &  |  expl | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbmain.h