Public Member Functions | List of all members
AcEdSysVarIterator Class Reference
AcEd Classes
 Public Member Functions
ACAD_PORT  | AcEdSysVarIterator ()
ACAD_PORT bool  | done () const
ACAD_PORT const AcRxVariable *  | getSysVar ()
ACAD_PORT void  | reset ()
ACAD_PORT void  | step ()
ACAD_PORT  | ~AcEdSysVarIterator ()
Constructor & Destructor Documentation
 ACAD_PORT AcEdSysVarIterator::AcEdSysVarIterator  |  ( |   | )
Warning
Not implemented!
 ACAD_PORT AcEdSysVarIterator::~AcEdSysVarIterator  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 ACAD_PORT bool AcEdSysVarIterator::done  |  ( |   | ) |   const
Warning
Not implemented!
 ACAD_PORT const AcRxVariable* AcEdSysVarIterator::getSysVar  |  ( |   | )
Warning
Not implemented!
 ACAD_PORT void AcEdSysVarIterator::reset  |  ( |   | )
Warning
Not implemented!
 ACAD_PORT void AcEdSysVarIterator::step  |  ( |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
aced.h