Public Member Functions | List of all members
AcDbNonSubEntDynamicUCSPE Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbNonSubEntDynamicUCSPE:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcDbNonSubEntDynamicUCSPE, ACDBCORE2D_PORT)
 virtual Acad::ErrorStatus  | dehighlightPlane (AcDbEntity *Ent, void *context)=0
 virtual Acad::ErrorStatus  | getCandidatePlane (AcDbEntity *Ent, const CPoint &pt, AcGePlane &result, double &distToEdge, double &objWidth, double &objHeight, void *&context)=0
 virtual Acad::ErrorStatus  | highlightPlane (AcDbEntity *Ent, void *context)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbDynamicUCSpe.h