Public Member Functions | List of all members
AcDbXObject Class Reference
AcDb Classes
  Inheritance diagram for AcDbXObject:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbXObject)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 Acad::ErrorStatus AcDbXObject::dwgIn  |  ( |  AcDbDwgFiler *  |  pFiler | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbXObject::dwgOut  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbXObject::dxfIn  |  ( |  AcDbDxfFiler *  |  pFiler | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbXObject::dxfOut  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbmain.h