Public Types | Public Member Functions | Protected Member Functions | Friends | List of all members
AcDbAssocArrayPolarParameters Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocArrayPolarParameters:
 Public Types
enum  | Direction { kClockwise, kCounterClockwise }
enum  | GripModes {
 kCenterPointGrip = 1 << 0, kStretchRadiusGrip = 1 << 1, kRowCountGrip = 1 << 2, kRowSpacingGrip = 1 << 3,
 kUniformRowSpacingGrip = 1 << 4, kLevelCountGrip = 1 << 5, kLevelSpacingGrip = 1 << 6, kUniformLevelSpacingGrip = 1 << 7,
 kItemCountGrip = 1 << 8, kAngleBetweenItemsGrip = 1 << 9, kFillAngleGrip = 1 << 10
 }
 Public Member Functions
AcDbAssocArrayPolarParameters (double angle=15, double rowSpacing=1, double levelSpacing=1, int itemCount=1, int rowCount=1, int levelCount=1, double rowElevation=1)
ACRX_DECLARE_MEMBERS (AcDbAssocArrayPolarParameters)
double  | angleBetweenItems (AcString &expression, AcString &evaluatorId) const
double  | angleBetweenItems () const
double  | angleBetweenItems (AcString &expression) const
Direction  | direction () const
double  | fillAngle (AcString &expression, AcString &evaluatorId) const
double  | fillAngle () const
double  | fillAngle (AcString &expression) const
virtual Acad::ErrorStatus  | getItemPosition (const AcDbItemLocator &locator, AcGePoint3d &position, AcGeMatrix3d &xform) const
virtual Acad::ErrorStatus  | getItems (AcArray< AcDbAssocArrayItem * > &items) const
int  | itemCount (AcString &expression, AcString &evaluatorId) const
int  | itemCount () const
int  | itemCount (AcString &expression) const
double  | radius (AcString &expression, AcString &evaluatorId) const
double  | radius () const
double  | radius (AcString &expression) const
bool  | rotateItems () const
Acad::ErrorStatus  | setAngleBetweenItems (double angle, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setDirection (Direction direction)
Acad::ErrorStatus  | setFillAngle (double fillAngle, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setItemCount (int nItems, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRadius (double radius, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRotateItems (bool bRotateItems)
Acad::ErrorStatus  | setStartAngle (double angle, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
double  | startAngle (AcString &expression, AcString &evaluatorId) const
virtual  | ~AcDbAssocArrayPolarParameters (void)
 Public Member Functions inherited from AcDbAssocArrayCommonParameters
ACRX_DECLARE_MEMBERS (AcDbAssocArrayCommonParameters)
Acad::ErrorStatus  | getBasePlane (AcDbVertexRef &basePoint, AcGeVector3d &normal, AcDbFaceRef *pFace=NULL) const
virtual AcDbItemLocator  | getCanonicalForm (const AcDbItemLocator &locator) const
int  | levelCount (AcString &expression, AcString &evaluatorId) const
 int  | levelCount () const
int  | levelCount (AcString &expression) const
double  | levelSpacing (AcString &expression, AcString &evaluatorId) const
double  | levelSpacing () const
double  | levelSpacing (AcString &expression) const
int  | rowCount (AcString &expression, AcString &evaluatorId) const
int  | rowCount () const
int  | rowCount (AcString &expression) const
double  | rowElevation (AcString &expression, AcString &evaluatorId) const
double  | rowElevation () const
double  | rowElevation (AcString &expression) const
double  | rowSpacing (AcString &expression, AcString &evaluatorId) const
double  | rowSpacing () const
double  | rowSpacing (AcString &expression) const
Acad::ErrorStatus  | setBasePlane (const AcDbVertexRef &basePoint, const AcGeVector3d &normal, const AcDbFaceRef *pFace=NULL)
Acad::ErrorStatus  | setLevelCount (int nLevels, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setLevelSpacing (double offset, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRowCount (int nRows, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRowElevation (double elevation, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRowSpacing (double offset, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
virtual  | ~AcDbAssocArrayCommonParameters (void)
 Public Member Functions inherited from AcDbAssocArrayParameters
ACRX_DECLARE_MEMBERS (AcDbAssocArrayParameters)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
Acad::ErrorStatus  | getGeomParam (const AcString &paramName, AcDbGeomRef *&pGeomRef, AcDbObjectId &paramId) const
virtual Acad::ErrorStatus  | getGripPointAt (unsigned int mode, AcDbArrayGripAppData *&pGrip) const
virtual Acad::ErrorStatus  | getGripPoints (AcArray< AcDbArrayGripAppData * > &grips) const
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints)
Acad::ErrorStatus  | getValueParam (const AcString &paramName, AcDbEvalVariant &value, AcString &expression, AcString &evaluatorId, AcValue::UnitType &unitType) const
virtual Acad::ErrorStatus  | moveGripPointAt (const AcDbArrayGripAppData *pGrip, const AcGeVector3d &offset, int &modificationBit)
void  | ownedGeomParamNames (AcArray< AcString > &paramNames) const
void  | ownedValueParamNames (AcArray< AcString > &paramNames) const
const AcDbAssocArrayActionBody *  | owner () const
AcDbAssocArrayActionBody *  | owner ()
Acad::ErrorStatus  | setGeomParam (const AcString &paramName, const AcDbGeomRef *pGeomRef, AcDbObjectId &paramId)
Acad::ErrorStatus  | setOwner (class AcDbAssocArrayActionBody *pOwner)
Acad::ErrorStatus  | setValueParam (const AcString &paramName, const AcDbEvalVariant &value, const AcString &expression, const AcString &evaluatorId, AcString &errorMessage, AcValue::UnitType *pUnitType=NULL)
virtual  | ~AcDbAssocArrayParameters (void)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
AcDbAssocArrayPolarParameters (AcDbImpAssocArrayPolarParameters *pSelf)
 Protected Member Functions inherited from AcDbAssocArrayCommonParameters
AcDbAssocArrayCommonParameters (AcDbImpAssocArrayCommonParameters *pSelf)
 Protected Member Functions inherited from AcDbAssocArrayParameters
AcDbAssocArrayParameters (AcDbImpAssocArrayParameters *pSelf=NULL)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpAssocArrayPolarParameters
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Attributes inherited from AcDbAssocArrayParameters
 AcDbImpAssocArrayParameters *  | mpSelf
Constructor & Destructor Documentation
 AcDbAssocArrayPolarParameters::AcDbAssocArrayPolarParameters  |  ( |  double  |  angle = 15,
|  double  |  rowSpacing = 1,
|  double  |  levelSpacing = 1,
|  int  |  itemCount = 1,
|  int  |  rowCount = 1,
|  int  |  levelCount = 1,
|  double  |  rowElevation = 1
)
Warning
Not implemented!
 virtual AcDbAssocArrayPolarParameters::~AcDbAssocArrayPolarParameters  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 AcDbAssocArrayPolarParameters::AcDbAssocArrayPolarParameters  |  ( |  AcDbImpAssocArrayPolarParameters *  |  pSelf | )
explicitprotected
Warning
Not implemented!
Member Function Documentation
 double AcDbAssocArrayPolarParameters::angleBetweenItems  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 double AcDbAssocArrayPolarParameters::angleBetweenItems  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayPolarParameters::angleBetweenItems  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 Direction AcDbAssocArrayPolarParameters::direction  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbAssocArrayPolarParameters::fillAngle  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 double AcDbAssocArrayPolarParameters::fillAngle  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayPolarParameters::fillAngle  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocArrayPolarParameters::getItemPosition  |  ( |  const AcDbItemLocator &  |  locator,
|  AcGePoint3d &  |  position,
|  AcGeMatrix3d &  |  xform
) |   |  const
virtual
Warning
Not implemented!
Implements AcDbAssocArrayParameters.
 virtual Acad::ErrorStatus AcDbAssocArrayPolarParameters::getItems  |  ( |  AcArray< AcDbAssocArrayItem * > &  |  items | ) |   const
virtual
Warning
Not implemented!
Implements AcDbAssocArrayParameters.
 int AcDbAssocArrayPolarParameters::itemCount  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 int AcDbAssocArrayPolarParameters::itemCount  |  ( |   | ) |   const
inline
Warning
Not implemented!
 int AcDbAssocArrayPolarParameters::itemCount  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayPolarParameters::radius  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 double AcDbAssocArrayPolarParameters::radius  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayPolarParameters::radius  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 bool AcDbAssocArrayPolarParameters::rotateItems  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPolarParameters::setAngleBetweenItems  |  ( |  double  |  angle,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPolarParameters::setDirection  |  ( |  Direction  |  direction | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPolarParameters::setFillAngle  |  ( |  double  |  fillAngle,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPolarParameters::setItemCount  |  ( |  int  |  nItems,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPolarParameters::setRadius  |  ( |  double  |  radius,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPolarParameters::setRotateItems  |  ( |  bool  |  bRotateItems | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPolarParameters::setStartAngle  |  ( |  double  |  angle,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 double AcDbAssocArrayPolarParameters::startAngle  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocArrayPolarParameters.h