Public Member Functions | List of all members
AcGeBoundBlock2d Class Reference
AcGe Classes
  Inheritance diagram for AcGeBoundBlock2d:
 Public Member Functions
AcGeBoundBlock2d (const AcGePoint2d &point1, const AcGePoint2d &point2)
AcGeBoundBlock2d (const AcGePoint2d &base, const AcGeVector2d &dir1, const AcGeVector2d &dir2)
AcGeBoundBlock2d (const AcGeBoundBlock2d &block)
 Adesk::Boolean  | contains (const AcGePoint2d &point) const
 AcGeBoundBlock2d &  | extend (const AcGePoint2d &point)
 void  | get (AcGePoint2d &base, AcGeVector2d &dir1, AcGeVector2d &dir2) const
 void  | getMinMaxPoints (AcGePoint2d &point1, AcGePoint2d &point2) const
 Adesk::Boolean  | isBox () const
 Adesk::Boolean  | isDisjoint (const AcGeBoundBlock2d &block) const
 AcGeBoundBlock2d &  | operator= (const AcGeBoundBlock2d &block)
 AcGeBoundBlock2d &  | set (const AcGePoint2d &point1, const AcGePoint2d &point2)
 AcGeBoundBlock2d &  | set (const AcGePoint2d &base, const AcGeVector2d &dir1, const AcGeVector2d &dir2)
 AcGeBoundBlock2d &  | setToBox (Adesk::Boolean)
 AcGeBoundBlock2d &  | swell (double distance)
 Public Member Functions inherited from AcGeEntity2d
 AcGeEntity2d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity2d &entity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity2d &  | mirror (const AcGeLine2d &line)
 Adesk::Boolean  | operator!= (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | operator= (const AcGeEntity2d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | rotateBy (double angle, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | scaleBy (double scaleFactor, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | transformBy (const AcGeMatrix2d &xfm)
 AcGeEntity2d &  | translateBy (const AcGeVector2d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeEntity2d
AcGeEntity2d (const AcGeEntity2d &)
AcGeEntity2d (AcGeImpEntity3d &, int)
AcGeEntity2d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 Protected Attributes inherited from AcGeEntity2d
 int  | mDelEnt
 class AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
geblok2d.h