Public Member Functions | Static Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcGiDrawStream Class Reference
AcGi Classes
  Inheritance diagram for AcGiDrawStream:
 Public Member Functions
AcGiDrawStream ()
AcGiDrawStream (const AcGiDrawable *pOwner)
ACRX_DECLARE_MEMBERS (AcGiDrawStream)
virtual bool  | bounds (AcDbExtents &bounds) const ADESK_OVERRIDE
virtual AcGiDrawable::DrawableType  | drawableType () const ADESK_OVERRIDE
virtual AcGiDrawStream *  | drawStream () const ADESK_OVERRIDE
AcGiDrawable *  | getOwner () const
virtual AcDbObjectId  | id () const ADESK_OVERRIDE
virtual Adesk::Boolean  | isPersistent () const ADESK_OVERRIDE
bool  | isValid () const
bool  | serializeIn (IAcReadStream *pInput, AcDbDatabase *pDb=NULL)
bool  | serializeOut (IAcWriteStream *pOutput) const
virtual void  | setDrawStream (AcGiDrawStream *pStream) ADESK_OVERRIDE
void  | setOwner (const AcGiDrawable *pOwner)
~AcGiDrawStream ()
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static bool  | build (const AcArray< AcGiDrawStream * > &streamArray, GraphicsUpdateProc lpFunc)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) ADESK_OVERRIDE
virtual void  | subViewportDraw (AcGiViewportDraw *pVd) ADESK_OVERRIDE
virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *pVd) ADESK_OVERRIDE
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) ADESK_OVERRIDE
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Protected Attributes
 AcGiDrawStreamImp *  | m_pImp
 Friends
 class  | AcGiDrawStreamImp
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
Constructor & Destructor Documentation
 AcGiDrawStream::AcGiDrawStream  |  ( |   | )
Warning
Not implemented!
 AcGiDrawStream::AcGiDrawStream  |  ( |  const AcGiDrawable *  |  pOwner | )
Warning
Not implemented!
 AcGiDrawStream::~AcGiDrawStream  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 virtual bool AcGiDrawStream::bounds  |  ( |  AcDbExtents &  |  bounds | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcGiDrawable.
 static bool AcGiDrawStream::build  |  ( |  const AcArray< AcGiDrawStream * > &  |  streamArray,
|  GraphicsUpdateProc  |  lpFunc
)
static
Warning
Not implemented!
 virtual AcGiDrawable::DrawableType AcGiDrawStream::drawableType  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcGiDrawable.
 virtual AcGiDrawStream* AcGiDrawStream::drawStream  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcGiDrawable.
 AcGiDrawable* AcGiDrawStream::getOwner  |  ( |   | ) |   const
Warning
Not implemented!
 virtual AcDbObjectId AcGiDrawStream::id  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcGiDrawable.
 virtual Adesk::Boolean AcGiDrawStream::isPersistent  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcGiDrawable.
 bool AcGiDrawStream::isValid  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcGiDrawStream::serializeIn  |  ( |  IAcReadStream *  |  pInput,
|  AcDbDatabase *  |  pDb = NULL
)
Warning
Not implemented!
 bool AcGiDrawStream::serializeOut  |  ( |  IAcWriteStream *  |  pOutput | ) |   const
Warning
Not implemented!
 virtual void AcGiDrawStream::setDrawStream  |  ( |  AcGiDrawStream *  |  pStream | )
virtual
Warning
Not implemented!
Reimplemented from AcGiDrawable.
 void AcGiDrawStream::setOwner  |  ( |  const AcGiDrawable *  |  pOwner | )
Warning
Not implemented!
 virtual Adesk::UInt32 AcGiDrawStream::subSetAttributes  |  ( |  AcGiDrawableTraits *  |  pTraits | )
protectedvirtual
Warning
Not implemented!
Implements AcGiDrawable.
 virtual void AcGiDrawStream::subViewportDraw  |  ( |  AcGiViewportDraw *  |  pVd | )
protectedvirtual
Warning
Not implemented!
Implements AcGiDrawable.
 virtual Adesk::UInt32 AcGiDrawStream::subViewportDrawLogicalFlags  |  ( |  AcGiViewportDraw *  |  pVd | )
protectedvirtual
Warning
Not implemented!
Reimplemented from AcGiDrawable.
 virtual Adesk::Boolean AcGiDrawStream::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pWd | )
protectedvirtual
Warning
Not implemented!
Implements AcGiDrawable.
 The documentation for this class was generated from the following file:
acgidrawstream.h