Public Member Functions | List of all members
AcConstrained2PointsConstructionLine Class Reference
AcDb Classes
  Inheritance diagram for AcConstrained2PointsConstructionLine:
 Public Member Functions
AcConstrained2PointsConstructionLine (bool bCreateImp=true)
AcConstrained2PointsConstructionLine (const AcGePoint3d &point1, const AcGePoint3d &point2)
ACRX_DECLARE_MEMBERS (AcConstrained2PointsConstructionLine)
 Public Member Functions inherited from AcConstrainedConstructionLine
ACRX_DECLARE_MEMBERS (AcConstrainedConstructionLine)
 Public Member Functions inherited from AcConstrainedLine
AcConstrainedLine (bool bCreateImp=true)
AcConstrainedLine (AcDbObjectId geomDependencyId)
ACRX_DECLARE_MEMBERS (AcConstrainedLine)
AcGeVector3d  | direction () const
AcGePoint3d  | pointOnLine () const
 Public Member Functions inherited from AcConstrainedCurve
ACRX_DECLARE_MEMBERS (AcConstrainedCurve)
virtual void  | getConstrainedImplicitPoints (AcArray< AcConstrainedImplicitPoint * > &apImplicitPoints) const
virtual bool  | isBounded () const
 Public Member Functions inherited from AcConstrainedGeometry
ACRX_DECLARE_MEMBERS (AcConstrainedGeometry)
AcDbObjectId  | geomDependencyId () const
Acad::ErrorStatus  | getCommonConstraints (AcConstrainedGeometry *pOtherConsGeom, AcArray< AcGeomConstraint * > &apConstraints) const
Acad::ErrorStatus  | getConnectedConstraints (AcArray< AcGeomConstraint * > &apConstraints) const
Acad::ErrorStatus  | getConnectedGeometries (AcArray< AcConstrainedGeometry * > &apConsGeoms) const
Acad::ErrorStatus  | getFullSubentPaths (AcDbFullSubentPathArray &subentPaths) const
AcConstrainedRigidSet *  | getOwningRigidSet () const
virtual bool  | isReadOnly () const
 Public Member Functions inherited from AcConstraintGroupNode
ACRX_DECLARE_MEMBERS (AcConstraintGroupNode)
AcDbObjectId  | owningConstraintGroupId () const
virtual  | ~AcConstraintGroupNode ()
 Public Member Functions inherited from AcGraphNode
ACRX_DECLARE_MEMBERS (AcGraphNode)
virtual void  | backup ()
Acad::ErrorStatus  | connectNode (AcGraphNode *pNode)
Acad::ErrorStatus  | disconnectAllNodes ()
Acad::ErrorStatus  | disconnectNode (AcGraphNode *pNode)
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Acad::ErrorStatus  | getAdjacentNodes (AcArray< AcGraphNode * > &adjacentNodes) const
bool  | isAdjacentTo (AcGraphNode *pNode) const
Id  | nodeId () const
virtual Acad::ErrorStatus  | nodeToBeConnectedNotification (AcGraphNode *pNode)
virtual Acad::ErrorStatus  | nodeToBeDisconnectedNotification (AcGraphNode *pNode)
virtual Acad::ErrorStatus  | nodeToBeMovedNotification (AcGraph *pGraph, AcArray< AcGraphNode * > &otherNodesToMove)
AcGraph *  | owningGraph () const
virtual  | ~AcGraphNode ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcGraphNode
enum  | { kNullId = 0 }
 typedef Adesk::UInt32  | Id
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Protected Member Functions inherited from AcConstrainedConstructionLine
AcConstrainedConstructionLine ()
 Protected Member Functions inherited from AcConstrainedGeometry
AcConstrainedGeometry ()
 Protected Member Functions inherited from AcConstraintGroupNode
AcConstraintGroupNode ()
 Protected Member Functions inherited from AcGraphNode
AcGraphNode (bool bCreateImp=true)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Protected Attributes inherited from AcGraphNode
 AcImpGraphNode *  | mpImpGraphNode
Constructor & Destructor Documentation
 AcConstrained2PointsConstructionLine::AcConstrained2PointsConstructionLine  |  ( |  bool  |  bCreateImp = true | )
explicit
Warning
Not implemented!
 AcConstrained2PointsConstructionLine::AcConstrained2PointsConstructionLine  |  ( |  const AcGePoint3d &  |  point1,
|  const AcGePoint3d &  |  point2
)
explicit
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcConstrainedGeometry.h