Public Member Functions | List of all members
AcPlPlotConfigInfo Class Reference
AcPl Classes
  Inheritance diagram for AcPlPlotConfigInfo:
 Public Member Functions
ACPL_DECLARE_MEMBERS (AcPlPlotConfigInfo)
 ACPL_PORT  | AcPlPlotConfigInfo (const ACHAR *pDevName, const ACHAR *pFullPath, DeviceType devType)
 ACPL_PORT  | AcPlPlotConfigInfo (const AcPlPlotConfigInfo &copy)
 ACPL_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
ACPL_PORT const ACHAR *  | deviceId () const
 ACPL_PORT const ACHAR *  | deviceName () const
 ACPL_PORT DeviceType  | deviceType () const
 ACPL_PORT const ACHAR *  | fullPath () const
 ACPL_PORT const AcPlPlotConfigInfo &  | operator= (const AcPlPlotConfigInfo &src)
ACPL_PORT void  | setDeviceId (const ACHAR *pDevId)
 ACPL_PORT void  | setDeviceName (const ACHAR *pDevName)
 ACPL_PORT void  | setDeviceType (DeviceType devType)
 ACPL_PORT void  | setFullPath (const ACHAR *pPath)
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 ACPL_PORT const ACHAR* AcPlPlotConfigInfo::deviceId  |  ( |   | ) |   const
Warning
Not implemented!
 ACPL_PORT void AcPlPlotConfigInfo::setDeviceId  |  ( |  const ACHAR *  |  pDevId | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acplplotconfigmgr.h