Public Member Functions | Protected Member Functions | Friends | List of all members
AcGiContext Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiContext:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiContext)
 virtual AcDb::LineWeight  | byBlockLineWeight () const
 virtual AcDbObjectId  | byBlockMaterialId () const
 virtual AcDbObjectId  | byBlockPlotStyleNameId () const
 virtual AcDbDatabase *  | database () const =0
 virtual void  | disableFastMoveDrag () const
 virtual AcCmEntityColor  | effectiveColor () const
 virtual const AcGiContextImp *  | getConstImpPtr () const
 virtual AcGiContextImp *  | getImpPtr ()
 virtual class AcGiGraphicsKernel &  | graphicsKernel ()
 virtual bool  | isBoundaryClipping () const =0
 virtual bool  | isNesting () const
 virtual Adesk::Boolean  | isPlotGeneration () const =0
 virtual Adesk::Boolean  | isPsOut () const =0
 virtual Adesk::Boolean  | supportsFastRenderBuffer () const
 virtual bool  | supportsFillTrait () const
 virtual Adesk::Boolean  | supportsNativePointCloudRender () const
 virtual bool  | supportsOwnerDraw ()
 virtual bool  | supportsTrueTypeText ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual void  | bypassHiddenLineRemoval ()
 virtual int  | drawTrueTypeText (const ACHAR *, double, int, bool, const TextParams &, Charset)
 virtual int  | getTrueTypeBoundingBox (AcGePoint3d const &, const wchar_t *, int, TextParams const *, AcGePoint3d *, float *)
 virtual int  | getTrueTypeTextExtents (ACHAR const *, Charset, double, int, int, int, short, short, double, double, AcGePoint2d &, AcGePoint2d &)
 virtual AcFontHandle *  | loadTrueTypeFont (const ACHAR *, bool, bool, Charset, int, FontInfo &)
 virtual int  | restoreTrueTypeTransform ()
 virtual int  | setTextStyle (int)
 virtual int  | setTrueTypeTransform (const AcGePoint3d &, const AcGeVector3d &, double, double, double, bool, bool)
 virtual AcGiWorldSegmentCallback  | wSegTaker () const
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpText
 class  | AcGiTextHook
 class  | CShFont
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acgi.h