Public Member Functions | List of all members
AcDbAssocEdgePersSubentId Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocEdgePersSubentId:
 Public Member Functions
AcDbAssocEdgePersSubentId ()
AcDbAssocEdgePersSubentId (int vertexIdentifier1, int vertexIdentifier2)
AcDbAssocEdgePersSubentId (int vertexIdentifier1, int vertexIdentifier2, bool isSegArcCenter, bool isSegMidpoint)
ACRX_DECLARE_MEMBERS (AcDbAssocEdgePersSubentId)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo) override
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) override
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const override
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) override
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const override
int  | index1 () const
int  | index2 () const
virtual bool  | isEqualTo (const AcDbEntity *pEntity, AcDbDatabase *pDatabase, const AcDbAssocPersSubentId *pOther) const override
 virtual bool  | isNull () const override
bool  | isSegmentArcCenter () const
bool  | isSegmentMidpoint () const
virtual AcDb::SubentType  | subentType (const AcDbEntity *pEntity, AcDbDatabase *pDatabase) const override
 virtual int  | transientSubentCount (const AcDbEntity *pEntity, AcDbDatabase *pDatabase) const override
 Public Member Functions inherited from AcDbAssocPersSubentId
ACRX_DECLARE_MEMBERS (AcDbAssocPersSubentId)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSource) override
virtual Acad::ErrorStatus  | getTransientSubentIds (const AcDbEntity *pEntity, AcDbDatabase *pDatabase, AcArray< AcDbSubentId > &subents) const
virtual Acad::ErrorStatus  | mirror (const AcDbEntity *pMirroredEntity, AcDbDatabase *pDatabase)
virtual Acad::ErrorStatus  | release (AcDbEntity *pEntity, AcDbDatabase *pDatabase) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcDbAssocPersSubentId
static Acad::ErrorStatus  | createObjectAndDwgInFields (AcDbDatabase *pDatabase, AcDbDwgFiler *pFiler, AcDbAssocPersSubentId *&pCreatedPersSubentId)
static Acad::ErrorStatus  | createObjectAndDxfInFields (AcDbDxfFiler *pFiler, AcDbAssocPersSubentId *&pCreatedPersSubentId)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbAssocEdgePersSubentId::AcDbAssocEdgePersSubentId  |  ( |   | )
Warning
Not implemented!
 AcDbAssocEdgePersSubentId::AcDbAssocEdgePersSubentId  |  ( |  int  |  vertexIdentifier1,
|  int  |  vertexIdentifier2
)
explicit
Warning
Not implemented!
 AcDbAssocEdgePersSubentId::AcDbAssocEdgePersSubentId  |  ( |  int  |  vertexIdentifier1,
|  int  |  vertexIdentifier2,
|  bool  |  isSegArcCenter,
|  bool  |  isSegMidpoint
)
explicit
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbAssocEdgePersSubentId::audit  |  ( |  AcDbAuditInfo *  |  pAuditInfo | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocEdgePersSubentId::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocEdgePersSubentId::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocEdgePersSubentId::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocEdgePersSubentId::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
 int AcDbAssocEdgePersSubentId::index1  |  ( |   | ) |   const
Warning
Not implemented!
 int AcDbAssocEdgePersSubentId::index2  |  ( |   | ) |   const
Warning
Not implemented!
 virtual bool AcDbAssocEdgePersSubentId::isEqualTo  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDbDatabase *  |  pDatabase,
|  const AcDbAssocPersSubentId *  |  pOther
) |   |  const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
 bool AcDbAssocEdgePersSubentId::isSegmentArcCenter  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbAssocEdgePersSubentId::isSegmentMidpoint  |  ( |   | ) |   const
Warning
Not implemented!
 virtual AcDb::SubentType AcDbAssocEdgePersSubentId::subentType  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDbDatabase *  |  pDatabase
) |   |  const
overridevirtual
Warning
Not implemented!
Implements AcDbAssocPersSubentId.
 The documentation for this class was generated from the following file:
AcDbAssocEdgePersSubentId.h