Public Member Functions | List of all members
AcGePosition3d Class Reference
AcGe Classes
  Inheritance diagram for AcGePosition3d:
 Public Member Functions
AcGePosition3d (const AcGePoint3d &pnt)
AcGePosition3d (double x, double y, double z)
AcGePosition3d (const AcGePosition3d &pos)
AcGePosition3d &  | operator= (const AcGePosition3d &pos)
 AcGePosition3d &  | set (const AcGePoint3d &)
 AcGePosition3d &  | set (double x, double y, double z)
 Public Member Functions inherited from AcGePointEnt3d
operator AcGePoint3d () const
 AcGePointEnt3d &  | operator= (const AcGePointEnt3d &pnt)
 AcGePoint3d  | point3d () const
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGePointEnt3d
AcGePointEnt3d (const AcGePointEnt3d &)
 Protected Member Functions inherited from AcGeEntity3d
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 class AcGeImpEntity3d *  | mpImpEnt
Member Function Documentation
 AcGePosition3d& AcGePosition3d::operator=  |  ( |  const AcGePosition3d &  |  pos | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
gepos3d.h