Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcDbAssocArrayParameters Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbAssocArrayParameters:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbAssocArrayParameters)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcDbItemLocator  | getCanonicalForm (const AcDbItemLocator &locator) const =0
Acad::ErrorStatus  | getGeomParam (const AcString &paramName, AcDbGeomRef *&pGeomRef, AcDbObjectId &paramId) const
virtual Acad::ErrorStatus  | getGripPointAt (unsigned int mode, AcDbArrayGripAppData *&pGrip) const
virtual Acad::ErrorStatus  | getGripPoints (AcArray< AcDbArrayGripAppData * > &grips) const
 virtual Acad::ErrorStatus  | getItemPosition (const AcDbItemLocator &locator, AcGePoint3d &position, AcGeMatrix3d &xform) const =0
 virtual Acad::ErrorStatus  | getItems (AcArray< AcDbAssocArrayItem * > &items) const =0
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints)
Acad::ErrorStatus  | getValueParam (const AcString &paramName, AcDbEvalVariant &value, AcString &expression, AcString &evaluatorId, AcValue::UnitType &unitType) const
virtual Acad::ErrorStatus  | moveGripPointAt (const AcDbArrayGripAppData *pGrip, const AcGeVector3d &offset, int &modificationBit)
void  | ownedGeomParamNames (AcArray< AcString > &paramNames) const
void  | ownedValueParamNames (AcArray< AcString > &paramNames) const
const AcDbAssocArrayActionBody *  | owner () const
AcDbAssocArrayActionBody *  | owner ()
Acad::ErrorStatus  | setGeomParam (const AcString &paramName, const AcDbGeomRef *pGeomRef, AcDbObjectId &paramId)
Acad::ErrorStatus  | setOwner (class AcDbAssocArrayActionBody *pOwner)
Acad::ErrorStatus  | setValueParam (const AcString &paramName, const AcDbEvalVariant &value, const AcString &expression, const AcString &evaluatorId, AcString &errorMessage, AcValue::UnitType *pUnitType=NULL)
virtual  | ~AcDbAssocArrayParameters (void)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
AcDbAssocArrayParameters (AcDbImpAssocArrayParameters *pSelf=NULL)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Protected Attributes
 AcDbImpAssocArrayParameters *  | mpSelf
 Friends
 class  | AcDbImpAssocArrayParameters
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
Constructor & Destructor Documentation
 virtual AcDbAssocArrayParameters::~AcDbAssocArrayParameters  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 AcDbAssocArrayParameters::AcDbAssocArrayParameters  |  ( |  AcDbImpAssocArrayParameters *  |  pSelf = NULL | )
explicitprotected
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbAssocArrayParameters::copyFrom  |  ( |  const AcRxObject *  |  other | )
virtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 Acad::ErrorStatus AcDbAssocArrayParameters::getGeomParam  |  ( |  const AcString &  |  paramName,
|  AcDbGeomRef *&  |  pGeomRef,
|  AcDbObjectId &  |  paramId
) |   |  const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocArrayParameters::getGripPointAt  |  ( |  unsigned int  |  mode,
|  AcDbArrayGripAppData *&  |  pGrip
) |   |  const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocArrayParameters::getGripPoints  |  ( |  AcArray< AcDbArrayGripAppData * > &  |  grips | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocArrayParameters::getStretchPoints  |  ( |  AcGePoint3dArray &  |  stretchPoints | )
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayParameters::getValueParam  |  ( |  const AcString &  |  paramName,
|  AcDbEvalVariant &  |  value,
|  AcString &  |  expression,
|  AcString &  |  evaluatorId,
|  AcValue::UnitType &  |  unitType
) |   |  const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocArrayParameters::moveGripPointAt  |  ( |  const AcDbArrayGripAppData *  |  pGrip,
|  const AcGeVector3d &  |  offset,
|  int &  |  modificationBit
)
virtual
Warning
Not implemented!
 void AcDbAssocArrayParameters::ownedGeomParamNames  |  ( |  AcArray< AcString > &  |  paramNames | ) |   const
Warning
Not implemented!
 void AcDbAssocArrayParameters::ownedValueParamNames  |  ( |  AcArray< AcString > &  |  paramNames | ) |   const
Warning
Not implemented!
 const AcDbAssocArrayActionBody* AcDbAssocArrayParameters::owner  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbAssocArrayActionBody* AcDbAssocArrayParameters::owner  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayParameters::setGeomParam  |  ( |  const AcString &  |  paramName,
|  const AcDbGeomRef *  |  pGeomRef,
|  AcDbObjectId &  |  paramId
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayParameters::setOwner  |  ( |  class AcDbAssocArrayActionBody *  |  pOwner | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayParameters::setValueParam  |  ( |  const AcString &  |  paramName,
|  const AcDbEvalVariant &  |  value,
|  const AcString &  |  expression,
|  const AcString &  |  evaluatorId,
|  AcString &  |  errorMessage,
|  AcValue::UnitType *  |  pUnitType = NULL
)
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocArrayParameters.h