Public Member Functions | List of all members
AcDbCustomOsnapMode2 Class Reference
AcDb Classes
  Inheritance diagram for AcDbCustomOsnapMode2:
 Public Member Functions
 virtual const ACHAR *  | displayString ()
 virtual HICON  | menuIcon ()
 virtual HICON  | menuIconForDarkTheme ()
 Public Member Functions inherited from AcDbCustomOsnapMode
 virtual const AcRxClass *  | entityOsnapClass () const =0
 virtual const ACHAR *  | globalModeString () const =0
 virtual AcGiGlyph *  | glyph () const =0
 virtual const ACHAR *  | localModeString () const =0
 virtual const ACHAR *  | tooltipString () const =0
 The documentation for this class was generated from the following file:
dbosnap2.h