Public Member Functions | List of all members
AcPublishSheetInfo Class Referenceabstract
AcPublish Classes
 Public Member Functions
 virtual const AcPlDSDEntry *  | GetDSDEntry ()=0
 virtual AcPlPlotLogger *  | GetPlotLogger ()=0
 virtual const ACHAR *  | GetUniqueId ()=0
 The documentation for this class was generated from the following file:
AcPublishReactors.h