Public Member Functions | List of all members
AcGiLightTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiLightTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiLightTraits)
 virtual bool  | isOn () const =0
 virtual void  | setOn (bool on)=0
 The documentation for this class was generated from the following file:
AcGiLightTraits.h