Public Types | Public Member Functions | Protected Attributes | List of all members
AcadAppInfo Class Reference
Misc Classes
  Inheritance diagram for AcadAppInfo:
 Public Types
enum  | CmdStatus { kNoAction = 0, kRetry = 1, kShowMsg = 2, kNoModule = 3 }
 typedef AcadAppInfo::CmdStatus(*  | LoaderFunPtr) (void *)
enum  | MgdType { kUnManaged = 0, kManaged = 1, kJavaScript = 2 }
enum  | ReadFlags { kNone = 0, kSkipFindFileForModuleName = 1 }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcadAppInfo)
 const ACHAR *  | appDesc () const
 bool  | appImplements (const ACHAR *) const
 const ACHAR *  | appName () const
 ACDBCORE2D_PORT AcadApp::ErrorStatus  | delFromRegistry ()
 ACDBCORE2D_PORT AcadApp::LoadReasons  | loadReason () const
 AcadAppInfo::MgdType  | managed () const
 const ACHAR *  | moduleName () const
 AcadApp::ErrorStatus  | readFromRegistry ()
 ACDBCORE2D_PORT AcadApp::ErrorStatus  | readFromRegistry (ReadFlags flags)
 AcadAppInfo::CmdStatus  | runAppLoader ()
 void  | setAppDesc (const ACHAR *)
 void  | setAppLoader (LoaderFunPtr)
 void  | setAppName (const ACHAR *)
 void  | setLoadReason (AcadApp::LoadReasons)
 void  | setManaged (AcadAppInfo::MgdType mgdType)
 void  | setModuleName (const ACHAR *)
 AcadApp::ErrorStatus  | status () const
 AcadApp::ErrorStatus  | writeCommandNameToRegistry (const ACHAR *globalCmdName, const ACHAR *localCmdName)
 AcadApp::ErrorStatus  | writeGroupNameToRegistry (const ACHAR *group)
 ACDB_PORT AcadApp::ErrorStatus  | writeToRegistry ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Attributes
 AcadAppInfoImp *  | mpImp
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
appinfo.h