Public Types | Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
AcDbSectionViewStyle Class Reference
AcDb Classes
  Inheritance diagram for AcDbSectionViewStyle:
 Public Types
enum  | ArrowDirection { kTowardsCuttingPlane = 0, kAwayFromCuttingPlane = 1 }
enum  | IdentifierPosition {
 kEndCuttingPlane = 0, kAboveDirectionArrowLine = 1, kAboveDirectionArrowSymbol = 2, kStartDirectionArrow = 3,
 kEndDirectionArrow = 4
 }
 Public Types inherited from AcDbModelDocViewStyle
enum  | AttachmentPoint { kAboveView = 0, kBelowView = 1 }
enum  | TextAlignment { kTextAlignmentLeft = 0, kTextAlignmentCenter = 1, kTextAlignmentRight = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbSectionViewStyle)
AcDbSectionViewStyle ()
AcDbObjectId  | arrowEndSymbolId () const
AcDbSectionViewStyle::ArrowDirection  | arrowPosition () const
AcDbObjectId  | arrowStartSymbolId () const
AcCmColor  | arrowSymbolColor () const
double  | arrowSymbolExtensionLength () const
double  | arrowSymbolSize () const
AcCmColor  | bendLineColor () const
double  | bendLineLength () const
AcDbObjectId  | bendLineTypeId () const
AcDb::LineWeight  | bendLineWeight () const
double  | endLineLength () const
double  | endLineOvershoot () const
Acad::ErrorStatus  | getViewLabelPattern (AcString &pattern, AcDbField *pField=NULL) const
const AcArray< double > &  | hatchAngles () const
AcCmColor  | hatchBackgroundColor () const
AcCmColor  | hatchColor () const
const ACHAR *  | hatchPattern () const
double  | hatchScale () const
AcCmTransparency  | hatchTransparency () const
AcCmColor  | identifierColor () const
const ACHAR *  | identifierExcludeCharacters () const
double  | identifierHeight () const
AcDbObjectId  | identifierStyleId () const
bool  | isContinuousLabeling () const
AcCmColor  | planeLineColor () const
AcDbObjectId  | planeLineTypeId () const
AcDb::LineWeight  | planeLineWeight () const
Acad::ErrorStatus  | setArrowEndSymbolId (const AcDbObjectId &arrowSymbolId)
Acad::ErrorStatus  | setArrowPosition (AcDbSectionViewStyle::ArrowDirection type)
Acad::ErrorStatus  | setArrowStartSymbolId (const AcDbObjectId &arrowSymbolId)
Acad::ErrorStatus  | setArrowSymbolColor (const AcCmColor &color)
Acad::ErrorStatus  | setArrowSymbolExtensionLength (double length)
Acad::ErrorStatus  | setArrowSymbolSize (double size)
Acad::ErrorStatus  | setBendLineColor (const AcCmColor &color)
Acad::ErrorStatus  | setBendLineLength (double length)
Acad::ErrorStatus  | setBendLineTypeId (const AcDbObjectId &objId)
Acad::ErrorStatus  | setBendLineWeight (AcDb::LineWeight lineweight)
Acad::ErrorStatus  | setContinuousLabeling (bool bValue)
Acad::ErrorStatus  | setEndLineLength (double length)
Acad::ErrorStatus  | setEndLineOvershoot (double length)
Acad::ErrorStatus  | setHatchAngles (const AcArray< double > &angleArray)
Acad::ErrorStatus  | setHatchBackgroundColor (const AcCmColor &color)
Acad::ErrorStatus  | setHatchColor (const AcCmColor &color)
Acad::ErrorStatus  | setHatchPattern (const ACHAR *pattern)
Acad::ErrorStatus  | setHatchScale (double scale)
Acad::ErrorStatus  | setHatchTransparency (const AcCmTransparency &transparency)
Acad::ErrorStatus  | setIdentifierColor (const AcCmColor &color)
Acad::ErrorStatus  | setIdentifierExcludeCharacters (const ACHAR *str)
Acad::ErrorStatus  | setIdentifierHeight (double height)
Acad::ErrorStatus  | setIdentifierStyleId (const AcDbObjectId &objId)
Acad::ErrorStatus  | setPlaneLineColor (const AcCmColor &color)
Acad::ErrorStatus  | setPlaneLineTypeId (const AcDbObjectId &objId)
Acad::ErrorStatus  | setPlaneLineWeight (AcDb::LineWeight lineweight)
Acad::ErrorStatus  | setShowAllBendIndentifiers (bool bValue)
Acad::ErrorStatus  | setShowAllPlaneLines (bool bValue)
Acad::ErrorStatus  | setShowArrowheads (bool bValue)
Acad::ErrorStatus  | setShowEndAndBendLines (bool bValue)
Acad::ErrorStatus  | setShowHatching (bool bValue)
Acad::ErrorStatus  | setShowViewLabel (bool bValue)
Acad::ErrorStatus  | setViewIdentifierOffset (double offset)
Acad::ErrorStatus  | setViewIdentifierPosition (AcDbSectionViewStyle::IdentifierPosition type)
Acad::ErrorStatus  | setViewLabelAlignment (AcDbModelDocViewStyle::TextAlignment alignment)
Acad::ErrorStatus  | setViewLabelAttachment (AcDbModelDocViewStyle::AttachmentPoint attachment)
Acad::ErrorStatus  | setViewLabelOffset (double offset)
Acad::ErrorStatus  | setViewLabelPattern (const ACHAR *pattern, const AcDbField *pField=NULL)
Acad::ErrorStatus  | setViewLabelTextColor (const AcCmColor &color)
Acad::ErrorStatus  | setViewLabelTextHeight (double height)
Acad::ErrorStatus  | setViewLabelTextStyleId (const AcDbObjectId &objId)
bool  | showAllBendIndentifiers () const
bool  | showAllPlaneLines () const
bool  | showArrowheads () const
bool  | showEndAndBendLines () const
bool  | showHatching () const
bool  | showViewLabel () const
double  | viewIdentifierOffset () const
AcDbSectionViewStyle::IdentifierPosition  | viewIdentifierPosition () const
AcDbModelDocViewStyle::TextAlignment  | viewLabelAlignment () const
AcDbModelDocViewStyle::AttachmentPoint  | viewLabelAttachment () const
double  | viewLabelOffset () const
const ACHAR *  | viewLabelPattern () const
AcCmColor  | viewLabelTextColor () const
double  | viewLabelTextHeight () const
AcDbObjectId  | viewLabelTextStyleId () const
~AcDbSectionViewStyle ()
 Public Member Functions inherited from AcDbModelDocViewStyle
ACDB_DECLARE_MEMBERS (AcDbModelDocViewStyle)
AcString  | defaultViewName (int index) const
virtual const ACHAR *  | description (void) const
virtual void  | getDescription (AcString &strDescription) const
virtual Acad::ErrorStatus  | getName (ACHAR *&pszName) const final
virtual Acad::ErrorStatus  | getName (AcString &strName) const
bool  | isModifiedForRecompute () const
bool  | isViewNameValid (const ACHAR *pName) const
Acad::ErrorStatus  | postViewStyleToDb (AcDbDatabase *pDb, const ACHAR *styleName, AcDbObjectId &viewStyleId)
void  | setDatabaseDefaults (AcDbDatabase *pDb)
virtual Acad::ErrorStatus  | setDescription (const ACHAR *pszDescription)
virtual Acad::ErrorStatus  | setName (const ACHAR *pszName)
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static bool  | validateIdentifierExcludeCharacters (const ACHAR *str)
 Static Public Member Functions inherited from AcDbModelDocViewStyle
static AcGePoint3d  | calculateViewLabelPosition (AcGeVector2d &offsetVector, AcDbMText::AttachmentPoint &textAlignment, AcDbModelDocViewStyle::AttachmentPoint attachment, double offset, const AcGePoint3d &minPt, const AcGePoint3d &maxPt)
static AcGeVector2d  | setViewLabelPosition (AcDbMText *pMText, AcDbModelDocViewStyle::AttachmentPoint attachment, double offset, const AcGePoint3d &minPt, const AcGePoint3d &maxPt)
static AcGeVector2d  | updateViewLabelPosition (AcDbMText *pMText, AcDbModelDocViewStyle::AttachmentPoint &attachment, const AcGePoint3d &minPt, const AcGePoint3d &maxPt)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Protected Member Functions
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwner, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const override
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwner, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const override
 Protected Member Functions inherited from AcDbModelDocViewStyle
AcDbModelDocViewStyle ()
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbSectionViewStyle::AcDbSectionViewStyle  |  ( |   | )
Warning
Not implemented!
 AcDbSectionViewStyle::~AcDbSectionViewStyle  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 AcDbObjectId AcDbSectionViewStyle::arrowEndSymbolId  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbSectionViewStyle::ArrowDirection AcDbSectionViewStyle::arrowPosition  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbSectionViewStyle::arrowStartSymbolId  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcDbSectionViewStyle::arrowSymbolColor  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbSectionViewStyle::arrowSymbolExtensionLength  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbSectionViewStyle::arrowSymbolSize  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcDbSectionViewStyle::bendLineColor  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbSectionViewStyle::bendLineLength  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbSectionViewStyle::bendLineTypeId  |  ( |   | ) |   const
Warning
Not implemented!
 AcDb::LineWeight AcDbSectionViewStyle::bendLineWeight  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbSectionViewStyle::endLineLength  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbSectionViewStyle::endLineOvershoot  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::getViewLabelPattern  |  ( |  AcString &  |  pattern,
|  AcDbField *  |  pField = NULL
) |   |  const
Warning
Not implemented!
 const AcArray<double>& AcDbSectionViewStyle::hatchAngles  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcDbSectionViewStyle::hatchBackgroundColor  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcDbSectionViewStyle::hatchColor  |  ( |   | ) |   const
Warning
Not implemented!
 const ACHAR* AcDbSectionViewStyle::hatchPattern  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbSectionViewStyle::hatchScale  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmTransparency AcDbSectionViewStyle::hatchTransparency  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcDbSectionViewStyle::identifierColor  |  ( |   | ) |   const
Warning
Not implemented!
 const ACHAR* AcDbSectionViewStyle::identifierExcludeCharacters  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbSectionViewStyle::identifierHeight  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbSectionViewStyle::identifierStyleId  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbSectionViewStyle::isContinuousLabeling  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcDbSectionViewStyle::planeLineColor  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbSectionViewStyle::planeLineTypeId  |  ( |   | ) |   const
Warning
Not implemented!
 AcDb::LineWeight AcDbSectionViewStyle::planeLineWeight  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setArrowEndSymbolId  |  ( |  const AcDbObjectId &  |  arrowSymbolId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setArrowPosition  |  ( |  AcDbSectionViewStyle::ArrowDirection  |  type | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setArrowStartSymbolId  |  ( |  const AcDbObjectId &  |  arrowSymbolId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setArrowSymbolColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setArrowSymbolExtensionLength  |  ( |  double  |  length | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setArrowSymbolSize  |  ( |  double  |  size | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setBendLineColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setBendLineLength  |  ( |  double  |  length | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setBendLineTypeId  |  ( |  const AcDbObjectId &  |  objId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setBendLineWeight  |  ( |  AcDb::LineWeight  |  lineweight | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setContinuousLabeling  |  ( |  bool  |  bValue | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setEndLineLength  |  ( |  double  |  length | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setEndLineOvershoot  |  ( |  double  |  length | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setHatchAngles  |  ( |  const AcArray< double > &  |  angleArray | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setHatchBackgroundColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setHatchColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setHatchPattern  |  ( |  const ACHAR *  |  pattern | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setHatchScale  |  ( |  double  |  scale | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setHatchTransparency  |  ( |  const AcCmTransparency &  |  transparency | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setIdentifierColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setIdentifierExcludeCharacters  |  ( |  const ACHAR *  |  str | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setIdentifierHeight  |  ( |  double  |  height | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setIdentifierStyleId  |  ( |  const AcDbObjectId &  |  objId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setPlaneLineColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setPlaneLineTypeId  |  ( |  const AcDbObjectId &  |  objId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setPlaneLineWeight  |  ( |  AcDb::LineWeight  |  lineweight | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setShowAllBendIndentifiers  |  ( |  bool  |  bValue | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setShowAllPlaneLines  |  ( |  bool  |  bValue | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setShowArrowheads  |  ( |  bool  |  bValue | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setShowEndAndBendLines  |  ( |  bool  |  bValue | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setShowHatching  |  ( |  bool  |  bValue | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setShowViewLabel  |  ( |  bool  |  bValue | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setViewIdentifierOffset  |  ( |  double  |  offset | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setViewIdentifierPosition  |  ( |  AcDbSectionViewStyle::IdentifierPosition  |  type | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setViewLabelAlignment  |  ( |  AcDbModelDocViewStyle::TextAlignment  |  alignment | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setViewLabelAttachment  |  ( |  AcDbModelDocViewStyle::AttachmentPoint  |  attachment | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setViewLabelOffset  |  ( |  double  |  offset | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setViewLabelPattern  |  ( |  const ACHAR *  |  pattern,
|  const AcDbField *  |  pField = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setViewLabelTextColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setViewLabelTextHeight  |  ( |  double  |  height | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbSectionViewStyle::setViewLabelTextStyleId  |  ( |  const AcDbObjectId &  |  objId | )
Warning
Not implemented!
 bool AcDbSectionViewStyle::showAllBendIndentifiers  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbSectionViewStyle::showAllPlaneLines  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbSectionViewStyle::showArrowheads  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbSectionViewStyle::showEndAndBendLines  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbSectionViewStyle::showHatching  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbSectionViewStyle::showViewLabel  |  ( |   | ) |   const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbSectionViewStyle::subDeepClone  |  ( |  AcDbObject *  |  pOwner,
|  AcDbObject *&  |  pClonedObject,
|  AcDbIdMapping &  |  idMap,
|  Adesk::Boolean  |  isPrimary = true
) |   |  const
overrideprotectedvirtual
Warning
Not implemented!
Reimplemented from AcDbModelDocViewStyle.
 virtual Acad::ErrorStatus AcDbSectionViewStyle::subWblockClone  |  ( |  AcRxObject *  |  pOwner,
|  AcDbObject *&  |  pClonedObject,
|  AcDbIdMapping &  |  idMap,
|  Adesk::Boolean  |  isPrimary = true
) |   |  const
overrideprotectedvirtual
Warning
Not implemented!
Reimplemented from AcDbModelDocViewStyle.
 static bool AcDbSectionViewStyle::validateIdentifierExcludeCharacters  |  ( |  const ACHAR *  |  str | )
static
Warning
Not implemented!
 double AcDbSectionViewStyle::viewIdentifierOffset  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbSectionViewStyle::IdentifierPosition AcDbSectionViewStyle::viewIdentifierPosition  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbModelDocViewStyle::TextAlignment AcDbSectionViewStyle::viewLabelAlignment  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbModelDocViewStyle::AttachmentPoint AcDbSectionViewStyle::viewLabelAttachment  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbSectionViewStyle::viewLabelOffset  |  ( |   | ) |   const
Warning
Not implemented!
 const ACHAR* AcDbSectionViewStyle::viewLabelPattern  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcDbSectionViewStyle::viewLabelTextColor  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbSectionViewStyle::viewLabelTextHeight  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbSectionViewStyle::viewLabelTextStyleId  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbSectionViewStyle.h