Public Types | Public Member Functions | List of all members
AcEdJig Class Reference
AcEd Classes
  Inheritance diagram for AcEdJig:
 Public Types
enum  | CursorType {
 kNoSpecialCursor = -1, kCrosshair = 0, kRectCursor, kRubberBand,
 kNotRotated, kTargetBox, kRotatedCrosshair, kCrosshairNoRotate,
 kInvisible, kEntitySelect, kParallelogram, kEntitySelectNoPersp,
 kPkfirstOrGrips, kCrosshairDashed
 }
enum  | DragStatus {
 kModeless = -17, kNoChange = -6, kCancel = -4, kOther = -3,
 kNull = -1, kNormal = 0, kKW1, kKW2,
 kKW3, kKW4, kKW5, kKW6,
 kKW7, kKW8, kKW9
 }
enum  | UserInputControls {
 kGovernedByOrthoMode = 0x000001, kNullResponseAccepted = 0x000002, kDontEchoCancelForCtrlC = 0x000004, kDontUpdateLastPoint = 0x000008,
 kNoDwgLimitsChecking = 0x000010, kNoZeroResponseAccepted = 0x000020, kNoNegativeResponseAccepted = 0x000040, kAccept3dCoordinates = 0x000080,
 kAcceptMouseUpAsPoint = 0x000100, kAnyBlankTerminatesInput = 0x000200, kInitialBlankTerminatesInput = 0x000400, kAcceptOtherInputString = 0x000800,
 kGovernedByUCSDetect = 0x001000, kNoZDirectionOrtho = 0x002000, kImpliedFaceForUCSChange = 0x004000, kUseBasePointElevation = 0x008000,
 kDisableDirectDistanceInput = 0x010000
 }
 Public Member Functions
 DragStatus  | acquireAngle (double &ang)
 DragStatus  | acquireAngle (double &ang, const AcGePoint3d &basePnt)
 DragStatus  | acquireDist (double &dist)
 DragStatus  | acquireDist (double &dist, const AcGePoint3d &basePnt)
 DragStatus  | acquirePoint (AcGePoint3d &)
 DragStatus  | acquirePoint (AcGePoint3d &, const AcGePoint3d &basePnt)
 ACCORE_PORT DragStatus  | acquireString (ACHAR(&str)[2049])
ACRX_DECLARE_MEMBERS (AcEdJig)
 AcDbObjectId  | append ()
 virtual AcDbDimDataPtrArray *  | dimData (const double dimScale)
 const ACHAR *  | dispPrompt ()
 DragStatus  | drag ()
ACCORE_PORT DragStatus  | drag (const AcEdDragStyle &style)
 virtual AcDbEntity *  | entity () const
 const ACHAR *  | keywordList ()
 virtual DragStatus  | sampler ()
 virtual Acad::ErrorStatus  | setDimValue (const AcDbDimData *dimData, const double dimValue)
 void  | setDispPrompt (const ACHAR *,...)
 void  | setKeywordList (const ACHAR *)
 void  | setSpecialCursorType (CursorType)
 void  | setUserInputControls (AcEdJig::UserInputControls)
 AcEdJig::CursorType  | specialCursorType ()
 virtual Adesk::Boolean  | update ()
 AcEdJig::UserInputControls  | userInputControls ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 ACCORE_PORT DragStatus AcEdJig::drag  |  ( |  const AcEdDragStyle &  |  style | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbjig.h