Public Member Functions | List of all members
AcEdCommandStackReactor Class Reference
AcEd Classes
  Inheritance diagram for AcEdCommandStackReactor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcEdCommandStackReactor)
virtual void  | commandAdded (AcEdCommand *pCmd, AcEdCommandEventArgs *data)
virtual void  | commandEnded (AcEdCommand *pCmd, AcEdCommandEventArgs *data)
virtual void  | commandRemoved (AcEdCommand *pCmd, AcEdCommandEventArgs *data)
virtual void  | commandWillStart (AcEdCommand *pCmd, AcEdCommandEventArgs *data)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual void AcEdCommandStackReactor::commandAdded  |  ( |  AcEdCommand *  |  pCmd,
|  AcEdCommandEventArgs *  |  data
)
virtual
Warning
Not implemented!
 virtual void AcEdCommandStackReactor::commandEnded  |  ( |  AcEdCommand *  |  pCmd,
|  AcEdCommandEventArgs *  |  data
)
virtual
Warning
Not implemented!
 virtual void AcEdCommandStackReactor::commandRemoved  |  ( |  AcEdCommand *  |  pCmd,
|  AcEdCommandEventArgs *  |  data
)
virtual
Warning
Not implemented!
 virtual void AcEdCommandStackReactor::commandWillStart  |  ( |  AcEdCommand *  |  pCmd,
|  AcEdCommandEventArgs *  |  data
)
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
accmd.h