Public Member Functions | Static Public Member Functions | List of all members
AcRxBoxedValue Class Referenceabstract
AcRx Classes
  Inheritance diagram for AcRxBoxedValue:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxBoxedValue, ACBASE_PORT)
virtual ACBASE_PORT AcRxObject *  | clone () const ADESK_OVERRIDE
virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const ADESK_OVERRIDE
virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other) ADESK_OVERRIDE
virtual ACBASE_PORT Adesk::Boolean  | isEqualTo (const AcRxObject *other) const ADESK_OVERRIDE
ACBASE_PORT const AcRxObject *  | rxObject () const
ACBASE_PORT AcRxObject *  | rxObject ()
 virtual const AcRxValue *  | value () const =0
 virtual AcRxValue *  | value ()=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxClass *  | isA () const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static ACBASE_PORT AcRxBoxedValue *  | newBoxedValueOnHeap (const AcRxValue &value)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual ACBASE_PORT AcRxObject* AcRxBoxedValue::clone  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 virtual ACBASE_PORT AcRx::Ordering AcRxBoxedValue::comparedTo  |  ( |  const AcRxObject *  |  other | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 virtual ACBASE_PORT Acad::ErrorStatus AcRxBoxedValue::copyFrom  |  ( |  const AcRxObject *  |  other | )
virtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 virtual ACBASE_PORT Adesk::Boolean AcRxBoxedValue::isEqualTo  |  ( |  const AcRxObject *  |  other | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 static ACBASE_PORT AcRxBoxedValue* AcRxBoxedValue::newBoxedValueOnHeap  |  ( |  const AcRxValue &  |  value | )
static
Warning
Not implemented!
 ACBASE_PORT const AcRxObject* AcRxBoxedValue::rxObject  |  ( |   | ) |   const
Warning
Not implemented!
 ACBASE_PORT AcRxObject* AcRxBoxedValue::rxObject  |  ( |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxvalue.h