Public Member Functions | List of all members
AcDbEntityHyperlinkPE Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbEntityHyperlinkPE:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbEntityHyperlinkPE)
 virtual Acad::ErrorStatus  | getHyperlinkCollection (AcDbObject *pObj, AcDbHyperlinkCollection *&pcHCL, bool bOneOnly=false, bool bIgnoreBlockDefinition=true)=0
 virtual Acad::ErrorStatus  | getHyperlinkCollection (const AcArray< AcDbObjectId > *&idContainers, AcDbHyperlinkCollection *&pcHCL, bool bOneOnly=false, bool bIgnoreBlockDefinition=true)=0
virtual Acad::ErrorStatus  | getHyperlinkCount (AcDbObject *pObj, unsigned int &nCount, bool bIgnoreBlockDefinition=true)=0
virtual Acad::ErrorStatus  | getHyperlinkCount (const AcArray< AcDbObjectId > *&idContainers, unsigned int &nCount, bool bIgnoreBlockDefinition=true)=0
 virtual Acad::ErrorStatus  | hasHyperlink (AcDbObject *pObj, bool &bHasHyperlink, bool bIgnoreBlockDefinition=true)=0
 virtual Acad::ErrorStatus  | hasHyperlink (const AcArray< AcDbObjectId > *&idContainers, bool &bHasHyperlink, bool bIgnoreBlockDefinition=true)=0
 virtual Acad::ErrorStatus  | setHyperlinkCollection (AcDbObject *pObj, AcDbHyperlinkCollection *pcHCL)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual Acad::ErrorStatus AcDbEntityHyperlinkPE::getHyperlinkCount  |  ( |  AcDbObject *  |  pObj,
|  unsigned int &  |  nCount,
|  bool  |  bIgnoreBlockDefinition = true
)
pure virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbEntityHyperlinkPE::getHyperlinkCount  |  ( |  const AcArray< AcDbObjectId > *&  |  idContainers,
|  unsigned int &  |  nCount,
|  bool  |  bIgnoreBlockDefinition = true
)
pure virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
achapi.h