Public Member Functions | List of all members
AcApProfileStorage Class Referenceabstract
AcAp Classes
 Public Member Functions
 virtual Acad::ErrorStatus  | CreateNode (const ACHAR *pszNodePath, IUnknown *&pUnknown)=0
 virtual Acad::ErrorStatus  | DeleteNode (const ACHAR *pszNodePath)=0
 virtual Acad::ErrorStatus  | GetNode (const ACHAR *pszNodePath, IUnknown *&pUnknown)=0
 virtual Acad::ErrorStatus  | GetStorageFile (AcString &pszFile)=0
 virtual Acad::ErrorStatus  | ReplaceNode (const ACHAR *pszNodePath, IUnknown *pUnknown)=0
 virtual Acad::ErrorStatus  | Save (void)=0
 The documentation for this class was generated from the following file:
acprofile.h