Public Types | Public Member Functions | Friends | List of all members
AcDbDate Class Reference
AcDb Classes
 Public Types
enum  | InitialValue { kInitZero = 1, kInitLocalTime = 2, kInitUniversalTime = 3 }
 Public Member Functions
AcDbDate (InitialValue i)
AcDbDate (const AcDbDate &)
 const AcDbDate &  | add (const AcDbDate &date)
 short  | day () const
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *inFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *outFiler) const
int  | getApproximateTime () const
 void  | getDate (short &month, short &day, short &year) const
ACDBCORE2D_PORT AcString  | getLocalDisplayString () const
 void  | getLocalTime ()
 ACDB_PORT void  | getTime (SYSTEMTIME &st) const
void  | getTime (std::tm &st) const
void  | getTime (time_t &st) const
 void  | getTime (short &hour, short &min, short &sec, short &msec) const
 void  | getUniversalTime ()
 short  | hour () const
 Adesk::Int32  | julianDay () const
 double  | julianFraction () const
 void  | localToUniversal ()
 short  | millisecond () const
 short  | minute () const
 short  | month () const
 Adesk::Int32  | msecsPastMidnight () const
 const AcDbDate  | operator+ (const AcDbDate &date) const
 const AcDbDate &  | operator+= (const AcDbDate &date)
 const AcDbDate  | operator- (const AcDbDate &date) const
 const AcDbDate &  | operator-= (const AcDbDate &date)
 bool  | operator< (const AcDbDate &) const
 bool  | operator<= (const AcDbDate &) const
 const AcDbDate &  | operator= (const AcDbDate &)
 bool  | operator== (const AcDbDate &) const
 bool  | operator> (const AcDbDate &) const
 bool  | operator>= (const AcDbDate &) const
 short  | second () const
void  | setApproximateTime (int time)
 ACDBCORE2D_PORT void  | setDate (int month, int day, int year)
 ACDBCORE2D_PORT void  | setDay (int)
 ACDBCORE2D_PORT void  | setHour (int)
 void  | setJulianDate (Adesk::Int32 julianDay, Adesk::Int32 msec)
void  | setJulianDay (Adesk::Int32 julianDay)
 void  | setJulianFraction (double)
 ACDBCORE2D_PORT void  | setMillisecond (int)
 ACDBCORE2D_PORT void  | setMinute (int)
 ACDBCORE2D_PORT void  | setMonth (int)
void  | setMsecsPastMidnight (Adesk::Int32 msec)
 ACDBCORE2D_PORT void  | setSecond (int)
ACDBCORE2D_PORT void  | setTime (const std::tm &st)
 ACDB_PORT void  | setTime (const SYSTEMTIME &st)
 ACDBCORE2D_PORT void  | setTime (int hour, int min, int sec, int msec)
 void  | setToZero ()
 ACDBCORE2D_PORT void  | setYear (int)
 const AcDbDate &  | subtract (const AcDbDate &date)
 void  | universalToLocal ()
 short  | year () const
 Friends
 class  | AcDbImpDate
Member Function Documentation
 int AcDbDate::getApproximateTime  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcString AcDbDate::getLocalDisplayString  |  ( |   | ) |   const
Warning
Not implemented!
 void AcDbDate::getTime  |  ( |  std::tm &  |  st | ) |   const
Warning
Not implemented!
 void AcDbDate::getTime  |  ( |  time_t &  |  st | ) |   const
Warning
Not implemented!
 void AcDbDate::setApproximateTime  |  ( |  int  |  time | )
Warning
Not implemented!
 void AcDbDate::setJulianDay  |  ( |  Adesk::Int32  |  julianDay | )
Warning
Not implemented!
 void AcDbDate::setMsecsPastMidnight  |  ( |  Adesk::Int32  |  msec | )
Warning
Not implemented!
 ACDBCORE2D_PORT void AcDbDate::setTime  |  ( |  const std::tm &  |  st | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbdate.h