Public Member Functions | List of all members
AcDbArrayGripAppData Class Reference
AcDb Classes
  Inheritance diagram for AcDbArrayGripAppData:
 Public Member Functions
AcDbArrayGripAppData (const AcGePoint3d &position=AcGePoint3d(), unsigned int modes=0)
ACRX_DECLARE_MEMBERS (AcDbArrayGripAppData)
 void  | addGripMode (unsigned int mode)
void  | appendDimData (AcDbDimData *pData)
 bool &  | arrowGrip ()
 const AcGePoint3d *  | basePoint () const
void  | deleteDimData ()
 const AcDbDimDataPtrArray &  | dimData () const
 void *  | getAppData (AcRxClass **ppClass=NULL) const
 AcDbItemLocator &  | locator ()
 unsigned int  | modes () const
 const AcGePoint3d &  | position () const
 void  | setAppData (void *pData, AcRxClass *pClass)
void  | setBasePoint (AcGePoint3d &basePoint)
 AcGeVector3d &  | xDir ()
 AcGeVector3d &  | yDir ()
virtual  | ~AcDbArrayGripAppData ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbArrayGripAppData::AcDbArrayGripAppData  |  ( |  const AcGePoint3d &  |  position = AcGePoint3d(),
|  unsigned int  |  modes = 0
)
Warning
Not implemented!
 virtual AcDbArrayGripAppData::~AcDbArrayGripAppData  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 void AcDbArrayGripAppData::appendDimData  |  ( |  AcDbDimData *  |  pData | )
Warning
Not implemented!
 void AcDbArrayGripAppData::deleteDimData  |  ( |   | )
Warning
Not implemented!
 void AcDbArrayGripAppData::setBasePoint  |  ( |  AcGePoint3d &  |  basePoint | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbArrayGripAppData.h