Public Member Functions | Static Public Member Functions | List of all members
AcGiDrawableEvent Class Reference
AcGi Classes
  Inheritance diagram for AcGiDrawableEvent:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiDrawableEvent)
virtual void  | addReactor (AcGiDrawableReactor *pReactor)
virtual void  | removeReactor (AcGiDrawableReactor *pReactor)
virtual void  | sendAdded (AcGiDrawable *pDrawable, Adesk::IntDbId parentID, Adesk::LongPtr databasePtr)
virtual void  | sendBeginRegen (AcGiDrawable *pDrawable, AcGiDrawableReactor::RegenFlags flags)
virtual void  | sendEndRegen (AcGiDrawable *pDrawable, AcGiDrawableReactor::RegenFlags flags)
virtual void  | sendErased (AcGiDrawable *pDrawable)
virtual void  | sendErased (AcGiDrawable *pDrawable, Adesk::IntDbId parentID)
virtual void  | sendHandOverTo (AcGiDrawable *pDrawableFrom, AcGiDrawable *pDrawableTo)
virtual void  | sendModified (AcGiDrawable *pDrawable)
virtual void  | sendModified (AcGiDrawable *pDrawable, Adesk::IntDbId parentID)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static ACDBCORE2D_PORT AcGiDrawableEvent &  | instance ()
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual void AcGiDrawableEvent::addReactor  |  ( |  AcGiDrawableReactor *  |  pReactor | )
virtual
Warning
Not implemented!
 static ACDBCORE2D_PORT AcGiDrawableEvent& AcGiDrawableEvent::instance  |  ( |   | )
static
Warning
Not implemented!
 virtual void AcGiDrawableEvent::removeReactor  |  ( |  AcGiDrawableReactor *  |  pReactor | )
virtual
Warning
Not implemented!
 virtual void AcGiDrawableEvent::sendAdded  |  ( |  AcGiDrawable *  |  pDrawable,
|  Adesk::IntDbId  |  parentID,
|  Adesk::LongPtr  |  databasePtr
)
virtual
Warning
Not implemented!
 virtual void AcGiDrawableEvent::sendBeginRegen  |  ( |  AcGiDrawable *  |  pDrawable,
|  AcGiDrawableReactor::RegenFlags  |  flags
)
virtual
Warning
Not implemented!
 virtual void AcGiDrawableEvent::sendEndRegen  |  ( |  AcGiDrawable *  |  pDrawable,
|  AcGiDrawableReactor::RegenFlags  |  flags
)
virtual
Warning
Not implemented!
 virtual void AcGiDrawableEvent::sendErased  |  ( |  AcGiDrawable *  |  pDrawable | )
virtual
Warning
Not implemented!
 virtual void AcGiDrawableEvent::sendErased  |  ( |  AcGiDrawable *  |  pDrawable,
|  Adesk::IntDbId  |  parentID
)
virtual
Warning
Not implemented!
 virtual void AcGiDrawableEvent::sendHandOverTo  |  ( |  AcGiDrawable *  |  pDrawableFrom,
|  AcGiDrawable *  |  pDrawableTo
)
virtual
Warning
Not implemented!
 virtual void AcGiDrawableEvent::sendModified  |  ( |  AcGiDrawable *  |  pDrawable | )
virtual
Warning
Not implemented!
 virtual void AcGiDrawableEvent::sendModified  |  ( |  AcGiDrawable *  |  pDrawable,
|  Adesk::IntDbId  |  parentID
)
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
drawable.h