Public Member Functions | List of all members
AcCmColorBase Class Referenceabstract
AcCm Classes
  Inheritance diagram for AcCmColorBase:
 Public Member Functions
 virtual Adesk::UInt8  | blue () const =0
 virtual const ACHAR *  | bookName (void) const =0
 virtual Adesk::UInt32  | color () const =0
 virtual Adesk::UInt16  | colorIndex () const =0
 virtual AcCmEntityColor::ColorMethod  | colorMethod () const =0
 virtual const ACHAR *  | colorName (void) const =0
 virtual const ACHAR *  | colorNameForDisplay (void)=0
 virtual Adesk::UInt8  | green () const =0
 virtual bool  | hasBookName (void) const =0
 virtual bool  | hasColorName (void) const =0
 virtual bool  | isByACI () const =0
 virtual bool  | isByBlock () const =0
 virtual bool  | isByColor () const =0
 virtual bool  | isByLayer () const =0
 virtual bool  | isByPen () const =0
 virtual bool  | isForeground () const =0
 virtual Adesk::UInt16  | penIndex () const =0
 virtual Adesk::UInt8  | red () const =0
 virtual Acad::ErrorStatus  | setBlue (Adesk::UInt8 blue)=0
 virtual Acad::ErrorStatus  | setColor (Adesk::UInt32 color)=0
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 colorIndex)=0
 virtual Acad::ErrorStatus  | setColorMethod (AcCmEntityColor::ColorMethod eColorMethod)=0
 virtual Acad::ErrorStatus  | setGreen (Adesk::UInt8 green)=0
 virtual Acad::ErrorStatus  | setNames (const ACHAR *colorName, const ACHAR *bookName=NULL)=0
 virtual Acad::ErrorStatus  | setPenIndex (Adesk::UInt16 penIndex)=0
 virtual Acad::ErrorStatus  | setRed (Adesk::UInt8 red)=0
 virtual Acad::ErrorStatus  | setRGB (Adesk::UInt8 red, Adesk::UInt8 green, Adesk::UInt8 blue)=0
 The documentation for this class was generated from the following file:
dbcolor.h