Public Types | Public Member Functions | Static Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcDbTextEditor Class Reference
AcDb Classes
  Inheritance diagram for AcDbTextEditor:
 Public Types
enum  | ExitStatus { kExitQuit = 0, kExitSave }
enum  | TextFindFlags {
 kFindMatchCase = 1 << 0, kFindWholeWord = 1 << 1, kFindHalfFullForm = 1 << 2, kFindIgnoreAccent = 1 << 3,
 kFindUseWildcards = 1 << 4
 }
 Public Member Functions
ACDBCORE2D_PORT double  | actualHeight () const
ACDBCORE2D_PORT double  | actualWidth () const
ACDBCORE2D_PORT AcDbMText::AttachmentPoint  | attachment () const
ACDBCORE2D_PORT bool  | autoCAPS ()
ACDBCORE2D_PORT bool  | autolistEnabled () const
ACDBCORE2D_PORT Acad::ErrorStatus  | clearSelection ()
virtual ACDBCORE2D_PORT void  | close (ExitStatus stat)
ACDBCORE2D_PORT AcDbTextEditorColumns *  | columns ()
ACDBCORE2D_PORT int  | currentStyleIndex () const
virtual ACDBCORE2D_PORT AcDbTextEditorCursor *  | cursor ()
ACDBCORE2D_PORT AcDbTextEditorSelectionBase::FlowAlign  | defaultStackAlignment () const
ACDBCORE2D_PORT double  | defaultStackScale () const
ACDBCORE2D_PORT double  | definedHeight () const
ACDBCORE2D_PORT double  | definedWidth () const
virtual ACDBCORE2D_PORT AcDbTextEditorLocation *  | endOfText () ADESK_OVERRIDE
ACDBCORE2D_PORT Acad::ErrorStatus  | findText (const ACHAR *text, int flags, AcDbTextEditorLocation *&pStart, AcDbTextEditorLocation *&pEnd)
ACDBCORE2D_PORT int  | getFontCount () const
ACDBCORE2D_PORT AcString  | getFontName (int index) const
ACDBCORE2D_PORT int  | getIndexFromStyleName (const AcString &styleName)
ACDBCORE2D_PORT int  | getStyleCount () const
ACDBCORE2D_PORT AcString  | getStyleName (int index) const
ACDBCORE2D_PORT bool  | isAnnotativeStyle (int index) const
ACDBCORE2D_PORT bool  | isTrueTypeFont (int index) const
ACDBCORE2D_PORT bool  | isVerticalSHX () const
ACDBCORE2D_PORT bool  | isVerticalTTF () const
ACDBCORE2D_PORT Acad::ErrorStatus  | makeSelection (const AcDbTextEditorLocation *pStart, const AcDbTextEditorLocation *pEnd)
ACDBCORE2D_PORT AcDbTextEditorParagraphIterator *  | newParagraphsIterator ()
ACDBCORE2D_PORT bool  | numberingEnabled () const
ACDBCORE2D_PORT void  | redraw ()
ACDBCORE2D_PORT Acad::ErrorStatus  | selectAll ()
virtual ACDBCORE2D_PORT AcDbTextEditorSelection *  | selection ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setAttachment (AcDbMText::AttachmentPoint attachment)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAutoCAPS (bool autoCAPS)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAutolistEnabled (bool enabled)
ACDBCORE2D_PORT Acad::ErrorStatus  | setDefaultStackAlignment (AcDbTextEditorSelectionBase::FlowAlign alignment)
ACDBCORE2D_PORT Acad::ErrorStatus  | setDefaultStackScale (double scale)
ACDBCORE2D_PORT Acad::ErrorStatus  | setDefinedHeight (double height)
ACDBCORE2D_PORT Acad::ErrorStatus  | setDefinedWidth (double width)
ACDBCORE2D_PORT Acad::ErrorStatus  | setEnableNumbering (bool bEnable)
ACDBCORE2D_PORT Acad::ErrorStatus  | setStyle (int index)
ACDBCORE2D_PORT Acad::ErrorStatus  | setStyle (AcDbObjectId styleId)
ACDBCORE2D_PORT Acad::ErrorStatus  | setTabOnlyDelimiter (bool tabOnlyDelimiter)
ACDBCORE2D_PORT Acad::ErrorStatus  | setTextHeight (double textHeight)
ACDBCORE2D_PORT int  | stackCount () const
virtual ACDBCORE2D_PORT AcDbTextEditorLocation *  | startOfText () ADESK_OVERRIDE
ACDBCORE2D_PORT AcDbObjectId  | style (int index) const
ACDBCORE2D_PORT bool  | tabOnlyDelimiter () const
ACDBCORE2D_PORT double  | textHeight () const
ACDBCORE2D_PORT AcDbTextEditorWipeout *  | wipeout ()
 Static Public Member Functions
static ACDBCORE2D_PORT AcDbTextEditor *  | createDbTextEditor (AcDbMText *pMText)
 Protected Member Functions
virtual ACDBCORE2D_PORT  | ~AcDbTextEditor ()
 Protected Attributes
 TextEditor *  | m_pImp
 Friends
 class  | AcDbTextEditorLocation
 class  | AcDbTextEditorParagraphIterator
Constructor & Destructor Documentation
 virtual ACDBCORE2D_PORT AcDbTextEditor::~AcDbTextEditor  |  ( |   | )
protectedvirtual
Warning
Not implemented!
Member Function Documentation
 ACDBCORE2D_PORT double AcDbTextEditor::actualHeight  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbTextEditor::actualWidth  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbMText::AttachmentPoint AcDbTextEditor::attachment  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditor::autoCAPS  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditor::autolistEnabled  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::clearSelection  |  ( |   | )
Warning
Not implemented!
 virtual ACDBCORE2D_PORT void AcDbTextEditor::close  |  ( |  ExitStatus  |  stat | )
virtual
Warning
Not implemented!
Reimplemented in AcEdInplaceTextEditor.
 ACDBCORE2D_PORT AcDbTextEditorColumns* AcDbTextEditor::columns  |  ( |   | )
Warning
Not implemented!
 static ACDBCORE2D_PORT AcDbTextEditor* AcDbTextEditor::createDbTextEditor  |  ( |  AcDbMText *  |  pMText | )
static
Warning
Not implemented!
 ACDBCORE2D_PORT int AcDbTextEditor::currentStyleIndex  |  ( |   | ) |   const
Warning
Not implemented!
 virtual ACDBCORE2D_PORT AcDbTextEditorCursor* AcDbTextEditor::cursor  |  ( |   | )
virtual
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbTextEditorSelectionBase::FlowAlign AcDbTextEditor::defaultStackAlignment  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbTextEditor::defaultStackScale  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbTextEditor::definedHeight  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbTextEditor::definedWidth  |  ( |   | ) |   const
Warning
Not implemented!
 virtual ACDBCORE2D_PORT AcDbTextEditorLocation* AcDbTextEditor::endOfText  |  ( |   | )
virtual
Warning
Not implemented!
Implements AcDbTextEditorSelectable.
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::findText  |  ( |  const ACHAR *  |  text,
|  int  |  flags,
|  AcDbTextEditorLocation *&  |  pStart,
|  AcDbTextEditorLocation *&  |  pEnd
)
Warning
Not implemented!
 ACDBCORE2D_PORT int AcDbTextEditor::getFontCount  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcString AcDbTextEditor::getFontName  |  ( |  int  |  index | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT int AcDbTextEditor::getIndexFromStyleName  |  ( |  const AcString &  |  styleName | )
Warning
Not implemented!
 ACDBCORE2D_PORT int AcDbTextEditor::getStyleCount  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcString AcDbTextEditor::getStyleName  |  ( |  int  |  index | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditor::isAnnotativeStyle  |  ( |  int  |  index | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditor::isTrueTypeFont  |  ( |  int  |  index | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditor::isVerticalSHX  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditor::isVerticalTTF  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::makeSelection  |  ( |  const AcDbTextEditorLocation *  |  pStart,
|  const AcDbTextEditorLocation *  |  pEnd
)
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbTextEditorParagraphIterator* AcDbTextEditor::newParagraphsIterator  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditor::numberingEnabled  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT void AcDbTextEditor::redraw  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::selectAll  |  ( |   | )
Warning
Not implemented!
 virtual ACDBCORE2D_PORT AcDbTextEditorSelection* AcDbTextEditor::selection  |  ( |   | )
virtual
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::setAttachment  |  ( |  AcDbMText::AttachmentPoint  |  attachment | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::setAutoCAPS  |  ( |  bool  |  autoCAPS | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::setAutolistEnabled  |  ( |  bool  |  enabled | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::setDefaultStackAlignment  |  ( |  AcDbTextEditorSelectionBase::FlowAlign  |  alignment | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::setDefaultStackScale  |  ( |  double  |  scale | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::setDefinedHeight  |  ( |  double  |  height | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::setDefinedWidth  |  ( |  double  |  width | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::setEnableNumbering  |  ( |  bool  |  bEnable | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::setStyle  |  ( |  int  |  index | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::setStyle  |  ( |  AcDbObjectId  |  styleId | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::setTabOnlyDelimiter  |  ( |  bool  |  tabOnlyDelimiter | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditor::setTextHeight  |  ( |  double  |  textHeight | )
Warning
Not implemented!
 ACDBCORE2D_PORT int AcDbTextEditor::stackCount  |  ( |   | ) |   const
Warning
Not implemented!
 virtual ACDBCORE2D_PORT AcDbTextEditorLocation* AcDbTextEditor::startOfText  |  ( |   | )
virtual
Warning
Not implemented!
Implements AcDbTextEditorSelectable.
 ACDBCORE2D_PORT AcDbObjectId AcDbTextEditor::style  |  ( |  int  |  index | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditor::tabOnlyDelimiter  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbTextEditor::textHeight  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbTextEditorWipeout* AcDbTextEditor::wipeout  |  ( |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbtexteditor.h