Public Types | Public Member Functions | Friends | List of all members
AcDbDataCell Class Reference
AcDb Classes
  Inheritance diagram for AcDbDataCell:
 Public Types
enum  | CellType {
 kUnknown = 0, kInteger, kDouble, kCharPtr,
 kPoint, kObjectId, kHardOwnerId, kSoftOwnerId,
 kHardPtrId, kSoftPtrId, kBool, kVector
 }
 Public Member Functions
AcDbDataCell (const AcDbDataCell &rCell)
AcDbDataCell (bool b)
AcDbDataCell (int i)
AcDbDataCell (double d)
AcDbDataCell (const ACHAR *pChar)
AcDbDataCell (const AcGePoint3d &point)
AcDbDataCell (const AcGeVector3d &vec)
AcDbDataCell (const AcDbObjectId &id)
AcDbDataCell (const AcDbHardOwnershipId &hoId)
AcDbDataCell (const AcDbSoftOwnershipId &soId)
AcDbDataCell (const AcDbHardPointerId &hpId)
AcDbDataCell (const AcDbSoftPointerId &spId)
ACRX_DECLARE_MEMBERS (AcDbDataCell)
 virtual void  | init ()
 virtual  | operator AcDbHardOwnershipId & () const
 virtual  | operator AcDbHardPointerId & () const
 virtual  | operator AcDbObjectId & () const
 virtual  | operator AcDbSoftOwnershipId & () const
 virtual  | operator AcDbSoftPointerId & () const
 virtual  | operator AcGePoint3d & () const
 virtual  | operator AcGeVector3d & () const
 virtual ACDBCORE2D_PORT  | operator AcString & () const
 virtual  | operator bool () const
 virtual  | operator const ACHAR * () const
 virtual  | operator double () const
 virtual  | operator int () const
 virtual bool  | operator!= (const AcDbDataCell &cell) const
 virtual AcDbDataCell &  | operator= (const AcDbDataCell &cell)
 virtual AcDbDataCell &  | operator= (bool b)
 virtual AcDbDataCell &  | operator= (int i)
 virtual AcDbDataCell &  | operator= (double d)
 virtual AcDbDataCell &  | operator= (const ACHAR *pChar)
 virtual ACDBCORE2D_PORT AcDbDataCell &  | operator= (const AcString &s)
 virtual AcDbDataCell &  | operator= (const AcGePoint3d &pt)
 virtual AcDbDataCell &  | operator= (const AcGeVector3d &vec)
 virtual AcDbDataCell &  | operator= (const AcDbObjectId &id)
 virtual AcDbDataCell &  | operator= (const AcDbHardOwnershipId &hoId)
 virtual AcDbDataCell &  | operator= (const AcDbSoftOwnershipId &soId)
 virtual AcDbDataCell &  | operator= (const AcDbHardPointerId &hpId)
 virtual AcDbDataCell &  | operator= (const AcDbSoftPointerId &spId)
 virtual bool  | operator== (const AcDbDataCell &cell) const
 virtual AcDbDataCell::CellType  | type () const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbDataTable.h