Public Member Functions | Friends | List of all members
AcEdInputPoint Class Reference
AcEd Classes
 Public Member Functions
 const AcArray< AcGeCurve3d * > &  | alignmentPaths () const
 const AcGePoint3d &  | cartesianSnappedPoint () const
 const AcGePoint3d &  | computedPoint () const
 const AcArray< AcDbCustomOsnapMode * > &  | customOsnapModes () const
 const AcArray< AcDbCustomOsnapMode * > &  | customOsnapOverrides () const
 AcApDocument *  | document () const
 AcGiViewportDraw *  | drawContext () const
 const AcGePoint3d &  | grippedPoint () const
 const AcArray< Adesk::GsMarker > &  | gsSelectionMark () const
 int  | history () const
 const AcArray< AcDbObjectId > &  | keyPointEntities () const
 const AcArray< Adesk::GsMarker > &  | keyPointGsSelectionMark () const
 const AcGePoint3d &  | lastPoint () const
 const AcArray< AcDbObjectIdArray, AcArrayObjectCopyReallocator< AcDbObjectIdArray > > &  | nestedKeyPointEntities () const
 const AcArray< AcDbObjectIdArray, AcArrayObjectCopyReallocator< AcDbObjectIdArray > > &  | nestedPickedEntities () const
 const AcDb::OsnapMask  | osnapMask () const
 const AcDb::OsnapMask  | osnapOverrides () const
 const AcGePoint3d &  | osnappedPoint () const
 const AcArray< AcDbObjectId > &  | pickedEntities () const
 bool  | pointComputed () const
 const AcGePoint3d &  | rawPoint () const
 const ACHAR *  | tooltipString () const
 Friends
 class  | AcEdImpInputPointManager
 The documentation for this class was generated from the following file:
acedinpt.h