Public Member Functions | List of all members
AcDMMEntityReactorInfo Class Referenceabstract
AcDMM Classes
 Public Member Functions
 virtual bool  | add3DDwfAttribute (const wchar_t *category, const wchar_t *name, const wchar_t *ns, const wchar_t *nsUrl, const wchar_t *attName, const wchar_t *attVal)=0
 virtual bool  | add3DDwfProperty (const wchar_t *category, const wchar_t *name, const wchar_t *value)=0
 virtual bool  | AddNodeToMap (AcDbObjectId Id, AcDbObjectIdArray objIds, int nodeId)=0
 virtual bool  | AddProperties (const AcDMMEPlotProperties *props)=0
 virtual bool  | AddPropertiesIds (AcDMMStringVec *IdVec, AcDMMNode &node)=0
 virtual void  | cancelTheJob ()=0
 virtual AcDbObjectId  | effectiveBlockLayerId () const =0
 virtual AcDbEntity *  | entity () const =0
 virtual void  | flush ()=0
 virtual bool  | GetCurrentEntityNode (AcDMMNode &node, AcDbObjectIdArray objIds) const =0
 virtual const AcDbObjectIdArray &  | getEntityBlockRefPath ()=0
 virtual bool  | GetEntityNode (AcDbObjectId id, AcDbObjectIdArray objIds, int &nodeId) const =0
 virtual const AcArray< long > &  | getGraphicIDs ()=0
 virtual int  | GetNextAvailableNodeId () const =0
 virtual const AcDMMNode *  | GetNode (int nodeId) const =0
 virtual AcPlPlotLogger *  | GetPlotLogger ()=0
 virtual bool  | isCancelled () const =0
 virtual bool  | SetCurrentNode (int nodeId, AcDbObjectIdArray objIds)=0
 virtual bool  | SetNodeName (int nodeNumber, const wchar_t *name)=0
 virtual const wchar_t *  | UniqueEntityId ()=0
 The documentation for this class was generated from the following file:
acdmmapi.h