Public Member Functions | List of all members
AcGiRapidRTRenderSettingsTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiRapidRTRenderSettingsTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiRapidRTRenderSettingsTraits)
 virtual int  | desiredRenderLevel () const =0
 virtual int  | desiredRenderTime () const =0
 virtual float  | filterHeight () const =0
 virtual AcGiFilterType  | filterType () const =0
 virtual float  | filterWidth () const =0
 virtual AcGiLightingMode  | lightingMode () const =0
 virtual AcGiQuitCondition  | quitCondition () const =0
 virtual void  | setDesiredRenderLevel (int renderLevel)=0
 virtual void  | setDesiredRenderTime (int renderTime)=0
 virtual void  | setFilterHeight (float height)=0
 virtual void  | setFilterType (AcGiFilterType filterInfo)=0
 virtual void  | setFilterWidth (float width)=0
 virtual void  | setLightingMode (AcGiLightingMode mode)=0
 virtual void  | setQuitCondition (AcGiQuitCondition quitCondition)=0
 The documentation for this class was generated from the following file:
AcGiEnvironment.h