Public Member Functions | List of all members
AcDbAssocSimplePersSubentId Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocSimplePersSubentId:
 Public Member Functions
AcDbAssocSimplePersSubentId (AcDbSubentId subentId=kNullSubentId)
ACRX_DECLARE_MEMBERS (AcDbAssocSimplePersSubentId)
virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo) override
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) override
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const override
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) override
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const override
virtual bool  | isEqualTo (const AcDbEntity *pEntity, AcDbDatabase *pDatabase, const AcDbAssocPersSubentId *pOther) const override
 virtual bool  | isNull () const override
 void  | setSubentId (const AcDbSubentId &newSubentId)
 virtual AcDbSubentId  | subentId (const AcDbEntity *) const
 virtual AcDb::SubentType  | subentType (const AcDbEntity *pEntity, AcDbDatabase *pDatabase) const override
 virtual int  | transientSubentCount (const AcDbEntity *pEntity, AcDbDatabase *pDatabase) const override
 Public Member Functions inherited from AcDbAssocPersSubentId
ACRX_DECLARE_MEMBERS (AcDbAssocPersSubentId)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSource) override
virtual Acad::ErrorStatus  | getTransientSubentIds (const AcDbEntity *pEntity, AcDbDatabase *pDatabase, AcArray< AcDbSubentId > &subents) const
virtual Acad::ErrorStatus  | mirror (const AcDbEntity *pMirroredEntity, AcDbDatabase *pDatabase)
virtual Acad::ErrorStatus  | release (AcDbEntity *pEntity, AcDbDatabase *pDatabase) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcDbAssocPersSubentId
static Acad::ErrorStatus  | createObjectAndDwgInFields (AcDbDatabase *pDatabase, AcDbDwgFiler *pFiler, AcDbAssocPersSubentId *&pCreatedPersSubentId)
static Acad::ErrorStatus  | createObjectAndDxfInFields (AcDbDxfFiler *pFiler, AcDbAssocPersSubentId *&pCreatedPersSubentId)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual Acad::ErrorStatus AcDbAssocSimplePersSubentId::audit  |  ( |  AcDbAuditInfo *  |  pAuditInfo | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocSimplePersSubentId::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocSimplePersSubentId::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocSimplePersSubentId::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocSimplePersSubentId::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
 virtual bool AcDbAssocSimplePersSubentId::isEqualTo  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDbDatabase *  |  pDatabase,
|  const AcDbAssocPersSubentId *  |  pOther
) |   |  const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
 The documentation for this class was generated from the following file:
AcDbAssocSimplePersSubentId.h