Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcEdCommandEventArgs Class Reference
AcEd Classes
 Public Member Functions
const ACHAR *  | groupName () const
void  | setStatus (AcEdCommandStatusFlags flags)
AcEdCommandStatusFlags  | status () const
 Protected Member Functions
AcEdCommandEventArgs (AcEdImpCommandEventArgs *pImp)
AcEdCommandEventArgs (const AcEdCommandEventArgs &other)
AcEdCommandEventArgs &  | operator= (const AcEdCommandEventArgs &other)
 Protected Attributes
 AcEdImpCommandEventArgs *  | m_pImp
 Friends
 class  | AcEdImpCommandEventArgs
Constructor & Destructor Documentation
 AcEdCommandEventArgs::AcEdCommandEventArgs  |  ( |  AcEdImpCommandEventArgs *  |  pImp | )
protected
Warning
Not implemented!
 AcEdCommandEventArgs::AcEdCommandEventArgs  |  ( |  const AcEdCommandEventArgs &  |  other | )
protected
Warning
Not implemented!
Member Function Documentation
 const ACHAR* AcEdCommandEventArgs::groupName  |  ( |   | ) |   const
Warning
Not implemented!
 AcEdCommandEventArgs& AcEdCommandEventArgs::operator=  |  ( |  const AcEdCommandEventArgs &  |  other | )
protected
Warning
Not implemented!
 void AcEdCommandEventArgs::setStatus  |  ( |  AcEdCommandStatusFlags  |  flags | )
Warning
Not implemented!
 AcEdCommandStatusFlags AcEdCommandEventArgs::status  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
accmd.h