Public Types | Public Member Functions | List of all members
AcDbDxfFiler Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbDxfFiler:
 Public Types
enum  | { kDfltPrec = -1, kMaxPrec = 16 }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbDxfFiler)
 virtual bool  | atEmbeddedObjectStart ()
 virtual bool  | atEndOfObject ()
 virtual bool  | atEOF ()
 virtual bool  | atExtendedData ()
 virtual bool  | atSubclassData (const ACHAR *subClassName)
 AcDbFilerController &  | controller () const
 virtual AcDbDatabase *  | database () const =0
 virtual Acad::ErrorStatus  | dwgVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer) const
 virtual double  | elevation () const
 virtual const ACHAR *  | errorMessage () const
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | extendedDwgMaintenanceReleaseVersion (AcDb::MaintenanceReleaseVersion &maintVer) const
 virtual Acad::ErrorStatus  | filerStatus () const =0
 virtual AcDb::FilerType  | filerType () const =0
 virtual void  | haltAtClassBoundaries (bool halt)
 virtual bool  | includesDefaultValues () const =0
 virtual bool  | isModifyingExistingObject () const
 virtual int  | precision () const
 virtual Acad::ErrorStatus  | pushBackItem ()
 Acad::ErrorStatus  | readItem (resbuf *pItem)
 virtual Acad::ErrorStatus  | readResBuf (resbuf *pRb)
 virtual void  | resetFilerStatus ()=0
 virtual int  | rewindFiler ()=0
 virtual Acad::ErrorStatus  | setError (Acad::ErrorStatus es, const ACHAR *errMsg,...)
 virtual Acad::ErrorStatus  | setError (const ACHAR *errMsg,...)
 virtual void  | setPrecision (int prec)
 virtual double  | thickness () const
 virtual Acad::ErrorStatus  | writeAcDbHandle (AcDb::DxfCode code, const AcDbHandle &val)=0
 virtual Acad::ErrorStatus  | writeBChunk (AcDb::DxfCode code, const ads_binary &val)=0
 virtual Acad::ErrorStatus  | writeBool (AcDb::DxfCode code, bool val)=0
 virtual Acad::ErrorStatus  | writeBoolean (AcDb::DxfCode code, Adesk::Boolean val)=0
 virtual Acad::ErrorStatus  | writeDouble (AcDb::DxfCode code, double val, int prec=kDfltPrec)=0
 virtual Acad::ErrorStatus  | writeEmbeddedObjectStart ()
 virtual Acad::ErrorStatus  | writeInt16 (AcDb::DxfCode code, Adesk::Int16 val)=0
 virtual Acad::ErrorStatus  | writeInt32 (AcDb::DxfCode code, Adesk::Int32 val)=0
 virtual Acad::ErrorStatus  | writeInt64 (AcDb::DxfCode code, Adesk::Int64 val)=0
 virtual Acad::ErrorStatus  | writeInt8 (AcDb::DxfCode code, Adesk::Int8)=0
 Acad::ErrorStatus  | writeItem (const resbuf &pItem)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, const AcDbObjectId &id)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, const ACHAR *val)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, const AcString &val)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, const ads_binary &val)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, const AcDbHandle &val)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, Adesk::Int32 val)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, Adesk::Int16 val)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, Adesk::Int8 val)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, Adesk::UInt32 val)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, Adesk::UInt16 val)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, Adesk::UInt8 val)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, Adesk::Boolean val)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, bool val)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, double val, int=kDfltPrec)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, const AcGePoint2d &val, int prec=kDfltPrec)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, const AcGePoint3d &val, int prec=kDfltPrec)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, const AcGeVector2d &val, int prec=kDfltPrec)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, const AcGeVector3d &val, int prec=kDfltPrec)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode dc, const AcGeScale3d &val, int prec=kDfltPrec)
 virtual Acad::ErrorStatus  | writeObjectId (AcDb::DxfCode code, const AcDbObjectId &id)=0
 virtual Acad::ErrorStatus  | writePoint2d (AcDb::DxfCode code, const AcGePoint2d &val, int prec=kDfltPrec)=0
 virtual Acad::ErrorStatus  | writePoint3d (AcDb::DxfCode code, const AcGePoint3d &val, int prec=kDfltPrec)=0
 virtual Acad::ErrorStatus  | writeResBuf (const resbuf &rb)
 virtual Acad::ErrorStatus  | writeScale3d (AcDb::DxfCode code, const AcGeScale3d &val, int prec=kDfltPrec)=0
 virtual Acad::ErrorStatus  | writeString (AcDb::DxfCode code, const ACHAR *pVal)=0
 virtual Acad::ErrorStatus  | writeString (AcDb::DxfCode code, const AcString &pVal)=0
 virtual Acad::ErrorStatus  | writeUInt16 (AcDb::DxfCode code, Adesk::UInt16 val)=0
 virtual Acad::ErrorStatus  | writeUInt32 (AcDb::DxfCode code, Adesk::UInt32 val)=0
 virtual Acad::ErrorStatus  | writeUInt64 (AcDb::DxfCode code, Adesk::UInt64 val)=0
 virtual Acad::ErrorStatus  | writeUInt8 (AcDb::DxfCode code, Adesk::UInt8 val)=0
 virtual Acad::ErrorStatus  | writeVector2d (AcDb::DxfCode code, const AcGeVector2d &val, int prec=kDfltPrec)=0
 virtual Acad::ErrorStatus  | writeVector3d (AcDb::DxfCode code, const AcGeVector3d &val, int prec=kDfltPrec)=0
 virtual Acad::ErrorStatus  | writeXDataStart ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcDbDxfFiler::extendedDwgMaintenanceReleaseVersion  |  ( |  AcDb::MaintenanceReleaseVersion &  |  maintVer | ) |   const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbfiler.h