Public Member Functions | List of all members
AcGiImageBackgroundTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiImageBackgroundTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiImageBackgroundTraits)
 virtual bool  | fitToScreen (void) const =0
 virtual const ACHAR *  | imageFilename (void) const =0
 virtual bool  | maintainAspectRatio (void) const =0
 virtual void  | setFitToScreen (bool bFitToScreen)=0
 virtual void  | setImageFilename (const ACHAR *filename)=0
 virtual void  | setMaintainAspectRatio (bool bMaintainAspectRatio)=0
 virtual void  | setUseTiling (bool bUseTiling)=0
 virtual void  | setXOffset (double xOffset)=0
 virtual void  | setXScale (double xScale)=0
 virtual void  | setYOffset (double yOffset)=0
 virtual void  | setYScale (double yScale)=0
 virtual bool  | useTiling (void) const =0
 virtual double  | xOffset (void) const =0
 virtual double  | xScale (void) const =0
 virtual double  | yOffset (void) const =0
 virtual double  | yScale (void) const =0
 The documentation for this class was generated from the following file:
AcGiEnvironment.h