Public Member Functions | Protected Attributes | Friends | List of all members
AcRxVariableChangedEventArgs Class Reference
AcRx Classes
  Inheritance diagram for AcRxVariableChangedEventArgs:
 Public Member Functions
AcRxVariableChangedEventArgs (AcRxImpVariableChangingEventArgs *)
ACDBCORE2D_PORT const resbuf &  | newValue () const
ACDBCORE2D_PORT const resbuf &  | oldValue () const
 Protected Attributes
 AcRxImpVariableChangingEventArgs *  | m_pImp
 Friends
 class  | AcRxImpVariableChangingEventArgs
Constructor & Destructor Documentation
 AcRxVariableChangedEventArgs::AcRxVariableChangedEventArgs  |  ( |  AcRxImpVariableChangingEventArgs *  |   | )
Warning
Not implemented!
Member Function Documentation
 ACDBCORE2D_PORT const resbuf& AcRxVariableChangedEventArgs::newValue  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT const resbuf& AcRxVariableChangedEventArgs::oldValue  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxvar.h