Public Types | Public Member Functions | List of all members
AcGiLightAttenuation Class Reference
AcGi Classes
  Inheritance diagram for AcGiLightAttenuation:
 Public Types
enum  | AttenuationType { kNone = 0, kInverseLinear, kInverseSquare }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiLightAttenuation)
 virtual AttenuationType  | attenuationType () const
 virtual double  | endLimit () const
bool  | operator== (const AcGiLightAttenuation &atten) const
 virtual void  | setAttenuationType (AttenuationType typ)
 virtual void  | setLimits (double startlim, double endlim)
 virtual void  | setUseLimits (bool on)
 virtual double  | startLimit () const
 virtual bool  | useLimits () const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 bool AcGiLightAttenuation::operator==  |  ( |  const AcGiLightAttenuation &  |  atten | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcGiLightTraits.h