Public Member Functions | Static Public Member Functions | Friends | List of all members
AcRxVariablesDictionary Class Reference
AcRx Classes
 Public Member Functions
ACDBCORE2D_PORT void  | addReactor (AcRxVariableReactor *reactor)
ACDBCORE2D_PORT const AcArray< AcString > &  | getAllNames () const
ACDBCORE2D_PORT AcRxVariable *  | getVariable (const ACHAR *name) const
ACDBCORE2D_PORT void  | removeReactor (AcRxVariableReactor *reactor)
ACDBCORE2D_PORT Acad::ErrorStatus  | reset (AcRxVariable::StorageType filter)
~AcRxVariablesDictionary ()
 Static Public Member Functions
static ACDBCORE2D_PORT AcRxVariablesDictionary *  | get ()
static ACDBCORE2D_PORT bool  | getBool (const ACHAR *name, bool def)
static ACDBCORE2D_PORT bool  | getBool (const AcRxVariable *pVar, bool def)
static ACDBCORE2D_PORT double  | getDouble (const ACHAR *name, double def)
static ACDBCORE2D_PORT double  | getDouble (const AcRxVariable *pVar, double def)
static ACDBCORE2D_PORT short  | getInt16 (const ACHAR *name, short def)
static ACDBCORE2D_PORT short  | getInt16 (const AcRxVariable *pVar, short def)
static ACDBCORE2D_PORT AcString  | getString (const ACHAR *name)
static ACDBCORE2D_PORT AcString  | getString (const AcRxVariable *pVar)
static ACDBCORE2D_PORT Acad::ErrorStatus  | setBool (const ACHAR *name, bool val)
static ACDBCORE2D_PORT Acad::ErrorStatus  | setBool (AcRxVariable *, bool val)
static ACDBCORE2D_PORT Acad::ErrorStatus  | setDouble (const ACHAR *name, double val)
static ACDBCORE2D_PORT Acad::ErrorStatus  | setDouble (AcRxVariable *pVar, double val)
static ACDBCORE2D_PORT Acad::ErrorStatus  | setInt16 (const ACHAR *name, short val)
static ACDBCORE2D_PORT Acad::ErrorStatus  | setInt16 (AcRxVariable *pVar, short val)
static ACDBCORE2D_PORT Acad::ErrorStatus  | setString (const ACHAR *name, const ACHAR *val)
static ACDBCORE2D_PORT Acad::ErrorStatus  | setString (AcRxVariable *pVar, const ACHAR *val)
 Friends
 class  | AcRxImpVariablesDictionary
Constructor & Destructor Documentation
 AcRxVariablesDictionary::~AcRxVariablesDictionary  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 ACDBCORE2D_PORT void AcRxVariablesDictionary::addReactor  |  ( |  AcRxVariableReactor *  |  reactor | )
Warning
Not implemented!
 static ACDBCORE2D_PORT AcRxVariablesDictionary* AcRxVariablesDictionary::get  |  ( |   | )
static
Warning
Not implemented!
 ACDBCORE2D_PORT const AcArray<AcString>& AcRxVariablesDictionary::getAllNames  |  ( |   | ) |   const
Warning
Not implemented!
 static ACDBCORE2D_PORT bool AcRxVariablesDictionary::getBool  |  ( |  const ACHAR *  |  name,
|  bool  |  def
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT bool AcRxVariablesDictionary::getBool  |  ( |  const AcRxVariable *  |  pVar,
|  bool  |  def
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT double AcRxVariablesDictionary::getDouble  |  ( |  const ACHAR *  |  name,
|  double  |  def
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT double AcRxVariablesDictionary::getDouble  |  ( |  const AcRxVariable *  |  pVar,
|  double  |  def
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT short AcRxVariablesDictionary::getInt16  |  ( |  const ACHAR *  |  name,
|  short  |  def
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT short AcRxVariablesDictionary::getInt16  |  ( |  const AcRxVariable *  |  pVar,
|  short  |  def
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT AcString AcRxVariablesDictionary::getString  |  ( |  const ACHAR *  |  name | )
static
Warning
Not implemented!
 static ACDBCORE2D_PORT AcString AcRxVariablesDictionary::getString  |  ( |  const AcRxVariable *  |  pVar | )
static
Warning
Not implemented!
 ACDBCORE2D_PORT AcRxVariable* AcRxVariablesDictionary::getVariable  |  ( |  const ACHAR *  |  name | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT void AcRxVariablesDictionary::removeReactor  |  ( |  AcRxVariableReactor *  |  reactor | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariablesDictionary::reset  |  ( |  AcRxVariable::StorageType  |  filter | )
Warning
Not implemented!
 static ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariablesDictionary::setBool  |  ( |  const ACHAR *  |  name,
|  bool  |  val
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariablesDictionary::setBool  |  ( |  AcRxVariable *  |  ,
|  bool  |  val
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariablesDictionary::setDouble  |  ( |  const ACHAR *  |  name,
|  double  |  val
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariablesDictionary::setDouble  |  ( |  AcRxVariable *  |  pVar,
|  double  |  val
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariablesDictionary::setInt16  |  ( |  const ACHAR *  |  name,
|  short  |  val
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariablesDictionary::setInt16  |  ( |  AcRxVariable *  |  pVar,
|  short  |  val
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariablesDictionary::setString  |  ( |  const ACHAR *  |  name,
|  const ACHAR *  |  val
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariablesDictionary::setString  |  ( |  AcRxVariable *  |  pVar,
|  const ACHAR *  |  val
)
static
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxvar.h