Public Member Functions | List of all members
IAcRxEnumeration Class Referenceabstract
AcRx Classes
  Inheritance diagram for IAcRxEnumeration:
 Public Member Functions
 virtual int  | count () const =0
 virtual const AcRxEnumTag &  | getAt (int index) const =0
 The documentation for this class was generated from the following file:
rxvaluetype.h