Public Types | Public Member Functions | Protected Member Functions | List of all members
AcDbViewTableRecord Class Reference
AcDb Classes
  Inheritance diagram for AcDbViewTableRecord:
 Public Types
 typedef AcDbViewTable  | TableType
 Public Types inherited from AcDbSymbolTableRecord
 typedef AcDbSymbolTable  | TableType
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbViewTableRecord)
 AcDbAnnotationScale *  | annotationScale () const
AcDbObjectId  | camera () const
 Acad::ErrorStatus  | disassociateUcsFromView ()
ACDBCORE2D_PORT Acad::ErrorStatus  | getCategoryName (AcString &sCategoryName) const
 Acad::ErrorStatus  | getCategoryName (ACHAR *&categoryName) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getLayerState (AcString &layerStateName) const
 Acad::ErrorStatus  | getLayerState (ACHAR *&layerStateName) const
 Acad::ErrorStatus  | getLayout (AcDbObjectId &layoutId) const
Acad::ErrorStatus  | getPreviewImage (Atil::Image *&pPreviewImage) const
 Acad::ErrorStatus  | getThumbnail (BITMAPINFO *&thumbnail) const
 bool  | isCameraPlottable () const
 bool  | isPaperspaceView () const
 bool  | isUcsAssociatedToView () const
 bool  | isViewAssociatedToViewport () const
 AcDbObjectId  | liveSection () const
 Acad::ErrorStatus  | setAnnotationScale (const AcDbAnnotationScale *pScaleObj)
Acad::ErrorStatus  | setCamera (AcDbObjectId cameraId)
 Acad::ErrorStatus  | setCategoryName (const ACHAR *categoryName)
 Acad::ErrorStatus  | setIsCameraPlottable (bool plottable)
 void  | setIsPaperspaceView (bool pspace)
 Acad::ErrorStatus  | setLayerState (const ACHAR *layerStateName)
 Acad::ErrorStatus  | setLayout (AcDbObjectId layoutId)
 Acad::ErrorStatus  | setLiveSection (const AcDbObjectId &liveSectionId)
 Acad::ErrorStatus  | setParametersFromViewport (AcDbObjectId objId)
Acad::ErrorStatus  | setPreviewImage (const Atil::Image *pPreviewImage)
Acad::ErrorStatus  | setSun (AcDbObjectId &retId, AcDbObject *pSun)
Acad::ErrorStatus  | setSun (AcDbObjectId &retId, AcDbObject *pSun, bool eraseOldSun)
 Acad::ErrorStatus  | setThumbnail (const BITMAPINFO *thumbnail)
 Acad::ErrorStatus  | setViewAssociatedToViewport (bool bVPflag)
AcDbObjectId  | sunId () const
 Public Member Functions inherited from AcDbAbstractViewTableRecord
ACDB_DECLARE_MEMBERS (AcDbAbstractViewTableRecord)
 AcCmColor  | ambientLightColor () const
 double  | backClipDistance () const
 bool  | backClipEnabled () const
 const AcDbObjectId &  | background () const
 AcDbObjectId &  | background ()
 double  | brightness () const
 AcGePoint2d  | centerPoint () const
 double  | contrast () const
 AcGiViewportTraits::DefaultLightingType  | defaultLightingType () const
 double  | elevation () const
 bool  | frontClipAtEye () const
 double  | frontClipDistance () const
 bool  | frontClipEnabled () const
 Acad::ErrorStatus  | getUcs (AcGePoint3d &origin, AcGeVector3d &xAxis, AcGeVector3d &yAxis) const
 double  | height () const
 bool  | isDefaultLightingOn () const
 bool  | isUcsOrthographic (AcDb::OrthographicView &view) const
 bool  | isViewOrthographic (AcDb::OrthographicView &view) const
 double  | lensLength () const
 bool  | perspectiveEnabled () const
 Acad::ErrorStatus  | setAmbientLightColor (const AcCmColor &clr)
 void  | setBackClipDistance (double distance)
 void  | setBackClipEnabled (bool enabled)
 Acad::ErrorStatus  | setBackground (const AcDbObjectId &backgroundId)
 Acad::ErrorStatus  | setBrightness (double)
 void  | setCenterPoint (const AcGePoint2d &)
 Acad::ErrorStatus  | setContrast (double)
 Acad::ErrorStatus  | setDefaultLightingOn (bool on)
 Acad::ErrorStatus  | setDefaultLightingType (AcGiViewportTraits::DefaultLightingType typ)
 Acad::ErrorStatus  | setElevation (double elev)
 void  | setFrontClipAtEye (bool atEye)
 void  | setFrontClipDistance (double distance)
 void  | setFrontClipEnabled (bool enabled)
 void  | setHeight (double height)
 void  | setLensLength (double length)
 void  | setPerspectiveEnabled (bool enabled)
Acad::ErrorStatus  | setSun (AcDbObjectId &retId, AcDbObject *pSun)
Acad::ErrorStatus  | setSun (AcDbObjectId &retId, AcDbObject *pSun, bool eraseOldSun)
 void  | setTarget (const AcGePoint3d &target)
 Acad::ErrorStatus  | setToneOperatorParameters (const AcGiToneOperatorParameters &params)
 Acad::ErrorStatus  | setUcs (const AcGePoint3d &origin, const AcGeVector3d &xAxis, const AcGeVector3d &yAxis)
 Acad::ErrorStatus  | setUcs (AcDb::OrthographicView view)
 Acad::ErrorStatus  | setUcs (const AcDbObjectId &ucsId)
 Acad::ErrorStatus  | setUcsToWorld ()
 void  | setViewDirection (const AcGeVector3d &viewDirection)
 Acad::ErrorStatus  | setViewDirection (AcDb::OrthographicView view)
 void  | setViewTwist (double angle)
 Acad::ErrorStatus  | setVisualStyle (const AcDbObjectId &visualStyleId)
 void  | setWidth (double width)
 AcDbObjectId  | sunId () const
 AcGePoint3d  | target () const
 Acad::ErrorStatus  | toneOperatorParameters (AcGiToneOperatorParameters &params) const
 AcDbObjectId  | ucsName () const
 AcGeVector3d  | viewDirection () const
 double  | viewTwist () const
 AcDbObjectId  | visualStyle () const
 double  | width () const
 Public Member Functions inherited from AcDbSymbolTableRecord
ACDB_DECLARE_MEMBERS (AcDbSymbolTableRecord)
 Acad::ErrorStatus  | getName (ACHAR *&pName) const
 Acad::ErrorStatus  | getName (AcString &sName) const
 Acad::ErrorStatus  | getName (const ACHAR *&pName) const
 bool  | isDependent () const
bool  | isRenamable () const
 bool  | isResolved () const
 Acad::ErrorStatus  | setName (const ACHAR *pName)
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const override
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
Member Function Documentation
 AcDbObjectId AcDbViewTableRecord::camera  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewTableRecord::getCategoryName  |  ( |  AcString &  |  sCategoryName | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewTableRecord::getLayerState  |  ( |  AcString &  |  layerStateName | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbViewTableRecord::getPreviewImage  |  ( |  Atil::Image *&  |  pPreviewImage | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbViewTableRecord::setCamera  |  ( |  AcDbObjectId  |  cameraId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbViewTableRecord::setPreviewImage  |  ( |  const Atil::Image *  |  pPreviewImage | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbViewTableRecord::setSun  |  ( |  AcDbObjectId &  |  retId,
|  AcDbObject *  |  pSun
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbViewTableRecord::setSun  |  ( |  AcDbObjectId &  |  retId,
|  AcDbObject *  |  pSun,
|  bool  |  eraseOldSun
)
Warning
Not implemented!
 AcDbObjectId AcDbViewTableRecord::sunId  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbsymtb.h