Public Member Functions | Protected Member Functions | Friends | List of all members
AcDbGeoMap Class Reference
AcDb Classes
  Inheritance diagram for AcDbGeoMap:
 Public Member Functions
AcDbGeoMap ()
AcDbGeoMap (AcGeoMapType mapType, AcGeoMapResolution resolution, unsigned int levelOfDetail)
AcDbGeoMap (AcDbObjectId viewportId, bool isViewportSpecific)
ACRX_DECLARE_MEMBERS (AcDbGeoMap)
virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj) override
AcGePoint3d  | bottomLeftPt () const
Adesk::Int8  | brightness () const override
const AcGePoint2dArray &  | clipBoundary () const override
Adesk::Int8  | contrast () const override
Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) override
Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const override
Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) override
Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const override
Adesk::Int8  | fade () const override
Adesk::Boolean  | freeScanLines (AcGiSentScanLines *pSSL) const override
Acad::ErrorStatus  | getImageVertices (AcGePoint3dArray &verts) const
void  | getOrientation (AcGePoint3d &origin, AcGeVector3d &u, AcGeVector3d &v) const override
AcGiSentScanLines *  | getScanLines (const AcGiRequestScanLines &req) const override
Acad::ErrorStatus  | getVertices (AcGePoint3dArray &verts) const override
double  | height () const
AcGePoint3d  | imageBottomLeftPt () const
AcDbObjectId  | imageDefId () const override
double  | imageHeight () const
AcGeVector2d  | imageSize (Adesk::Boolean bGetCachedValue=Adesk::kFalse) const override
double  | imageWidth () const
Adesk::Boolean  | isOutOfDate () const
unsigned int  | LOD () const
AcGeoMapType  | mapType () const
AcGeoMapResolution  | resolution () const
Acad::ErrorStatus  | setBrightness (Adesk::Int8 value) override
Acad::ErrorStatus  | setContrast (Adesk::Int8 value) override
Acad::ErrorStatus  | setFade (Adesk::Int8 value) override
Acad::ErrorStatus  | setMapType (AcGeoMapType mapType)
Acad::ErrorStatus  | setResolution (AcGeoMapResolution resolution)
Acad::ErrorStatus  | subErase (Adesk::Boolean erasing) override
Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const override
Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const override
Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const override
Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *ent, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const override
Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *ent, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const override
Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) override
Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) override
Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &xform) override
Adesk::Boolean  | updateMapImage (Adesk::Boolean bReset=Adesk::kFalse)
double  | width () const
virtual  | ~AcDbGeoMap ()
 Public Member Functions inherited from AcDbRasterImage
ACRX_DECLARE_MEMBERS (AcDbRasterImage)
 virtual bool  | castShadows () const override
 virtual ClipBoundaryType  | clipBoundaryType () const
 virtual Acad::ErrorStatus  | getPixelToModelTransform (AcGeMatrix3d &) const
 double  | height () const
double  | imageHeight () const
double  | imageWidth () const
 virtual Adesk::Boolean  | isClipInverted () const
 Adesk::Boolean  | isClipped () const
bool  | isImageShown () const
bool  | isImageTransparent () const
 virtual Adesk::Boolean  | isSetDisplayOpt (ImageDisplayOpt option) const
bool  | isShownClipped () const
AcGePoint3d  | position () const
 RasterImageImp *  | ptrImp () const
 virtual AcDbObjectId  | reactorId () const
 virtual bool  | receiveShadows () const override
 double  | rotation () const
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st) override
 virtual AcGeVector2d  | scale () const
 virtual void  | setCastShadows (bool newVal) override
 virtual Acad::ErrorStatus  | setClipBoundary (ClipBoundaryType type, const AcGePoint2dArray &)
 virtual Acad::ErrorStatus  | setClipBoundaryToWholeImage (AcGeVector2d &size)
 Acad::ErrorStatus  | setClipBoundaryToWholeImage ()
 virtual void  | setClipInverted (Adesk::Boolean newVal)
 virtual void  | setDisplayOpt (ImageDisplayOpt option, Adesk::Boolean bValue)
 Acad::ErrorStatus  | setHeight (double)
 virtual Acad::ErrorStatus  | setImageDefId (AcDbObjectId imageId)
void  | setImageTransparency (bool value)
 virtual Adesk::Boolean  | setOrientation (const AcGePoint3d &origin, const AcGeVector3d &uCorner, const AcGeVector3d &vOnPlane)
 RasterImageImp *  | setPtrImp (RasterImageImp *pImp)
 virtual void  | setReactorId (AcDbObjectId reactorId)
 virtual void  | setReceiveShadows (bool newVal) override
 Acad::ErrorStatus  | setRotation (double rotation)
void  | setShowClipped (bool value)
void  | setShowImage (bool value)
 Acad::ErrorStatus  | setWidth (double)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=Adesk::kFalse, Adesk::Boolean swapExtDict=Adesk::kFalse) override
 double  | width () const
 Public Member Functions inherited from AcDbImage
ACRX_DECLARE_MEMBERS (AcDbImage)
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths) ADESK_SEALED
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo) override
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual bool  | bounds (AcDbExtents &bounds) const override
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | cloneMeForDragging () ADESK_SEALED
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths) ADESK_SEALED
 virtual void  | dragStatus (const AcDb::DragStat status)
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable () override
 AcCmEntityColor  | entityColor () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const ADESK_SEALED
 virtual void  | getEcs (AcGeMatrix3d &retVal) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const ADESK_SEALED
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const ADESK_SEALED
 virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=nullptr) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | gripStatus (const AcDb::GripStat status) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL bool  | hideMeForDragging () const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const ADESK_SEALED
AcGiHighlightStyle  | highlightState (const AcDbFullSubentPath &subId)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const ADESK_SEALED
ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL bool  | isContentSnappable () const ADESK_SEALED
 virtual Adesk::Boolean  | isPlanar () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | layer (AcString &sName) const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | linetype (AcString &sName) const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | list () const ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | material (AcString &sName) const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | plotStyleName (AcString &sName) const
 ACHAR *  | plotStyleName () const
Acad::ErrorStatus  | popHighlight (const AcDbFullSubentPath &subId)
Acad::ErrorStatus  | pushHighlight (const AcDbFullSubentPath &subId, AcGiHighlightStyle highlightStyle)
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | setColor (const AcCmColor &color, bool doSubents, AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, bool doSubents=true) final
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true) ADESK_SEALED
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId visualStyleId, VisualStyleType vsType=kFullVisualStyle, Adesk::Boolean doSubents=true)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL AcDbEntity *  | subentPtr (const AcDbFullSubentPath &id) const ADESK_SEALED
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform) ADESK_SEALED
 AcCmTransparency  | transparency () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const ADESK_SEALED
 AcDb::Visibility  | visibility () const
AcDbObjectId  | visualStyleId (VisualStyleType vsType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const override
Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &extents) const override
virtual void  | subList () const override
Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
void  | subViewportDraw (AcGiViewportDraw *pViewportDraw) override
Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWorldDraw) override
 Protected Member Functions inherited from AcDbRasterImage
void  | baseList () const
 virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &entitySet) const override
 virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const override
 virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &stretchPoints) const override
 virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=0) const override
 virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&ent) const override
virtual void  | subGripStatus (const AcDb::GripStat status) override
 virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) override
 virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &id) const override
 Protected Member Functions inherited from AcDbEntity
AcDbEntity (const AcDbEntity &)=delete
 AcDbEntity &  | operator= (const AcDbEntity &)=delete
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual bool  | subHideMeForDragging () const
 virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
virtual ACDBCORE2D_PORT AcGiHighlightStyle  | subHighlightState (const AcDbFullSubentPath &subId)
virtual bool  | subIsContentSnappable () const
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subPopHighlight (const AcDbFullSubentPath &subId)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subPushHighlight (const AcDbFullSubentPath &subId, AcGiHighlightStyle highlightStyle)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual ACDBCORE2D_PORT AcDb::Visibility  | subVisibility () const
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbGeoMapSystemInternals
 Additional Inherited Members
 Public Types inherited from AcDbRasterImage
enum  | ClipBoundaryType { kInvalid, kRect, kPoly }
enum  | ImageDisplayOpt { kShow = 1, kShowUnAligned = 2, kClip = 4, kTransparent = 8 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Static Public Member Functions inherited from AcDbRasterImage
 static ClassVersion  | classVersion ()
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
Constructor & Destructor Documentation
 AcDbGeoMap::AcDbGeoMap  |  ( |   | )
Warning
Not implemented!
 AcDbGeoMap::AcDbGeoMap  |  ( |  AcGeoMapType  |  mapType,
|  AcGeoMapResolution  |  resolution,
|  unsigned int  |  levelOfDetail
)
Warning
Not implemented!
 AcDbGeoMap::AcDbGeoMap  |  ( |  AcDbObjectId  |  viewportId,
|  bool  |  isViewportSpecific
)
Warning
Not implemented!
 virtual AcDbGeoMap::~AcDbGeoMap  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbGeoMap::applyPartialUndo  |  ( |  AcDbDwgFiler *  |  undoFiler,
|  AcRxClass *  |  classObj
)
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 AcGePoint3d AcDbGeoMap::bottomLeftPt  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::Int8 AcDbGeoMap::brightness  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 const AcGePoint2dArray& AcDbGeoMap::clipBoundary  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Adesk::Int8 AcDbGeoMap::contrast  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Adesk::Int8 AcDbGeoMap::fade  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Adesk::Boolean AcDbGeoMap::freeScanLines  |  ( |  AcGiSentScanLines *  |  pSSL | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::getImageVertices  |  ( |  AcGePoint3dArray &  |  verts | ) |   const
Warning
Not implemented!
 void AcDbGeoMap::getOrientation  |  ( |  AcGePoint3d &  |  origin,
|  AcGeVector3d &  |  u,
|  AcGeVector3d &  |  v
) |   |  const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 AcGiSentScanLines* AcDbGeoMap::getScanLines  |  ( |  const AcGiRequestScanLines &  |  req | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::getVertices  |  ( |  AcGePoint3dArray &  |  verts | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 double AcDbGeoMap::height  |  ( |   | ) |   const
Warning
Not implemented!
 AcGePoint3d AcDbGeoMap::imageBottomLeftPt  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbGeoMap::imageDefId  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 double AcDbGeoMap::imageHeight  |  ( |   | ) |   const
Warning
Not implemented!
 AcGeVector2d AcDbGeoMap::imageSize  |  ( |  Adesk::Boolean  |  bGetCachedValue = Adesk::kFalse | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 double AcDbGeoMap::imageWidth  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::Boolean AcDbGeoMap::isOutOfDate  |  ( |   | ) |   const
Warning
Not implemented!
 unsigned int AcDbGeoMap::LOD  |  ( |   | ) |   const
Warning
Not implemented!
 AcGeoMapType AcDbGeoMap::mapType  |  ( |   | ) |   const
Warning
Not implemented!
 AcGeoMapResolution AcDbGeoMap::resolution  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbGeoMap::setBrightness  |  ( |  Adesk::Int8  |  value | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::setContrast  |  ( |  Adesk::Int8  |  value | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::setFade  |  ( |  Adesk::Int8  |  value | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::setMapType  |  ( |  AcGeoMapType  |  mapType | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbGeoMap::setResolution  |  ( |  AcGeoMapResolution  |  resolution | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbGeoMap::subErase  |  ( |  Adesk::Boolean  |  erasing | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual Acad::ErrorStatus AcDbGeoMap::subGetClassID  |  ( |  CLSID *  |  pClsid | ) |   const
overrideprotectedvirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::subGetGeomExtents  |  ( |  AcDbExtents &  |  extents | ) |   const
overrideprotectedvirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::subGetGripPoints  |  ( |  AcDbGripDataPtrArray &  |  grips,
|  const double  |  curViewUnitSize,
|  const int  |  gripSize,
|  const AcGeVector3d &  |  curViewDir,
|  const int  |  bitflags
) |   |  const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::subGetGripPoints  |  ( |  AcGePoint3dArray &  |  gripPoints,
|  AcDbIntArray &  |  osnapModes,
|  AcDbIntArray &  |  geomIds
) |   |  const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::subGetOsnapPoints  |  ( |  AcDb::OsnapMode  |  osnapMode,
|  Adesk::GsMarker  |  gsSelectionMark,
|  const AcGePoint3d &  |  pickPoint,
|  const AcGePoint3d &  |  lastPoint,
|  const AcGeMatrix3d &  |  viewXform,
|  AcGePoint3dArray &  |  snapPoints,
|  AcDbIntArray &  |  geomIds
) |   |  const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::subIntersectWith  |  ( |  const AcDbEntity *  |  ent,
|  AcDb::Intersect  |  intType,
|  AcGePoint3dArray &  |  points,
|  Adesk::GsMarker  |  thisGsMarker = 0,
|  Adesk::GsMarker  |  otherGsMarker = 0
) |   |  const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::subIntersectWith  |  ( |  const AcDbEntity *  |  ent,
|  AcDb::Intersect  |  intType,
|  const AcGePlane &  |  projPlane,
|  AcGePoint3dArray &  |  points,
|  Adesk::GsMarker  |  thisGsMarker = 0,
|  Adesk::GsMarker  |  otherGsMarker = 0
) |   |  const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 virtual void AcDbGeoMap::subList  |  ( |   | ) |   const
overrideprotectedvirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::subMoveGripPointsAt  |  ( |  const AcDbVoidPtrArray &  |  gripAppData,
|  const AcGeVector3d &  |  offset,
|  const int  |  bitflags
)
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Acad::ErrorStatus AcDbGeoMap::subMoveGripPointsAt  |  ( |  const AcDbIntArray &  |  indices,
|  const AcGeVector3d &  |  offset
)
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Adesk::UInt32 AcDbGeoMap::subSetAttributes  |  ( |  AcGiDrawableTraits *  |  pTraits | )
overrideprotectedvirtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 Acad::ErrorStatus AcDbGeoMap::subTransformBy  |  ( |  const AcGeMatrix3d &  |  xform | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 void AcDbGeoMap::subViewportDraw  |  ( |  AcGiViewportDraw *  |  pViewportDraw | )
overrideprotectedvirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Adesk::Boolean AcDbGeoMap::subWorldDraw  |  ( |  AcGiWorldDraw *  |  pWorldDraw | )
overrideprotectedvirtual
Warning
Not implemented!
Reimplemented from AcDbRasterImage.
 Adesk::Boolean AcDbGeoMap::updateMapImage  |  ( |  Adesk::Boolean  |  bReset = Adesk::kFalse | )
Warning
Not implemented!
 double AcDbGeoMap::width  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbGeoMap.h