Public Types | Public Member Functions | List of all members
AcDbVertexRef Class Reference
AcDb Classes
  Inheritance diagram for AcDbVertexRef:
 Public Types
enum  | ImpliedType {
 kExplicitVertex, kUnknownType, kEdgeStart, kEdgeEnd,
 kEdgeMid, kEdgeCenter, kEdgeSplineControlPoint, kEdgeSplineFitPoint
 }
 Public Member Functions
AcDbVertexRef ()
AcDbVertexRef (const AcDbVertexRef &)
AcDbVertexRef (const AcDbCompoundObjectId &, const AcDbSubentId &=kNullSubentId, const AcGePoint3d &=AcGePoint3d::kOrigin)
AcDbVertexRef (const AcDbFullSubentPath &)
AcDbVertexRef (const AcDbEntity *)
AcDbVertexRef (const AcGePoint3d &)
AcDbVertexRef (ImpliedType, const AcDbEdgeRef &edgeRef, int controlOrFitPointIndex=0, const AcGePoint3d &=AcGePoint3d::kOrigin)
ACRX_DECLARE_MEMBERS (AcDbVertexRef)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *) override
class AcDbEntity *  | createEntity () const override
virtual const AcDbCompoundObjectId &  | entity () const override
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry () override
virtual Acad::ErrorStatus  | evaluatePoint (AcGePoint3d &) const
 ImpliedType  | impliedType () const
 int  | index () const
virtual bool  | isValid () const override
AcDbVertexRef &  | operator= (const AcDbVertexRef &)
AcGePoint3d  | point () const
 const AcDbGeomRef *  | referencedRef () const
virtual void  | reset () override
virtual AcDbSubentId  | subentId () const override
virtual  | ~AcDbVertexRef ()
 Public Member Functions inherited from AcDbSubentRef
AcDbSubentRef (const AcDbCompoundObjectId &, const AcDbSubentId &=kNullSubentId)
ACRX_DECLARE_MEMBERS (AcDbSubentRef)
 virtual bool  | isEmpty () const override
AcDbSubentRef &  | operator= (const AcDbSubentRef &)
 Public Member Functions inherited from AcDbGeomRef
ACRX_DECLARE_MEMBERS (AcDbGeomRef)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcDbSubentRef
 void  | setEntity (const AcDbCompoundObjectId &entityId)
void  | setFromSubentPath (const AcDbFullSubentPath &)
 void  | setSubent (const AcDbSubentId &subentId)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbVertexRef::AcDbVertexRef  |  ( |   | )
Warning
Not implemented!
 AcDbVertexRef::AcDbVertexRef  |  ( |  const AcDbVertexRef &  |   | )
Warning
Not implemented!
 virtual AcDbVertexRef::~AcDbVertexRef  |  ( |   | )
virtual
Warning
Not implemented!
 AcDbVertexRef::AcDbVertexRef  |  ( |  const AcDbCompoundObjectId &  |  ,
|  const AcDbSubentId &  |   = kNullSubentId,
|  const AcGePoint3d &  |   = AcGePoint3d::kOrigin
)
explicit
Warning
Not implemented!
 AcDbVertexRef::AcDbVertexRef  |  ( |  const AcDbFullSubentPath &  |   | )
explicit
Warning
Not implemented!
 AcDbVertexRef::AcDbVertexRef  |  ( |  const AcDbEntity *  |   | )
explicit
Warning
Not implemented!
 AcDbVertexRef::AcDbVertexRef  |  ( |  const AcGePoint3d &  |   | )
explicit
Warning
Not implemented!
 AcDbVertexRef::AcDbVertexRef  |  ( |  ImpliedType  |  ,
|  const AcDbEdgeRef &  |  edgeRef,
|  int  |  controlOrFitPointIndex = 0,
|  const AcGePoint3d &  |   = AcGePoint3d::kOrigin
)
explicit
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbVertexRef::copyFrom  |  ( |  const AcRxObject *  |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 class AcDbEntity* AcDbVertexRef::createEntity  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 virtual const AcDbCompoundObjectId& AcDbVertexRef::entity  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 virtual Acad::ErrorStatus AcDbVertexRef::evaluateAndCacheGeometry  |  ( |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 virtual Acad::ErrorStatus AcDbVertexRef::evaluatePoint  |  ( |  AcGePoint3d &  |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcDbVertexRef::isValid  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 AcDbVertexRef& AcDbVertexRef::operator=  |  ( |  const AcDbVertexRef &  |   | )
Warning
Not implemented!
 AcGePoint3d AcDbVertexRef::point  |  ( |   | ) |   const
Warning
Not implemented!
 virtual void AcDbVertexRef::reset  |  ( |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 virtual AcDbSubentId AcDbVertexRef::subentId  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbSubentRef.
 The documentation for this class was generated from the following file:
AcDbGeomRef.h