Public Member Functions | Protected Attributes | Friends | List of all members
AcFdFieldEvaluatorLoader Class Reference
AcFd Classes
  Inheritance diagram for AcFdFieldEvaluatorLoader:
 Public Member Functions
 ACDBCORE2D_PORT  | AcFdFieldEvaluatorLoader (void *)
ACRX_DECLARE_MEMBERS (AcFdFieldEvaluatorLoader)
virtual ACDBCORE2D_PORT AcFdFieldEvaluator *  | findEvaluator (AcDbField *pField, const ACHAR *&pszEvalId)
virtual ACDBCORE2D_PORT AcFdFieldEvaluator *  | getEvaluator (const ACHAR *pszEvalId)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Attributes
 void *  | mpImpObj
 Friends
 class  | AcFdSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual ACDBCORE2D_PORT AcFdFieldEvaluator* AcFdFieldEvaluatorLoader::findEvaluator  |  ( |  AcDbField *  |  pField,
|  const ACHAR *&  |  pszEvalId
)
virtual
Warning
Not implemented!
 virtual ACDBCORE2D_PORT AcFdFieldEvaluator* AcFdFieldEvaluatorLoader::getEvaluator  |  ( |  const ACHAR *  |  pszEvalId | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcField.h