Public Member Functions | Protected Attributes | List of all members
AcGsGraphicsKernel Class Referenceabstract
AcGs Classes
  Inheritance diagram for AcGsGraphicsKernel:
 Public Member Functions
 virtual void  | addModelReactor (AcGsModel *pModel, AcGsModelReactor *pReactor)=0
 virtual void  | addReactor (AcGsReactor *pReactor)=0
DRAWBRIDGE_API void  | addRef (void)
 virtual void  | associate (Adesk::LongPtr databasePtr, AcGsModel *pModel, AcGsModel::RenderType renderType)=0
 virtual AcGsDevice *  | createDevice (AcGsWindowingSystemID id, GS::DeviceType deviceType=GS::kScreenDevice)=0
 virtual AcGsModel *  | createModel (AcGsModel::RenderType type, Adesk::IntDbId databaseId, AcGsGetInterfaceFunc getFunc, AcGsReleaseInterfaceFunc releaseFunc)=0
 virtual AcGsDevice *  | createOffScreenDevice (void)=0
 virtual AcGsView *  | createView (const AcGsClientViewInfo *pClientViewInfo=nullptr, bool bEnableLayerVisibilityPerView=false)=0
 virtual void  | deleteDevice (AcGsDevice *pDevice)=0
 virtual void  | deleteModel (AcGsModel *pModel)=0
 virtual void  | deleteView (AcGsView *pView)=0
DRAWBRIDGE_API bool  | delRef (void)
 virtual AcGsModel *  | find (Adesk::LongPtr databasePtr, AcGsModel::RenderType renderType)=0
 virtual AcGsConfig *  | getConfig (void) const =0
 virtual bool  | isCompatibleWith (const AcGsKernelDescriptor &descriptor) const =0
 virtual void  | removeModelReactor (AcGsModel *pModel, AcGsModelReactor *pReactor)=0
 virtual void  | removeReactor (AcGsReactor *pReactor)=0
 Public Member Functions inherited from AcGiGraphicsKernel
 virtual const AcGiKernelDescriptor &  | getDescriptor (void) const
 Protected Attributes
 int  | m_refCount
Member Function Documentation
 DRAWBRIDGE_API void AcGsGraphicsKernel::addRef  |  ( |  void  |   | )
Warning
Not implemented!
 DRAWBRIDGE_API bool AcGsGraphicsKernel::delRef  |  ( |  void  |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
gs.h