Public Member Functions | List of all members
AcDbEntityReactor Class Reference
AcDb Classes
  Inheritance diagram for AcDbEntityReactor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbEntityReactor)
 virtual void  | dragCloneToBeDeleted (const AcDbEntity *pOriginalObj, const AcDbEntity *pClone)
 virtual void  | modifiedGraphics (const AcDbEntity *dbObj)
 Public Member Functions inherited from AcDbObjectReactor
ACRX_DECLARE_MEMBERS (AcDbObjectReactor)
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 virtual void  | openedForModify (const AcDbObject *dbObj)
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual void  | unappended (const AcDbObject *dbObj)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbmain.h