Public Types | Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcGraphNode Class Reference
AcDb Classes
  Inheritance diagram for AcGraphNode:
 Public Types
enum  | { kNullId = 0 }
 typedef Adesk::UInt32  | Id
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGraphNode)
virtual void  | backup ()
Acad::ErrorStatus  | connectNode (AcGraphNode *pNode)
Acad::ErrorStatus  | disconnectAllNodes ()
Acad::ErrorStatus  | disconnectNode (AcGraphNode *pNode)
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Acad::ErrorStatus  | getAdjacentNodes (AcArray< AcGraphNode * > &adjacentNodes) const
bool  | isAdjacentTo (AcGraphNode *pNode) const
Id  | nodeId () const
virtual Acad::ErrorStatus  | nodeToBeConnectedNotification (AcGraphNode *pNode)
virtual Acad::ErrorStatus  | nodeToBeDisconnectedNotification (AcGraphNode *pNode)
virtual Acad::ErrorStatus  | nodeToBeMovedNotification (AcGraph *pGraph, AcArray< AcGraphNode * > &otherNodesToMove)
AcGraph *  | owningGraph () const
virtual  | ~AcGraphNode ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
AcGraphNode (bool bCreateImp=true)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Protected Attributes
 AcImpGraphNode *  | mpImpGraphNode
 Friends
 class  | AcGraph
 class  | AcImpGraph
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
Constructor & Destructor Documentation
 virtual AcGraphNode::~AcGraphNode  |  ( |   | )
virtual
Warning
Not implemented!
 AcGraphNode::AcGraphNode  |  ( |  bool  |  bCreateImp = true | )
explicitprotected
Warning
Not implemented!
Member Function Documentation
 virtual void AcGraphNode::backup  |  ( |   | )
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcGraphNode::connectNode  |  ( |  AcGraphNode *  |  pNode | )
Warning
Not implemented!
 Acad::ErrorStatus AcGraphNode::disconnectAllNodes  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcGraphNode::disconnectNode  |  ( |  AcGraphNode *  |  pNode | )
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGraphNode::dwgInFields  |  ( |  AcDbDwgFiler *  |   | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGraphNode::dwgOutFields  |  ( |  AcDbDwgFiler *  |   | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGraphNode::dxfInFields  |  ( |  AcDbDxfFiler *  |   | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGraphNode::dxfOutFields  |  ( |  AcDbDxfFiler *  |   | ) |   const
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcGraphNode::getAdjacentNodes  |  ( |  AcArray< AcGraphNode * > &  |  adjacentNodes | ) |   const
Warning
Not implemented!
 bool AcGraphNode::isAdjacentTo  |  ( |  AcGraphNode *  |  pNode | ) |   const
Warning
Not implemented!
 Id AcGraphNode::nodeId  |  ( |   | ) |   const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGraphNode::nodeToBeConnectedNotification  |  ( |  AcGraphNode *  |  pNode | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGraphNode::nodeToBeDisconnectedNotification  |  ( |  AcGraphNode *  |  pNode | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGraphNode::nodeToBeMovedNotification  |  ( |  AcGraph *  |  pGraph,
|  AcArray< AcGraphNode * > &  |  otherNodesToMove
)
virtual
Warning
Not implemented!
 AcGraph* AcGraphNode::owningGraph  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcGraphNode.h