Public Member Functions | Static Public Member Functions | List of all members
AcRxSharedObject Class Reference
AcRx Classes
  Inheritance diagram for AcRxSharedObject:
 Public Member Functions
ACBASE_PORT  | AcRxSharedObject ()
ACBASE_PORT  | AcRxSharedObject (void *nativeHandle)
ACBASE_PORT  | AcRxSharedObject (AcRxSharedObject &&from)=default
ACBASE_PORT void *  | getSymbol (const char *name) const noexcept
ACBASE_PORT bool  | isLoaded () const noexcept
ACBASE_PORT AcRxSharedObject &  | operator= (AcRxSharedObject &&from)
ACBASE_PORT  | ~AcRxSharedObject ()=default
 Static Public Member Functions
static ACBASE_PORT AcRxSharedObject  | tryLoad (const wchar_t *path, bool autoRelease=true)
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Additional Inherited Members
 Protected Member Functions inherited from Pimpl::ApiPart< AcHeapOperators, Autodesk::AutoCAD::PAL::AcRxSharedObjImp >
ApiPart (Autodesk::AutoCAD::PAL::AcRxSharedObjImp *pImp) throw ()
Constructor & Destructor Documentation
 ACBASE_PORT AcRxSharedObject::AcRxSharedObject  |  ( |   | )
Warning
Not implemented!
 ACBASE_PORT AcRxSharedObject::AcRxSharedObject  |  ( |  void *  |  nativeHandle | )
Warning
Not implemented!
 ACBASE_PORT AcRxSharedObject::~AcRxSharedObject  |  ( |   | )
default
Warning
Not implemented!
 ACBASE_PORT AcRxSharedObject::AcRxSharedObject  |  ( |  AcRxSharedObject &&  |  from | )
default
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT void* AcRxSharedObject::getSymbol  |  ( |  const char *  |  name | ) |   const
noexcept
Warning
Not implemented!
 ACBASE_PORT bool AcRxSharedObject::isLoaded  |  ( |   | ) |   const
noexcept
Warning
Not implemented!
 ACBASE_PORT AcRxSharedObject& AcRxSharedObject::operator=  |  ( |  AcRxSharedObject &&  |  from | )
Warning
Not implemented!
 static ACBASE_PORT AcRxSharedObject AcRxSharedObject::tryLoad  |  ( |  const wchar_t *  |  path,
|  bool  |  autoRelease = true
)
static
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxsharedobj.h