Public Types | Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcDbHostApplicationServices Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbHostApplicationServices:
 Public Types
enum  | FindFileHint {
 kDefault = 0, kFontFile, kCompiledShapeFile, kTrueTypeFontFile,
 kEmbeddedImageFile, kXRefDrawing, kPatternFile, kARXApplication,
 kFontMapFile, kUnderlayFile, kDataLinkFile, kPhotometricWebFile,
 kMaterialMapFile, kCloudOrProjectFile
 }
enum  | ModelerFlavor { kModelerFull =0, kModelerRegionsOnly =1, kModelerObjectsOnly =2 }
enum  | PasswordOptions { kPasswordOptionDefault = 0, kPasswordOptionUpperCase =1, kPasswordOptionIsExternalReference = 2 }
enum  | RemapFileContext { kDrawingOpen, kXrefResolution, kRasterResolution, kAfterXrefResolution }
enum  | RequiredVersionFlags { kNoOpen = 0, kReadOnly = 1, kWriteAllowed = 2 }
 Public Member Functions
 virtual ACDBCORE2D_PORT Adesk::Boolean  | _entToWorldTransform (double normal[3], flagmat *tran)
 ACDBCORE2D_PORT void *  | acadInternalGetvar (const ACHAR *name)
 virtual ACDBCORE2D_PORT AcadInternalServices *  | acadInternalServices ()
virtual ACDBCORE2D_PORT AcadInternalServices2 *  | acadInternalServices2 ()
 ACDBCORE2D_PORT  | AcDbHostApplicationServices (int createGlobals=1)
ACRX_DECLARE_MEMBERS (AcDbHostApplicationServices)
 virtual ACDBCORE2D_PORT void  | alert (const ACHAR *string) const
 virtual ACDBCORE2D_PORT void  | auditPrintReport (AcDbAuditInfo *pAuditInfo, const ACHAR *line, int both) const
 virtual ACDBCORE2D_PORT bool  | cacheSymbolIndices () const
 virtual ACDBCORE2D_PORT const ACHAR *  | companyName ()
 virtual ACDBCORE2D_PORT AcDbGlobals *  | createWorkingGlobals ()
 virtual ACDBCORE2D_PORT AcDbUndoController *  | defaultUndoController ()
 virtual ACDBCORE2D_PORT void  | displayChar (ACHAR c) const
 virtual ACDBCORE2D_PORT void  | displayString (const ACHAR *string, int count) const
 virtual ACDBCORE2D_PORT Adesk::Boolean  | doFullCRCCheck ()
 virtual ACDBCORE2D_PORT void  | drawOleOwnerDrawItem (COleClientItem *pItem, Adesk::LongPtr hdc, Adesk::Int32 left, Adesk::Int32 top, Adesk::Int32 right, Adesk::Int32 bottom)
 virtual ACDBCORE2D_PORT void  | enableMessageDisplay (Adesk::Boolean)
 virtual ACDBCORE2D_PORT void  | fatalError (const ACHAR *format,...)
 ACDBCORE2D_PORT Acad::ErrorStatus  | findFile (AcString &fileOut, const ACHAR *pcFilename, AcDbDatabase *pDb=nullptr, AcDbHostApplicationServices::FindFileHint hint=AcDbHostApplicationServices::kDefault)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getAllUsersRootFolder (const ACHAR *&folder)
 virtual ACDBCORE2D_PORT const ACHAR *  | getAlternateFontName () const
 virtual ACDBCORE2D_PORT const ACHAR *  | getColorBookLocation () const
 virtual ACDBCORE2D_PORT bool  | getDefaultPlotCfgInfo (ACHAR *plotDeviceName, size_t nDevNameLen, ACHAR *plotStyleName, size_t nStyleNameLen)
 template<size_t nDevLen, size_t nStyleLen>
bool  | getDefaultPlotCfgInfo (ACHAR(&devName)[nDevLen], ACHAR(&styleName)[nStyleLen])
 ACDBCORE2D_PORT void  | getDefaultPlotCfgInfo (AcString &devName, AcString &styleName)
 virtual ACDBCORE2D_PORT const ACHAR *  | getEnv (const ACHAR *var)
 virtual ACDBCORE2D_PORT const ACHAR *  | getFontMapFileName () const
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getGraphicsCacheFolder (const ACHAR *&folder)
virtual ACDBCORE2D_PORT short  | getKeyState (int nVirtKey) const
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getLocalRootFolder (const ACHAR *&folder)
 virtual ACDBCORE2D_PORT const ACHAR *  | getMachineRegistryProductRootKey ()
 virtual ACDBCORE2D_PORT ModelerFlavor  | getModelerFlavor () const
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getNewOleClientItem (COleClientItem *&pItem)
virtual ACDBCORE2D_PORT bool  | getPassword (const ACHAR *dwgName, PasswordOptions options, wchar_t *password, const size_t bufSize)
bool  | getPassword (const ACHAR *dwgName, AcDbHostApplicationServices::PasswordOptions options, AcString &password)
 ACDBCORE2D_PORT AcPwdCache *  | getPasswordCache () const
virtual ACDBCORE2D_PORT AcLocale  | getProductLocale ()
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getRegisteredFileMapClients (AcArray< const ACHAR * > &clients)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getRegisteredSelectFileClients (AcArray< const ACHAR * > &clients)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getRemoteFile (const ACHAR *pszURL, ACHAR *pszLocalFile, size_t nLocalFileLen, bool bIgnoreCache) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | getRemoteFile (const ACHAR *pszURL, AcString &strLocalFile, bool bIgnoreCache) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | getRemoteFile (const ACHAR *pszURL, AcString &strLocalFile)
 template<size_t N>
Acad::ErrorStatus  | getRemoteFile (const ACHAR *pszURL, ACHAR(&pszLocalFile)[N]) const
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getRoamableRootFolder (const ACHAR *&folder)
 virtual ACDBCORE2D_PORT Adesk::Boolean  | getSubstituteFont (ACHAR **pFileName, const ACHAR *prompt, int type, int fontAlt)
 virtual Adesk::Boolean  | getSubstituteFont (ACHAR **pFileName, ACHAR *prompt, int type, int fontAlt) final
 ACDBCORE2D_PORT code_page_id  | getSystemCodePage () const
 virtual ACDBCORE2D_PORT unsigned int  | getTempPath (Adesk::UInt32 lBufferSize, ACHAR *pcBuffer)
ACDBCORE2D_PORT AcString  | getTempPath ()
 virtual ACDBCORE2D_PORT const ACHAR *  | getUserRegistryProductRootKey ()
 virtual ACDBCORE2D_PORT bool  | isRemoteFile (const ACHAR *pszLocalFile, ACHAR *pszURL, size_t nUrlLen) const
 template<size_t N>
bool  | isRemoteFile (const ACHAR *pszLocalFile, ACHAR(&pszURL)[N]) const
ACDBCORE2D_PORT bool  | isRemoteFile (const ACHAR *pszLocalFile, AcString &strUrl)
 virtual ACDBCORE2D_PORT bool  | isURL (const ACHAR *pszURL) const
 virtual ACDBCORE2D_PORT Adesk::Boolean  | launchBrowserDialog (ACHAR *pszSelectedURL, size_t selectedUrlLen, const ACHAR *pszDialogTitle, const ACHAR *pszOpenButtonCaption, const ACHAR *pszStartURL, const ACHAR *pszRegistryRootKey=0, Adesk::Boolean bOpenButtonAlwaysEnabled=Adesk::kFalse) const
 template<size_t N>
Adesk::Boolean  | launchBrowserDialog (ACHAR(&pszSelectedURL)[N], const ACHAR *pszDialogTitle, const ACHAR *pszOpenButtonCaption, const ACHAR *pszStartURL, const ACHAR *pszRegistryRootKey=0, Adesk::Boolean bOpenButtonAlwaysEnabled=Adesk::kFalse) const
 virtual ACDBCORE2D_PORT AcDbLayoutManager *  | layoutManager () const
 virtual ACDBCORE2D_PORT bool  | loadApp (const ACHAR *appName, AcadApp::LoadReasons why, bool printit, bool asCmd)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | mapFile (ACHAR *&newName, const ACHAR *filename, int context, void *pReserved)
 virtual ACDBCORE2D_PORT void  | missingCryptoProviderMsg ()
 virtual ACDBCORE2D_PORT ClipBoundaryArray *  | newClipBoundaryArray ()
 virtual ACDBCORE2D_PORT AcDbAbstractClipBoundaryDefinition *  | newClipBoundaryPolygonal ()
 virtual ACDBCORE2D_PORT AcDbAbstractClipBoundaryDefinition *  | newClipBoundaryRectangular ()
 virtual ACDBCORE2D_PORT AcDbHostApplicationProgressMeter *  | newProgressMeter ()
virtual ACDBCORE2D_PORT bool  | notifyCorruptDrawingFoundOnOpen (AcDbObjectId id, Acad::ErrorStatus es)
 virtual ACDBCORE2D_PORT AcDbPlotSettingsValidator *  | plotSettingsValidator () const
 virtual ACDBCORE2D_PORT const ACHAR *  | primaryClientForMapFileCallback ()
 virtual ACDBCORE2D_PORT const ACHAR *  | primaryClientForSelectFileCallback ()
 virtual ACDBCORE2D_PORT const ProdIdCode  | prodcode ()
 virtual ACDBCORE2D_PORT const ACHAR *  | product ()
 virtual ACDBCORE2D_PORT const ACHAR *  | program ()
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | putRemoteFile (const ACHAR *pszURL, const ACHAR *pszLocalFile) const
 virtual ACDBCORE2D_PORT Adesk::Boolean  | readyToDisplayMessages ()
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | registerMapFileCallback (const ACHAR *appName, REMAPPROC proc, bool unRegister=false, bool asPrimary=false)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | registerMapFileNotification (const ACHAR *appName, MAPFILENOTIFYPROC, bool unRegister=false)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | registerSelectFileCallback (const ACHAR *appName, SELECTFILEPROC proc, bool unRegister=false, bool asPrimary=false)
 virtual ACDBCORE2D_PORT const ACHAR *  | releaseMajorMinorString ()
 virtual ACDBCORE2D_PORT int  | releaseMajorVersion ()
virtual ACDBCORE2D_PORT const ACHAR *  | releaseMarketVersion ()
 virtual ACDBCORE2D_PORT int  | releaseMinorVersion ()
 virtual ACDBCORE2D_PORT void  | reportUnhandledArxException (const ACHAR *pExceptionDescription, const ACHAR *pAppName)
virtual ACDBCORE2D_PORT bool  | requiredVersionNotAvailable (AcDbHostApplicationServices::RequiredVersionFlags flags, AcDbDatabase *pDb) const
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | selectFile (short *userCancel, ACHAR *&chosenPath, void *h, const int nFlags, const ACHAR *prompt, const ACHAR *dir, const ACHAR *name, const ACHAR *type, int *pnChoice, bool *pbReadOnly, const ACHAR *pszWSTags, AcStringArray *pReserved)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | serializeOleItem (COleClientItem *pItem, CArchive *)
 ACDBCORE2D_PORT void  | setDefaultUndoController (AcDbUndoController *pUndoCtrl)
 virtual ACDBCORE2D_PORT bool  | setMapFlag (bool setIt)
 ACDBCORE2D_PORT void  | setWorkingAppSysvars (AcDbAppSystemVariables *pSysvars)
 ACDBCORE2D_PORT void  | setWorkingDatabase (AcDbDatabase *pDatabase)
 ACDBCORE2D_PORT void  | setWorkingGlobals (AcDbGlobals *pGlobals)
 ACDBCORE2D_PORT void  | setWorkingProgressMeter (AcDbHostApplicationProgressMeter *pNewMeter)
 void  | setWorkingTransactionManager (AcDbTransactionManager *pTM)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | signingComplete (Acad::ErrorStatus es, const ACHAR *msg, bool *result)
 virtual ACDBCORE2D_PORT bool  | supportsMultiRedo () const
 virtual ACDBCORE2D_PORT void  | terminateScript ()
 virtual ACDBCORE2D_PORT void  | usedPasswordFromCacheMsg (const ACHAR *dwgName)
 virtual ACDBCORE2D_PORT Adesk::Boolean  | userBreak (bool updCtrlsWhenEnteringIdle=true) const
 virtual ACDBCORE2D_PORT const ACHAR *  | versionString ()
 ACDBCORE2D_PORT AcDbAppSystemVariables *  | workingAppSysvars () const
 AcDbDatabase *  | workingDatabase () const
 ACDBCORE2D_PORT AcDbGlobals *  | workingGlobals () const
 virtual AcDbTransactionManager *  | workingTransactionManager ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 void  | acadInternalSetvar (const ACHAR *name, void *var)
 Acad::ErrorStatus  | mapInetStatusToAcadStatus (const AcadInet::Status status) const
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Protected Attributes
 void *  | mp_sessionVars = nullptr
 Friends
 class  | AcadInternalServices
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
Member Function Documentation
 virtual ACDBCORE2D_PORT AcadInternalServices2* AcDbHostApplicationServices::acadInternalServices2  |  ( |   | )
virtual
Warning
Not implemented!
 virtual ACDBCORE2D_PORT short AcDbHostApplicationServices::getKeyState  |  ( |  int  |  nVirtKey | ) |   const
virtual
Warning
Not implemented!
 virtual ACDBCORE2D_PORT bool AcDbHostApplicationServices::getPassword  |  ( |  const ACHAR *  |  dwgName,
|  PasswordOptions  |  options,
|  wchar_t *  |  password,
|  const size_t  |  bufSize
)
virtual
Warning
Not implemented!
 bool AcDbHostApplicationServices::getPassword  |  ( |  const ACHAR *  |  dwgName,
|  AcDbHostApplicationServices::PasswordOptions  |  options,
|  AcString &  |  password
)
Warning
Not implemented!
 virtual ACDBCORE2D_PORT AcLocale AcDbHostApplicationServices::getProductLocale  |  ( |   | )
virtual
Warning
Not implemented!
 ACDBCORE2D_PORT AcString AcDbHostApplicationServices::getTempPath  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbHostApplicationServices::isRemoteFile  |  ( |  const ACHAR *  |  pszLocalFile,
|  AcString &  |  strUrl
)
Warning
Not implemented!
 virtual ACDBCORE2D_PORT bool AcDbHostApplicationServices::notifyCorruptDrawingFoundOnOpen  |  ( |  AcDbObjectId  |  id,
|  Acad::ErrorStatus  |  es
)
virtual
Warning
Not implemented!
 virtual ACDBCORE2D_PORT const ACHAR* AcDbHostApplicationServices::releaseMarketVersion  |  ( |   | )
virtual
Warning
Not implemented!
 virtual ACDBCORE2D_PORT bool AcDbHostApplicationServices::requiredVersionNotAvailable  |  ( |  AcDbHostApplicationServices::RequiredVersionFlags  |  flags,
|  AcDbDatabase *  |  pDb
) |   |  const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbapserv.h