Public Member Functions | List of all members
AcDbSubentityOverrule Class Reference
AcDb Classes
  Inheritance diagram for AcDbSubentityOverrule:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbSubentityOverrule)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | addSubentPaths (AcDbEntity *pSubject, const AcDbFullSubentPathArray &newPaths)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | deleteSubentPaths (AcDbEntity *pSubject, const AcDbFullSubentPathArray &paths)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getCompoundObjectTransform (const AcDbEntity *pSubject, AcGeMatrix3d &xMat)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbEntity *pSubject, const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbEntity *pSubject, const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getSubentClassId (const AcDbEntity *pSubject, const AcDbFullSubentPath &path, CLSID *clsId)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbEntity *pSubject, const AcDbFullSubentPath &path, AcDbExtents &extents)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | getSubentPathsAtGsMarker (const AcDbEntity *pSubject, AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | moveGripPointsAtSubentPaths (AcDbEntity *pSubject, const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual ACDBCORE2D_PORT void  | subentGripStatus (AcDbEntity *pSubject, const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual ACDBCORE2D_PORT AcDbEntity *  | subentPtr (const AcDbEntity *pSubject, const AcDbFullSubentPath &id)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | transformSubentPathsBy (AcDbEntity *pSubject, const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 Public Member Functions inherited from AcRxOverrule
ACRX_DECLARE_MEMBERS (AcRxOverrule)
 virtual bool  | isApplicable (const AcRxObject *pOverruledSubject) const =0
 Public Member Functions inherited from AcRxOverruleBase
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxOverruleBase, ACBASE_PORT)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxOverrule
 static Acad::ErrorStatus  | addOverrule (AcRxClass *pClass, AcRxOverrule *pOverrule, bool bAddAtLast=false)
 static bool  | hasOverrule (const AcRxObject *pSubject, AcRxClass *pOverruleClass)
 static bool  | isOverruling (void)
 static Acad::ErrorStatus  | removeOverrule (AcRxClass *pClass, AcRxOverrule *pOverrule)
 static void  | setIsOverruling (bool bIsOverruling)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbentityoverrule.h