Public Member Functions | List of all members
AcGeNurbCurve3d Class Reference
AcGe Classes
  Inheritance diagram for AcGeNurbCurve3d:
 Public Member Functions
AcGeNurbCurve3d (const AcGeNurbCurve3d &src)
AcGeNurbCurve3d (int degree, const AcGeKnotVector &knots, const AcGePoint3dArray &cntrlPnts, Adesk::Boolean isPeriodic=Adesk::kFalse)
AcGeNurbCurve3d (int degree, const AcGeKnotVector &knots, const AcGePoint3dArray &cntrlPnts, const AcGeDoubleArray &weights, Adesk::Boolean isPeriodic=Adesk::kFalse)
AcGeNurbCurve3d (int degree, const AcGePolyline3d &fitPolyline, Adesk::Boolean isPeriodic=Adesk::kFalse)
AcGeNurbCurve3d (const AcGePoint3dArray &fitPoints, const AcGeVector3d &startTangent, const AcGeVector3d &endTangent, Adesk::Boolean startTangentDefined=Adesk::kTrue, Adesk::Boolean endTangentDefined=Adesk::kTrue, const AcGeTol &fitTolerance=AcGeContext::gTol)
AcGeNurbCurve3d (const AcGePoint3dArray &fitPoints, const AcGeVector3d &startTangent, const AcGeVector3d &endTangent, Adesk::Boolean startTangentDefined, Adesk::Boolean endTangentDefined, AcGe::KnotParameterization knotParam, const AcGeTol &fitTolerance=AcGeContext::gTol)
AcGeNurbCurve3d (const AcGePoint3dArray &fitPoints, const AcGeTol &fitTolerance=AcGeContext::gTol)
AcGeNurbCurve3d (const AcGePoint3dArray &fitPoints, const AcGeVector3dArray &fitTangents, const AcGeTol &fitTolerance=AcGeContext::gTol, Adesk::Boolean isPeriodic=Adesk::kFalse)
AcGeNurbCurve3d (const AcGeCurve3d &curve, double epsilon=AcGeContext::gTol.equalPoint())
AcGeNurbCurve3d (const AcGeEllipArc3d &ellipse)
AcGeNurbCurve3d (const AcGeLineSeg3d &linSeg)
Adesk::Boolean  | addControlPointAt (double newKnot, const AcGePoint3d &point, double weight=1.0)
 Adesk::Boolean  | addFitPointAt (int index, const AcGePoint3d &point)
 AcGeNurbCurve3d &  | addKnot (double newKnot)
Adesk::Boolean  | buildFitData ()
Adesk::Boolean  | buildFitData (KnotParameterization kp)
Adesk::Boolean  | deleteControlPointAt (int index)
 Adesk::Boolean  | deleteFitPointAt (int index)
 AcGeNurbCurve3d &  | elevateDegree (int plusDegree)
 Adesk::Boolean  | evalMode () const
 void  | getDefinitionData (int &degree, Adesk::Boolean &rational, Adesk::Boolean &periodic, AcGeKnotVector &knots, AcGePoint3dArray &controlPoints, AcGeDoubleArray &weights) const
 Adesk::Boolean  | getFitData (AcGePoint3dArray &fitPoints, AcGeTol &fitTolerance, Adesk::Boolean &tangentsExist, AcGeVector3d &startTangent, AcGeVector3d &endTangent) const
Adesk::Boolean  | getFitData (AcGePoint3dArray &fitPoints, AcGeTol &fitTolerance, Adesk::Boolean &tangentsExist, AcGeVector3d &startTangent, AcGeVector3d &endTangent, KnotParameterization &knotParam) const
Adesk::Boolean  | getFitKnotParameterization (KnotParameterization &knotParam) const
 Adesk::Boolean  | getFitPointAt (int index, AcGePoint3d &point) const
 Adesk::Boolean  | getFitTangents (AcGeVector3d &startTangent, AcGeVector3d &endTangent) const
 Adesk::Boolean  | getFitTangents (AcGeVector3d &startTangent, AcGeVector3d &endTangent, Adesk::Boolean &startTangentDefined, Adesk::Boolean &endTangentDefined) const
 Adesk::Boolean  | getFitTolerance (AcGeTol &fitTolerance) const
 Adesk::Boolean  | getParamsOfC1Discontinuity (AcGeDoubleArray &params, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | getParamsOfG1Discontinuity (AcGeDoubleArray &params, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeNurbCurve3d &  | hardTrimByParams (double newStartParam, double newEndParam)
 AcGeNurbCurve3d &  | insertKnot (double newKnot)
 AcGeNurbCurve3d &  | joinWith (const AcGeNurbCurve3d &curve)
 AcGeNurbCurve3d &  | makeClosed ()
 AcGeNurbCurve3d &  | makeNonPeriodic ()
 AcGeNurbCurve3d &  | makeOpen ()
 AcGeNurbCurve3d &  | makePeriodic ()
 AcGeNurbCurve3d &  | makeRational (double weight=1.0)
 int  | numFitPoints () const
 int  | numWeights () const
 AcGeNurbCurve3d &  | operator= (const AcGeNurbCurve3d &spline)
 Adesk::Boolean  | purgeFitData ()
 AcGeNurbCurve3d &  | setEvalMode (Adesk::Boolean evalMode=Adesk::kFalse)
 AcGeNurbCurve3d &  | setFitData (const AcGePoint3dArray &fitPoints, const AcGeVector3d &startTangent, const AcGeVector3d &endTangent, const AcGeTol &fitTol=AcGeContext::gTol)
AcGeNurbCurve3d &  | setFitData (const AcGePoint3dArray &fitPoints, const AcGeVector3d &startTangent, const AcGeVector3d &endTangent, KnotParameterization knotParam, const AcGeTol &fitTol=AcGeContext::gTol)
 AcGeNurbCurve3d &  | setFitData (const AcGeKnotVector &fitKnots, const AcGePoint3dArray &fitPoints, const AcGeVector3d &startTangent, const AcGeVector3d &endTangent, const AcGeTol &fitTol=AcGeContext::gTol, Adesk::Boolean isPeriodic=Adesk::kFalse)
 AcGeNurbCurve3d &  | setFitData (int degree, const AcGePoint3dArray &fitPoints, const AcGeTol &fitTol=AcGeContext::gTol)
Adesk::Boolean  | setFitKnotParameterization (KnotParameterization knotParam)
 Adesk::Boolean  | setFitPointAt (int index, const AcGePoint3d &point)
 Adesk::Boolean  | setFitTangents (const AcGeVector3d &startTangent, const AcGeVector3d &endTangent)
 Adesk::Boolean  | setFitTangents (const AcGeVector3d &startTangent, const AcGeVector3d &endTangent, Adesk::Boolean startTangentDefined, Adesk::Boolean endTangentDefined) const
 Adesk::Boolean  | setFitTolerance (const AcGeTol &fitTol=AcGeContext::gTol)
 AcGeSplineEnt3d &  | setWeightAt (int idx, double val)
 double  | weightAt (int idx) const
 Public Member Functions inherited from AcGeSplineEnt3d
 int  | continuityAtKnot (int idx, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | controlPointAt (int idx) const
 int  | degree () const
 double  | endParam () const
 AcGePoint3d  | endPoint () const
 Adesk::Boolean  | hasFitData () const
 Adesk::Boolean  | isRational () const
 double  | knotAt (int idx) const
 const AcGeKnotVector &  | knots () const
 int  | numControlPoints () const
 int  | numKnots () const
AcGeSplineEnt3d &  | operator= (const AcGeSplineEnt3d &spline)
 int  | order () const
 AcGeSplineEnt3d &  | setControlPointAt (int idx, const AcGePoint3d &pnt)
 AcGeSplineEnt3d &  | setKnotAt (int idx, double val)
 double  | startParam () const
 AcGePoint3d  | startPoint () const
 Public Member Functions inherited from AcGeCurve3d
 Adesk::Boolean  | area (double startParam, double endParam, double &value, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeBoundBlock3d  | boundBlock () const
 AcGeBoundBlock3d  | boundBlock (const AcGeInterval &range) const
 AcGePoint3d  | closestPointTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | closestPointTo (const AcGeCurve3d &curve3d, AcGePoint3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGeCurve3d &curve, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | evalPoint (double param) const
 AcGePoint3d  | evalPoint (double param, int numDeriv, AcGeVector3dArray &derivArray) const
 Adesk::Boolean  | explode (AcGeVoidPointerArray &explodedCurves, AcGeIntArray &newExplodedCurves, const AcGeInterval *intrvl=NULL) const
 void  | getClosestPointTo (const AcGePoint3d &pnt, AcGePointOnCurve3d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getClosestPointTo (const AcGeCurve3d &curve3d, AcGePointOnCurve3d &pntOnThisCrv, AcGePointOnCurve3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getInterval (AcGeInterval &intrvl) const
 void  | getInterval (AcGeInterval &intrvl, AcGePoint3d &start, AcGePoint3d &end) const
 void  | getLocalClosestPoints (const AcGePoint3d &point, AcGePointOnCurve3d &approxPnt, const AcGeInterval *nbhd=0, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getLocalClosestPoints (const AcGeCurve3d &otherCurve, AcGePointOnCurve3d &approxPntOnThisCrv, AcGePointOnCurve3d &approxPntOnOtherCrv, const AcGeInterval *nbhd1=0, const AcGeInterval *nbhd2=0, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | getNormalPoint (const AcGePoint3d &pnt, AcGePointOnCurve3d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getProjClosestPointTo (const AcGePoint3d &pnt, const AcGeVector3d &projectDirection, AcGePointOnCurve3d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getProjClosestPointTo (const AcGeCurve3d &curve3d, const AcGeVector3d &projectDirection, AcGePointOnCurve3d &pntOnThisCrv, AcGePointOnCurve3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getSamplePoints (double fromParam, double toParam, double approxEps, AcGePoint3dArray &pointArray, AcGeDoubleArray &paramArray, bool forceResampling=false) const
 void  | getSamplePoints (int numSample, AcGePoint3dArray &pointArray) const
 void  | getSamplePoints (int numSample, AcGePoint3dArray &pointArray, AcGeDoubleArray &paramArray) const
 void  | getSplitCurves (double param, AcGeCurve3d *&piece1, AcGeCurve3d *&piece2) const
 void  | getTrimmedOffset (double distance, const AcGeVector3d &planeNormal, AcGeVoidPointerArray &offsetCurveList, AcGe::OffsetCrvExtType extensionType=AcGe::kFillet, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | hasEndPoint (AcGePoint3d &endPnt) const
 Adesk::Boolean  | hasStartPoint (AcGePoint3d &startPnt) const
 Adesk::Boolean  | isClosed (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isCoplanarWith (const AcGeCurve3d &curve3d, AcGePlane &plane, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isDegenerate (AcGe::EntityId &degenerateType, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isDegenerate (AcGeEntity3d *&pConvertedEntity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isLinear (AcGeLine3d &line, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, double &param, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (double param, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isPeriodic (double &period) const
 Adesk::Boolean  | isPlanar (AcGePlane &plane, const AcGeTol &tol=AcGeContext::gTol) const
 double  | length (double fromParam, double toParam, double tol=AcGeContext::gTol.equalPoint()) const
 AcGeCurve3d &  | operator= (const AcGeCurve3d &curve)
 AcGeBoundBlock3d  | orthoBoundBlock () const
 AcGeBoundBlock3d  | orthoBoundBlock (const AcGeInterval &range) const
 AcGeEntity3d *  | orthoProject (const AcGePlane &projectionPlane, const AcGeTol &tol=AcGeContext::gTol) const
 double  | paramAtLength (double datumParam, double length, Adesk::Boolean posParamDir=Adesk::kTrue, double tol=AcGeContext::gTol.equalPoint()) const
 double  | paramOf (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | projClosestPointTo (const AcGePoint3d &pnt, const AcGeVector3d &projectDirection, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | projClosestPointTo (const AcGeCurve3d &curve3d, const AcGeVector3d &projectDirection, AcGePoint3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d *  | project (const AcGePlane &projectionPlane, const AcGeVector3d &projectDirection, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeCurve3d &  | reverseParam ()
 AcGeCurve3d &  | setInterval ()
 Adesk::Boolean  | setInterval (const AcGeInterval &intrvl)
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeSplineEnt3d
AcGeSplineEnt3d (const AcGeSplineEnt3d &)
 Protected Member Functions inherited from AcGeCurve3d
AcGeCurve3d (const AcGeCurve3d &)
 Protected Member Functions inherited from AcGeEntity3d
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 class AcGeImpEntity3d *  | mpImpEnt
Constructor & Destructor Documentation
 AcGeNurbCurve3d::AcGeNurbCurve3d  |  ( |  const AcGePoint3dArray &  |  fitPoints,
|  const AcGeVector3d &  |  startTangent,
|  const AcGeVector3d &  |  endTangent,
|  Adesk::Boolean  |  startTangentDefined,
|  Adesk::Boolean  |  endTangentDefined,
|  AcGe::KnotParameterization  |  knotParam,
|  const AcGeTol &  |  fitTolerance = AcGeContext::gTol
)
Warning
Not implemented!
 AcGeNurbCurve3d::AcGeNurbCurve3d  |  ( |  const AcGeCurve3d &  |  curve,
|  double  |  epsilon = AcGeContext::gTol.equalPoint()
)
Warning
Not implemented!
Member Function Documentation
 Adesk::Boolean AcGeNurbCurve3d::addControlPointAt  |  ( |  double  |  newKnot,
|  const AcGePoint3d &  |  point,
|  double  |  weight = 1.0
)
Warning
Not implemented!
 Adesk::Boolean AcGeNurbCurve3d::buildFitData  |  ( |   | )
Warning
Not implemented!
 Adesk::Boolean AcGeNurbCurve3d::buildFitData  |  ( |  KnotParameterization  |  kp | )
Warning
Not implemented!
 Adesk::Boolean AcGeNurbCurve3d::deleteControlPointAt  |  ( |  int  |  index | )
Warning
Not implemented!
 Adesk::Boolean AcGeNurbCurve3d::getFitData  |  ( |  AcGePoint3dArray &  |  fitPoints,
|  AcGeTol &  |  fitTolerance,
|  Adesk::Boolean &  |  tangentsExist,
|  AcGeVector3d &  |  startTangent,
|  AcGeVector3d &  |  endTangent,
|  KnotParameterization &  |  knotParam
) |   |  const
Warning
Not implemented!
 Adesk::Boolean AcGeNurbCurve3d::getFitKnotParameterization  |  ( |  KnotParameterization &  |  knotParam | ) |   const
Warning
Not implemented!
 AcGeNurbCurve3d& AcGeNurbCurve3d::setFitData  |  ( |  const AcGePoint3dArray &  |  fitPoints,
|  const AcGeVector3d &  |  startTangent,
|  const AcGeVector3d &  |  endTangent,
|  KnotParameterization  |  knotParam,
|  const AcGeTol &  |  fitTol = AcGeContext::gTol
)
Warning
Not implemented!
 Adesk::Boolean AcGeNurbCurve3d::setFitKnotParameterization  |  ( |  KnotParameterization  |  knotParam | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
genurb3d.h