Public Member Functions | List of all members
AcDbGripData Class Reference
AcDb Classes
 Public Member Functions
AcDbGripData (const AcGePoint3d &, void *, GripOperationPtr hotGrip=NULL, GripOperationPtr hoverGrip=NULL, GripRtClkHandler RtClk=NULL, GripWorldDrawPtr wd=NULL, GripViewportDrawPtr vd=NULL, GripOpStatusPtr stat=NULL, GripToolTipPtr tt=NULL, GripDimensionPtr hoverDim=NULL, GripDimensionPtr hotGripDim=NULL, unsigned int bitFlags=0, AcGePoint3d *altBasePt=NULL, GripInputPointPtr inputPointFunc=NULL)
AcDbGripData (const AcGePoint3d &, void *, AcRxClass *, GripOperationPtr hotGrip=NULL, GripOperationPtr hoverGrip=NULL, GripRtClkHandler RtClk=NULL, GripWorldDrawPtr wd=NULL, GripViewportDrawPtr vd=NULL, GripOpStatusPtr stat=NULL, GripToolTipPtr tt=NULL, GripDimensionPtr hoverDim=NULL, GripDimensionPtr hotGripDim=NULL, unsigned int bitFlags=0, AcGePoint3d *altBasePt=NULL, GripInputPointPtr inputPointFunc=NULL)
AcDbGripData (const AcDbGripData &)
 AcGePoint3d *  | alternateBasePoint () const
 void *  | appData () const
 AcRxClass *  | appDataAcRxClass () const
 bool  | areModeKeywordsDisabled () const
 unsigned int  | bitFlags () const
 void  | disableGrip (bool disable)
 void  | disableModeKeywords (bool disable)
 void  | disableRubberBandLine (bool disable)
 bool  | drawAtDragImageGripPoint () const
 bool  | forcedPickOn () const
 GripCLIDisplayStringPtr  | getCLIDisplayStringFunc () const
 GripCLIPromptPtr  | getCLIPromptFunc () const
 bool  | gizmosEnabled () const
 bool  | gripIsDisabled () const
 bool  | gripIsPerViewport () const
 GripOpStatusPtr  | gripOpStatFunc () const
 const AcGePoint3d &  | gripPoint () const
 bool  | gripRightClickIsNewStyle () const
 GripDimensionPtr  | hotGripDimensionFunc () const
 GripOperationPtr  | hotGripFunc () const
 GripDimensionPtr  | hoverDimensionFunc () const
 GripOperationPtr  | hoverFunc () const
 GripInputPointPtr  | inputPointFunc () const
 bool  | isRubberBandLineDisabled () const
 bool  | mapGripHotToRtClk () const
 AcDbGripData &  | operator= (const AcDbGripData &)
 GripRightClickHandler  | righClick () const
 GripRtClkHandler  | rtClk () const
 void  | setAllData (const AcGePoint3d &, void *, GripOperationPtr hotGrip=NULL, GripOperationPtr hoverGrip=NULL, GripRtClkHandler RtClk=NULL, GripWorldDrawPtr wd=NULL, GripViewportDrawPtr vd=NULL, GripOpStatusPtr stat=NULL, GripToolTipPtr tt=NULL, GripDimensionPtr hoverDim=NULL, GripDimensionPtr hotGripDim=NULL, unsigned int bitFlags=0, AcGePoint3d *altBasePt=NULL, GripInputPointPtr inputPointFunc=NULL, AcRxClass *appDataAcRxClass=NULL)
 void  | setAlternateBasePoint (AcGePoint3d *altBasePt)
 void  | setAppData (void *appData)
 void  | setAppDataAcRxClass (AcRxClass *pClass)
 void  | setBitFlags (unsigned int flags)
 void  | setCLIDisplayStringFunc (GripCLIDisplayStringPtr pFunc)
 void  | setCLIPromptFunc (GripCLIPromptPtr pFunc)
 void  | setDrawAtDragImageGripPoint (bool atDragPoint)
 void  | setForcedPickOn (bool on)
 void  | setGizmosEnabled (bool on)
 void  | setGripIsPerViewport (bool on)
 void  | setGripOpStatFunc (GripOpStatusPtr pFunc)
 void  | setGripPoint (const AcGePoint3d &pt)
 void  | setHotGripDimensionFunc (GripDimensionPtr pFunc)
 void  | setHotGripFunc (GripOperationPtr pFunc)
 void  | setHoverDimensionFunc (GripDimensionPtr pFunc)
 void  | setHoverFunc (GripOperationPtr pFunc)
 void  | setInputPointFunc (GripInputPointPtr pFunc)
 void  | setMapGripHotToRtClk (bool on)
 void  | setRightClick (GripRightClickHandler pFunc)
 void  | setRtClk (GripRtClkHandler pFunc)
 void  | setSkipWhenShared (bool skip)
 void  | setToolTipFunc (GripToolTipPtr pFunc)
 void  | setTriggerGrip (bool trigger)
 void  | setViewportDraw (GripViewportDrawPtr pFunc)
 void  | setWorldDraw (GripWorldDrawPtr pFunc)
 bool  | skipWhenShared () const
 GripToolTipPtr  | toolTipFunc () const
 bool  | triggerGrip () const
 GripViewportDrawPtr  | viewportDraw () const
 GripWorldDrawPtr  | worldDraw () const
 The documentation for this class was generated from the following file:
dbgrip.h