Public Types | Public Member Functions | List of all members
AcGiDrawableReactor Class Reference
AcGi Classes
  Inheritance diagram for AcGiDrawableReactor:
 Public Types
enum  | RegenFlags { k2DRegen, k3DRegen }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiDrawableReactor)
 virtual void  | added (AcGiDrawable *, Adesk::IntDbId, Adesk::LongPtr)
 virtual void  | beginRegen (AcGiDrawable *, RegenFlags)
 virtual void  | endRegen (AcGiDrawable *, RegenFlags)
 virtual void  | erased (AcGiDrawable *)
 virtual void  | erased (AcGiDrawable *, Adesk::IntDbId)
 virtual void  | handOverTo (AcGiDrawable *, AcGiDrawable *)
 virtual void  | modified (AcGiDrawable *)
 virtual void  | modified (AcGiDrawable *, Adesk::IntDbId)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
drawable.h