Public Types | Public Member Functions | Protected Attributes | List of all members
AcEdInplaceTextEditorSettings Class Reference
AcEd Classes
 Public Types
enum  | EditFlags { kForceOpaqueBackground = 1 << 0, kSelectAll = 1 << 1, kCursorAtEnd = 1 << 2 }
enum  | EntityType { kDefault, kTableCell, kMultiAttribute }
 Public Member Functions
ACCORE_PORT  | AcEdInplaceTextEditorSettings ()
ACCORE_PORT double  | definedHeight () const
ACCORE_PORT int  | editFlags () const
ACCORE_PORT Acad::ErrorStatus  | setDefinedHeight (double height)
ACCORE_PORT Acad::ErrorStatus  | setEditFlags (int flags)
ACCORE_PORT Acad::ErrorStatus  | setSimpleMText (bool bSimpleMText)
ACCORE_PORT Acad::ErrorStatus  | setSourceEntityType (EntityType type)
ACCORE_PORT Acad::ErrorStatus  | setSupportTab (bool bTab)
ACCORE_PORT bool  | simpleMText () const
ACCORE_PORT EntityType  | sourceEntityType () const
ACCORE_PORT bool  | tabSupported () const
ACCORE_PORT  | ~AcEdInplaceTextEditorSettings ()
 Protected Attributes
 AcEdInplaceTextEditorSettingsImp *  | m_pImp
Constructor & Destructor Documentation
 ACCORE_PORT AcEdInplaceTextEditorSettings::AcEdInplaceTextEditorSettings  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT AcEdInplaceTextEditorSettings::~AcEdInplaceTextEditorSettings  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 ACCORE_PORT double AcEdInplaceTextEditorSettings::definedHeight  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT int AcEdInplaceTextEditorSettings::editFlags  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditorSettings::setDefinedHeight  |  ( |  double  |  height | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditorSettings::setEditFlags  |  ( |  int  |  flags | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditorSettings::setSimpleMText  |  ( |  bool  |  bSimpleMText | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditorSettings::setSourceEntityType  |  ( |  EntityType  |  type | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditorSettings::setSupportTab  |  ( |  bool  |  bTab | )
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditorSettings::simpleMText  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT EntityType AcEdInplaceTextEditorSettings::sourceEntityType  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditorSettings::tabSupported  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcEdInplaceTextEditor.h