Public Member Functions | List of all members
AcGiImageBGRA32 Class Reference
AcGi Classes
 Public Member Functions
AcGiImageBGRA32 (Adesk::UInt32 imageWidth, Adesk::UInt32 imageHeight, AcGiPixelBGRA32 *imageData)
 Adesk::UInt32  | height () const
 AcGiPixelBGRA32 *  | image () const
 void  | setImage (Adesk::UInt32 imageWidth, Adesk::UInt32 imageHeight, AcGiPixelBGRA32 *imageData)
 Adesk::UInt32  | width () const
 The documentation for this class was generated from the following file:
acgi.h