Public Member Functions | Friends | List of all members
AcDbIdMapping Class Reference
AcDb Classes
  Inheritance diagram for AcDbIdMapping:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbIdMapping)
 virtual Acad::ErrorStatus  | assign (const AcDbIdPair &)
 virtual bool  | change (const AcDbIdPair &)
 virtual bool  | compute (AcDbIdPair &) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other) override
 AcDb::DeepCloneType  | deepCloneContext () const
 virtual bool  | del (AcDbObjectId key)
 Acad::ErrorStatus  | destDb (AcDbDatabase *&db) const
 AcDb::DuplicateRecordCloning  | duplicateRecordCloning () const
 Acad::ErrorStatus  | origDb (AcDbDatabase *&db) const
 Acad::ErrorStatus  | setDestDb (AcDbDatabase *db)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpIdMappingIter
 class  | AcDbSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbidmap.h