Public Types | Public Member Functions | Protected Member Functions | List of all members
AcDbViewport Class Reference
AcDb Classes
  Inheritance diagram for AcDbViewport:
 Public Types
enum  | ShadePlotType {
 kAsDisplayed = 0, kWireframe = 1, kHidden = 2, kRendered = 3,
 kVisualStyle = 4, kRenderPreset = 5
 }
enum  | StandardScaleType {
 kScaleToFit, kCustomScale, k1_1, k1_2,
 k1_4, k1_5, k1_8, k1_10,
 k1_16, k1_20, k1_30, k1_40,
 k1_50, k1_100, k2_1, k4_1,
 k8_1, k10_1, k100_1, k1_128in_1ft,
 k1_64in_1ft, k1_32in_1ft, k1_16in_1ft, k3_32in_1ft,
 k1_8in_1ft, k3_16in_1ft, k1_4in_1ft, k3_8in_1ft,
 k1_2in_1ft, k3_4in_1ft, k1in_1ft, k1and1_2in_1ft,
 k3in_1ft, k6in_1ft, k1ft_1ft
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbViewport)
 AcCmColor  | ambientLightColor () const
 AcDbAnnotationScale *  | annotationScale () const
 double  | backClipDistance () const
 AcDbObjectId  | background () const
 double  | brightness () const
 AcGePoint3d  | centerPoint () const
 Adesk::UInt16  | circleSides () const
 double  | contrast () const
 virtual void  | copied (const AcDbObject *pDbObj, const AcDbObject *pNewObj) override
 double  | customScale () const
 AcGiViewportTraits::DefaultLightingType  | defaultLightingType () const
 Acad::ErrorStatus  | effectivePlotStyleSheet (const ACHAR *&)
 double  | elevation () const
 virtual void  | erased (const AcDbObject *, Adesk::Boolean) override
 Acad::ErrorStatus  | freezeLayersInViewport (const AcDbObjectIdArray &)
 double  | frontClipDistance () const
 Acad::ErrorStatus  | getFrozenLayerList (AcDbObjectIdArray &ids) const
 Acad::ErrorStatus  | getLabelBlock (AcDbObjectId &objId) const
 Acad::ErrorStatus  | getModelView (AcDbXrefObjectId &xrefObjId) const
Acad::ErrorStatus  | getPreviewImage (Atil::Image *&pPreviewImage) const
 Acad::ErrorStatus  | getSheetView (AcDbObjectId &objId) const
 Acad::ErrorStatus  | getThumbnail (BITMAPINFO *&thumbnail) const
 Acad::ErrorStatus  | getUcs (AcGePoint3d &origin, AcGeVector3d &xAxis, AcGeVector3d &yAxis) const
 AcGeVector2d  | gridIncrement () const
 Adesk::UInt16  | gridMajor () const
 double  | height () const
 bool  | hiddenLinesRemoved () const
 bool  | isBackClipOn () const
 bool  | isDefaultLightingOn () const
 bool  | isFastZoomOn () const
 bool  | isFrontClipAtEyeOn () const
 bool  | isFrontClipOn () const
 bool  | isGridAdaptive () const
 bool  | isGridBoundToLimits () const
 bool  | isGridFollow () const
 bool  | isGridOn () const
 bool  | isGridSubdivisionRestricted () const
 bool  | isLayerFrozenInViewport (const AcDbObjectId &layerId) const
 bool  | isLocked () const
 bool  | isNonRectClipOn () const
 bool  | isOn () const
 bool  | isPerspectiveOn () const
 bool  | isSnapIsometric () const
 bool  | isSnapOn () const
 bool  | isTransparent () const
 bool  | isUcsFollowModeOn () const
 bool  | isUcsIconAtOrigin () const
 bool  | isUcsIconVisible () const
 bool  | isUcsOrthographic (AcDb::OrthographicView &view) const
 bool  | isUcsSavedWithViewport () const
 bool  | isViewOrthographic (AcDb::OrthographicView &view) const
 double  | lensLength () const
 virtual void  | modified (const AcDbObject *) override
 AcDbObjectId  | nonRectClipEntityId () const
 Adesk::Int16  | number () const
 bool  | plotAsRaster () const
ACDBCORE2D_PORT Acad::ErrorStatus  | plotStyleSheet (AcString &sName) const
 Acad::ErrorStatus  | plotStyleSheet (ACHAR *&) const
 Acad::ErrorStatus  | plotStyleSheet (const ACHAR *&) const
 bool  | plotWireframe () const
 AcDbObjectId  | previousBackground (AcGiDrawable::DrawableType type=AcGiDrawable::kGeometry) const
bool  | previousBackgroundForcedSwitch (void) const
 Acad::ErrorStatus  | removeHiddenLines ()
ACDBCORE2D_PORT Acad::ErrorStatus  | removeHiddenLines (bool)
 Acad::ErrorStatus  | removeLabelBlock (void)
 Acad::ErrorStatus  | removeModelView (void)
 Acad::ErrorStatus  | removeSheetView (void)
 Acad::ErrorStatus  | setAmbientLightColor (const AcCmColor &clr)
 Acad::ErrorStatus  | setAnnotationScale (const AcDbAnnotationScale *pScaleObj)
 Acad::ErrorStatus  | setBackClipDistance (double newVal)
 Acad::ErrorStatus  | setBackClipOff ()
 Acad::ErrorStatus  | setBackClipOn ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setBackClipOn (bool bOn)
 Acad::ErrorStatus  | setBackground (AcDbObjectId backgroundId)
 Acad::ErrorStatus  | setBrightness (double)
 Acad::ErrorStatus  | setCenterPoint (const AcGePoint3d &)
 Acad::ErrorStatus  | setCircleSides (Adesk::UInt16)
 Acad::ErrorStatus  | setContrast (double)
 Acad::ErrorStatus  | setCustomScale (double)
 Acad::ErrorStatus  | setDefaultLightingOn (bool on)
 Acad::ErrorStatus  | setDefaultLightingType (AcGiViewportTraits::DefaultLightingType typ)
 Acad::ErrorStatus  | setElevation (double elev)
 Acad::ErrorStatus  | setFastZoomOff ()
 Acad::ErrorStatus  | setFastZoomOn ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setFastZoomOn (bool)
 Acad::ErrorStatus  | setFrontClipAtEyeOff ()
 Acad::ErrorStatus  | setFrontClipAtEyeOn ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setFrontClipAtEyeOn (bool bOn)
 Acad::ErrorStatus  | setFrontClipDistance (double newVal)
 Acad::ErrorStatus  | setFrontClipOff ()
 Acad::ErrorStatus  | setFrontClipOn ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setFrontClipOn (bool bOn)
 Acad::ErrorStatus  | setGridAdaptive (bool bNewVal)
 Acad::ErrorStatus  | setGridBoundToLimits (bool bNewVal)
 Acad::ErrorStatus  | setGridFollow (bool bNewVal)
 Acad::ErrorStatus  | setGridIncrement (const AcGeVector2d &)
 Acad::ErrorStatus  | setGridMajor (Adesk::UInt16)
 Acad::ErrorStatus  | setGridOff ()
 Acad::ErrorStatus  | setGridOn ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setGridOn (bool)
 Acad::ErrorStatus  | setGridSubdivisionRestricted (bool bNewVal)
 Acad::ErrorStatus  | setHeight (double)
 ACDBCORE2D_PORT Acad::ErrorStatus  | setIsOn (bool bOn)
 Acad::ErrorStatus  | setLabelBlock (AcDbObjectId objId)
 Acad::ErrorStatus  | setLensLength (double)
 Acad::ErrorStatus  | setLocked ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setLocked (bool)
 Acad::ErrorStatus  | setModelView (const AcDbXrefObjectId &xrefObjId)
 Acad::ErrorStatus  | setNonRectClipEntityId (AcDbObjectId)
 Acad::ErrorStatus  | setNonRectClipOff ()
 Acad::ErrorStatus  | setNonRectClipOn ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setNonRectClipOn (bool bOn)
 Acad::ErrorStatus  | setOff ()
 Acad::ErrorStatus  | setOn ()
 Acad::ErrorStatus  | setOpaque ()
 Acad::ErrorStatus  | setPerspectiveOff ()
 Acad::ErrorStatus  | setPerspectiveOn ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setPerspectiveOn (bool bOn)
 Acad::ErrorStatus  | setPlotStyleSheet (const ACHAR *)
Acad::ErrorStatus  | setPreviewImage (const Atil::Image *pPreviewImage)
 Acad::ErrorStatus  | setPreviousBackground (AcDbObjectId backgroundId, AcGiDrawable::DrawableType type=AcGiDrawable::kGeometry)
Acad::ErrorStatus  | setPreviousBackground (AcDbObjectId backgroundId, AcGiDrawable::DrawableType type, bool bForcedSwitch)
 Acad::ErrorStatus  | setShadePlot (const ShadePlotType)
 Acad::ErrorStatus  | setShadePlot (const ShadePlotType type, const AcDbObjectId shadePlotId)
 Acad::ErrorStatus  | setSheetView (AcDbObjectId objId)
 Acad::ErrorStatus  | setSnapAngle (double)
 Acad::ErrorStatus  | setSnapBasePoint (const AcGePoint2d &)
 Acad::ErrorStatus  | setSnapIncrement (const AcGeVector2d &)
 Acad::ErrorStatus  | setSnapIsometric ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setSnapIsometric (bool)
 Acad::ErrorStatus  | setSnapIsoPair (Adesk::UInt16)
 Acad::ErrorStatus  | setSnapOff ()
 Acad::ErrorStatus  | setSnapOn ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setSnapOn (bool)
 Acad::ErrorStatus  | setSnapStandard ()
 Acad::ErrorStatus  | setStandardScale (const StandardScaleType)
 Acad::ErrorStatus  | setSun (AcDbObjectId &retId, AcDbObject *pSun)
Acad::ErrorStatus  | setSun (AcDbObjectId &retId, AcDbObject *pSun, bool eraseOldSun)
 Acad::ErrorStatus  | setThumbnail (const BITMAPINFO *thumbnail)
 Acad::ErrorStatus  | setToneOperatorParameters (const AcGiToneOperatorParameters &params)
 Acad::ErrorStatus  | setTransparent ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setTransparent (bool)
 Acad::ErrorStatus  | setTwistAngle (double)
 Acad::ErrorStatus  | setUcs (const AcGePoint3d &origin, const AcGeVector3d &xAxis, const AcGeVector3d &yAxis)
 Acad::ErrorStatus  | setUcs (AcDb::OrthographicView view)
 Acad::ErrorStatus  | setUcs (const AcDbObjectId &ucsId)
 Acad::ErrorStatus  | setUcsFollowModeOff ()
 Acad::ErrorStatus  | setUcsFollowModeOn ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setUcsFollowModeOn (bool bOn)
 Acad::ErrorStatus  | setUcsIconAtCorner ()
 Acad::ErrorStatus  | setUcsIconAtOrigin ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setUcsIconAtOrigin (bool)
 Acad::ErrorStatus  | setUcsIconInvisible ()
 Acad::ErrorStatus  | setUcsIconVisible ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setUcsIconVisible (bool)
 void  | setUcsPerViewport (bool ucsvp)
 Acad::ErrorStatus  | setUcsToWorld ()
 Acad::ErrorStatus  | setUnlocked ()
 Acad::ErrorStatus  | setViewCenter (const AcGePoint2d &pt)
 Acad::ErrorStatus  | setViewDirection (const AcGeVector3d &)
 Acad::ErrorStatus  | setViewDirection (AcDb::OrthographicView view)
 Acad::ErrorStatus  | setViewHeight (double ht)
 Acad::ErrorStatus  | setViewTarget (const AcGePoint3d &)
 Acad::ErrorStatus  | setVisualStyle (const AcDbObjectId oidVisualStyle)
 Acad::ErrorStatus  | setWidth (double)
 ShadePlotType  | shadePlot () const
 AcDbObjectId  | shadePlotId () const
 Acad::ErrorStatus  | showHiddenLines ()
 double  | snapAngle () const
 AcGePoint2d  | snapBasePoint () const
 AcGeVector2d  | snapIncrement () const
 Adesk::UInt16  | snapIsoPair () const
 StandardScaleType  | standardScale () const
 virtual void  | subObjModified (const AcDbObject *pDbObj, const AcDbObject *pSubObj) override
 AcDbObjectId  | sunId () const
 Acad::ErrorStatus  | syncModelView (void)
 Acad::ErrorStatus  | thawAllLayersInViewport ()
 Acad::ErrorStatus  | thawLayersInViewport (const AcDbObjectIdArray &)
 Acad::ErrorStatus  | toneOperatorParameters (AcGiToneOperatorParameters &params) const
 double  | twistAngle () const
 AcDbObjectId  | ucsName () const
 Acad::ErrorStatus  | updateDisplay () const
 AcGePoint2d  | viewCenter () const
 AcGeVector3d  | viewDirection () const
 double  | viewHeight () const
 AcGePoint3d  | viewTarget () const
 AcDbObjectId  | visualStyle () const
 double  | width () const
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths) ADESK_SEALED
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj) override
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo) override
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual bool  | bounds (AcDbExtents &bounds) const override
 virtual bool  | castShadows () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | cloneMeForDragging () ADESK_SEALED
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths) ADESK_SEALED
 virtual void  | dragStatus (const AcDb::DragStat status)
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable () override
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) override
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const override
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) override
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const override
 AcCmEntityColor  | entityColor () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const ADESK_SEALED
 virtual void  | getEcs (AcGeMatrix3d &retVal) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const ADESK_SEALED
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const ADESK_SEALED
 virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=nullptr) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | gripStatus (const AcDb::GripStat status) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL bool  | hideMeForDragging () const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const ADESK_SEALED
AcGiHighlightStyle  | highlightState (const AcDbFullSubentPath &subId)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const ADESK_SEALED
ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL bool  | isContentSnappable () const ADESK_SEALED
 virtual Adesk::Boolean  | isPlanar () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | layer (AcString &sName) const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | linetype (AcString &sName) const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | list () const ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | material (AcString &sName) const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | plotStyleName (AcString &sName) const
 ACHAR *  | plotStyleName () const
Acad::ErrorStatus  | popHighlight (const AcDbFullSubentPath &subId)
Acad::ErrorStatus  | pushHighlight (const AcDbFullSubentPath &subId, AcGiHighlightStyle highlightStyle)
 virtual bool  | receiveShadows () const
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st)
 virtual void  | setCastShadows (bool newVal)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | setColor (const AcCmColor &color, bool doSubents, AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, bool doSubents=true) final
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual void  | setReceiveShadows (bool newVal)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true) ADESK_SEALED
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId visualStyleId, VisualStyleType vsType=kFullVisualStyle, Adesk::Boolean doSubents=true)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL AcDbEntity *  | subentPtr (const AcDbFullSubentPath &id) const ADESK_SEALED
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform) ADESK_SEALED
 AcCmTransparency  | transparency () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const ADESK_SEALED
 AcDb::Visibility  | visibility () const
AcDbObjectId  | visualStyleId (VisualStyleType vsType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const override
 Protected Member Functions inherited from AcDbEntity
AcDbEntity (const AcDbEntity &)=delete
 AcDbEntity &  | operator= (const AcDbEntity &)=delete
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &entitySet) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &stretchPoints) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=nullptr) const
 virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const
 virtual void  | subGripStatus (const AcDb::GripStat status)
 virtual bool  | subHideMeForDragging () const
 virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
virtual ACDBCORE2D_PORT AcGiHighlightStyle  | subHighlightState (const AcDbFullSubentPath &subId)
 virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
virtual bool  | subIsContentSnappable () const
 virtual void  | subList () const
 virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subPopHighlight (const AcDbFullSubentPath &subId)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subPushHighlight (const AcDbFullSubentPath &subId, AcGiHighlightStyle highlightStyle)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &id) const
 virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual ACDBCORE2D_PORT AcDb::Visibility  | subVisibility () const
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
Member Function Documentation
 Acad::ErrorStatus AcDbViewport::getPreviewImage  |  ( |  Atil::Image *&  |  pPreviewImage | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::plotStyleSheet  |  ( |  AcString &  |  sName | ) |   const
Warning
Not implemented!
 bool AcDbViewport::previousBackgroundForcedSwitch  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::removeHiddenLines  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setBackClipOn  |  ( |  bool  |  bOn | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setFastZoomOn  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setFrontClipAtEyeOn  |  ( |  bool  |  bOn | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setFrontClipOn  |  ( |  bool  |  bOn | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setGridOn  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setLocked  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setNonRectClipOn  |  ( |  bool  |  bOn | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setPerspectiveOn  |  ( |  bool  |  bOn | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbViewport::setPreviewImage  |  ( |  const Atil::Image *  |  pPreviewImage | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbViewport::setPreviousBackground  |  ( |  AcDbObjectId  |  backgroundId,
|  AcGiDrawable::DrawableType  |  type,
|  bool  |  bForcedSwitch
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setSnapIsometric  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setSnapOn  |  ( |  bool  |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbViewport::setSun  |  ( |  AcDbObjectId &  |  retId,
|  AcDbObject *  |  pSun,
|  bool  |  eraseOldSun
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setTransparent  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setUcsFollowModeOn  |  ( |  bool  |  bOn | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setUcsIconAtOrigin  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbViewport::setUcsIconVisible  |  ( |  bool  |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbents.h