Public Member Functions | List of all members
AcGiGraphicsKernel Class Reference
AcGi Classes
  Inheritance diagram for AcGiGraphicsKernel:
 Public Member Functions
 virtual const AcGiKernelDescriptor &  | getDescriptor (void) const
 The documentation for this class was generated from the following file:
acgi.h