Public Member Functions | List of all members
AcEdUIContext Class Referenceabstract
AcEd Classes
  Inheritance diagram for AcEdUIContext:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcEdUIContext)
 virtual void *  | getMenuContext (const AcRxClass *, const AcDbObjectIdArray &)=0
 virtual void *  | getMenuContext (const AcRxClass *, const AcDbObjectIdArray &, const AcArray< AcDbFullSubentPathArray, AcArrayObjectCopyReallocator< AcDbFullSubentPathArray > > &subentIds)
 virtual void  | onCommand (Adesk::UInt32)=0
 virtual void  | OnUpdateMenu ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
aced.h