Public Member Functions | Protected Member Functions | Friends | List of all members
AcRxProperty Class Reference
AcRx Classes
  Inheritance diagram for AcRxProperty:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxProperty, ACBASE_PORT)
ACBASE_PORT Acad::ErrorStatus  | getValue (const AcRxObject *pO, AcRxValue &value) const
ACBASE_PORT Acad::ErrorStatus  | setValue (AcRxObject *pO, const AcRxValue &value) const
 Public Member Functions inherited from AcRxPropertyBase
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxPropertyBase, ACBASE_PORT)
ACBASE_PORT bool  | isReadOnly (const AcRxObject *pO) const
 Public Member Functions inherited from AcRxMember
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxMember, ACBASE_PORT)
ACBASE_PORT const AcRxAttributeCollection &  | attributes () const throw ()
ACBASE_PORT AcRxAttributeCollection &  | attributes () throw ()
ACBASE_PORT const AcArray< const AcRxMember * > *  | children () const throw ()
ACBASE_PORT AcString  | localName () const throw ()
ACBASE_PORT const ACHAR *  | name () const throw ()
ACBASE_PORT const AcRxObject *  | owner () const throw ()
ACBASE_PORT const AcRxValueType &  | type () const throw ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
ACBASE_PORT  | AcRxProperty (const ACHAR *name, const AcRxValueType &type, const AcRxObject *owner=NULL) throw ()
AcRxProperty (AcRxPropertyImp *)
virtual ACBASE_PORT Acad::ErrorStatus  | subGetValue (const AcRxObject *pO, AcRxValue &value) const
virtual ACBASE_PORT Acad::ErrorStatus  | subSetValue (AcRxObject *pO, const AcRxValue &value) const
ACBASE_PORT  | ~AcRxProperty ()
 Protected Member Functions inherited from AcRxPropertyBase
ACBASE_PORT  | AcRxPropertyBase (AcRxPropertyBaseImp *)
ACBASE_PORT  | ~AcRxPropertyBase ()
 Protected Member Functions inherited from AcRxMember
ACBASE_PORT  | AcRxMember (AcRxMemberImp *) throw ()
virtual ACBASE_PORT Acad::ErrorStatus  | subChildren (AcArray< const AcRxMember * > &children) const
virtual ACBASE_PORT AcString  | subLocalName () const
virtual ACBASE_PORT  | ~AcRxMember () throw ()
 Protected Member Functions inherited from Pimpl::ApiPart< AcRxObject, AcRxMemberImp >
ApiPart (AcRxMemberImp *pImp) throw ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcRxPropertyImp
 class  | AcRxPropertyOverrule
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxMember
static ACBASE_PORT void  | deleteMember (const AcRxMember *pMember) throw ()
static ACBASE_PORT void *  | operator new (size_t size)
static ACBASE_PORT void *  | operator new (size_t size, const char *pFName, int nLine)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Protected Member Functions inherited from AcRxMember
static ACBASE_PORT void  | operator delete (void *p)
static ACBASE_PORT void  | operator delete (void *p, const char *pFName, int nLine)
static ACBASE_PORT void  | operator delete[] (void *p)
static ACBASE_PORT void  | operator delete[] (void *p, const char *pFName, int nLine)
Constructor & Destructor Documentation
 ACBASE_PORT AcRxProperty::~AcRxProperty  |  ( |   | )
protected
Warning
Not implemented!
 ACBASE_PORT AcRxProperty::AcRxProperty  |  ( |  const ACHAR *  |  name,
|  const AcRxValueType &  |  type,
|  const AcRxObject *  |  owner = NULL
)
 throw  | (
)
protected
Warning
Not implemented!
 AcRxProperty::AcRxProperty  |  ( |  AcRxPropertyImp *  |   | )
protected
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT Acad::ErrorStatus AcRxProperty::getValue  |  ( |  const AcRxObject *  |  pO,
|  AcRxValue &  |  value
) |   |  const
Warning
Not implemented!
 ACBASE_PORT Acad::ErrorStatus AcRxProperty::setValue  |  ( |  AcRxObject *  |  pO,
|  const AcRxValue &  |  value
) |   |  const
Warning
Not implemented!
 virtual ACBASE_PORT Acad::ErrorStatus AcRxProperty::subGetValue  |  ( |  const AcRxObject *  |  pO,
|  AcRxValue &  |  value
) |   |  const
protectedvirtual
Warning
Not implemented!
 virtual ACBASE_PORT Acad::ErrorStatus AcRxProperty::subSetValue  |  ( |  AcRxObject *  |  pO,
|  const AcRxValue &  |  value
) |   |  const
protectedvirtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxprop.h