Public Types | Public Member Functions | List of all members
AcRxUnitTypeAttribute Class Reference
AcRx Classes
  Inheritance diagram for AcRxUnitTypeAttribute:
 Public Types
enum  | UnitType {
 kUnitless = 0, kDistance = (0x1 << 0), kAngle = (0x1 << 1), kArea = (0x1 << 2),
 kVolume = (0x1 << 3), kCurrency = (0x1 << 4), kPercentage = (0x1 << 5), kAngleNotTransformed = (0x1 << 16)
 }
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxUnitTypeAttribute, ACBASE_PORT)
ACBASE_PORT  | AcRxUnitTypeAttribute (UnitType unitType)
ACBASE_PORT UnitType  | unitType () const
 Public Member Functions inherited from AcRxAttribute
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxAttribute, ACBASE_PORT)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxAttribute
ACBASE_PORT  | AcRxAttribute (AcRxAttributeImp *)
 Protected Member Functions inherited from Pimpl::ApiPart< AcRxObject, AcRxAttributeImp >
ApiPart (AcRxAttributeImp *pImp) throw ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 ACBASE_PORT AcRxUnitTypeAttribute::AcRxUnitTypeAttribute  |  ( |  UnitType  |  unitType | )
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT UnitType AcRxUnitTypeAttribute::unitType  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxattrib.h