Public Member Functions | List of all members
AcRxQueryXOverrule Class Reference
AcRx Classes
  Inheritance diagram for AcRxQueryXOverrule:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcRxQueryXOverrule)
AcRxQueryXOverrule ()
virtual AcRxObject *  | queryX (const AcRxObject *pSubject, const AcRxClass *protocolClass) const
 Public Member Functions inherited from AcRxOverrule
ACRX_DECLARE_MEMBERS (AcRxOverrule)
 virtual bool  | isApplicable (const AcRxObject *pOverruledSubject) const =0
 Public Member Functions inherited from AcRxOverruleBase
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxOverruleBase, ACBASE_PORT)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxOverrule
 static Acad::ErrorStatus  | addOverrule (AcRxClass *pClass, AcRxOverrule *pOverrule, bool bAddAtLast=false)
 static bool  | hasOverrule (const AcRxObject *pSubject, AcRxClass *pOverruleClass)
 static bool  | isOverruling (void)
 static Acad::ErrorStatus  | removeOverrule (AcRxClass *pClass, AcRxOverrule *pOverrule)
 static void  | setIsOverruling (bool bIsOverruling)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcRxQueryXOverrule::AcRxQueryXOverrule  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 virtual AcRxObject* AcRxQueryXOverrule::queryX  |  ( |  const AcRxObject *  |  pSubject,
|  const AcRxClass *  |  protocolClass
) |   |  const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxoverrule.h