Public Member Functions | List of all members
AcRxTypePromotionAttribute Class Reference
AcRx Classes
  Inheritance diagram for AcRxTypePromotionAttribute:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxTypePromotionAttribute, ACBASE_PORT)
ACBASE_PORT  | AcRxTypePromotionAttribute (const ACHAR *properties)
ACBASE_PORT const ACHAR *  | properties () const
 Public Member Functions inherited from AcRxAttribute
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxAttribute, ACBASE_PORT)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxAttribute
ACBASE_PORT  | AcRxAttribute (AcRxAttributeImp *)
 Protected Member Functions inherited from Pimpl::ApiPart< AcRxObject, AcRxAttributeImp >
ApiPart (AcRxAttributeImp *pImp) throw ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 ACBASE_PORT AcRxTypePromotionAttribute::AcRxTypePromotionAttribute  |  ( |  const ACHAR *  |  properties | )
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT const ACHAR* AcRxTypePromotionAttribute::properties  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxattrib.h