Public Member Functions | List of all members
AcCmComplexColor Class Reference
AcCm Classes
  Inheritance diagram for AcCmComplexColor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcCmComplexColor)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo) override
virtual Adesk::UInt8  | blue () const
virtual Adesk::UInt32  | color () const
virtual Adesk::UInt16  | colorIndex () const
virtual AcCmEntityColor::ColorMethod  | colorMethod () const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *) override
virtual void  | decReference ()
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) override
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const override
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) override
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const override
virtual Acad::ErrorStatus  | getDescription (AcString &desc) const
virtual Acad::ErrorStatus  | getDescription (ACHAR *&desc) const final
virtual Acad::ErrorStatus  | getExplanation (AcString &expl) const
virtual Acad::ErrorStatus  | getExplanation (ACHAR *&expl) const final
virtual Adesk::UInt8  | green () const
virtual AcCmComplexColor *  | incReference ()
virtual bool  | isByACI () const
virtual bool  | isByBlock () const
virtual bool  | isByColor () const
virtual bool  | isByLayer () const
virtual bool  | isByPen () const
virtual bool  | isForeground () const
virtual Adesk::UInt16  | penIndex () const
virtual Adesk::UInt8  | red () const
virtual Acad::ErrorStatus  | setBlue (Adesk::UInt8 blue)
virtual Acad::ErrorStatus  | setColor (Adesk::UInt32 color)
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 colorIndex)
virtual Acad::ErrorStatus  | setColorMethod (AcCmEntityColor::ColorMethod eColorMethod)
virtual Acad::ErrorStatus  | setGreen (Adesk::UInt8 green)
virtual Acad::ErrorStatus  | setPenIndex (Adesk::UInt16 penIndex)
virtual Acad::ErrorStatus  | setRed (Adesk::UInt8 red)
virtual Acad::ErrorStatus  | setRGB (Adesk::UInt8 red, Adesk::UInt8 green, Adesk::UInt8 blue)
 Public Member Functions inherited from AcDbXObject
ACRX_DECLARE_MEMBERS (AcDbXObject)
Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual Adesk::UInt8 AcCmComplexColor::blue  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual Adesk::UInt32 AcCmComplexColor::color  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual Adesk::UInt16 AcCmComplexColor::colorIndex  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcCmEntityColor::ColorMethod AcCmComplexColor::colorMethod  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual void AcCmComplexColor::decReference  |  ( |   | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcCmComplexColor::getDescription  |  ( |  AcString &  |  desc | ) |   const
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcCmComplexColor::getDescription  |  ( |  ACHAR *&  |  desc | ) |   const
inlinefinalvirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcCmComplexColor::getExplanation  |  ( |  AcString &  |  expl | ) |   const
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcCmComplexColor::getExplanation  |  ( |  ACHAR *&  |  expl | ) |   const
inlinefinalvirtual
Warning
Not implemented!
 virtual Adesk::UInt8 AcCmComplexColor::green  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcCmComplexColor* AcCmComplexColor::incReference  |  ( |   | )
virtual
Warning
Not implemented!
 virtual bool AcCmComplexColor::isByACI  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcCmComplexColor::isByBlock  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcCmComplexColor::isByColor  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcCmComplexColor::isByLayer  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcCmComplexColor::isByPen  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcCmComplexColor::isForeground  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual Adesk::UInt16 AcCmComplexColor::penIndex  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual Adesk::UInt8 AcCmComplexColor::red  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcCmComplexColor::setBlue  |  ( |  Adesk::UInt8  |  blue | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcCmComplexColor::setColor  |  ( |  Adesk::UInt32  |  color | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcCmComplexColor::setColorIndex  |  ( |  Adesk::UInt16  |  colorIndex | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcCmComplexColor::setColorMethod  |  ( |  AcCmEntityColor::ColorMethod  |  eColorMethod | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcCmComplexColor::setGreen  |  ( |  Adesk::UInt8  |  green | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcCmComplexColor::setPenIndex  |  ( |  Adesk::UInt16  |  penIndex | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcCmComplexColor::setRed  |  ( |  Adesk::UInt8  |  red | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcCmComplexColor::setRGB  |  ( |  Adesk::UInt8  |  red,
|  Adesk::UInt8  |  green,
|  Adesk::UInt8  |  blue
)
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbmain.h