Public Member Functions | List of all members
AcPlPlotLogger Class Referenceabstract
AcPl Classes
 Public Member Functions
 virtual Acad::ErrorStatus  | endJob (void)=0
 virtual Acad::ErrorStatus  | endSheet (void)=0
 virtual bool  | errorHasHappenedInJob (void) const =0
 virtual bool  | errorHasHappenedInSheet (void) const =0
 virtual Acad::ErrorStatus  | logARIError (const ACHAR *pErrorString)=0
 virtual Acad::ErrorStatus  | logError (const ACHAR *pErrorString)=0
 virtual Acad::ErrorStatus  | logInformation (const ACHAR *pMessageString)=0
 virtual Acad::ErrorStatus  | logMessage (const ACHAR *pMessageString)=0
 virtual Acad::ErrorStatus  | logSevereError (const ACHAR *pErrorString)=0
 virtual Acad::ErrorStatus  | logTerminalError (const ACHAR *pErrorString)=0
 virtual Acad::ErrorStatus  | logWarning (const ACHAR *pWarningString)=0
 virtual Acad::ErrorStatus  | startJob (void)=0
 virtual Acad::ErrorStatus  | startSheet (void)=0
 virtual bool  | warningHasHappenedInJob (void) const =0
 virtual bool  | warningHasHappenedInSheet (void) const =0
 The documentation for this class was generated from the following file:
acplplotlogger.h