Public Member Functions | List of all members
AcDbLoftProfile Class Reference
AcDb Classes
  Inheritance diagram for AcDbLoftProfile:
 Public Member Functions
AcDbLoftProfile ()
AcDbLoftProfile (AcDbEntity *pEntity)
AcDbLoftProfile (const AcDbPathRef &pathRef)
AcDbLoftProfile (const AcGePoint3d &pnt)
AcDbLoftProfile (const AcDbLoftProfile &src)
ACRX_DECLARE_MEMBERS (AcDbLoftProfile)
Adesk::Int16  | continuity () const
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *src) override
double  | magnitude () const
AcDbLoftProfile &  | operator= (const AcDbLoftProfile &src)
AcDbLoftProfile &  | operator= (const AcDb3dProfile &src)
void  | setContinuity (Adesk::Int16 value)
void  | setMagnitude (double value)
 Public Member Functions inherited from AcDb3dProfile
AcDb3dProfile ()
AcDb3dProfile (AcDbEntity *pEntity)
AcDb3dProfile (const AcDbFullSubentPath &faceSubentPath)
AcDb3dProfile (const AcDbPathRef &pathRef)
AcDb3dProfile (const AcDbVertexRef &vertexRef)
AcDb3dProfile (const AcDb3dProfile &src)
ACRX_DECLARE_MEMBERS (AcDb3dProfile)
Acad::ErrorStatus  | convertProfile (bool explodeMultiFaceRegions, bool convertSurfaceToEdges, bool nonPlanarOnly, bool outerLoopOnly, AcArray< AcDb3dProfile * > &convertedProfileArr) const
AcDbEntity *  | entity () const
Acad::ErrorStatus  | getPathRef (AcDbPathRef &pathRef) const
Acad::ErrorStatus  | getVertexRef (AcDbVertexRef &vertexRef) const
bool  | isClosed () const
bool  | isEdge () const
bool  | isFace () const
bool  | isPlanar () const
bool  | isSubent () const
bool  | isValid () const
AcDb3dProfile &  | operator= (const AcDb3dProfile &src)
Acad::ErrorStatus  | set (const AcDbPathRef &pathRef)
Acad::ErrorStatus  | set (const AcDbVertexRef &vertexRef)
Acad::ErrorStatus  | set (AcDbEntity *pEntity)
virtual  | ~AcDb3dProfile ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcDb3dProfile
static AcDb3dProfile *  | convertProfile (const AcArray< AcDbPathRef > &)
static Acad::ErrorStatus  | mergeProfiles (const AcArray< AcDb3dProfile * > &profileArr, bool mergeEdges, bool mergeCurves, AcArray< AcDb3dProfile * > &mergedProfileArr)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbLoftProfile::AcDbLoftProfile  |  ( |   | )
Warning
Not implemented!
 AcDbLoftProfile::AcDbLoftProfile  |  ( |  AcDbEntity *  |  pEntity | )
Warning
Not implemented!
 AcDbLoftProfile::AcDbLoftProfile  |  ( |  const AcDbPathRef &  |  pathRef | )
Warning
Not implemented!
 AcDbLoftProfile::AcDbLoftProfile  |  ( |  const AcGePoint3d &  |  pnt | )
Warning
Not implemented!
 AcDbLoftProfile::AcDbLoftProfile  |  ( |  const AcDbLoftProfile &  |  src | )
Warning
Not implemented!
Member Function Documentation
 Adesk::Int16 AcDbLoftProfile::continuity  |  ( |   | ) |   const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLoftProfile::copyFrom  |  ( |  const AcRxObject *  |  src | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDb3dProfile.
 double AcDbLoftProfile::magnitude  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbLoftProfile& AcDbLoftProfile::operator=  |  ( |  const AcDbLoftProfile &  |  src | )
Warning
Not implemented!
 AcDbLoftProfile& AcDbLoftProfile::operator=  |  ( |  const AcDb3dProfile &  |  src | )
Warning
Not implemented!
 void AcDbLoftProfile::setContinuity  |  ( |  Adesk::Int16  |  value | )
Warning
Not implemented!
 void AcDbLoftProfile::setMagnitude  |  ( |  double  |  value | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
db3dProfile.h