Public Member Functions | Static Public Member Functions | List of all members
AcRxResourceInstance Class Reference
AcRx Classes
  Inheritance diagram for AcRxResourceInstance:
 Public Member Functions
ACBASE_PORT  | AcRxResourceInstance (const wchar_t *path)
ACBASE_PORT  | AcRxResourceInstance (void *hInst)
ACBASE_PORT  | AcRxResourceInstance (const AcRxResourceInstance &other)
AcRxResourceInstance (AcRxResourceInstance &&)=delete
ACBASE_PORT void  | freeDataResource (const void *&data) const noexcept
ACBASE_PORT bool  | isLoaded () const noexcept
ACBASE_PORT bool  | loadDataResource (Adesk::Int32 id, unsigned long &resourceSize, const void *&data) const noexcept
AcRxResourceInstance &  | operator= (AcRxResourceInstance &&)=delete
AcRxResourceInstance &  | operator= (const AcRxResourceInstance &other)=delete
ACBASE_PORT bool  | tryLoadString (Adesk::Int32 id, AcString &out) const noexcept
ACBASE_PORT  | ~AcRxResourceInstance ()
 Static Public Member Functions
ACBASE_PORT static const AcRxResourceInstance &  | empty ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Additional Inherited Members
 Protected Member Functions inherited from Pimpl::ApiPart< AcHeapOperators, Autodesk::AutoCAD::PAL::AcRxResourceInstanceImp >
ApiPart (Autodesk::AutoCAD::PAL::AcRxResourceInstanceImp *pImp) throw ()
Constructor & Destructor Documentation
 ACBASE_PORT AcRxResourceInstance::AcRxResourceInstance  |  ( |  const wchar_t *  |  path | )
explicit
Warning
Not implemented!
 ACBASE_PORT AcRxResourceInstance::AcRxResourceInstance  |  ( |  void *  |  hInst | )
Warning
Not implemented!
 ACBASE_PORT AcRxResourceInstance::AcRxResourceInstance  |  ( |  const AcRxResourceInstance &  |  other | )
Warning
Not implemented!
 ACBASE_PORT AcRxResourceInstance::~AcRxResourceInstance  |  ( |   | )
Warning
Not implemented!
 AcRxResourceInstance::AcRxResourceInstance  |  ( |  AcRxResourceInstance &&  |   | )
delete
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT static const AcRxResourceInstance& AcRxResourceInstance::empty  |  ( |   | )
static
Warning
Not implemented!
 ACBASE_PORT void AcRxResourceInstance::freeDataResource  |  ( |  const void *&  |  data | ) |   const
noexcept
Warning
Not implemented!
 ACBASE_PORT bool AcRxResourceInstance::isLoaded  |  ( |   | ) |   const
noexcept
Warning
Not implemented!
 ACBASE_PORT bool AcRxResourceInstance::loadDataResource  |  ( |  Adesk::Int32  |  id,
|  unsigned long &  |  resourceSize,
|  const void *&  |  data
) |   |  const
noexcept
Warning
Not implemented!
 AcRxResourceInstance& AcRxResourceInstance::operator=  |  ( |  AcRxResourceInstance &&  |   | )
delete
Warning
Not implemented!
 AcRxResourceInstance& AcRxResourceInstance::operator=  |  ( |  const AcRxResourceInstance &  |  other | )
delete
Warning
Not implemented!
 ACBASE_PORT bool AcRxResourceInstance::tryLoadString  |  ( |  Adesk::Int32  |  id,
|  AcString &  |  out
) |   |  const
noexcept
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxresource.h