Public Member Functions | List of all members
AcG2SmoothConstraint Class Reference
AcDb Classes
  Inheritance diagram for AcG2SmoothConstraint:
 Public Member Functions
AcG2SmoothConstraint (bool bCreateImp=true)
ACRX_DECLARE_MEMBERS (AcG2SmoothConstraint)
 Public Member Functions inherited from AcCompositeConstraint
ACRX_DECLARE_MEMBERS (AcCompositeConstraint)
Acad::ErrorStatus  | getOwnedConstraints (AcArray< AcGeomConstraint * > &apSubConstraints) const
 Public Member Functions inherited from AcGeomConstraint
ACRX_DECLARE_MEMBERS (AcGeomConstraint)
Acad::ErrorStatus  | deactivate ()
virtual Acad::ErrorStatus  | getConnectedGeometries (AcArray< AcConstrainedGeometry * > &apConsGeoms) const
virtual AcHelpParameter *  | getConnectedHelpParameterFor (const AcConstrainedGeometry *pConsGeom) const
virtual Acad::ErrorStatus  | getConnectedHelpParameters (AcArray< AcHelpParameter * > &apHelpParameters) const
AcCompositeConstraint *  | getOwningCompositeConstraint () const
bool  | isActive () const
bool  | isEnabled () const
bool  | isImplied () const
bool  | isInternal () const
Acad::ErrorStatus  | reactivate ()
void  | setIsImplied (bool yesNo)
 Public Member Functions inherited from AcConstraintGroupNode
ACRX_DECLARE_MEMBERS (AcConstraintGroupNode)
AcDbObjectId  | owningConstraintGroupId () const
virtual  | ~AcConstraintGroupNode ()
 Public Member Functions inherited from AcGraphNode
ACRX_DECLARE_MEMBERS (AcGraphNode)
virtual void  | backup ()
Acad::ErrorStatus  | connectNode (AcGraphNode *pNode)
Acad::ErrorStatus  | disconnectAllNodes ()
Acad::ErrorStatus  | disconnectNode (AcGraphNode *pNode)
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Acad::ErrorStatus  | getAdjacentNodes (AcArray< AcGraphNode * > &adjacentNodes) const
bool  | isAdjacentTo (AcGraphNode *pNode) const
Id  | nodeId () const
virtual Acad::ErrorStatus  | nodeToBeConnectedNotification (AcGraphNode *pNode)
virtual Acad::ErrorStatus  | nodeToBeDisconnectedNotification (AcGraphNode *pNode)
virtual Acad::ErrorStatus  | nodeToBeMovedNotification (AcGraph *pGraph, AcArray< AcGraphNode * > &otherNodesToMove)
AcGraph *  | owningGraph () const
virtual  | ~AcGraphNode ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcGeomConstraint
enum  | GeomConstraintType {
 kHorizontal = 0, kVertical, kParallel, kPerpendicular,
 kNormal, kColinear, kCoincident, kConcentric,
 kTangent, kEqualRadius, kEqualLength, kSymmetric,
 kG2Smooth, kFix
 }
 Public Types inherited from AcGraphNode
enum  | { kNullId = 0 }
 typedef Adesk::UInt32  | Id
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Protected Member Functions inherited from AcCompositeConstraint
AcCompositeConstraint ()
 Protected Member Functions inherited from AcGeomConstraint
AcGeomConstraint ()
 Protected Member Functions inherited from AcConstraintGroupNode
AcConstraintGroupNode ()
 Protected Member Functions inherited from AcGraphNode
AcGraphNode (bool bCreateImp=true)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Protected Attributes inherited from AcGraphNode
 AcImpGraphNode *  | mpImpGraphNode
Constructor & Destructor Documentation
 AcG2SmoothConstraint::AcG2SmoothConstraint  |  ( |  bool  |  bCreateImp = true | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcImplicitConstr.h