Public Types | Public Member Functions | Protected Member Functions | Friends | List of all members
AcDbPointCloudEx Class Reference
AcDb Classes
  Inheritance diagram for AcDbPointCloudEx:
 Public Types
enum  | DispOptionOutOfRange { kUseMinMaxColors = 0, kUseRGBScanColors, kHidePoints }
enum  | PointCloudOSnapMode {
 kOsModePNod = 0, kOsModePNea = 1, kOsModePPer = 2, kOsModePEdgeNea = 3,
 kOsModePEdgePer = 4, kOsModePInt = 5, kOsModePCL = 6, kOsModePCorner = 7
 }
enum  | StylizationType {
 kTrueColor = 1, kSingleColor, kNormalRamp, kHeightRamp,
 kIntensityRamp, kClassificationRamp
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Public Member Functions
AcDbPointCloudEx ()
ACRX_DECLARE_MEMBERS (AcDbPointCloudEx)
Acad::ErrorStatus  | addAttributeFilter (IAcDbPointCloudAttributeFilter *pFilter)
void  | addCroppingBoundary (const AcDbPointCloudCrop &cropping)
Acad::ErrorStatus  | addSpatialFilter (IAcDbPointCloudSpatialFilter *pFilter)
void  | applyGeoLocation (bool useDrawingGeo=false, const AcString &geoCS=_T(""))
void  | clearAttributeFilters ()
Acad::ErrorStatus  | clearCropping ()
void  | clearGeoLocation ()
void  | clearSpatialFilters ()
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pObj)
AcDbPointCloudCropStateManager *  | cropStatesManager ()
const AcDbPointCloudCropStateManager *  | cropStatesManagerConst () const
Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
Acad::ErrorStatus  | detectPointBelonger (const AcGePoint3d &ptInWCS, AcString &scanGuid, Adesk::UInt16 &segmentIndex) const
virtual void  | dragStatus (const AcDb::DragStat status) ADESK_OVERRIDE
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) ADESK_OVERRIDE
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const ADESK_OVERRIDE
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) ADESK_OVERRIDE
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const ADESK_OVERRIDE
bool  | elevationApplyToFixedRange () const
DispOptionOutOfRange  | elevationOutOfRangeBehavior () const
AcPointCloudItem *  | findRegionItem (int regionId)
AcPointCloudItem *  | findScanItem (const AcString &scanGuid)
bool  | geolocate () const
bool  | getActiveFileName (AcString &strActiveFileName) const
Acad::ErrorStatus  | getCandidatePlane (const class CPoint &pt, AcGePlane &result, double &distToEdge, double &objWidth, double &objHeight, void *&context) const
AcString  | getColorSchemeForStylization (StylizationType type) const
int  | getCroppingCount () const
bool  | getCroppingInvert () const
AcString  | getCurrentColorScheme () const
Acad::ErrorStatus  | getCustomOsnapInfo (PointCloudOSnapMode snapMode, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcArray< AcGePoint3d > &snapPoints)
Acad::ErrorStatus  | getCylinderAt (const AcGeMatrix3d &viewXform, const AcGePoint3d &pickPt, AcGePoint3d &origin, AcGeVector3d &axis, double &height, double &radius)
Acad::ErrorStatus  | getCylinderAt (const AcGeMatrix3d &viewXform, const AcGePoint3d &pickPt, AcPointCloudExtractedCylinder &extractedCylinder)
unsigned int  | getDisplayedVisiblePointCount () const
virtual void  | getEcs (AcGeMatrix3d &retVal) const ADESK_OVERRIDE
Acad::ErrorStatus  | getEstimatedPointCountByPrecision (unsigned long long &pointCount, double distPrecision, IAcDbPointCloudSpatialFilter *pSpatialFilter=NULL, IAcDbPointCloudAttributeFilter *pAttributeFilter=NULL) const
void  | getLimitBox (AcDbPointCloudExLimitBox &limitBox) const
unsigned int  | getLoadedVisiblePointCount () const
Acad::ErrorStatus  | getMinDistPrecision (double &minDistPrecision) const
void  | getNativeCloudExtent (AcDbExtents &extents) const
bool  | getPlaneBoundaryAt (const AcGeMatrix3d &viewXform, const AcGePoint3d &pickPt, AcGePoint3dArray &arrPlaneVertices)
bool  | getPlaneOrPointAt (const AcGeMatrix3d &viewXform, const AcGePoint3d &pickPt, AcArray< AcGePoint3d > &points)
AcDbPointCloudCrop *  | getPointCloudCropping (int index)
const AcDbPointCloudCrop *  | getPointCloudCroppingConst (int index) const
const AcPointCloudItemArray *  | getPointCloudDataList () const
AcString  | getPointCloudName () const
PointCloudPerfMonitor *  | getPointCloudPerfMonitor ()
Acad::ErrorStatus  | getPointDataByPointCount (IAcDbPointCloudDataBuffer *&pointData, Adesk::UInt32 pointCount, IAcDbPointCloudSpatialFilter *pSpatialFilter, IAcDbPointCloudAttributeFilter *pAttributeFilter, Adesk::UInt32 dataTypes, Adesk::UInt32 maxPointLimitation) const
Acad::ErrorStatus  | getPointDataByPointCount (IAcDbPointCloudDataBuffer *&pointData, Adesk::UInt32 pointCount, const AcArray< AcString > &arrScanGuids, IAcDbPointCloudSpatialFilter *pSpatialFilter, IAcDbPointCloudAttributeFilter *pAttributeFilter, Adesk::UInt32 dataTypes, Adesk::UInt32 maxPointLimitation) const
Acad::ErrorStatus  | getPointDataByPrecision (IAcDbPointCloudDataBuffer *&pointData, double distPrecision, IAcDbPointCloudSpatialFilter *pSpatialFilter=NULL, IAcDbPointCloudAttributeFilter *pAttributeFilter=NULL, Adesk::UInt32 dataTypes=0, Adesk::UInt32 maxPointLimitation=1000000uLL) const
Acad::ErrorStatus  | getPointDataBySegment (IAcDbPointCloudDataBuffer *&pointData, const AcString &scanGuid, Adesk::UInt16 nSegmentIndex, Adesk::UInt32 nExpectedCount) const
void *  | getQuery ()
bool  | getScanViewInfo (const AcString &scanGuid, AcGePoint3d &origin, AcDbExtents &extent) const
unsigned int  | getVisiblePointCount () const
DispOptionOutOfRange  | intensityOutOfRangeBehavior () const
AcGePoint3d  | location () const
bool  | locked () const
double  | maxElevation () const
Adesk::Int32  | maxIntensity () const
double  | minElevation () const
Adesk::Int32  | minIntensity () const
void  | objectToWorldMatrix (AcGeMatrix3d &mat) const
AcDbObjectId  | pointCloudDefExId () const
AcDbObjectId  | reactorId () const
Acad::ErrorStatus  | removeAttributeFilter (IAcDbPointCloudAttributeFilter *pFilter)
Acad::ErrorStatus  | removeLastCropping ()
Acad::ErrorStatus  | removeSpatialFilter (IAcDbPointCloudSpatialFilter *pFilter)
void  | resetLimitBox ()
void  | resetScanRegionVisibility ()
double  | rotation () const
double  | scale () const
bool  | setActiveFileName (const wchar_t *strActiveFileName)
void  | setAllRegionHighlight (bool bHighlight, bool bIncludeUnassignedPoints=false)
void  | setAllRegionsVisibility (bool bVisible, bool includeUnassigned=false)
void  | setAllScanHighlight (bool bHighlight)
void  | setAllScansVisibility (bool bVisible)
void  | setAllScansVisibilityByRegion (int regionId, bool bVisible)
Acad::ErrorStatus  | setColorSchemeForStylization (const AcString &guid, StylizationType type)
Acad::ErrorStatus  | setCroppingInvert (bool invert)
Acad::ErrorStatus  | setCurrentColorScheme (const AcString &guid)
void  | setElevationApplyToFixedRange (bool val)
void  | setElevationOutOfRangeBehavior (DispOptionOutOfRange dispOp)
void  | setHighlightLimitboxBoundary (bool val)
void  | setInCreatingCroppingMode (bool bCreating)
void  | setIntensityOutOfRangeBehavior (DispOptionOutOfRange dispOp)
Acad::ErrorStatus  | setLimitBox (const AcDbPointCloudExLimitBox &limitBox)
Acad::ErrorStatus  | setLocation (const AcGePoint3d &pt)
void  | setLocked (bool locked)
Acad::ErrorStatus  | setMinMaxElevation (double min, double max)
Acad::ErrorStatus  | setMinMaxIntensity (int min, int max)
void  | setPointCloudDefExId (const AcDbObjectId &defExId)
Acad::ErrorStatus  | setPointCloudName (const AcString &name)
void  | setReactorId (const AcDbObjectId &reactorId)
void  | setRegionVisibility (int regionId, bool bVisible)
Acad::ErrorStatus  | setRotation (double val)
Acad::ErrorStatus  | setScale (double val)
void  | setScanVisibility (const AcString &scanGuid, bool bVisible)
Acad::ErrorStatus  | setShowCropped (bool bShowCropped)
void  | setShowElevationAsGradient (bool b)
void  | setShowIntensityAsGradient (bool b)
Acad::ErrorStatus  | setStylizationType (StylizationType type)
bool  | showCropped () const
bool  | showElevationAsGradient () const
bool  | showIntensityAsGradient () const
StylizationType  | stylizationType () const
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false) ADESK_OVERRIDE
Acad::ErrorStatus  | traverseAllPointData (IAcDbPointCloudPointProcessor *processor, IAcDbPointCloudSpatialFilter *pSpatialFilter, Adesk::UInt32 dataTypes, int LODLevel) const
Acad::ErrorStatus  | traverseAllPointData (IAcDbPointCloudPointProcessor *processor, IAcDbPointCloudSpatialFilter *pSpatialFilter, Adesk::UInt32 dataTypes, int LODLevel, const AcArray< AcString > &arrScanGuids) const
void  | updateGeoLocation ()
virtual  | ~AcDbPointCloudEx ()
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths) ADESK_SEALED
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj) override
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo) override
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual bool  | bounds (AcDbExtents &bounds) const override
 virtual bool  | castShadows () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | cloneMeForDragging () ADESK_SEALED
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths) ADESK_SEALED
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable () override
 AcCmEntityColor  | entityColor () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const ADESK_SEALED
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const ADESK_SEALED
 virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=nullptr) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | gripStatus (const AcDb::GripStat status) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL bool  | hideMeForDragging () const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const ADESK_SEALED
AcGiHighlightStyle  | highlightState (const AcDbFullSubentPath &subId)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const ADESK_SEALED
ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL bool  | isContentSnappable () const ADESK_SEALED
 virtual Adesk::Boolean  | isPlanar () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | layer (AcString &sName) const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | linetype (AcString &sName) const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | list () const ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | material (AcString &sName) const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | plotStyleName (AcString &sName) const
 ACHAR *  | plotStyleName () const
Acad::ErrorStatus  | popHighlight (const AcDbFullSubentPath &subId)
Acad::ErrorStatus  | pushHighlight (const AcDbFullSubentPath &subId, AcGiHighlightStyle highlightStyle)
 virtual bool  | receiveShadows () const
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st)
 virtual void  | setCastShadows (bool newVal)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | setColor (const AcCmColor &color, bool doSubents, AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, bool doSubents=true) final
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual void  | setReceiveShadows (bool newVal)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true) ADESK_SEALED
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId visualStyleId, VisualStyleType vsType=kFullVisualStyle, Adesk::Boolean doSubents=true)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL AcDbEntity *  | subentPtr (const AcDbFullSubentPath &id) const ADESK_SEALED
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform) ADESK_SEALED
 AcCmTransparency  | transparency () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const ADESK_SEALED
 AcDb::Visibility  | visibility () const
AcDbObjectId  | visualStyleId (VisualStyleType vsType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const ADESK_OVERRIDE
virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &extents) const ADESK_OVERRIDE
virtual bool  | subIsContentSnappable () const ADESK_OVERRIDE
virtual void  | subList () const ADESK_OVERRIDE
virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &xform) ADESK_OVERRIDE
virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *mode) ADESK_OVERRIDE
 Protected Member Functions inherited from AcDbEntity
AcDbEntity (const AcDbEntity &)=delete
 AcDbEntity &  | operator= (const AcDbEntity &)=delete
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &entitySet) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &stretchPoints) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=nullptr) const
 virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const
 virtual void  | subGripStatus (const AcDb::GripStat status)
 virtual bool  | subHideMeForDragging () const
 virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
virtual ACDBCORE2D_PORT AcGiHighlightStyle  | subHighlightState (const AcDbFullSubentPath &subId)
 virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subPopHighlight (const AcDbFullSubentPath &subId)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subPushHighlight (const AcDbFullSubentPath &subId, AcGiHighlightStyle highlightStyle)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &id) const
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual ACDBCORE2D_PORT AcDb::Visibility  | subVisibility () const
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbPointCloudCropStateManagerImp
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
Constructor & Destructor Documentation
 AcDbPointCloudEx::AcDbPointCloudEx  |  ( |   | )
Warning
Not implemented!
 virtual AcDbPointCloudEx::~AcDbPointCloudEx  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 Acad::ErrorStatus AcDbPointCloudEx::addAttributeFilter  |  ( |  IAcDbPointCloudAttributeFilter *  |  pFilter | )
Warning
Not implemented!
 void AcDbPointCloudEx::addCroppingBoundary  |  ( |  const AcDbPointCloudCrop &  |  cropping | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::addSpatialFilter  |  ( |  IAcDbPointCloudSpatialFilter *  |  pFilter | )
Warning
Not implemented!
 void AcDbPointCloudEx::applyGeoLocation  |  ( |  bool  |  useDrawingGeo = false,
|  const AcString &  |  geoCS = _T("")
)
Warning
Not implemented!
 void AcDbPointCloudEx::clearAttributeFilters  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::clearCropping  |  ( |   | )
Warning
Not implemented!
 void AcDbPointCloudEx::clearGeoLocation  |  ( |   | )
Warning
Not implemented!
 void AcDbPointCloudEx::clearSpatialFilters  |  ( |   | )
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbPointCloudEx::copyFrom  |  ( |  const AcRxObject *  |  pObj | )
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 AcDbPointCloudCropStateManager* AcDbPointCloudEx::cropStatesManager  |  ( |   | )
Warning
Not implemented!
 const AcDbPointCloudCropStateManager* AcDbPointCloudEx::cropStatesManagerConst  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::decomposeForSave  |  ( |  AcDb::AcDbDwgVersion  |  ver,
|  AcDbObject *&  |  replaceObj,
|  AcDbObjectId &  |  replaceId,
|  Adesk::Boolean &  |  exchangeXData
)
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 Acad::ErrorStatus AcDbPointCloudEx::detectPointBelonger  |  ( |  const AcGePoint3d &  |  ptInWCS,
|  AcString &  |  scanGuid,
|  Adesk::UInt16 &  |  segmentIndex
) |   |  const
Warning
Not implemented!
 virtual void AcDbPointCloudEx::dragStatus  |  ( |  const AcDb::DragStat  |  status | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbPointCloudEx::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbPointCloudEx::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbPointCloudEx::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbPointCloudEx::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 bool AcDbPointCloudEx::elevationApplyToFixedRange  |  ( |   | ) |   const
Warning
Not implemented!
 DispOptionOutOfRange AcDbPointCloudEx::elevationOutOfRangeBehavior  |  ( |   | ) |   const
Warning
Not implemented!
 AcPointCloudItem* AcDbPointCloudEx::findRegionItem  |  ( |  int  |  regionId | )
Warning
Not implemented!
 AcPointCloudItem* AcDbPointCloudEx::findScanItem  |  ( |  const AcString &  |  scanGuid | )
Warning
Not implemented!
 bool AcDbPointCloudEx::geolocate  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbPointCloudEx::getActiveFileName  |  ( |  AcString &  |  strActiveFileName | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::getCandidatePlane  |  ( |  const class CPoint &  |  pt,
|  AcGePlane &  |  result,
|  double &  |  distToEdge,
|  double &  |  objWidth,
|  double &  |  objHeight,
|  void *&  |  context
) |   |  const
Warning
Not implemented!
 AcString AcDbPointCloudEx::getColorSchemeForStylization  |  ( |  StylizationType  |  type | ) |   const
Warning
Not implemented!
 int AcDbPointCloudEx::getCroppingCount  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbPointCloudEx::getCroppingInvert  |  ( |   | ) |   const
Warning
Not implemented!
 AcString AcDbPointCloudEx::getCurrentColorScheme  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::getCustomOsnapInfo  |  ( |  PointCloudOSnapMode  |  snapMode,
|  const AcGePoint3d &  |  pickPoint,
|  const AcGePoint3d &  |  lastPoint,
|  const AcGeMatrix3d &  |  viewXform,
|  AcArray< AcGePoint3d > &  |  snapPoints
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::getCylinderAt  |  ( |  const AcGeMatrix3d &  |  viewXform,
|  const AcGePoint3d &  |  pickPt,
|  AcGePoint3d &  |  origin,
|  AcGeVector3d &  |  axis,
|  double &  |  height,
|  double &  |  radius
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::getCylinderAt  |  ( |  const AcGeMatrix3d &  |  viewXform,
|  const AcGePoint3d &  |  pickPt,
|  AcPointCloudExtractedCylinder &  |  extractedCylinder
)
Warning
Not implemented!
 unsigned int AcDbPointCloudEx::getDisplayedVisiblePointCount  |  ( |   | ) |   const
Warning
Not implemented!
 virtual void AcDbPointCloudEx::getEcs  |  ( |  AcGeMatrix3d &  |  retVal | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 Acad::ErrorStatus AcDbPointCloudEx::getEstimatedPointCountByPrecision  |  ( |  unsigned long long &  |  pointCount,
|  double  |  distPrecision,
|  IAcDbPointCloudSpatialFilter *  |  pSpatialFilter = NULL,
|  IAcDbPointCloudAttributeFilter *  |  pAttributeFilter = NULL
) |   |  const
Warning
Not implemented!
 void AcDbPointCloudEx::getLimitBox  |  ( |  AcDbPointCloudExLimitBox &  |  limitBox | ) |   const
Warning
Not implemented!
 unsigned int AcDbPointCloudEx::getLoadedVisiblePointCount  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::getMinDistPrecision  |  ( |  double &  |  minDistPrecision | ) |   const
Warning
Not implemented!
 void AcDbPointCloudEx::getNativeCloudExtent  |  ( |  AcDbExtents &  |  extents | ) |   const
Warning
Not implemented!
 bool AcDbPointCloudEx::getPlaneBoundaryAt  |  ( |  const AcGeMatrix3d &  |  viewXform,
|  const AcGePoint3d &  |  pickPt,
|  AcGePoint3dArray &  |  arrPlaneVertices
)
Warning
Not implemented!
 bool AcDbPointCloudEx::getPlaneOrPointAt  |  ( |  const AcGeMatrix3d &  |  viewXform,
|  const AcGePoint3d &  |  pickPt,
|  AcArray< AcGePoint3d > &  |  points
)
Warning
Not implemented!
 AcDbPointCloudCrop* AcDbPointCloudEx::getPointCloudCropping  |  ( |  int  |  index | )
Warning
Not implemented!
 const AcDbPointCloudCrop* AcDbPointCloudEx::getPointCloudCroppingConst  |  ( |  int  |  index | ) |   const
Warning
Not implemented!
 const AcPointCloudItemArray* AcDbPointCloudEx::getPointCloudDataList  |  ( |   | ) |   const
Warning
Not implemented!
 AcString AcDbPointCloudEx::getPointCloudName  |  ( |   | ) |   const
Warning
Not implemented!
 PointCloudPerfMonitor* AcDbPointCloudEx::getPointCloudPerfMonitor  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::getPointDataByPointCount  |  ( |  IAcDbPointCloudDataBuffer *&  |  pointData,
|  Adesk::UInt32  |  pointCount,
|  IAcDbPointCloudSpatialFilter *  |  pSpatialFilter,
|  IAcDbPointCloudAttributeFilter *  |  pAttributeFilter,
|  Adesk::UInt32  |  dataTypes,
|  Adesk::UInt32  |  maxPointLimitation
) |   |  const
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::getPointDataByPointCount  |  ( |  IAcDbPointCloudDataBuffer *&  |  pointData,
|  Adesk::UInt32  |  pointCount,
|  const AcArray< AcString > &  |  arrScanGuids,
|  IAcDbPointCloudSpatialFilter *  |  pSpatialFilter,
|  IAcDbPointCloudAttributeFilter *  |  pAttributeFilter,
|  Adesk::UInt32  |  dataTypes,
|  Adesk::UInt32  |  maxPointLimitation
) |   |  const
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::getPointDataByPrecision  |  ( |  IAcDbPointCloudDataBuffer *&  |  pointData,
|  double  |  distPrecision,
|  IAcDbPointCloudSpatialFilter *  |  pSpatialFilter = NULL,
|  IAcDbPointCloudAttributeFilter *  |  pAttributeFilter = NULL,
|  Adesk::UInt32  |  dataTypes = 0,
|  Adesk::UInt32  |  maxPointLimitation = 1000000uLL
) |   |  const
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::getPointDataBySegment  |  ( |  IAcDbPointCloudDataBuffer *&  |  pointData,
|  const AcString &  |  scanGuid,
|  Adesk::UInt16  |  nSegmentIndex,
|  Adesk::UInt32  |  nExpectedCount
) |   |  const
Warning
Not implemented!
 void* AcDbPointCloudEx::getQuery  |  ( |   | )
Warning
Not implemented!
 bool AcDbPointCloudEx::getScanViewInfo  |  ( |  const AcString &  |  scanGuid,
|  AcGePoint3d &  |  origin,
|  AcDbExtents &  |  extent
) |   |  const
Warning
Not implemented!
 unsigned int AcDbPointCloudEx::getVisiblePointCount  |  ( |   | ) |   const
Warning
Not implemented!
 DispOptionOutOfRange AcDbPointCloudEx::intensityOutOfRangeBehavior  |  ( |   | ) |   const
Warning
Not implemented!
 AcGePoint3d AcDbPointCloudEx::location  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbPointCloudEx::locked  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbPointCloudEx::maxElevation  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::Int32 AcDbPointCloudEx::maxIntensity  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbPointCloudEx::minElevation  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::Int32 AcDbPointCloudEx::minIntensity  |  ( |   | ) |   const
Warning
Not implemented!
 void AcDbPointCloudEx::objectToWorldMatrix  |  ( |  AcGeMatrix3d &  |  mat | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbPointCloudEx::pointCloudDefExId  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbPointCloudEx::reactorId  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::removeAttributeFilter  |  ( |  IAcDbPointCloudAttributeFilter *  |  pFilter | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::removeLastCropping  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::removeSpatialFilter  |  ( |  IAcDbPointCloudSpatialFilter *  |  pFilter | )
Warning
Not implemented!
 void AcDbPointCloudEx::resetLimitBox  |  ( |   | )
Warning
Not implemented!
 void AcDbPointCloudEx::resetScanRegionVisibility  |  ( |   | )
Warning
Not implemented!
 double AcDbPointCloudEx::rotation  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbPointCloudEx::scale  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbPointCloudEx::setActiveFileName  |  ( |  const wchar_t *  |  strActiveFileName | )
Warning
Not implemented!
 void AcDbPointCloudEx::setAllRegionHighlight  |  ( |  bool  |  bHighlight,
|  bool  |  bIncludeUnassignedPoints = false
)
Warning
Not implemented!
 void AcDbPointCloudEx::setAllRegionsVisibility  |  ( |  bool  |  bVisible,
|  bool  |  includeUnassigned = false
)
Warning
Not implemented!
 void AcDbPointCloudEx::setAllScanHighlight  |  ( |  bool  |  bHighlight | )
Warning
Not implemented!
 void AcDbPointCloudEx::setAllScansVisibility  |  ( |  bool  |  bVisible | )
Warning
Not implemented!
 void AcDbPointCloudEx::setAllScansVisibilityByRegion  |  ( |  int  |  regionId,
|  bool  |  bVisible
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::setColorSchemeForStylization  |  ( |  const AcString &  |  guid,
|  StylizationType  |  type
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::setCroppingInvert  |  ( |  bool  |  invert | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::setCurrentColorScheme  |  ( |  const AcString &  |  guid | )
Warning
Not implemented!
 void AcDbPointCloudEx::setElevationApplyToFixedRange  |  ( |  bool  |  val | )
Warning
Not implemented!
 void AcDbPointCloudEx::setElevationOutOfRangeBehavior  |  ( |  DispOptionOutOfRange  |  dispOp | )
Warning
Not implemented!
 void AcDbPointCloudEx::setHighlightLimitboxBoundary  |  ( |  bool  |  val | )
Warning
Not implemented!
 void AcDbPointCloudEx::setInCreatingCroppingMode  |  ( |  bool  |  bCreating | )
Warning
Not implemented!
 void AcDbPointCloudEx::setIntensityOutOfRangeBehavior  |  ( |  DispOptionOutOfRange  |  dispOp | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::setLimitBox  |  ( |  const AcDbPointCloudExLimitBox &  |  limitBox | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::setLocation  |  ( |  const AcGePoint3d &  |  pt | )
Warning
Not implemented!
 void AcDbPointCloudEx::setLocked  |  ( |  bool  |  locked | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::setMinMaxElevation  |  ( |  double  |  min,
|  double  |  max
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::setMinMaxIntensity  |  ( |  int  |  min,
|  int  |  max
)
Warning
Not implemented!
 void AcDbPointCloudEx::setPointCloudDefExId  |  ( |  const AcDbObjectId &  |  defExId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::setPointCloudName  |  ( |  const AcString &  |  name | )
Warning
Not implemented!
 void AcDbPointCloudEx::setReactorId  |  ( |  const AcDbObjectId &  |  reactorId | )
Warning
Not implemented!
 void AcDbPointCloudEx::setRegionVisibility  |  ( |  int  |  regionId,
|  bool  |  bVisible
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::setRotation  |  ( |  double  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::setScale  |  ( |  double  |  val | )
Warning
Not implemented!
 void AcDbPointCloudEx::setScanVisibility  |  ( |  const AcString &  |  scanGuid,
|  bool  |  bVisible
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::setShowCropped  |  ( |  bool  |  bShowCropped | )
Warning
Not implemented!
 void AcDbPointCloudEx::setShowElevationAsGradient  |  ( |  bool  |  b | )
Warning
Not implemented!
 void AcDbPointCloudEx::setShowIntensityAsGradient  |  ( |  bool  |  b | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::setStylizationType  |  ( |  StylizationType  |  type | )
Warning
Not implemented!
 bool AcDbPointCloudEx::showCropped  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbPointCloudEx::showElevationAsGradient  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbPointCloudEx::showIntensityAsGradient  |  ( |   | ) |   const
Warning
Not implemented!
 StylizationType AcDbPointCloudEx::stylizationType  |  ( |   | ) |   const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbPointCloudEx::subErase  |  ( |  Adesk::Boolean  |  erasing | )
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual Acad::ErrorStatus AcDbPointCloudEx::subGetClassID  |  ( |  CLSID *  |  pClsid | ) |   const
protectedvirtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbPointCloudEx::subGetGeomExtents  |  ( |  AcDbExtents &  |  extents | ) |   const
protectedvirtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual bool AcDbPointCloudEx::subIsContentSnappable  |  ( |   | ) |   const
protectedvirtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual void AcDbPointCloudEx::subList  |  ( |   | ) |   const
protectedvirtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbPointCloudEx::subSwapIdWith  |  ( |  AcDbObjectId  |  otherId,
|  Adesk::Boolean  |  swapXdata = false,
|  Adesk::Boolean  |  swapExtDict = false
)
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual Acad::ErrorStatus AcDbPointCloudEx::subTransformBy  |  ( |  const AcGeMatrix3d &  |  xform | )
protectedvirtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Adesk::Boolean AcDbPointCloudEx::subWorldDraw  |  ( |  AcGiWorldDraw *  |  mode | )
protectedvirtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 Acad::ErrorStatus AcDbPointCloudEx::traverseAllPointData  |  ( |  IAcDbPointCloudPointProcessor *  |  processor,
|  IAcDbPointCloudSpatialFilter *  |  pSpatialFilter,
|  Adesk::UInt32  |  dataTypes,
|  int  |  LODLevel
) |   |  const
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudEx::traverseAllPointData  |  ( |  IAcDbPointCloudPointProcessor *  |  processor,
|  IAcDbPointCloudSpatialFilter *  |  pSpatialFilter,
|  Adesk::UInt32  |  dataTypes,
|  int  |  LODLevel,
|  const AcArray< AcString > &  |  arrScanGuids
) |   |  const
Warning
Not implemented!
 void AcDbPointCloudEx::updateGeoLocation  |  ( |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbPointCloudEx.h