Public Member Functions | Friends | List of all members
AcGiParameter Class Reference
AcGi Classes
  Inheritance diagram for AcGiParameter:
 Public Member Functions
AcGiParameter (AcGiParameterImp *pImp)
AcGiParameter (const AcGiParameter &other)
ACRX_DECLARE_MEMBERS_READWRITE (AcGiParameter, AcGiParameterImp)
 const AcGiParameter &  | operator= (const AcGiParameter &other)
 Public Member Functions inherited from AcRxCopyOnWriteObject
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxCopyOnWriteObject, ACBASE_PORT)
ACBASE_PORT  | AcRxCopyOnWriteObject (AcRxObject *pData)
ACBASE_PORT  | AcRxCopyOnWriteObject (const AcRxCopyOnWriteObject &other)
ACBASE_PORT const AcRxCopyOnWriteObject &  | operator= (const AcRxCopyOnWriteObject &other)
ACBASE_PORT  | ~AcRxCopyOnWriteObject ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcGiParameterImp
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxCopyOnWriteObject
ACBASE_PORT const AcRxObject *  | read () const
ACBASE_PORT void  | unshare ()
ACBASE_PORT AcRxObject *  | write ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgiparameter.h