Public Types | Public Member Functions | Static Public Member Functions | Friends | List of all members
AcString Class Reference
Misc Classes
  Inheritance diagram for AcString:
 Public Types
enum  | {
 kParseZero = 0, kParseMinus1 = 0x01, kParseAssert = 0x02, kParseExcept = 0x04,
 kParseNoEmpty = 0x08, kParseDefault = (kParseAssert | kParseZero)
 }
enum  | eFormat { kSigned = 0x0002, kUnSigned = 0x0003, kHex = 0x0004 }
enum  | Encoding { Utf8 }
 Public Member Functions
 ACBASE_PORT  | AcString (wchar_t wch)
 ACBASE_PORT  | AcString (const char *psz, Encoding encoding)
 ACBASE_PORT  | AcString (const wchar_t *pwsz)
 ACBASE_PORT  | AcString (const wchar_t *pwsz, unsigned int count)
 ACBASE_PORT  | AcString (const AcString &acs)
 ACBASE_PORT  | AcString (AcString &&acs)
 ACBASE_PORT  | AcString (eFormat nCtorFlags, unsigned nArg)
 ACBASE_PORT  | AcString (ACHAR ch, unsigned nRepeatTimes)
 ACBASE_PORT  | AcString (const AcDbHandle &h)
ACBASE_PORT  | AcString (const AcRxResourceInstance &hDll, unsigned int nId)
AcString (const CStringW &csw)
 AcString &  | append (wchar_t wch)
 ACBASE_PORT AcString &  | append (const char *psz, Encoding encoding)
 ACBASE_PORT AcString &  | append (const wchar_t *pwsz)
 ACBASE_PORT AcString &  | append (const AcString &acs)
 ACBASE_PORT AcString &  | appendFormat (const ACHAR *pszFmt,...)
 ACBASE_PORT AcDbHandle  | asAcDbHandle (int nFlags=kParseDefault) const
 ACBASE_PORT int  | asDeci (int nFlags=kParseDefault) const
 ACBASE_PORT int64_t  | asDeci64 (int nFlags=kParseDefault) const
 ACBASE_PORT int  | asHex (int nFlags=kParseDefault) const
 ACBASE_PORT int64_t  | asHex64 (int nFlags=kParseDefault) const
 AcString &  | assign (wchar_t wch)
 ACBASE_PORT AcString &  | assign (const char *psz, Encoding encoding)
 ACBASE_PORT AcString &  | assign (const wchar_t *pwsz)
 ACBASE_PORT AcString &  | assign (const AcString &acs)
 ACBASE_PORT AcString &  | assign (const AcDbHandle &h)
 ACBASE_PORT unsigned int  | asUDeci (int nFlags=kParseDefault) const
 ACBASE_PORT Adesk::UInt64  | asUDeci64 (int nFlags=kParseDefault) const
 ACBASE_PORT unsigned int  | asUHex (int nFlags=kParseDefault) const
 ACBASE_PORT Adesk::UInt64  | asUHex64 (int nFlags=kParseDefault) const
 ACBASE_PORT unsigned  | capacity () const
 ACBASE_PORT int  | collate (const wchar_t *pwsz) const
 int  | collate (const AcString &acs) const
 ACBASE_PORT int  | collateNoCase (const wchar_t *psz) const
 int  | collateNoCase (const AcString &acs) const
 int  | compare (wchar_t wch) const
 ACBASE_PORT int  | compare (const char *psz, Encoding encoding) const
 ACBASE_PORT int  | compare (const wchar_t *pwsz) const
 int  | compare (const AcString &acs) const
 int  | compare (const CStringW &csw) const
 int  | compareNoCase (wchar_t wch) const
 ACBASE_PORT int  | compareNoCase (const char *psz, Encoding encoding) const
 ACBASE_PORT int  | compareNoCase (const wchar_t *pwsz) const
 int  | compareNoCase (const AcString &acs) const
 int  | compareNoCase (const CStringW &csw) const
 AcString  | concat (wchar_t wch) const
 ACBASE_PORT AcString  | concat (const char *psz, Encoding encoding) const
 ACBASE_PORT AcString  | concat (const wchar_t *pwsz) const
 ACBASE_PORT AcString  | concat (const AcString &acs) const
 const wchar_t *  | constPtr () const
 ACBASE_PORT int  | deleteAtIndex (int iIndex, int nCount=1)
 int  | find (ACHAR ch) const
 ACBASE_PORT int  | find (ACHAR ch, int nStartFrom) const
 ACBASE_PORT int  | find (const ACHAR *psz) const
 ACBASE_PORT int  | find (const AcString &acs) const
 ACBASE_PORT int  | findOneOf (const ACHAR *psz) const
 ACBASE_PORT int  | findOneOfRev (const ACHAR *psz) const
 int  | findRev (ACHAR ch) const
 ACBASE_PORT int  | findRev (const ACHAR *psz) const
 ACBASE_PORT int  | findRev (const AcString &acs) const
 ACBASE_PORT AcString &  | format (const ACHAR *pszFmt,...)
 ACBASE_PORT AcString &  | formatV (const ACHAR *pszFmt, va_list args)
 wchar_t  | getAt (int nIndex) const
 ACBASE_PORT ACHAR *  | getBuffer (int nMinBufferLength=0)
 ACBASE_PORT AcString &  | insert (int nIndex, wchar_t ch)
 ACBASE_PORT AcString &  | insert (int nIndex, const wchar_t *pwsz)
 ACBASE_PORT bool  | isAscii () const
 bool  | isEmpty () const
 const ACHAR *  | kACharPtr () const
 const wchar_t *  | kTCharPtr () const
 const wchar_t *  | kwszPtr () const
 AcString  | left (int nNumChars) const
 ACBASE_PORT unsigned  | length () const
ACBASE_PORT bool  | loadString (const AcRxResourceInstance &hDll, unsigned nId)
 ACBASE_PORT AcString &  | makeLower ()
 ACBASE_PORT AcString &  | makeReverse ()
 ACBASE_PORT AcString &  | makeUpper ()
 ACBASE_PORT int  | match (const char *psz, Encoding encoding) const
 ACBASE_PORT int  | match (const wchar_t *pwsz) const
 ACBASE_PORT int  | match (const AcString &acs) const
 int  | match (const CStringW &csw) const
 ACBASE_PORT int  | matchNoCase (const char *psz, Encoding encoding) const
 ACBASE_PORT int  | matchNoCase (const wchar_t *pwsz) const
 ACBASE_PORT int  | matchNoCase (const AcString &acs) const
 int  | matchNoCase (const CStringW &csw) const
 AcString  | mid (int nStart) const
 AcString  | mid (int nStart, int nNumChars) const
operator const wchar_t * () const
 bool  | operator!= (wchar_t wch) const
 bool  | operator!= (const wchar_t *pwsz) const
 bool  | operator!= (const AcString &acs) const
 bool  | operator!= (const CStringW &) const
 AcString  | operator+ (wchar_t wch) const
 AcString  | operator+ (const wchar_t *pwsz) const
 AcString  | operator+ (const AcString &acs) const
 AcString &  | operator+= (wchar_t wch)
 AcString &  | operator+= (const wchar_t *pwsz)
 AcString &  | operator+= (const AcString &acs)
 AcString &  | operator+= (const CStringW &csw)
 bool  | operator< (wchar_t wch) const
 bool  | operator< (const wchar_t *pwsz) const
 bool  | operator< (const AcString &acs) const
 bool  | operator< (const CStringW &) const
 bool  | operator<= (wchar_t wch) const
 bool  | operator<= (const wchar_t *pwsz) const
 bool  | operator<= (const AcString &acs) const
 bool  | operator<= (const CStringW &) const
 AcString &  | operator= (wchar_t wch)
 AcString &  | operator= (const wchar_t *pwsz)
 AcString &  | operator= (const AcString &acs)
 ACBASE_PORT AcString &  | operator= (AcString &&acs)
 AcString &  | operator= (const AcDbHandle &h)
 AcString &  | operator= (const CStringW &csw)
 bool  | operator== (wchar_t wch) const
 bool  | operator== (const wchar_t *pwsz) const
 bool  | operator== (const AcString &acs) const
 bool  | operator== (const CStringW &) const
 bool  | operator> (wchar_t wch) const
 bool  | operator> (const wchar_t *pwsz) const
 bool  | operator> (const AcString &acs) const
 bool  | operator> (const CStringW &) const
 bool  | operator>= (wchar_t wch) const
 bool  | operator>= (const wchar_t *pwsz) const
 bool  | operator>= (const AcString &acs) const
 bool  | operator>= (const CStringW &) const
 AcString  | precat (ACHAR ch) const
 ACBASE_PORT AcString  | precat (const char *psz, Encoding encoding) const
 ACBASE_PORT AcString  | precat (const wchar_t *psz) const
 ACBASE_PORT bool  | releaseBuffer (int nNewLength=-1)
 ACBASE_PORT int  | remove (wchar_t wch)
 int  | remove ()
 ACBASE_PORT int  | replace (const wchar_t *pwszOld, const wchar_t *pwszNew)
 ACBASE_PORT int  | replace (wchar_t wchOld, wchar_t wchNew)
 ACBASE_PORT bool  | reserve (unsigned nCapacity)
 AcString  | right (int nNumChars) const
 ACBASE_PORT AcString &  | setAt (int nIndex, ACHAR ch)
 ACBASE_PORT AcString &  | setEmpty ()
 ACBASE_PORT AcString  | spanExcluding (const wchar_t *pwszChars) const
 AcString  | substr (int numChars) const
 ACBASE_PORT AcString  | substr (int nStart, int nNumChars) const
 ACBASE_PORT AcString  | substrRev (int numChars) const
 unsigned  | tcharLength () const
 ACBASE_PORT AcString  | tokenize (const wchar_t *pszTokens, int &iStart)
 ACBASE_PORT AcString &  | trim (wchar_t wch)
 AcString &  | trim ()
 ACBASE_PORT AcString &  | trim (const wchar_t *pwszChars)
 ACBASE_PORT AcString &  | trimLeft (wchar_t wch)
 AcString &  | trimLeft ()
 ACBASE_PORT AcString &  | trimLeft (const wchar_t *pwszChars)
 ACBASE_PORT AcString &  | trimRight (wchar_t wch)
 AcString &  | trimRight ()
 ACBASE_PORT AcString &  | trimRight (const wchar_t *pwszChars)
 ACBASE_PORT const char *  | utf8Ptr () const
 Static Public Member Functions
 static bool  | equalsNoCase (const AcString &left, const AcString &right)
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Friends
 class  | AcStringImp
Constructor & Destructor Documentation
 ACBASE_PORT AcString::AcString  |  ( |  const AcRxResourceInstance &  |  hDll,
|  unsigned int  |  nId
)
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT bool AcString::loadString  |  ( |  const AcRxResourceInstance &  |  hDll,
|  unsigned  |  nId
)
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcString.h