Public Member Functions | List of all members
AcEdSteeringWheelReactor Class Referenceabstract
AcEd Classes
 Public Member Functions
 virtual void  | modifyContextMenu (HMENU hMenu)=0
 virtual void  | onBeginOperation ()=0
 virtual void  | onBeginShot ()=0
 virtual void  | onClose ()=0
 virtual void  | onEndOperation ()=0
 virtual void  | onEndShot ()=0
 virtual void  | onSetCursor (HCURSOR hCursor)=0
 The documentation for this class was generated from the following file:
AcEdSteeringWheel.h