Public Member Functions | Static Public Attributes | Protected Attributes | List of all members
AcDbObjectId Class Reference
AcDb Classes
  Inheritance diagram for AcDbObjectId:
 Public Member Functions
AcDbObjectId (const AcDbStub *)
 Adesk::IntDbId  | asOldId () const
 ACDBCORE2D_PORT bool  | convertToRedirectedId ()
 AcDbDatabase *  | database () const
 AcDbHandle  | handle () const
 bool  | isEffectivelyErased () const
 bool  | isErased () const
 bool  | isNull () const
bool  | isResident () const
 ACDBCORE2D_PORT bool  | isValid () const
ACDBCORE2D_PORT bool  | isWellBehaved () const
 AcDbHandle  | nonForwardedHandle () const
AcRxClass *  | objectClass () const
 bool  | objectLeftOnDisk () const
operator AcDbStub * () const
 bool  | operator!= (const AcDbObjectId &) const
 bool  | operator!= (const AcDbStub *) const
 bool  | operator< (const AcDbObjectId &) const
 bool  | operator< (const AcDbStub *) const
 bool  | operator<= (const AcDbObjectId &) const
 bool  | operator<= (const AcDbStub *) const
 AcDbObjectId &  | operator= (const AcDbObjectId &)
 AcDbObjectId &  | operator= (const AcDbStub *)
 bool  | operator== (const AcDbObjectId &) const
 bool  | operator== (const AcDbStub *) const
 bool  | operator> (const AcDbObjectId &) const
 bool  | operator> (const AcDbStub *) const
 bool  | operator>= (const AcDbObjectId &) const
 bool  | operator>= (const AcDbStub *) const
 AcDbDatabase *  | originalDatabase () const
 AcDbObjectId &  | setFromOldId (Adesk::IntDbId oldId)
 AcDbObjectId &  | setFromOldId (Adesk::UIntPtr nUnsignedId)
 void  | setNull ()
 Static Public Attributes
 static const AcDbObjectId  | kNull
 Protected Attributes
 AcDbStub *  | mId
Member Function Documentation
 bool AcDbObjectId::isResident  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbObjectId::isWellBehaved  |  ( |   | ) |   const
Warning
Not implemented!
 AcRxClass* AcDbObjectId::objectClass  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbid.h