Public Member Functions | List of all members
AcAxPoint2d Class Reference
AcAx Classes
  Inheritance diagram for AcAxPoint2d:
 Public Member Functions
AcAxPoint2d (double x, double y)
AcAxPoint2d (const AcGePoint2d &pt)
AcAxPoint2d (const AcGeVector2d &pt)
AcAxPoint2d (const VARIANT *var) throw (HRESULT)
AcAxPoint2d (const VARIANT &var) throw (HRESULT)
AcAxPoint2d (const SAFEARRAY *safeArrayPt) throw (HRESULT)
 SAFEARRAY *  | asSafeArrayPtr () const throw (HRESULT)
 VARIANT *  | asVariantPtr () const throw (HRESULT)
 AcAxPoint2d &  | operator= (const AcGePoint2d &pt)
 AcAxPoint2d &  | operator= (const AcGeVector2d &pt)
 AcAxPoint2d &  | operator= (const VARIANT *var) throw (HRESULT)
 AcAxPoint2d &  | operator= (const VARIANT &var) throw (HRESULT)
 AcAxPoint2d &  | operator= (const SAFEARRAY *safeArrayPt) throw (HRESULT)
 VARIANT &  | setVariant (VARIANT &var) const throw (HRESULT)
 VARIANT *  | setVariant (VARIANT *var) const throw (HRESULT)
 Public Member Functions inherited from AcGePoint2d
 GE_DLLEXPIMPORT  | AcGePoint2d (const AcGePoint2d &pnt)
 GE_DLLEXPIMPORT  | AcGePoint2d (double x, double y)
 GE_DLLEXPIMPORT AcGeVector2d  | asVector () const
 GE_DLLEXPIMPORT double  | distanceTo (const AcGePoint2d &pnt) const
 GE_DLLEXPIMPORT bool  | isEqualTo (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT AcGePoint2d &  | mirror (const AcGeLine2d &line)
 GE_DLLEXPIMPORT bool  | operator!= (const AcGePoint2d &pnt) const
 GE_DLLEXPIMPORT AcGePoint2d  | operator* (double) const
 GE_DLLEXPIMPORT AcGePoint2d &  | operator*= (double scl)
 GE_DLLEXPIMPORT AcGePoint2d  | operator+ (const AcGeVector2d &vec) const
 GE_DLLEXPIMPORT AcGePoint2d &  | operator+= (const AcGeVector2d &vec)
 GE_DLLEXPIMPORT AcGePoint2d  | operator- (const AcGeVector2d &vec) const
 GE_DLLEXPIMPORT AcGeVector2d  | operator- (const AcGePoint2d &pnt) const
 GE_DLLEXPIMPORT AcGePoint2d &  | operator-= (const AcGeVector2d &vec)
 GE_DLLEXPIMPORT AcGePoint2d  | operator/ (double scl) const
 GE_DLLEXPIMPORT AcGePoint2d &  | operator/= (double scl)
 GE_DLLEXPIMPORT bool  | operator== (const AcGePoint2d &pnt) const
 GE_DLLEXPIMPORT double  | operator[] (unsigned int i) const
 GE_DLLEXPIMPORT double &  | operator[] (unsigned int idx)
 GE_DLLEXPIMPORT AcGePoint2d &  | rotateBy (double angle, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 GE_DLLEXPIMPORT AcGePoint2d &  | scaleBy (double scaleFactor, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 GE_DLLEXPIMPORT AcGePoint2d &  | set (double x, double y)
 GE_DLLEXPIMPORT AcGePoint2d &  | setToProduct (const AcGeMatrix2d &mat, const AcGePoint2d &pnt)
 GE_DLLEXPIMPORT AcGePoint2d &  | setToSum (const AcGePoint2d &pnt, const AcGeVector2d &vec)
 GE_DLLEXPIMPORT AcGePoint2d &  | transformBy (const AcGeMatrix2d &leftSide)
 Additional Inherited Members
 Public Attributes inherited from AcGePoint2d
 double  | x
 double  | y
 Static Public Attributes inherited from AcGePoint2d
 static GE_DLLDATAEXIMP const AcGePoint2d  | kOrigin
 The documentation for this class was generated from the following file:
axpnt2d.h