Public Member Functions | Protected Member Functions | List of all members
AcRxCopyOnWriteObject Class Reference
AcRx Classes
  Inheritance diagram for AcRxCopyOnWriteObject:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxCopyOnWriteObject, ACBASE_PORT)
ACBASE_PORT  | AcRxCopyOnWriteObject (AcRxObject *pData)
ACBASE_PORT  | AcRxCopyOnWriteObject (const AcRxCopyOnWriteObject &other)
ACBASE_PORT const AcRxCopyOnWriteObject &  | operator= (const AcRxCopyOnWriteObject &other)
ACBASE_PORT  | ~AcRxCopyOnWriteObject ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
ACBASE_PORT const AcRxObject *  | read () const
ACBASE_PORT void  | unshare ()
ACBASE_PORT AcRxObject *  | write ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
Constructor & Destructor Documentation
 ACBASE_PORT AcRxCopyOnWriteObject::AcRxCopyOnWriteObject  |  ( |  AcRxObject *  |  pData | )
Warning
Not implemented!
 ACBASE_PORT AcRxCopyOnWriteObject::AcRxCopyOnWriteObject  |  ( |  const AcRxCopyOnWriteObject &  |  other | )
Warning
Not implemented!
 ACBASE_PORT AcRxCopyOnWriteObject::~AcRxCopyOnWriteObject  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT const AcRxCopyOnWriteObject& AcRxCopyOnWriteObject::operator=  |  ( |  const AcRxCopyOnWriteObject &  |  other | )
Warning
Not implemented!
 ACBASE_PORT const AcRxObject* AcRxCopyOnWriteObject::read  |  ( |   | ) |   const
protected
Warning
Not implemented!
 ACBASE_PORT void AcRxCopyOnWriteObject::unshare  |  ( |   | )
protected
Warning
Not implemented!
 ACBASE_PORT AcRxObject* AcRxCopyOnWriteObject::write  |  ( |   | )
protected
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxcopyonwriteobject.h