Public Member Functions | List of all members
AcDbRasterImageDefTransReactor Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbRasterImageDefTransReactor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbRasterImageDefTransReactor)
 virtual Adesk::Boolean  | onDeleteImage (const AcDbRasterImageDef *pImageDef, const Atil::Image *pImage, AcDbRasterImageDefReactor::DeleteImageEvent event, Adesk::Boolean cancelAllowed)=0
virtual  | ~AcDbRasterImageDefTransReactor ()
 Public Member Functions inherited from AcDbObjectReactor
ACRX_DECLARE_MEMBERS (AcDbObjectReactor)
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 virtual void  | openedForModify (const AcDbObject *dbObj)
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual void  | unappended (const AcDbObject *dbObj)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 virtual AcDbRasterImageDefTransReactor::~AcDbRasterImageDefTransReactor  |  ( |   | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
imgdef.h