Public Member Functions | Static Public Member Functions | Friends | List of all members
AcDbAssocDependency Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocDependency:
 Public Member Functions
AcDbAssocDependency (AcDbAssocCreateImpObject createImpObject=kAcDbAssocCreateImpObject)
ACRX_DECLARE_MEMBERS (AcDbAssocDependency)
Acad::ErrorStatus  | attachToObject (const AcDbCompoundObjectId &compoundId)
virtual void  | copied (const AcDbObject *pDbObj, const AcDbObject *pNewObj) override
AcDbAssocEvaluationCallback *  | currentEvaluationCallback () const
AcDbObjectId  | dependencyBody () const
AcDbObjectId  | dependentOnObject () const
Acad::ErrorStatus  | dependentOnObjectStatus () const
Acad::ErrorStatus  | detachFromObject ()
virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean isErasing=true) override
void  | evaluate ()
Acad::ErrorStatus  | getDependentOnCompoundObject (AcDbCompoundObjectId &compoundId) const
bool  | hasCachedValue () const
bool  | isActionEvaluationInProgress () const
bool  | isAttachedToObject () const
bool  | isDelegatingToOwningAction () const
bool  | isDependentOnCompoundObject () const
bool  | isDependentOnObjectReadOnly () const
bool  | isDependentOnTheSameThingAs (const AcDbAssocDependency *pOtherDependency) const
bool  | isEqualTo (const AcDbAssocDependency *pOtherDependency) const
bool  | isObjectStateDependent () const
bool  | isReadDependency () const
bool  | isRelevantChange () const
bool  | isWriteDependency () const
virtual void  | modified (const AcDbObject *dbObj) override
AcDbObjectId  | nextDependencyOnObject () const
Acad::ErrorStatus  | notification (AcDbAssocNotificationData *pNotifData)
int  | order () const
 AcDbObjectId  | owningAction () const
AcDbObjectId  | prevDependencyOnObject () const
Acad::ErrorStatus  | setDependencyBody (const AcDbObjectId &dependencyBodyId)
void  | setDependentOnObject (const AcDbCompoundObjectId &compoundId)
void  | setIsDelegatingToOwningAction (bool yesNo)
void  | setIsObjectStateDependent (bool yesNo)
void  | setIsReadDependency (bool yesNo)
void  | setIsWriteDependency (bool yesNo)
void  | setOrder (int newOrder)
Acad::ErrorStatus  | setOwningAction (const AcDbObjectId &actionId)
Acad::ErrorStatus  | setStatus (AcDbAssocStatus newStatus, bool notifyOwningAction=true)
AcDbAssocStatus  | status () const
Acad::ErrorStatus  | transferToObject (const AcDbCompoundObjectId &compoundId)
Acad::ErrorStatus  | updateDependentOnObject ()
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static Acad::ErrorStatus  | getDependenciesOnObject (const AcDbObject *pObject, bool readDependenciesWanted, bool writeDependenciesWanted, AcDbObjectIdArray &dependencyIds)
static Acad::ErrorStatus  | getFirstDependencyOnObject (const AcDbObject *pObject, AcDbObjectId &firstDependencyId)
static Acad::ErrorStatus  | notifyDependenciesOnObject (const AcDbObject *pObject, AcDbAssocStatus newStatus)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Friends
 class  | AcDbAssocDeepCloneData
 class  | AcDbAssocDeepCloneRxEventReactor
 class  | AcDbImpAssocDependency
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbAssocDependency::AcDbAssocDependency  |  ( |  AcDbAssocCreateImpObject  |  createImpObject = kAcDbAssocCreateImpObject | )
explicit
Warning
Not implemented!
Member Function Documentation
 Acad::ErrorStatus AcDbAssocDependency::attachToObject  |  ( |  const AcDbCompoundObjectId &  |  compoundId | )
Warning
Not implemented!
 virtual void AcDbAssocDependency::copied  |  ( |  const AcDbObject *  |  pDbObj,
|  const AcDbObject *  |  pNewObj
)
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 AcDbAssocEvaluationCallback* AcDbAssocDependency::currentEvaluationCallback  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbAssocDependency::dependencyBody  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbAssocDependency::dependentOnObject  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDependency::dependentOnObjectStatus  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDependency::detachFromObject  |  ( |   | )
Warning
Not implemented!
 virtual void AcDbAssocDependency::erased  |  ( |  const AcDbObject *  |  dbObj,
|  Adesk::Boolean  |  isErasing = true
)
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 void AcDbAssocDependency::evaluate  |  ( |   | )
Warning
Not implemented!
 static Acad::ErrorStatus AcDbAssocDependency::getDependenciesOnObject  |  ( |  const AcDbObject *  |  pObject,
|  bool  |  readDependenciesWanted,
|  bool  |  writeDependenciesWanted,
|  AcDbObjectIdArray &  |  dependencyIds
)
static
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDependency::getDependentOnCompoundObject  |  ( |  AcDbCompoundObjectId &  |  compoundId | ) |   const
Warning
Not implemented!
 static Acad::ErrorStatus AcDbAssocDependency::getFirstDependencyOnObject  |  ( |  const AcDbObject *  |  pObject,
|  AcDbObjectId &  |  firstDependencyId
)
static
Warning
Not implemented!
 bool AcDbAssocDependency::hasCachedValue  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbAssocDependency::isActionEvaluationInProgress  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbAssocDependency::isAttachedToObject  |  ( |   | ) |   const
inline
Warning
Not implemented!
 bool AcDbAssocDependency::isDelegatingToOwningAction  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbAssocDependency::isDependentOnCompoundObject  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbAssocDependency::isDependentOnObjectReadOnly  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbAssocDependency::isDependentOnTheSameThingAs  |  ( |  const AcDbAssocDependency *  |  pOtherDependency | ) |   const
Warning
Not implemented!
 bool AcDbAssocDependency::isEqualTo  |  ( |  const AcDbAssocDependency *  |  pOtherDependency | ) |   const
Warning
Not implemented!
 bool AcDbAssocDependency::isObjectStateDependent  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbAssocDependency::isReadDependency  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbAssocDependency::isRelevantChange  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbAssocDependency::isWriteDependency  |  ( |   | ) |   const
Warning
Not implemented!
 virtual void AcDbAssocDependency::modified  |  ( |  const AcDbObject *  |  dbObj | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 AcDbObjectId AcDbAssocDependency::nextDependencyOnObject  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDependency::notification  |  ( |  AcDbAssocNotificationData *  |  pNotifData | )
Warning
Not implemented!
 static Acad::ErrorStatus AcDbAssocDependency::notifyDependenciesOnObject  |  ( |  const AcDbObject *  |  pObject,
|  AcDbAssocStatus  |  newStatus
)
static
Warning
Not implemented!
 int AcDbAssocDependency::order  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbAssocDependency::prevDependencyOnObject  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDependency::setDependencyBody  |  ( |  const AcDbObjectId &  |  dependencyBodyId | )
Warning
Not implemented!
 void AcDbAssocDependency::setDependentOnObject  |  ( |  const AcDbCompoundObjectId &  |  compoundId | )
Warning
Not implemented!
 void AcDbAssocDependency::setIsDelegatingToOwningAction  |  ( |  bool  |  yesNo | )
Warning
Not implemented!
 void AcDbAssocDependency::setIsObjectStateDependent  |  ( |  bool  |  yesNo | )
Warning
Not implemented!
 void AcDbAssocDependency::setIsReadDependency  |  ( |  bool  |  yesNo | )
Warning
Not implemented!
 void AcDbAssocDependency::setIsWriteDependency  |  ( |  bool  |  yesNo | )
Warning
Not implemented!
 void AcDbAssocDependency::setOrder  |  ( |  int  |  newOrder | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDependency::setOwningAction  |  ( |  const AcDbObjectId &  |  actionId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDependency::setStatus  |  ( |  AcDbAssocStatus  |  newStatus,
|  bool  |  notifyOwningAction = true
)
Warning
Not implemented!
 AcDbAssocStatus AcDbAssocDependency::status  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDependency::transferToObject  |  ( |  const AcDbCompoundObjectId &  |  compoundId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDependency::updateDependentOnObject  |  ( |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocDependency.h