Public Member Functions | Public Attributes | Static Public Attributes | Friends | List of all members
AcGeVector3d Class Reference
AcGe Classes
 Public Member Functions
 GE_DLLEXPIMPORT  | AcGeVector3d (const AcGeVector3d &vec)
 GE_DLLEXPIMPORT  | AcGeVector3d (double x, double y, double z)
 GE_DLLEXPIMPORT  | AcGeVector3d (const AcGePlanarEnt &, const AcGeVector2d &)
 GE_DLLEXPIMPORT double  | angleOnPlane (const AcGePlanarEnt &pln) const
 GE_DLLEXPIMPORT double  | angleTo (const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT double  | angleTo (const AcGeVector3d &vec, const AcGeVector3d &refVec) const
 GE_DLLEXPIMPORT AcGeVector2d  | convert2d (const AcGePlanarEnt &pln) const
 GE_DLLEXPIMPORT AcGeVector3d  | crossProduct (const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT double  | dotProduct (const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isCodirectionalTo (const AcGeVector3d &vec, const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isCodirectionalTo (const AcGeVector3d &vec, const AcGeTol &tol, AcGeError &flag) const
 GE_DLLEXPIMPORT bool  | isEqualTo (const AcGeVector3d &vec, const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isParallelTo (const AcGeVector3d &vec, const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isParallelTo (const AcGeVector3d &vec, const AcGeTol &tol, AcGeError &flag) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isPerpendicularTo (const AcGeVector3d &vec, const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isPerpendicularTo (const AcGeVector3d &vec, const AcGeTol &tol, AcGeError &flag) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isUnitLength (const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT Adesk::Boolean  | isZeroLength (const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT unsigned int  | largestElement () const
 GE_DLLEXPIMPORT double  | length () const
 GE_DLLEXPIMPORT double  | lengthSqrd () const
 GE_DLLEXPIMPORT AcGeVector3d &  | mirror (const AcGeVector3d &normalToPlane)
 GE_DLLEXPIMPORT AcGeVector3d &  | negate ()
 GE_DLLEXPIMPORT AcGeVector3d  | normal (const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT AcGeVector3d &  | normalize (const AcGeTol &tol=AcGeContext::gTol)
 GE_DLLEXPIMPORT AcGeVector3d &  | normalize (const AcGeTol &tol, AcGeError &flag)
 GE_DLLEXPIMPORT  | operator AcGeMatrix3d () const
 GE_DLLEXPIMPORT bool  | operator!= (const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT AcGeVector3d  | operator* (double scl) const
 GE_DLLEXPIMPORT AcGeVector3d &  | operator*= (double scl)
 GE_DLLEXPIMPORT AcGeVector3d  | operator+ (const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT AcGeVector3d &  | operator+= (const AcGeVector3d &vec)
 GE_DLLEXPIMPORT AcGeVector3d  | operator- (const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT AcGeVector3d  | operator- () const
 GE_DLLEXPIMPORT AcGeVector3d &  | operator-= (const AcGeVector3d &vec)
 GE_DLLEXPIMPORT AcGeVector3d  | operator/ (double scl) const
 GE_DLLEXPIMPORT AcGeVector3d &  | operator/= (double scl)
 GE_DLLEXPIMPORT bool  | operator== (const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT double  | operator[] (unsigned int i) const
 GE_DLLEXPIMPORT double &  | operator[] (unsigned int i)
 GE_DLLEXPIMPORT AcGeVector3d  | orthoProject (const AcGeVector3d &planeNormal) const
 GE_DLLEXPIMPORT AcGeVector3d  | orthoProject (const AcGeVector3d &planeNormal, const AcGeTol &tol, AcGeError &flag) const
 GE_DLLEXPIMPORT AcGeVector3d  | perpVector () const
 GE_DLLEXPIMPORT AcGeVector3d  | project (const AcGeVector3d &planeNormal, const AcGeVector3d &projectDirection) const
 GE_DLLEXPIMPORT AcGeVector3d  | project (const AcGeVector3d &planeNormal, const AcGeVector3d &projectDirection, const AcGeTol &tol, AcGeError &flag) const
 GE_DLLEXPIMPORT AcGeVector3d &  | rotateBy (double ang, const AcGeVector3d &axis)
 GE_DLLEXPIMPORT AcGeMatrix3d  | rotateTo (const AcGeVector3d &vec, const AcGeVector3d &axis=AcGeVector3d::kIdentity) const
 GE_DLLEXPIMPORT AcGeVector3d &  | set (double x, double y, double z)
 GE_DLLEXPIMPORT AcGeVector3d &  | set (const AcGePlanarEnt &pln, const AcGeVector2d &vec)
 GE_DLLEXPIMPORT AcGeVector3d &  | setToProduct (const AcGeMatrix3d &mat, const AcGeVector3d &vec)
 GE_DLLEXPIMPORT AcGeVector3d &  | setToProduct (const AcGeVector3d &vec, double scl)
 GE_DLLEXPIMPORT AcGeVector3d &  | setToSum (const AcGeVector3d &vec1, const AcGeVector3d &vec2)
 GE_DLLEXPIMPORT AcGeVector3d &  | transformBy (const AcGeMatrix3d &leftSide)
 Public Attributes
 double  | x
 double  | y
 double  | z
 Static Public Attributes
 static GE_DLLDATAEXIMP const AcGeVector3d  | kIdentity
 static GE_DLLDATAEXIMP const AcGeVector3d  | kXAxis
 static GE_DLLDATAEXIMP const AcGeVector3d  | kYAxis
 static GE_DLLDATAEXIMP const AcGeVector3d  | kZAxis
 Friends
 GE_DLLEXPIMPORT AcGeVector3d  | operator* (const AcGeMatrix3d &mat, const AcGeVector3d &vec)
 GE_DLLEXPIMPORT AcGeVector3d  | operator* (double scl, const AcGeVector3d &vec)
 The documentation for this class was generated from the following file:
gevec3d.h