Public Member Functions | Protected Member Functions | Friends | List of all members
AcEditorReactor Class Reference
AcEd Classes
  Inheritance diagram for AcEditorReactor:
 Public Member Functions
 virtual void  | abortAttach (AcDbDatabase *pFrom) override
 virtual void  | abortDeepClone (AcDbIdMapping &) override
 virtual void  | abortDxfIn (AcDbDatabase *) override
 virtual void  | abortDxfOut (AcDbDatabase *) override
 virtual void  | abortInsert (AcDbDatabase *pTo) override
 virtual void  | abortRestore (AcDbDatabase *pTo) override
 virtual void  | abortSave (AcDbDatabase *) override
 virtual void  | abortWblock (AcDbDatabase *pTo) override
ACRX_DECLARE_MEMBERS (AcEditorReactor)
 virtual void  | beginAttach (AcDbDatabase *pTo, const ACHAR *, AcDbDatabase *pFrom) override
 virtual ADESK_DEPRECATED void  | beginClose (AcDbDatabase *) final
 virtual void  | beginCloseAll ()
 virtual void  | beginDeepClone (AcDbDatabase *pTo, AcDbIdMapping &) override
 virtual void  | beginDeepCloneXlation (AcDbIdMapping &, Acad::ErrorStatus *) override
 virtual void  | beginDocClose (AcDbDatabase *)
 virtual void  | beginDoubleClick (const AcGePoint3d &clickPoint)
 virtual ADESK_DEPRECATED void  | beginDwgOpen (ACHAR *) final
 virtual void  | beginDwgOpen (const ACHAR *)
 virtual void  | beginDxfIn (AcDbDatabase *) override
 virtual void  | beginDxfOut (AcDbDatabase *) override
 virtual void  | beginInsert (AcDbDatabase *pTo, const ACHAR *pBlockName, AcDbDatabase *pFrom) override
 virtual void  | beginInsert (AcDbDatabase *pTo, const AcGeMatrix3d &xform, AcDbDatabase *pFrom) override
 virtual void  | beginQuit ()
 virtual void  | beginRestore (AcDbDatabase *pTo, const ACHAR *, AcDbDatabase *pFrom) override
 virtual void  | beginRightClick (const AcGePoint3d &clickPoint)
 virtual void  | beginSave (AcDbDatabase *, const ACHAR *pIntendedName) override
 virtual void  | beginWblock (AcDbDatabase *pTo, AcDbDatabase *pFrom, const AcGePoint3d *&insertionPoint) override
 virtual void  | beginWblock (AcDbDatabase *pTo, AcDbDatabase *pFrom, AcDbObjectId blockId) override
 virtual void  | beginWblock (AcDbDatabase *pTo, AcDbDatabase *pFrom) override
 virtual void  | beginWblockObjects (AcDbDatabase *pFrom, AcDbIdMapping &) override
 virtual void  | cmdIUnkModified (const ACHAR *strCommand)
 virtual void  | comandeered (AcDbDatabase *pTo, AcDbObjectId id, AcDbDatabase *pFrom) override
 virtual void  | commandCancelled (const ACHAR *cmdStr)
 virtual void  | commandEnded (const ACHAR *cmdStr)
 virtual void  | commandFailed (const ACHAR *cmdStr)
 virtual void  | commandWillStart (const ACHAR *cmdStr)
 virtual void  | curDocOpenDowngraded (AcDbDatabase *, const CAdUiPathname &)
 virtual void  | curDocOpenUpgraded (AcDbDatabase *, const CAdUiPathname &)
 virtual void  | databaseConstructed (AcDbDatabase *) override
 virtual void  | databaseToBeDestroyed (AcDbDatabase *) override
 virtual void  | docCloseAborted (AcDbDatabase *)
 virtual void  | docCloseWillStart (AcDbDatabase *)
 virtual void  | docFrameMovedOrResized (Adesk::LongPtr hwndDocFrame, bool bMoved)
 virtual void  | dwgViewResized (Adesk::LongPtr)
 virtual void  | dxfInComplete (AcDbDatabase *) override
 virtual void  | dxfOutComplete (AcDbDatabase *) override
 virtual void  | endAttach (AcDbDatabase *pTo) override
 virtual void  | endDeepClone (AcDbIdMapping &) override
 virtual void  | endDwgOpen (const ACHAR *filename, AcDbDatabase *pDb)
 virtual void  | endInsert (AcDbDatabase *pTo) override
 virtual void  | endRestore (AcDbDatabase *pTo) override
 virtual void  | endWblock (AcDbDatabase *pTo) override
 virtual void  | fullRegenEnded (AcDbDatabase *, const AcDbIntArray &)
 virtual void  | fullRegenWillStart (AcDbDatabase *)
 virtual void  | initialDwgFileOpenComplete (AcDbDatabase *pDwg) override
 virtual void  | layoutSwitched (const ACHAR *newLayoutName)
 virtual void  | layoutToBeSwitched (const ACHAR *, const ACHAR *)
 virtual void  | lispCancelled ()
 virtual void  | lispEnded ()
 virtual void  | lispWillStart (const ACHAR *firstLine)
 virtual void  | mainFrameMovedOrResized (Adesk::LongPtr hwndMainFrame, bool bMoved)
 virtual void  | modelessOperationEnded (const ACHAR *contextStr)
 virtual void  | modelessOperationWillStart (const ACHAR *contextStr)
 virtual void  | objectsLazyLoaded (const AcDbObjectIdArray &idArray)
 virtual void  | otherAttach (AcDbDatabase *pTo, AcDbDatabase *pFrom) override
 virtual void  | otherInsert (AcDbDatabase *pTo, AcDbIdMapping &idMap, AcDbDatabase *pFrom) override
 virtual void  | otherWblock (AcDbDatabase *pTo, AcDbIdMapping &, AcDbDatabase *pFrom) override
 virtual void  | partialOpenNotice (AcDbDatabase *pDb) override
 virtual void  | pickfirstModified ()
 virtual void  | preXrefLockFile (AcDbObjectId btrId)
 virtual void  | quitAborted ()
 virtual void  | quitWillStart ()
 virtual void  | redirected (AcDbObjectId newId, AcDbObjectId oldId) override
 virtual void  | saveComplete (AcDbDatabase *, const ACHAR *pActualName) override
 virtual void  | sysVarChanged (const ACHAR *varName, Adesk::Boolean success)
 virtual void  | sysVarChanged (const ACHAR *, int) final
 virtual void  | sysVarWillChange (const ACHAR *varName)
 virtual void  | toolbarBitmapSizeChanged (Adesk::Boolean bLarge)
 virtual void  | toolbarBitmapSizeChanged (int) final
 virtual void  | toolbarBitmapSizeWillChange (Adesk::Boolean bLarge)
 virtual void  | toolbarBitmapSizeWillChange (int) final
 virtual void  | undoSubcommandAuto (int activity, Adesk::Boolean state)
 virtual void  | undoSubcommandAuto (int, int) final
 virtual void  | undoSubcommandBack (int activity)
 virtual void  | undoSubcommandBegin (int activity)
 virtual void  | undoSubcommandControl (int activity, int option)
 virtual void  | undoSubcommandEnd (int activity)
 virtual void  | undoSubcommandMark (int activity)
 virtual void  | undoSubcommandNumber (int activity, int num)
 virtual void  | unknownCommand (const ACHAR *cmdStr, AcDbVoidPtrArray *al)
 virtual void  | viewChanged ()
 virtual void  | wblockNotice (AcDbDatabase *pDb) override
 virtual void  | xrefSubcommandAttachItem (AcDbDatabase *pHost, int activity, const ACHAR *pPath) override
 virtual void  | xrefSubcommandBindItem (AcDbDatabase *pHost, int activity, AcDbObjectId blockId) override
 virtual void  | xrefSubcommandDetachItem (AcDbDatabase *pHost, int activity, AcDbObjectId blockId) override
 virtual void  | xrefSubcommandOverlayItem (AcDbDatabase *pHost, int activity, const ACHAR *pPath) override
 virtual void  | xrefSubcommandPathItem (int activity, AcDbObjectId blockId, const ACHAR *pNewPath) override
 virtual void  | xrefSubcommandReloadItem (AcDbDatabase *pHost, int activity, AcDbObjectId blockId) override
 virtual Acad::ErrorStatus  | xrefSubCommandStart (AcXrefSubCommand subcmd, const AcDbObjectIdArray &btrIds, const ACHAR *const *btrNames, const ACHAR *const *paths)
 virtual void  | xrefSubcommandUnloadItem (AcDbDatabase *pHost, int activity, AcDbObjectId blockId) override
 Public Member Functions inherited from AcRxEventReactor
ACRX_DECLARE_MEMBERS (AcRxEventReactor)
 virtual ADESK_DEPRECATED void  | dwgFileOpened (AcDbDatabase *, ACHAR *) final
 virtual void  | dwgFileOpened (AcDbDatabase *, const ACHAR *)
 virtual void  | preXrefLockFile (AcDbDatabase *pDb, AcDbObjectId btrId)
 virtual void  | xrefSubCommandAborted (AcDbDatabase *pHostDb, AcXrefSubCommand op, const AcArray< AcDbObjectId > &ids, const ACHAR *const *btrNames, const ACHAR *const *paths)
 virtual void  | xrefSubCommandEnd (AcDbDatabase *pHostDb, AcXrefSubCommand op, const AcArray< AcDbObjectId > &ids, const ACHAR *const *btrNames, const ACHAR *const *paths)
 virtual void  | xrefSubCommandStart (AcDbDatabase *pHostDb, AcXrefSubCommand op, const AcArray< AcDbObjectId > &ids, const ACHAR *const *btrNames, const ACHAR *const *paths, bool &vetoOp)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 Acad::ErrorStatus  | veto ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcEditorImp
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
aced.h