Public Member Functions | Static Public Member Functions | List of all members
AcGiPhotographicExposureParameters Class Reference
AcGi Classes
  Inheritance diagram for AcGiPhotographicExposureParameters:
 Public Member Functions
AcGiPhotographicExposureParameters ()
ACRX_DECLARE_MEMBERS (AcGiPhotographicExposureParameters)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *) override
double  | exposure (void) const
AcGiPhotographicExposureParameters &  | operator= (const AcGiPhotographicExposureParameters &params)
bool  | operator== (const AcGiPhotographicExposureParameters &params) const
virtual bool  | setBrightness (double) override
bool  | setExposure (double exposure)
bool  | setWhitePoint (double whitePoint)
double  | whitePoint (void) const
virtual  | ~AcGiPhotographicExposureParameters ()
 Public Member Functions inherited from AcGiToneOperatorParameters
AcGiToneOperatorParameters ()
ACRX_DECLARE_MEMBERS (AcGiToneOperatorParameters)
virtual double  | brightness () const
virtual bool  | chromaticAdaptation () const
virtual bool  | colorDifferentiation () const
virtual double  | contrast () const
virtual ExteriorDaylightMode  | exteriorDaylight () const
virtual bool  | isActive () const
virtual double  | midTones () const
AcGiToneOperatorParameters &  | operator= (const AcGiToneOperatorParameters &params)
bool  | operator== (const AcGiToneOperatorParameters &params) const
virtual bool  | processBackground () const
virtual void  | setChromaticAdaptation (bool enable)
virtual void  | setColorDifferentiation (bool enable)
virtual bool  | setContrast (double contrast)
virtual bool  | setExteriorDaylight (ExteriorDaylightMode mode)
virtual void  | setIsActive (bool active)
virtual bool  | setMidTones (double midTones)
virtual void  | setProcessBackground (bool processBG)
virtual void  | setWhiteColor (const AcCmColor &color)
virtual AcCmColor  | whiteColor () const
virtual  | ~AcGiToneOperatorParameters ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static double  | convertBrightnessToExposure (double brt)
static double  | convertExposureToBrightness (double exp)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Public Types inherited from AcGiToneOperatorParameters
enum  | ExteriorDaylightMode { kDaylightOff = 0, kDaylightOn, kDaylightAuto }
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcGiPhotographicExposureParameters::AcGiPhotographicExposureParameters  |  ( |   | )
Warning
Not implemented!
 virtual AcGiPhotographicExposureParameters::~AcGiPhotographicExposureParameters  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 static double AcGiPhotographicExposureParameters::convertBrightnessToExposure  |  ( |  double  |  brt | )
static
Warning
Not implemented!
 static double AcGiPhotographicExposureParameters::convertExposureToBrightness  |  ( |  double  |  exp | )
static
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGiPhotographicExposureParameters::copyFrom  |  ( |  const AcRxObject *  |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcGiToneOperatorParameters.
 double AcGiPhotographicExposureParameters::exposure  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 AcGiPhotographicExposureParameters& AcGiPhotographicExposureParameters::operator=  |  ( |  const AcGiPhotographicExposureParameters &  |  params | )
Warning
Not implemented!
 bool AcGiPhotographicExposureParameters::operator==  |  ( |  const AcGiPhotographicExposureParameters &  |  params | ) |   const
Warning
Not implemented!
 virtual bool AcGiPhotographicExposureParameters::setBrightness  |  ( |  double  |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcGiToneOperatorParameters.
 bool AcGiPhotographicExposureParameters::setExposure  |  ( |  double  |  exposure | )
Warning
Not implemented!
 bool AcGiPhotographicExposureParameters::setWhitePoint  |  ( |  double  |  whitePoint | )
Warning
Not implemented!
 double AcGiPhotographicExposureParameters::whitePoint  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcGiEnvironment.h