Public Types | Public Member Functions | List of all members
IAcRxReferenceType Class Referenceabstract
AcRx Classes
 Public Types
enum  | OpenMode { kForRead = 0, kForWrite = 1, kForNotify = 2 }
 Public Member Functions
 virtual AcRxObject *  | beginDereferencing (const AcRxValue &value, OpenMode mode) const =0
 virtual Acad::ErrorStatus  | endDereferencing (AcRxObject *pO) const =0
 The documentation for this class was generated from the following file:
rxvaluetype.h