Public Member Functions | Protected Attributes | Friends | List of all members
AcEdSelectedTransient Class Reference
AcEd Classes
 Public Member Functions
AcEdSelectedTransient ()
AcEdSelectedTransient (const AcEdSelectedTransient &source)
AcGiDrawable *  | drawable ()
Adesk::GsMarker  | marker ()
AcGiTransientDrawingMode  | mode ()
AcEdSelectedTransient &  | operator= (const AcEdSelectedTransient &source)
AcGiDrawable *  | parent ()
int  | subDrawingMode ()
~AcEdSelectedTransient ()
 Protected Attributes
 AcEdSelectedTransientImp *  | mImp
 Friends
 class  | AcEdTransientSelectionInternals
Constructor & Destructor Documentation
 AcEdSelectedTransient::AcEdSelectedTransient  |  ( |   | )
Warning
Not implemented!
 AcEdSelectedTransient::AcEdSelectedTransient  |  ( |  const AcEdSelectedTransient &  |  source | )
Warning
Not implemented!
 AcEdSelectedTransient::~AcEdSelectedTransient  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 AcGiDrawable* AcEdSelectedTransient::drawable  |  ( |   | )
Warning
Not implemented!
 Adesk::GsMarker AcEdSelectedTransient::marker  |  ( |   | )
Warning
Not implemented!
 AcGiTransientDrawingMode AcEdSelectedTransient::mode  |  ( |   | )
Warning
Not implemented!
 AcEdSelectedTransient& AcEdSelectedTransient::operator=  |  ( |  const AcEdSelectedTransient &  |  source | )
Warning
Not implemented!
 AcGiDrawable* AcEdSelectedTransient::parent  |  ( |   | )
Warning
Not implemented!
 int AcEdSelectedTransient::subDrawingMode  |  ( |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acedsel.h