Public Member Functions | List of all members
AcDbLayoutManager Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbLayoutManager:
 Public Member Functions
 virtual void  | addReactor (AcDbLayoutManagerReactor *newObj)=0
 virtual Acad::ErrorStatus  | cloneLayout (AcDbLayout *pLBTR, const ACHAR *newname, int newTabOrder=0, AcDbDatabase *pDb=NULL)=0
 virtual Acad::ErrorStatus  | copyLayout (const ACHAR *copyname, const ACHAR *newname, AcDbDatabase *pDb=NULL)=0
 virtual int  | countLayouts (AcDbDatabase *pDb=NULL)=0
 virtual Acad::ErrorStatus  | createLayout (const ACHAR *newname, AcDbObjectId &layoutId, AcDbObjectId &blockTableRecId, AcDbDatabase *pDb=NULL)=0
 virtual Acad::ErrorStatus  | deleteLayout (const ACHAR *delname, AcDbDatabase *pDb=NULL)=0
 virtual const ACHAR *  | findActiveLayout (bool allowModel, const AcDbDatabase *pDb=nullptr) final
 virtual AcDbObjectId  | findLayoutNamed (const ACHAR *name, const AcDbDatabase *pDb=NULL)=0
 virtual AcDbObjectId  | getActiveLayoutBTRId (const AcDbDatabase *pDb=NULL)=0
 virtual Acad::ErrorStatus  | getActiveLayoutName (AcString &sName, bool allowModel, const AcDbDatabase *pDb=nullptr)=0
 Acad::ErrorStatus  | getLayoutNamed (const ACHAR *name, AcDbLayout *&pLayout, AcDb::OpenMode mode=AcDb::kForRead, const AcDbDatabase *pDb=nullptr)
 virtual AcDbObjectId  | getNonRectVPIdFromClipId (AcDbObjectId clipId)=0
 virtual bool  | isVpnumClipped (int index, const AcDbDatabase *pDb=NULL)=0
 bool  | layoutExists (const ACHAR *name, const AcDbDatabase *pDb=nullptr)
 virtual void  | removeReactor (AcDbLayoutManagerReactor *delObj)=0
 virtual Acad::ErrorStatus  | renameLayout (const ACHAR *oldname, const ACHAR *newname, AcDbDatabase *pDb=NULL)=0
 virtual Acad::ErrorStatus  | setCurrentLayout (const ACHAR *newname, AcDbDatabase *pDb=NULL)=0
 virtual Acad::ErrorStatus  | setCurrentLayoutId (AcDbObjectId layoutId)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
AcDbLMgr.h