Public Member Functions | List of all members
AcDbObjectContextCollection Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbObjectContextCollection:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbObjectContextCollection)
 virtual Acad::ErrorStatus  | addContext (const AcDbObjectContext *pContext)=0
 virtual AcDbObjectContext *  | currentContext (const AcDbObject *pRequestingObject) const =0
 virtual AcDbObjectContext *  | getContext (const AcString &contextName) const =0
 virtual bool  | hasContext (const AcString &contextName) const =0
 virtual Acad::ErrorStatus  | lockContext (const AcDbObjectContext *pContext)=0
 virtual bool  | locked () const =0
 virtual AcString  | name () const =0
 virtual AcDbObjectContextCollectionIterator *  | newIterator () const =0
 virtual Acad::ErrorStatus  | removeContext (const AcString &contextName)=0
 virtual Acad::ErrorStatus  | setCurrentContext (const AcDbObjectContext *pContext)=0
 virtual Acad::ErrorStatus  | unlockContext ()=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbObjectContextCollection.h