Public Member Functions | Protected Member Functions | Friends | List of all members
AcApDocWindow Class Reference
AcAp Classes
  Inheritance diagram for AcApDocWindow:
 Public Member Functions
ACAD_PORT  | AcApDocWindow ()
warning Not implemented! More...
ACAD_PORT void  | activate ()
warning Not implemented! More...
ACAD_PORT void  | addReactor (AcApDocWindowReactor *reactor)
warning Not implemented! More...
ACAD_PORT bool  | canClose () const
warning Not implemented! More...
ACAD_PORT void  | close ()
warning Not implemented! More...
ACAD_PORT AcRxObject *  | document ()
warning Not implemented! More...
ACAD_PORT void  | enable (bool bEnable)
warning Not implemented! More...
ACAD_PORT void  | removeReactor (AcApDocWindowReactor *reactor)
warning Not implemented! More...
ACAD_PORT void  | setCanClose (bool bCanClose)
warning Not implemented! More...
ACAD_PORT void  | setTitle (const ACHAR *title)
warning Not implemented! More...
ACAD_PORT const ACHAR *  | title () const
warning Not implemented! More...
virtual ACAD_PORT HWND  | windowHandle () ADESK_OVERRIDE
warning Not implemented! More...
virtual ACAD_PORT  | ~AcApDocWindow ()
warning Not implemented! More...
 Public Member Functions inherited from AcApWindow
ACCORE_PORT bool  | postRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
ACCORE_PORT bool  | preRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
ACCORE_PORT bool  | routeMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
 Protected Member Functions
virtual ACAD_PORT void  | onActivate ()
warning Not implemented! More...
virtual ACAD_PORT void  | onCreate (HWND hWnd)
warning Not implemented! More...
virtual ACAD_PORT void  | onDestroy ()
warning Not implemented! More...
virtual ACAD_PORT void  | onLoad ()
warning Not implemented! More...
virtual ACAD_PORT void  | onUpdate ()
warning Not implemented! More...
virtual ACAD_PORT void  | setDocument (AcRxObject *document)
warning Not implemented! More...
 Protected Member Functions inherited from AcApWindow
ACCORE_PORT  | AcApWindow ()
virtual ACCORE_PORT bool  | subPostRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
virtual ACCORE_PORT bool  | subPreRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
virtual ACCORE_PORT bool  | subRouteMessage (HWND hwnd, UINT message, WPARAM wParam, LPARAM lParam, Adesk::LongPtr &lResult)
virtual ACCORE_PORT  | ~AcApWindow ()
 Friends
 class  | AcApDocWindowImp
 Additional Inherited Members
 Protected Attributes inherited from AcApWindow
 AcApWindowImp *  | m_pImp
Constructor & Destructor Documentation
 ACAD_PORT AcApDocWindow::AcApDocWindow  |  ( |   | )
warning Not implemented!
 virtual ACAD_PORT AcApDocWindow::~AcApDocWindow  |  ( |   | )
virtual
warning Not implemented!
Member Function Documentation
 ACAD_PORT void AcApDocWindow::activate  |  ( |   | )
warning Not implemented!
 ACAD_PORT void AcApDocWindow::addReactor  |  ( |  AcApDocWindowReactor *  |  reactor | )
warning Not implemented!
 ACAD_PORT bool AcApDocWindow::canClose  |  ( |   | ) |   const
warning Not implemented!
 ACAD_PORT void AcApDocWindow::close  |  ( |   | )
warning Not implemented!
 ACAD_PORT AcRxObject* AcApDocWindow::document  |  ( |   | )
warning Not implemented!
 ACAD_PORT void AcApDocWindow::enable  |  ( |  bool  |  bEnable | )
warning Not implemented!
 virtual ACAD_PORT void AcApDocWindow::onActivate  |  ( |   | )
protectedvirtual
warning Not implemented!
 virtual ACAD_PORT void AcApDocWindow::onCreate  |  ( |  HWND  |  hWnd | )
protectedvirtual
warning Not implemented!
 virtual ACAD_PORT void AcApDocWindow::onDestroy  |  ( |   | )
protectedvirtual
warning Not implemented!
 virtual ACAD_PORT void AcApDocWindow::onLoad  |  ( |   | )
protectedvirtual
warning Not implemented!
 virtual ACAD_PORT void AcApDocWindow::onUpdate  |  ( |   | )
protectedvirtual
warning Not implemented!
 ACAD_PORT void AcApDocWindow::removeReactor  |  ( |  AcApDocWindowReactor *  |  reactor | )
warning Not implemented!
 ACAD_PORT void AcApDocWindow::setCanClose  |  ( |  bool  |  bCanClose | )
warning Not implemented!
 virtual ACAD_PORT void AcApDocWindow::setDocument  |  ( |  AcRxObject *  |  document | )
protectedvirtual
warning Not implemented!
 ACAD_PORT void AcApDocWindow::setTitle  |  ( |  const ACHAR *  |  title | )
warning Not implemented!
 ACAD_PORT const ACHAR* AcApDocWindow::title  |  ( |   | ) |   const
warning Not implemented!
 virtual ACAD_PORT HWND AcApDocWindow::windowHandle  |  ( |   | )
virtual
warning Not implemented!
Implements IAdHostWindow.
 The documentation for this class was generated from the following file:
AcApDocWindow.h