Public Member Functions | List of all members
AcRxBoxedValueOnStack Class Reference
AcRx Classes
  Inheritance diagram for AcRxBoxedValueOnStack:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxBoxedValueOnStack, ACBASE_PORT)
ACBASE_PORT  | AcRxBoxedValueOnStack (const AcRxValue &value)
virtual ACBASE_PORT const AcRxValue *  | value () const ADESK_OVERRIDE
virtual ACBASE_PORT AcRxValue *  | value () ADESK_OVERRIDE
 Public Member Functions inherited from AcRxBoxedValue
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxBoxedValue, ACBASE_PORT)
virtual ACBASE_PORT AcRxObject *  | clone () const ADESK_OVERRIDE
virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const ADESK_OVERRIDE
virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other) ADESK_OVERRIDE
virtual ACBASE_PORT Adesk::Boolean  | isEqualTo (const AcRxObject *other) const ADESK_OVERRIDE
ACBASE_PORT const AcRxObject *  | rxObject () const
ACBASE_PORT AcRxObject *  | rxObject ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxClass *  | isA () const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxBoxedValue
static ACBASE_PORT AcRxBoxedValue *  | newBoxedValueOnHeap (const AcRxValue &value)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 ACBASE_PORT AcRxBoxedValueOnStack::AcRxBoxedValueOnStack  |  ( |  const AcRxValue &  |  value | )
Warning
Not implemented!
Member Function Documentation
 virtual ACBASE_PORT const AcRxValue* AcRxBoxedValueOnStack::value  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcRxBoxedValue.
 virtual ACBASE_PORT AcRxValue* AcRxBoxedValueOnStack::value  |  ( |   | )
virtual
Warning
Not implemented!
Implements AcRxBoxedValue.
 The documentation for this class was generated from the following file:
rxvalue.h