Public Member Functions | List of all members
AcDbDatabaseSummaryInfo Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbDatabaseSummaryInfo:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbDatabaseSummaryInfo)
 virtual Acad::ErrorStatus  | addCustomSummaryInfo (const ACHAR *key, const ACHAR *value)=0
 virtual AcDbDatabase *  | database () const =0
 virtual Acad::ErrorStatus  | deleteCustomSummaryInfo (int index)=0
 virtual Acad::ErrorStatus  | deleteCustomSummaryInfo (const ACHAR *key)=0
 virtual Acad::ErrorStatus  | getAuthor (AcString &author) const =0
 virtual Acad::ErrorStatus  | getAuthor (ACHAR *&author) const final
 virtual Acad::ErrorStatus  | getComments (AcString &comments) const =0
 virtual Acad::ErrorStatus  | getComments (ACHAR *&comments) const final
 virtual Acad::ErrorStatus  | getCustomSummaryInfo (int index, AcString &key, AcString &value) const =0
 virtual Acad::ErrorStatus  | getCustomSummaryInfo (const ACHAR *customInfoKey, AcString &value) const =0
 virtual Acad::ErrorStatus  | getCustomSummaryInfo (int index, ACHAR *&key, ACHAR *&value) const final
 virtual Acad::ErrorStatus  | getCustomSummaryInfo (const ACHAR *customInfoKey, ACHAR *&value) const final
 virtual Acad::ErrorStatus  | getHyperlinkBase (AcString &HyperlinkBase) const =0
 virtual Acad::ErrorStatus  | getHyperlinkBase (ACHAR *&HyperlinkBase) const final
 virtual Acad::ErrorStatus  | getKeywords (AcString &keywordlist) const =0
 virtual Acad::ErrorStatus  | getKeywords (ACHAR *&keywordlist) const final
 virtual Acad::ErrorStatus  | getLastSavedBy (AcString &lastSavedBy) const =0
 virtual Acad::ErrorStatus  | getLastSavedBy (ACHAR *&lastSavedBy) const final
 virtual Acad::ErrorStatus  | getRevisionNumber (AcString &revisionNumber) const =0
 virtual Acad::ErrorStatus  | getRevisionNumber (ACHAR *&revisionNumber) const final
 virtual Acad::ErrorStatus  | getSubject (AcString &subject) const =0
 virtual Acad::ErrorStatus  | getSubject (ACHAR *&subject) const final
 virtual Acad::ErrorStatus  | getTitle (AcString &title) const =0
 virtual Acad::ErrorStatus  | getTitle (ACHAR *&title) const final
 virtual int  | numCustomInfo () const =0
 virtual Acad::ErrorStatus  | setAuthor (const ACHAR *author)=0
 virtual Acad::ErrorStatus  | setComments (const ACHAR *comments)=0
 virtual Acad::ErrorStatus  | setCustomSummaryInfo (int index, const ACHAR *key, const ACHAR *value)=0
 virtual Acad::ErrorStatus  | setCustomSummaryInfo (const ACHAR *customInfoKey, const ACHAR *value)=0
 virtual Acad::ErrorStatus  | setHyperlinkBase (const ACHAR *HyperlinkBase)=0
 virtual Acad::ErrorStatus  | setKeywords (const ACHAR *keywordlist)=0
 virtual Acad::ErrorStatus  | setLastSavedBy (const ACHAR *lastSavedBy)=0
 virtual Acad::ErrorStatus  | setRevisionNumber (const ACHAR *revisionNumber)=0
 virtual Acad::ErrorStatus  | setSubject (const ACHAR *subject)=0
 virtual Acad::ErrorStatus  | setTitle (const ACHAR *title)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
summinfo.h