Public Member Functions | Protected Member Functions | List of all members
AcDbEvalVariant Class Reference
AcDb Classes
  Inheritance diagram for AcDbEvalVariant:
 Public Member Functions
AcDbEvalVariant (const AcDbEvalVariant &other)
 ACDBCORE2D_PORT  | AcDbEvalVariant (AcDbEvalVariant &&other)
AcDbEvalVariant (const AcDbEvalVariant *pOther)
AcDbEvalVariant (double dVal)
AcDbEvalVariant (short iVal)
AcDbEvalVariant (const ACHAR *szVal)
AcDbEvalVariant (Adesk::Int32 lVal)
AcDbEvalVariant (const AcDbObjectId &id)
AcDbEvalVariant (const AcGePoint2d &pt)
AcDbEvalVariant (const AcGePoint3d &pt)
AcDbEvalVariant (const resbuf &rb)
ACRX_DECLARE_MEMBERS (AcDbEvalVariant)
 void  | clear ()
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pOther) override
Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
Acad::ErrorStatus  | fromAcRxValue (const AcRxValue &value)
AcDb::DwgDataType  | getType () const
Acad::ErrorStatus  | getValue (double &value) const
Acad::ErrorStatus  | getValue (short &value) const
Acad::ErrorStatus  | getValue (Adesk::Int32 &value) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getValue (AcString &value) const
Acad::ErrorStatus  | getValue (AcDbObjectId &value, AcDbDatabase *pDb=NULL) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getValue (AcGePoint3d &value) const
Acad::ErrorStatus  | getValue (AcGePoint2d &value) const
bool  | operator!= (const AcDbEvalVariant &val) const
bool  | operator< (const AcDbEvalVariant &val) const
bool  | operator<= (const AcDbEvalVariant &val) const
AcDbEvalVariant &  | operator= (const resbuf &rb)
 AcDbEvalVariant &  | operator= (double dVal)
 AcDbEvalVariant &  | operator= (short iVal)
 AcDbEvalVariant &  | operator= (Adesk::Int32 lVal)
 AcDbEvalVariant &  | operator= (const ACHAR *szVal)
 AcDbEvalVariant &  | operator= (const AcDbEvalVariant &other)
 ACDBCORE2D_PORT AcDbEvalVariant &  | operator= (AcDbEvalVariant &&other)
 AcDbEvalVariant &  | operator= (const AcDbObjectId &id)
 AcDbEvalVariant &  | operator= (const AcGePoint2d &pt)
 AcDbEvalVariant &  | operator= (const AcGePoint3d &pt)
bool  | operator== (const AcDbEvalVariant &val) const
bool  | operator> (const AcDbEvalVariant &val) const
bool  | operator>= (const AcDbEvalVariant &val) const
Acad::ErrorStatus  | setValue (AcDb::DxfCode groupcode, double value)
Acad::ErrorStatus  | setValue (AcDb::DxfCode groupcode, short value)
Acad::ErrorStatus  | setValue (AcDb::DxfCode groupcode, Adesk::Int32 value)
Acad::ErrorStatus  | setValue (AcDb::DxfCode groupcode, const AcString &value)
ACDBCORE2D_PORT Acad::ErrorStatus  | setValue (AcDb::DxfCode groupcode, const wchar_t *value)
Acad::ErrorStatus  | setValue (AcDb::DxfCode groupcode, AcDbObjectId value)
Acad::ErrorStatus  | setValue (AcDb::DxfCode groupcode, const AcGePoint3d &value)
Acad::ErrorStatus  | setValue (AcDb::DxfCode groupcode, const AcGePoint2d &value)
Acad::ErrorStatus  | toAcRxValue (const AcRxValueType &type, AcRxValue &value) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 void  | init ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Public Attributes inherited from resbuf
 struct resbuf *  | rbnext
 short  | restype
 union ads_u_val  | resval
Constructor & Destructor Documentation
 AcDbEvalVariant::AcDbEvalVariant  |  ( |  double  |  dVal | )
Warning
Not implemented!
 AcDbEvalVariant::AcDbEvalVariant  |  ( |  const resbuf &  |  rb | )
Warning
Not implemented!
Member Function Documentation
 Acad::ErrorStatus AcDbEvalVariant::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::fromAcRxValue  |  ( |  const AcRxValue &  |  value | )
Warning
Not implemented!
 AcDb::DwgDataType AcDbEvalVariant::getType  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  double &  |  value | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  short &  |  value | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  Adesk::Int32 &  |  value | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  AcString &  |  value | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  AcDbObjectId &  |  value,
|  AcDbDatabase *  |  pDb = NULL
) |   |  const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  AcGePoint3d &  |  value | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::getValue  |  ( |  AcGePoint2d &  |  value | ) |   const
Warning
Not implemented!
 bool AcDbEvalVariant::operator!=  |  ( |  const AcDbEvalVariant &  |  val | ) |   const
Warning
Not implemented!
 bool AcDbEvalVariant::operator<  |  ( |  const AcDbEvalVariant &  |  val | ) |   const
Warning
Not implemented!
 bool AcDbEvalVariant::operator<=  |  ( |  const AcDbEvalVariant &  |  val | ) |   const
Warning
Not implemented!
 AcDbEvalVariant& AcDbEvalVariant::operator=  |  ( |  const resbuf &  |  rb | )
Warning
Not implemented!
 bool AcDbEvalVariant::operator==  |  ( |  const AcDbEvalVariant &  |  val | ) |   const
Warning
Not implemented!
 bool AcDbEvalVariant::operator>  |  ( |  const AcDbEvalVariant &  |  val | ) |   const
Warning
Not implemented!
 bool AcDbEvalVariant::operator>=  |  ( |  const AcDbEvalVariant &  |  val | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  groupcode,
|  double  |  value
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  groupcode,
|  short  |  value
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  groupcode,
|  Adesk::Int32  |  value
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  groupcode,
|  const AcString &  |  value
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  groupcode,
|  const wchar_t *  |  value
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  groupcode,
|  AcDbObjectId  |  value
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  groupcode,
|  const AcGePoint3d &  |  value
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::setValue  |  ( |  AcDb::DxfCode  |  groupcode,
|  const AcGePoint2d &  |  value
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbEvalVariant::toAcRxValue  |  ( |  const AcRxValueType &  |  type,
|  AcRxValue &  |  value
) |   |  const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbeval.h