Public Member Functions | Protected Member Functions | Friends | List of all members
AcRxMemberIterator Class Reference
AcRx Classes
  Inheritance diagram for AcRxMemberIterator:
 Public Member Functions
virtual ACBASE_PORT AcRxMember *  | current () const
virtual ACBASE_PORT bool  | done ()
virtual ACBASE_PORT AcRxMember *  | find (const ACHAR *name) const
virtual ACBASE_PORT bool  | next ()
virtual ACBASE_PORT  | ~AcRxMemberIterator ()
 Protected Member Functions
ACBASE_PORT  | AcRxMemberIterator ()
 Protected Member Functions inherited from Pimpl::ApiPart< void, AcRxMemberIteratorImp >
ApiPart (AcRxMemberIteratorImp *pImp) throw ()
 Friends
 class  | AcRxMemberIteratorImp
Constructor & Destructor Documentation
 virtual ACBASE_PORT AcRxMemberIterator::~AcRxMemberIterator  |  ( |   | )
virtual
Warning
Not implemented!
 ACBASE_PORT AcRxMemberIterator::AcRxMemberIterator  |  ( |   | )
protected
Warning
Not implemented!
Member Function Documentation
 virtual ACBASE_PORT AcRxMember* AcRxMemberIterator::current  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual ACBASE_PORT bool AcRxMemberIterator::done  |  ( |   | )
virtual
Warning
Not implemented!
 virtual ACBASE_PORT AcRxMember* AcRxMemberIterator::find  |  ( |  const ACHAR *  |  name | ) |   const
virtual
Warning
Not implemented!
 virtual ACBASE_PORT bool AcRxMemberIterator::next  |  ( |   | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxmember.h