Public Member Functions | List of all members
AcDbDwgFiler Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbDwgFiler:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbDwgFiler)
 virtual Acad::ErrorStatus  | addReferences (AcDbIdRefQueue &)
 virtual AcDbFilerController &  | controller () const
 virtual Acad::ErrorStatus  | dwgVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer) const
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | extendedDwgMaintenanceReleaseVersion (AcDb::MaintenanceReleaseVersion &maintVer) const
 virtual Acad::ErrorStatus  | filerStatus () const =0
 virtual AcDb::FilerType  | filerType () const =0
 virtual AcDbAuditInfo *  | getAuditInfo () const
 virtual Acad::ErrorStatus  | readAcDbHandle (AcDbHandle *pVal)=0
 virtual Acad::ErrorStatus  | readAddress (void **pVal)
 virtual Acad::ErrorStatus  | readBChunk (ads_binary *pVal)=0
 virtual Acad::ErrorStatus  | readBool (bool *pVal)=0
 virtual Acad::ErrorStatus  | readBoolean (Adesk::Boolean *pVal)=0
 virtual Acad::ErrorStatus  | readBytes (void *pDest, Adesk::UIntPtr nBytes)=0
 virtual Acad::ErrorStatus  | readDouble (double *pVal)=0
 virtual Acad::ErrorStatus  | readHardOwnershipId (AcDbHardOwnershipId *pVal)=0
 virtual Acad::ErrorStatus  | readHardPointerId (AcDbHardPointerId *pVal)=0
 virtual Acad::ErrorStatus  | readInt16 (Adesk::Int16 *pVal)=0
 virtual Acad::ErrorStatus  | readInt32 (Adesk::Int32 *pVal)=0
 virtual Acad::ErrorStatus  | readInt64 (Adesk::Int64 *pVal)=0
 virtual Acad::ErrorStatus  | readInt8 (Adesk::Int8 *pVal)=0
 Acad::ErrorStatus  | readItem (AcDbHardOwnershipId *pId)
 Acad::ErrorStatus  | readItem (AcDbSoftOwnershipId *pId)
 Acad::ErrorStatus  | readItem (AcDbHardPointerId *pId)
 Acad::ErrorStatus  | readItem (AcDbSoftPointerId *pId)
 Acad::ErrorStatus  | readItem (ACHAR **pVal)
 Acad::ErrorStatus  | readItem (ads_binary *pVal)
 Acad::ErrorStatus  | readItem (AcDbHandle *pVal)
 Acad::ErrorStatus  | readItem (Adesk::Int32 *pVal)
 Acad::ErrorStatus  | readItem (Adesk::Int16 *pVal)
 Acad::ErrorStatus  | readItem (Adesk::Int8 *pVal)
 Acad::ErrorStatus  | readItem (Adesk::UInt32 *pVal)
 Acad::ErrorStatus  | readItem (Adesk::UInt16 *pVal)
 Acad::ErrorStatus  | readItem (Adesk::UInt8 *pVal)
 Acad::ErrorStatus  | readItem (Adesk::Boolean *pVal)
 Acad::ErrorStatus  | readItem (bool *pVal)
 Acad::ErrorStatus  | readItem (double *pVal)
 Acad::ErrorStatus  | readItem (AcGePoint2d *pVal)
 Acad::ErrorStatus  | readItem (AcGePoint3d *pVal)
 Acad::ErrorStatus  | readItem (AcGeVector2d *pVal)
 Acad::ErrorStatus  | readItem (AcGeVector3d *pVal)
 Acad::ErrorStatus  | readItem (AcGeScale3d *pVal)
 Acad::ErrorStatus  | readItem (void *pDest, Adesk::UIntPtr nBytes)
 Acad::ErrorStatus  | readItem (void **pp)
 virtual Acad::ErrorStatus  | readPoint2d (AcGePoint2d *pVal)=0
 virtual Acad::ErrorStatus  | readPoint3d (AcGePoint3d *pVal)=0
 virtual Acad::ErrorStatus  | readScale3d (AcGeScale3d *pVal)=0
 virtual Acad::ErrorStatus  | readSoftOwnershipId (AcDbSoftOwnershipId *pVal)=0
 virtual Acad::ErrorStatus  | readSoftPointerId (AcDbSoftPointerId *pVal)=0
 virtual Acad::ErrorStatus  | readString (ACHAR **pVal)=0
 virtual Acad::ErrorStatus  | readString (AcString &val)=0
 virtual Acad::ErrorStatus  | readUInt16 (Adesk::UInt16 *pVal)=0
 virtual Acad::ErrorStatus  | readUInt32 (Adesk::UInt32 *pVal)=0
 virtual Acad::ErrorStatus  | readUInt64 (Adesk::UInt64 *pVal)=0
 virtual Acad::ErrorStatus  | readUInt8 (Adesk::UInt8 *pVal)=0
 virtual Acad::ErrorStatus  | readVector2d (AcGeVector2d *pVal)=0
 virtual Acad::ErrorStatus  | readVector3d (AcGeVector3d *pVal)=0
 virtual void  | resetFilerStatus ()=0
 virtual Acad::ErrorStatus  | seek (Adesk::Int64 nOffset, int nMethod)=0
 virtual void  | setFilerStatus (Acad::ErrorStatus es)=0
 virtual Adesk::Int64  | tell () const =0
 virtual bool  | usesReferences () const
 virtual Acad::ErrorStatus  | writeAcDbHandle (const AcDbHandle &val)=0
 virtual Acad::ErrorStatus  | writeAddress (const void *pVal)
 virtual Acad::ErrorStatus  | writeBChunk (const ads_binary &)=0
 virtual Acad::ErrorStatus  | writeBool (bool val)=0
 virtual Acad::ErrorStatus  | writeBoolean (Adesk::Boolean val)=0
 virtual Acad::ErrorStatus  | writeBytes (const void *pSrc, Adesk::UIntPtr nBytes)=0
 virtual Acad::ErrorStatus  | writeDouble (double val)=0
 virtual Acad::ErrorStatus  | writeHardOwnershipId (const AcDbHardOwnershipId &val)=0
 virtual Acad::ErrorStatus  | writeHardPointerId (const AcDbHardPointerId &val)=0
 virtual Acad::ErrorStatus  | writeInt16 (Adesk::Int16 val)=0
 virtual Acad::ErrorStatus  | writeInt32 (Adesk::Int32 val)=0
 virtual Acad::ErrorStatus  | writeInt64 (Adesk::Int64 val)=0
 virtual Acad::ErrorStatus  | writeInt8 (Adesk::Int8 val)=0
 Acad::ErrorStatus  | writeItem (const AcDbHardOwnershipId &id)
 Acad::ErrorStatus  | writeItem (const AcDbSoftOwnershipId &id)
 Acad::ErrorStatus  | writeItem (const AcDbHardPointerId &id)
 Acad::ErrorStatus  | writeItem (const AcDbSoftPointerId &id)
 Acad::ErrorStatus  | writeItem (const ACHAR *val)
Acad::ErrorStatus  | writeItem (const AcString &val)
 Acad::ErrorStatus  | writeItem (const ads_binary &val)
 Acad::ErrorStatus  | writeItem (const AcDbHandle &val)
 Acad::ErrorStatus  | writeItem (Adesk::Int32 val)
 Acad::ErrorStatus  | writeItem (Adesk::Int16 val)
 Acad::ErrorStatus  | writeItem (Adesk::Int8 val)
 Acad::ErrorStatus  | writeItem (Adesk::UInt32 val)
 Acad::ErrorStatus  | writeItem (Adesk::UInt16 val)
 Acad::ErrorStatus  | writeItem (Adesk::UInt8 val)
 Acad::ErrorStatus  | writeItem (Adesk::Boolean val)
 Acad::ErrorStatus  | writeItem (bool val)
 Acad::ErrorStatus  | writeItem (double val)
 Acad::ErrorStatus  | writeItem (const AcGePoint2d &val)
 Acad::ErrorStatus  | writeItem (const AcGePoint3d &val)
 Acad::ErrorStatus  | writeItem (const AcGeVector2d &val)
 Acad::ErrorStatus  | writeItem (const AcGeVector3d &val)
 Acad::ErrorStatus  | writeItem (const AcGeScale3d &val)
 Acad::ErrorStatus  | writeItem (const void *pSrc, Adesk::UIntPtr nBytes)
 Acad::ErrorStatus  | writeItem (const void *p)
 virtual Acad::ErrorStatus  | writePoint2d (const AcGePoint2d &val)=0
 virtual Acad::ErrorStatus  | writePoint3d (const AcGePoint3d &val)=0
 virtual Acad::ErrorStatus  | writeScale3d (const AcGeScale3d &val)=0
 virtual Acad::ErrorStatus  | writeSoftOwnershipId (const AcDbSoftOwnershipId &val)=0
 virtual Acad::ErrorStatus  | writeSoftPointerId (const AcDbSoftPointerId &val)=0
 virtual Acad::ErrorStatus  | writeString (const ACHAR *pVal)=0
 virtual Acad::ErrorStatus  | writeString (const AcString &pVal)=0
 virtual Acad::ErrorStatus  | writeUInt16 (Adesk::UInt16 val)=0
 virtual Acad::ErrorStatus  | writeUInt32 (Adesk::UInt32 val)=0
 virtual Acad::ErrorStatus  | writeUInt64 (Adesk::UInt64 val)=0
 virtual Acad::ErrorStatus  | writeUInt8 (Adesk::UInt8 val)=0
 virtual Acad::ErrorStatus  | writeVector2d (const AcGeVector2d &val)=0
 virtual Acad::ErrorStatus  | writeVector3d (const AcGeVector3d &val)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcDbDwgFiler::extendedDwgMaintenanceReleaseVersion  |  ( |  AcDb::MaintenanceReleaseVersion &  |  maintVer | ) |   const
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcDbDwgFiler::writeItem  |  ( |  const AcString &  |  val | )
inline
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbfiler.h