Public Member Functions | List of all members
IAcRxObjectValue Class Referenceabstract
AcRx Classes
 Public Member Functions
 virtual const AcRxObject *  | getRxObject (const AcRxValue &value) const =0
 The documentation for this class was generated from the following file:
rxvaluetype.h