Public Member Functions | Static Public Member Functions | Friends | List of all members
AcDb3dProfile Class Reference
AcDb Classes
  Inheritance diagram for AcDb3dProfile:
 Public Member Functions
AcDb3dProfile ()
AcDb3dProfile (AcDbEntity *pEntity)
AcDb3dProfile (const AcDbFullSubentPath &faceSubentPath)
AcDb3dProfile (const AcDbPathRef &pathRef)
AcDb3dProfile (const AcDbVertexRef &vertexRef)
AcDb3dProfile (const AcDb3dProfile &src)
ACRX_DECLARE_MEMBERS (AcDb3dProfile)
Acad::ErrorStatus  | convertProfile (bool explodeMultiFaceRegions, bool convertSurfaceToEdges, bool nonPlanarOnly, bool outerLoopOnly, AcArray< AcDb3dProfile * > &convertedProfileArr) const
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *src) override
AcDbEntity *  | entity () const
Acad::ErrorStatus  | getPathRef (AcDbPathRef &pathRef) const
Acad::ErrorStatus  | getVertexRef (AcDbVertexRef &vertexRef) const
bool  | isClosed () const
bool  | isEdge () const
bool  | isFace () const
bool  | isPlanar () const
bool  | isSubent () const
bool  | isValid () const
AcDb3dProfile &  | operator= (const AcDb3dProfile &src)
Acad::ErrorStatus  | set (const AcDbPathRef &pathRef)
Acad::ErrorStatus  | set (const AcDbVertexRef &vertexRef)
Acad::ErrorStatus  | set (AcDbEntity *pEntity)
virtual  | ~AcDb3dProfile ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static AcDb3dProfile *  | convertProfile (const AcArray< AcDbPathRef > &)
static Acad::ErrorStatus  | mergeProfiles (const AcArray< AcDb3dProfile * > &profileArr, bool mergeEdges, bool mergeCurves, AcArray< AcDb3dProfile * > &mergedProfileArr)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Friends
 class  | AcDb3dProfileData
 class  | AcDbLoftProfile
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDb3dProfile::AcDb3dProfile  |  ( |   | )
Warning
Not implemented!
 AcDb3dProfile::AcDb3dProfile  |  ( |  AcDbEntity *  |  pEntity | )
Warning
Not implemented!
 AcDb3dProfile::AcDb3dProfile  |  ( |  const AcDbFullSubentPath &  |  faceSubentPath | )
Warning
Not implemented!
 AcDb3dProfile::AcDb3dProfile  |  ( |  const AcDbPathRef &  |  pathRef | )
Warning
Not implemented!
 AcDb3dProfile::AcDb3dProfile  |  ( |  const AcDbVertexRef &  |  vertexRef | )
Warning
Not implemented!
 AcDb3dProfile::AcDb3dProfile  |  ( |  const AcDb3dProfile &  |  src | )
Warning
Not implemented!
 virtual AcDb3dProfile::~AcDb3dProfile  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 Acad::ErrorStatus AcDb3dProfile::convertProfile  |  ( |  bool  |  explodeMultiFaceRegions,
|  bool  |  convertSurfaceToEdges,
|  bool  |  nonPlanarOnly,
|  bool  |  outerLoopOnly,
|  AcArray< AcDb3dProfile * > &  |  convertedProfileArr
) |   |  const
Warning
Not implemented!
 static AcDb3dProfile* AcDb3dProfile::convertProfile  |  ( |  const AcArray< AcDbPathRef > &  |   | )
static
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDb3dProfile::copyFrom  |  ( |  const AcRxObject *  |  src | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcRxObject.
Reimplemented in AcDbLoftProfile.
 AcDbEntity* AcDb3dProfile::entity  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDb3dProfile::getPathRef  |  ( |  AcDbPathRef &  |  pathRef | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDb3dProfile::getVertexRef  |  ( |  AcDbVertexRef &  |  vertexRef | ) |   const
Warning
Not implemented!
 bool AcDb3dProfile::isClosed  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDb3dProfile::isEdge  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDb3dProfile::isFace  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDb3dProfile::isPlanar  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDb3dProfile::isSubent  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDb3dProfile::isValid  |  ( |   | ) |   const
Warning
Not implemented!
 static Acad::ErrorStatus AcDb3dProfile::mergeProfiles  |  ( |  const AcArray< AcDb3dProfile * > &  |  profileArr,
|  bool  |  mergeEdges,
|  bool  |  mergeCurves,
|  AcArray< AcDb3dProfile * > &  |  mergedProfileArr
)
static
Warning
Not implemented!
 AcDb3dProfile& AcDb3dProfile::operator=  |  ( |  const AcDb3dProfile &  |  src | )
Warning
Not implemented!
 Acad::ErrorStatus AcDb3dProfile::set  |  ( |  const AcDbPathRef &  |  pathRef | )
Warning
Not implemented!
 Acad::ErrorStatus AcDb3dProfile::set  |  ( |  const AcDbVertexRef &  |  vertexRef | )
Warning
Not implemented!
 Acad::ErrorStatus AcDb3dProfile::set  |  ( |  AcDbEntity *  |  pEntity | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
db3dProfile.h