Public Types | Public Member Functions | Static Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcEdInplaceTextEditor Class Reference
AcEd Classes
  Inheritance diagram for AcEdInplaceTextEditor:
 Public Types
enum  | TextUndoType {
 kUndoTyping = 1, kUndoBoldOn, kUndoBoldOff, kUndoItalicOn,
 kUndoItalicOff, kUndoUnderlineOn, kUndoUnderlineOff, kUndoOverlineOn,
 kUndoOverlineOff, kUndoFont, kUndoHeight, kUndoColor,
 kUndoObliqueAngle, kUndoWidthScale, kUndoTrackingFactor, kUndoLanguage,
 kUndoBackspace, kUndoDelete, kUndoPaste, kUndoCut,
 kUndoStack, kUndoUnstack, kUndoStackProperties, kUndoFieldInsert,
 kUndoFieldConvert, kUndoFieldUpdate, kUndoSymbolInsert, kUndoAutoField,
 kUndoAutoStack, kUndoAutoSymbol, kUndoAutoDTextEscape, kUndoAutoMifOrCif,
 kUndoAutoDimension, kUndoAutoDimBreak, kUndoAutoSpell, kUndoStyle,
 kUndoAttachment, kUndoChangeCase, kUndoImportText, kUndoCombineParagraphs,
 kUndoRemoveCharFormatting, kUndoRemoveParaFormatting, kUndoRemoveAllFormatting, kUndoReplaceAll,
 kUndoReplace, kUndoParagraphAttributes, kUndoSetDefinedWidth, kUndoSetDefinedHeight,
 kUndoCharAttributes, kUndoWipeout, kUndoDimensionInsert, kUndoDimBreakInsert,
 kUndoCustomConvert, kUndoDeleteAndMoveSelection, kUndoParagraphNumbering, kUndoCursorAttributes,
 kUndoColumns, kUndoAnnoState, kUndoDimensionTweak, kUndoDimensionSymbol,
 kUndoDimensionTemplate
 }
 Public Types inherited from AcDbTextEditor
enum  | ExitStatus { kExitQuit = 0, kExitSave }
enum  | TextFindFlags {
 kFindMatchCase = 1 << 0, kFindWholeWord = 1 << 1, kFindHalfFullForm = 1 << 2, kFindIgnoreAccent = 1 << 3,
 kFindUseWildcards = 1 << 4
 }
 Public Member Functions
ACCORE_PORT Acad::ErrorStatus  | addUndoMarker (TextUndoType type)
ACCORE_PORT bool  | annotative () const
ACCORE_PORT Acad::ErrorStatus  | attachmentMenusInput (AcGePoint2d *menuPt, HWND parentHandle)
ACCORE_PORT bool  | canCopy () const
ACCORE_PORT bool  | canCut () const
ACCORE_PORT bool  | canExitInplaceEditor ()
ACCORE_PORT bool  | canPaste () const
ACCORE_PORT bool  | canRedo () const
ACCORE_PORT bool  | canUndo () const
virtual ACCORE_PORT void  | close (ExitStatus stat)
ACCORE_PORT Acad::ErrorStatus  | columnMenusInput (AcGePoint2d *menuPt, HWND parentHandle)
ACCORE_PORT Acad::ErrorStatus  | contextMenusInput (AcGePoint2d *menuPt, HWND parentHandle)
ACCORE_PORT Acad::ErrorStatus  | copy ()
ACCORE_PORT Acad::ErrorStatus  | cut ()
ACCORE_PORT void  | drawHighlight ()
ACCORE_PORT void  | enableWysiwyg ()
ACCORE_PORT void  | findMatchItem (int findFlags, const AcString &findStr) const
ACCORE_PORT bool  | forcedOpaqueBackground ()
ACCORE_PORT AcDbTextEditorParagraph::AlignmentType  | getAlignmentFromAttachment () const
ACCORE_PORT void  | insertFile (const AcString &fileName)
ACCORE_PORT Acad::ErrorStatus  | invokeColumnsDialog (int iStaticColumnCount=0)
ACCORE_PORT Acad::ErrorStatus  | invokeFieldDialog (AcDbField *pField=NULL)
ACCORE_PORT Acad::ErrorStatus  | invokeFindReplaceDialog ()
ACCORE_PORT Acad::ErrorStatus  | invokeHelpDialog ()
ACCORE_PORT Acad::ErrorStatus  | invokeHightlightColorDialog ()
ACCORE_PORT Acad::ErrorStatus  | invokeImportTextDialog ()
ADESK_DEPRECATED ACCORE_PORT Acad::ErrorStatus  | invokeNewFeatureWorkshop ()
ACCORE_PORT Acad::ErrorStatus  | invokeParagraphDialog ()
ACCORE_PORT Acad::ErrorStatus  | invokeSpellerDictionaryDialog ()
ACCORE_PORT Acad::ErrorStatus  | invokeSpellSettingDialog ()
ACCORE_PORT Acad::ErrorStatus  | invokeStackPropertyDialog ()
ACCORE_PORT Acad::ErrorStatus  | invokeWipeoutDialog ()
ACCORE_PORT bool  | isMultiAttribute () const
ACCORE_PORT bool  | isParagraphSupported () const
ACCORE_PORT bool  | isSimpleMtext () const
ACCORE_PORT bool  | isTableCell () const
ACCORE_PORT bool  | isText () const
ACCORE_PORT COLORREF  | layerColor () const
ACCORE_PORT Acad::ErrorStatus  | lineSpaceMenusInput (AcGePoint2d *menuPt, HWND parentHandle)
ACCORE_PORT Acad::ErrorStatus  | numberingMenusInput (AcGePoint2d *menuPt, HWND parentHandle)
ACCORE_PORT bool  | opaqueBackground ()
ACCORE_PORT void  | otherSymbol ()
ACCORE_PORT Acad::ErrorStatus  | paste ()
ACCORE_PORT Acad::ErrorStatus  | pasteWithoutFormats ()
ACCORE_PORT Acad::ErrorStatus  | redo ()
ACCORE_PORT void  | removeHightlight ()
ACCORE_PORT void  | replaceAllMatchItems (int findFlags, const AcString &findStr, const AcString &replaceStr) const
ACCORE_PORT void  | replaceCurrentMatchItem (int findFlags, const AcString &findStr, const AcString &replaceStr) const
ACCORE_PORT bool  | rulerHidden () const
ACCORE_PORT bool  | rulerSupported () const
ACCORE_PORT Acad::ErrorStatus  | setAnnotative (bool bSet)
ACCORE_PORT void  | setCanExitInplaceEditor (bool bCanExit)
ACCORE_PORT void  | setHost (IAcEdInplaceTextEditorHost *pHost)
ACCORE_PORT void  | setOpaqueBackground (bool opaqueBackground)
ACCORE_PORT void  | setRulerHidden (bool hideRuler)
ACCORE_PORT Acad::ErrorStatus  | setStaticColumnsWithCount (int columnCount)
ACCORE_PORT void  | setToolbarHidden (bool bHideToolbar)
ACCORE_PORT void  | setToolbarOptionHidden (bool bHideOption)
ACCORE_PORT Acad::ErrorStatus  | setUndoRecordingDisable (bool disabled)
ACCORE_PORT bool  | spellerEnabled () const
ACCORE_PORT Acad::ErrorStatus  | symbolMenusInput (AcGePoint2d *menuPt, HWND parentHandle)
ACCORE_PORT void  | toggleSpelling ()
ACCORE_PORT bool  | toolbarHidden () const
ACCORE_PORT bool  | toolbarOptionHidden () const
ACCORE_PORT Acad::ErrorStatus  | undo ()
ACCORE_PORT bool  | undoRecordingDisabled ()
ACCORE_PORT bool  | wysiwyg ()
 Public Member Functions inherited from AcDbTextEditor
ACDBCORE2D_PORT double  | actualHeight () const
ACDBCORE2D_PORT double  | actualWidth () const
ACDBCORE2D_PORT AcDbMText::AttachmentPoint  | attachment () const
ACDBCORE2D_PORT bool  | autoCAPS ()
ACDBCORE2D_PORT bool  | autolistEnabled () const
ACDBCORE2D_PORT Acad::ErrorStatus  | clearSelection ()
ACDBCORE2D_PORT AcDbTextEditorColumns *  | columns ()
ACDBCORE2D_PORT int  | currentStyleIndex () const
virtual ACDBCORE2D_PORT AcDbTextEditorCursor *  | cursor ()
ACDBCORE2D_PORT AcDbTextEditorSelectionBase::FlowAlign  | defaultStackAlignment () const
ACDBCORE2D_PORT double  | defaultStackScale () const
ACDBCORE2D_PORT double  | definedHeight () const
ACDBCORE2D_PORT double  | definedWidth () const
virtual ACDBCORE2D_PORT AcDbTextEditorLocation *  | endOfText () ADESK_OVERRIDE
ACDBCORE2D_PORT Acad::ErrorStatus  | findText (const ACHAR *text, int flags, AcDbTextEditorLocation *&pStart, AcDbTextEditorLocation *&pEnd)
ACDBCORE2D_PORT int  | getFontCount () const
ACDBCORE2D_PORT AcString  | getFontName (int index) const
ACDBCORE2D_PORT int  | getIndexFromStyleName (const AcString &styleName)
ACDBCORE2D_PORT int  | getStyleCount () const
ACDBCORE2D_PORT AcString  | getStyleName (int index) const
ACDBCORE2D_PORT bool  | isAnnotativeStyle (int index) const
ACDBCORE2D_PORT bool  | isTrueTypeFont (int index) const
ACDBCORE2D_PORT bool  | isVerticalSHX () const
ACDBCORE2D_PORT bool  | isVerticalTTF () const
ACDBCORE2D_PORT Acad::ErrorStatus  | makeSelection (const AcDbTextEditorLocation *pStart, const AcDbTextEditorLocation *pEnd)
ACDBCORE2D_PORT AcDbTextEditorParagraphIterator *  | newParagraphsIterator ()
ACDBCORE2D_PORT bool  | numberingEnabled () const
ACDBCORE2D_PORT void  | redraw ()
ACDBCORE2D_PORT Acad::ErrorStatus  | selectAll ()
virtual ACDBCORE2D_PORT AcDbTextEditorSelection *  | selection ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setAttachment (AcDbMText::AttachmentPoint attachment)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAutoCAPS (bool autoCAPS)
ACDBCORE2D_PORT Acad::ErrorStatus  | setAutolistEnabled (bool enabled)
ACDBCORE2D_PORT Acad::ErrorStatus  | setDefaultStackAlignment (AcDbTextEditorSelectionBase::FlowAlign alignment)
ACDBCORE2D_PORT Acad::ErrorStatus  | setDefaultStackScale (double scale)
ACDBCORE2D_PORT Acad::ErrorStatus  | setDefinedHeight (double height)
ACDBCORE2D_PORT Acad::ErrorStatus  | setDefinedWidth (double width)
ACDBCORE2D_PORT Acad::ErrorStatus  | setEnableNumbering (bool bEnable)
ACDBCORE2D_PORT Acad::ErrorStatus  | setStyle (int index)
ACDBCORE2D_PORT Acad::ErrorStatus  | setStyle (AcDbObjectId styleId)
ACDBCORE2D_PORT Acad::ErrorStatus  | setTabOnlyDelimiter (bool tabOnlyDelimiter)
ACDBCORE2D_PORT Acad::ErrorStatus  | setTextHeight (double textHeight)
ACDBCORE2D_PORT int  | stackCount () const
virtual ACDBCORE2D_PORT AcDbTextEditorLocation *  | startOfText () ADESK_OVERRIDE
ACDBCORE2D_PORT AcDbObjectId  | style (int index) const
ACDBCORE2D_PORT bool  | tabOnlyDelimiter () const
ACDBCORE2D_PORT double  | textHeight () const
ACDBCORE2D_PORT AcDbTextEditorWipeout *  | wipeout ()
 Static Public Member Functions
static ACCORE_PORT AcEdInplaceTextEditor *  | current ()
static ACCORE_PORT Acad::ErrorStatus  | invoke (AcDbMText *pMtext, const AcEdInplaceTextEditorSettings *pSettings)
static ACCORE_PORT Acad::ErrorStatus  | invoke (AcDbText *pText, AcDbObjectIdArray *appendedEntities)
 Static Public Member Functions inherited from AcDbTextEditor
static ACDBCORE2D_PORT AcDbTextEditor *  | createDbTextEditor (AcDbMText *pMText)
 Protected Member Functions
AcEdInplaceTextEditor ()
AcEdInplaceTextEditor (const AcEdInplaceTextEditor &)
AcEdInplaceTextEditor &  | operator= (const AcEdInplaceTextEditor &)
~AcEdInplaceTextEditor ()
 Protected Member Functions inherited from AcDbTextEditor
virtual ACDBCORE2D_PORT  | ~AcDbTextEditor ()
 Protected Attributes
 AcEdInplaceTextEditorImp *  | m_pEditorImp
 IPE_Editor *  | m_pIPEEditorImp
 Protected Attributes inherited from AcDbTextEditor
 TextEditor *  | m_pImp
 Friends
 class  | AcEdInplaceTextEditorImp
Constructor & Destructor Documentation
 AcEdInplaceTextEditor::AcEdInplaceTextEditor  |  ( |   | )
protected
Warning
Not implemented!
 AcEdInplaceTextEditor::~AcEdInplaceTextEditor  |  ( |   | )
protected
Warning
Not implemented!
 AcEdInplaceTextEditor::AcEdInplaceTextEditor  |  ( |  const AcEdInplaceTextEditor &  |   | )
protected
Warning
Not implemented!
Member Function Documentation
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::addUndoMarker  |  ( |  TextUndoType  |  type | )
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::annotative  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::attachmentMenusInput  |  ( |  AcGePoint2d *  |  menuPt,
|  HWND  |  parentHandle
)
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::canCopy  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::canCut  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::canExitInplaceEditor  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::canPaste  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::canRedo  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::canUndo  |  ( |   | ) |   const
Warning
Not implemented!
 virtual ACCORE_PORT void AcEdInplaceTextEditor::close  |  ( |  ExitStatus  |  stat | )
virtual
Warning
Not implemented!
Reimplemented from AcDbTextEditor.
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::columnMenusInput  |  ( |  AcGePoint2d *  |  menuPt,
|  HWND  |  parentHandle
)
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::contextMenusInput  |  ( |  AcGePoint2d *  |  menuPt,
|  HWND  |  parentHandle
)
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::copy  |  ( |   | )
Warning
Not implemented!
 static ACCORE_PORT AcEdInplaceTextEditor* AcEdInplaceTextEditor::current  |  ( |   | )
static
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::cut  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::drawHighlight  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::enableWysiwyg  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::findMatchItem  |  ( |  int  |  findFlags,
|  const AcString &  |  findStr
) |   |  const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::forcedOpaqueBackground  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT AcDbTextEditorParagraph::AlignmentType AcEdInplaceTextEditor::getAlignmentFromAttachment  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::insertFile  |  ( |  const AcString &  |  fileName | )
Warning
Not implemented!
 static ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invoke  |  ( |  AcDbMText *  |  pMtext,
|  const AcEdInplaceTextEditorSettings *  |  pSettings
)
static
Warning
Not implemented!
 static ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invoke  |  ( |  AcDbText *  |  pText,
|  AcDbObjectIdArray *  |  appendedEntities
)
static
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invokeColumnsDialog  |  ( |  int  |  iStaticColumnCount = 0 | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invokeFieldDialog  |  ( |  AcDbField *  |  pField = NULL | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invokeFindReplaceDialog  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invokeHelpDialog  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invokeHightlightColorDialog  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invokeImportTextDialog  |  ( |   | )
Warning
Not implemented!
 ADESK_DEPRECATED ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invokeNewFeatureWorkshop  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invokeParagraphDialog  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invokeSpellerDictionaryDialog  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invokeSpellSettingDialog  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invokeStackPropertyDialog  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::invokeWipeoutDialog  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::isMultiAttribute  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::isParagraphSupported  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::isSimpleMtext  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::isTableCell  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::isText  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT COLORREF AcEdInplaceTextEditor::layerColor  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::lineSpaceMenusInput  |  ( |  AcGePoint2d *  |  menuPt,
|  HWND  |  parentHandle
)
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::numberingMenusInput  |  ( |  AcGePoint2d *  |  menuPt,
|  HWND  |  parentHandle
)
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::opaqueBackground  |  ( |   | )
Warning
Not implemented!
 AcEdInplaceTextEditor& AcEdInplaceTextEditor::operator=  |  ( |  const AcEdInplaceTextEditor &  |   | )
protected
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::otherSymbol  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::paste  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::pasteWithoutFormats  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::redo  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::removeHightlight  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::replaceAllMatchItems  |  ( |  int  |  findFlags,
|  const AcString &  |  findStr,
|  const AcString &  |  replaceStr
) |   |  const
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::replaceCurrentMatchItem  |  ( |  int  |  findFlags,
|  const AcString &  |  findStr,
|  const AcString &  |  replaceStr
) |   |  const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::rulerHidden  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::rulerSupported  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::setAnnotative  |  ( |  bool  |  bSet | )
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::setCanExitInplaceEditor  |  ( |  bool  |  bCanExit | )
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::setHost  |  ( |  IAcEdInplaceTextEditorHost *  |  pHost | )
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::setOpaqueBackground  |  ( |  bool  |  opaqueBackground | )
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::setRulerHidden  |  ( |  bool  |  hideRuler | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::setStaticColumnsWithCount  |  ( |  int  |  columnCount | )
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::setToolbarHidden  |  ( |  bool  |  bHideToolbar | )
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::setToolbarOptionHidden  |  ( |  bool  |  bHideOption | )
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::setUndoRecordingDisable  |  ( |  bool  |  disabled | )
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::spellerEnabled  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::symbolMenusInput  |  ( |  AcGePoint2d *  |  menuPt,
|  HWND  |  parentHandle
)
Warning
Not implemented!
 ACCORE_PORT void AcEdInplaceTextEditor::toggleSpelling  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::toolbarHidden  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::toolbarOptionHidden  |  ( |   | ) |   const
Warning
Not implemented!
 ACCORE_PORT Acad::ErrorStatus AcEdInplaceTextEditor::undo  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::undoRecordingDisabled  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT bool AcEdInplaceTextEditor::wysiwyg  |  ( |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcEdInplaceTextEditor.h