Public Member Functions | List of all members
Ac3dDwfNavTreeNode Class Referenceabstract
Misc Classes
  Inheritance diagram for Ac3dDwfNavTreeNode:
 Public Member Functions
 virtual bool  | addChild (const Ac3dDwfNavTreeNode *node)=0
 virtual const AcArray< const Ac3dDwfNavTreeNode * > &  | children () const =0
 virtual const AcString &  | displayName () const =0
 virtual bool  | isBlock () const =0
 virtual bool  | isGroup () const =0
 virtual const AcArray< long > &  | keys () const =0
 virtual int  | nDescendants () const =0
 virtual bool  | removeChild (const Ac3dDwfNavTreeNode *node)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
Ac3dDwfNavTree.h