Public Member Functions | List of all members
AcGiSkyBackgroundTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiSkyBackgroundTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiSkyBackgroundTraits)
 virtual void  | setSkyParameters (const AcGiSkyParameters &params)=0
 virtual void  | skyParameters (AcGiSkyParameters &params) const =0
 The documentation for this class was generated from the following file:
AcGiEnvironment.h