Public Member Functions | List of all members
AcDbDgnUnderlayItem Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbDgnUnderlayItem:
 Public Member Functions
virtual void  | setShowRasterRef (bool bShow)=0
virtual void  | setUseMasterUnits (bool bUseMasterUnits)=0
virtual bool  | showRasterRef () const =0
virtual bool  | useMasterUnits () const =0
 Public Member Functions inherited from AcDbUnderlayItem
 virtual Acad::ErrorStatus  | draw (AcGiWorldDraw *pWorldDraw, AcGiViewportDraw *pViewportDraw, const AcDbUnderlayDrawContext &context) const =0
 virtual Acad::ErrorStatus  | getExtents (AcGePoint2d &min, AcGePoint2d &max) const =0
 virtual AcString  | getName () const =0
 virtual Acad::ErrorStatus  | getOsnapPoints (const AcGeMatrix3d &modelToWorld, AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const =0
virtual AcDbEntity *  | getSubEntityAtGsMarker (const AcGeMatrix3d &modelToWorld, Adesk::GsMarker gsSelectionMark) const =0
virtual Acad::ErrorStatus  | getThumbnail (BITMAPINFO *&thumbnail) const =0
 virtual Acad::ErrorStatus  | getUnderlayLayer (int, AcUnderlayLayer &) const
 virtual AcDb::UnitsValue  | getUnits () const =0
virtual Acad::ErrorStatus  | intersectWith (const AcGeMatrix3d &modelToWorld, const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane *projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const =0
virtual AcGeMatrix3d  | modelTransform () const =0
 virtual Adesk::UInt32  | underlayLayerCount () const
virtual bool  | usingPartialContent () const =0
int  | version () const
Member Function Documentation
 virtual void AcDbDgnUnderlayItem::setShowRasterRef  |  ( |  bool  |  bShow | )
pure virtual
Warning
Not implemented!
 virtual void AcDbDgnUnderlayItem::setUseMasterUnits  |  ( |  bool  |  bUseMasterUnits | )
pure virtual
Warning
Not implemented!
 virtual bool AcDbDgnUnderlayItem::showRasterRef  |  ( |   | ) |   const
pure virtual
Warning
Not implemented!
 virtual bool AcDbDgnUnderlayItem::useMasterUnits  |  ( |   | ) |   const
pure virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbunderlayhost.h