Public Member Functions | Protected Attributes | Friends | List of all members
AcDbAssocIndexPersSubentId Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocIndexPersSubentId:
 Public Member Functions
AcDbAssocIndexPersSubentId (AcDb::SubentType subentType=AcDb::kNullSubentType, unsigned int index=0)
ACRX_DECLARE_MEMBERS (AcDbAssocIndexPersSubentId)
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) override
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const override
virtual Acad::ErrorStatus  | dwgOutFieldsData (AcDbDwgFiler *pFiler) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) override
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const override
virtual Acad::ErrorStatus  | dxfOutFieldsData (AcDbDxfFiler *pFiler) const
 unsigned int  | index () const
 virtual bool  | isNull () const override
 bool  | operator< (const AcDbAssocIndexPersSubentId &other) const
 bool  | operator== (const AcDbAssocIndexPersSubentId &other) const
 void  | setIndex (unsigned int newIndex)
 void  | setSubentType (AcDb::SubentType subentType)
 virtual AcDb::SubentType  | subentType (const AcDbEntity *, AcDbDatabase *) const override
 Public Member Functions inherited from AcDbAssocPersSubentId
ACRX_DECLARE_MEMBERS (AcDbAssocPersSubentId)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSource) override
virtual Acad::ErrorStatus  | getTransientSubentIds (const AcDbEntity *pEntity, AcDbDatabase *pDatabase, AcArray< AcDbSubentId > &subents) const
virtual bool  | isEqualTo (const AcDbEntity *pEntity, AcDbDatabase *pDatabase, const AcDbAssocPersSubentId *pOther) const
virtual Acad::ErrorStatus  | mirror (const AcDbEntity *pMirroredEntity, AcDbDatabase *pDatabase)
virtual Acad::ErrorStatus  | release (AcDbEntity *pEntity, AcDbDatabase *pDatabase) const
virtual int  | transientSubentCount (const AcDbEntity *pEntity, AcDbDatabase *pDatabase) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Attributes
 unsigned int  | mIndex
 AcDb::SubentType  | mSubentType
 Friends
 void  | roundTripReadViaAcDbAssocSimplePersSubentId (AcDbAssocPersSubentId *&)
 Additional Inherited Members
 Static Public Member Functions inherited from AcDbAssocPersSubentId
static Acad::ErrorStatus  | createObjectAndDwgInFields (AcDbDatabase *pDatabase, AcDbDwgFiler *pFiler, AcDbAssocPersSubentId *&pCreatedPersSubentId)
static Acad::ErrorStatus  | createObjectAndDxfInFields (AcDbDxfFiler *pFiler, AcDbAssocPersSubentId *&pCreatedPersSubentId)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbAssocIndexPersSubentId::AcDbAssocIndexPersSubentId  |  ( |  AcDb::SubentType  |  subentType = AcDb::kNullSubentType,
|  unsigned int  |  index = 0
)
explicit
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbAssocIndexPersSubentId::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
Reimplemented in AcDbAssocObjectAndIndexPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocIndexPersSubentId::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
Reimplemented in AcDbAssocObjectAndIndexPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocIndexPersSubentId::dwgOutFieldsData  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
Reimplemented in AcDbAssocObjectAndIndexPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocIndexPersSubentId::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
Reimplemented in AcDbAssocObjectAndIndexPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocIndexPersSubentId::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocPersSubentId.
Reimplemented in AcDbAssocObjectAndIndexPersSubentId.
 virtual Acad::ErrorStatus AcDbAssocIndexPersSubentId::dxfOutFieldsData  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
Reimplemented in AcDbAssocObjectAndIndexPersSubentId.
 The documentation for this class was generated from the following file:
AcDbAssocIndexPersSubentId.h