Classes | Public Types | Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
AcRxValueType Class Referenceabstract
AcRx Classes
  Inheritance diagram for AcRxValueType:
 Classes
struct  | Desc< AcCmColor >
struct  | Desc< AcDbBlkParamValueSetValuesArray >
struct  | Desc< AcDbBlockParamValueSet >
struct  | Desc< AcDbDate >
struct  | Desc< AcDbIntArray >
struct  | Desc< AcDbLoftOptions >
struct  | Desc< AcDbMText * >
struct  | Desc< AcDbSweepOptions >
struct  | Desc< AcDbTableCellBlockReference >
struct  | Desc< AcGeMatrix3d >
struct  | Desc< AcGiLightAttenuation >
struct  | Desc< AcGiMaterialColor >
struct  | Desc< AcGiMaterialMap >
struct  | Desc< AcGiPhotographicExposureParameters >
struct  | Desc< AcGiShadowParameters >
struct  | Desc< AcGiSkyParameters >
struct  | Desc< AcGiToneOperatorParameters >
struct  | Desc< AcStringArray >
struct  | Desc< AcUnderlayLayer >
struct  | Desc< const ACHAR * >
struct  | Desc< const char * >
struct  | Desc< DimFillColor >
 Public Types
enum  | StringFormat { kStringFormatGlobal = 0, kStringFormatCurrent = 1 }
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxValueType, ACBASE_PORT)
 const IAcRxEnumeration *  | enumeration () const
 bool  | equalTo (const void *a, const void *b) const
 bool  | isBlittable () const
 bool  | isEnum () const
 bool  | isReference () const
 const IAcRxNonBlittableType *  | nonBlittable () const
 bool  | operator!= (const AcRxValueType &rhs) const
 bool  | operator== (const AcRxValueType &rhs) const
 const IAcRxReferenceType *  | reference () const
 const IAcRxObjectValue *  | rxObjectValue () const
 unsigned int  | size () const
 int  | toString (const void *instance, ACHAR *buffer, size_t sizeInACHARs, StringFormat format) const
 Public Member Functions inherited from AcRxClass
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxClass, ACBASE_PORT)
 ACBASE_PORT AcRxObject *  | addX (AcRxClass *, AcRxObject *)
 ACBASE_PORT const ACHAR *  | appName () const
 ACBASE_PORT AppNameChangeFuncPtr  | appNameCallbackPtr () const
ACBASE_PORT const AcRxAttributeCollection &  | attributes () const
ACBASE_PORT AcRxAttributeCollection &  | attributes ()
 ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *) const override
 ACBASE_PORT AcRxObject *  | create ()
 ACBASE_PORT AcRxObject *  | delX (AcRxClass *)
ACBASE_PORT const AcRxSet *  | descendants () const
 ACBASE_PORT const ACHAR *  | dxfName () const
 ACBASE_PORT void  | getClassVersion (int &dwgVer, int &maintVer) const
 ACBASE_PORT AcRxObject *  | getX (const AcRxClass *)
 bool  | isDerivedFrom (const AcRxClass *) const
ACBASE_PORT AcRxMemberCollection *  | members () const
 ACBASE_PORT AcRxClass *  | myParent () const
 ACBASE_PORT const ACHAR *  | name () const
 ACBASE_PORT int  | proxyFlags () const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static ACBASE_PORT void  | badCast ()
 Static Public Member Functions inherited from AcRxClass
 static ACBASE_PORT bool  | isDerivedFrom (const AcRxClass *pDerived, const AcRxClass *pBase)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const ACHAR *parent, const IAcRxNonBlittableType &nonBlittable, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const IAcRxNonBlittableType &pNonBlittable, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const IAcRxEnumeration &pEnum, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const IAcRxEnumeration &pEnum, const IAcRxNonBlittableType &pNonBlittable, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const IAcRxEnumeration *pEnum, const IAcRxNonBlittableType *pNonBlittable, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const IAcRxReferenceType &pRef, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
ACBASE_PORT  | AcRxValueType (const ACHAR *name, const IAcRxObjectValue &rxObjValue, const IAcRxNonBlittableType &pNonBlittable, unsigned int size, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData=NULL)
 Protected Member Functions inherited from AcRxClass
AcRxClass (const ACHAR *name, const ACHAR *parent, AcRxMemberCollectionConstructorPtr memberConstruct, void *userData)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 ACBASE_PORT AcRxValueType::AcRxValueType  |  ( |  const ACHAR *  |  name,
|  const ACHAR *  |  parent,
|  const IAcRxNonBlittableType &  |  nonBlittable,
|  unsigned int  |  size,
|  AcRxMemberCollectionConstructorPtr  |  memberConstruct,
|  void *  |  userData = NULL
)
protected
Warning
Not implemented!
 ACBASE_PORT AcRxValueType::AcRxValueType  |  ( |  const ACHAR *  |  name,
|  unsigned int  |  size,
|  AcRxMemberCollectionConstructorPtr  |  memberConstruct,
|  void *  |  userData = NULL
)
protected
Warning
Not implemented!
 ACBASE_PORT AcRxValueType::AcRxValueType  |  ( |  const ACHAR *  |  name,
|  const IAcRxNonBlittableType &  |  pNonBlittable,
|  unsigned int  |  size,
|  AcRxMemberCollectionConstructorPtr  |  memberConstruct,
|  void *  |  userData = NULL
)
protected
Warning
Not implemented!
 ACBASE_PORT AcRxValueType::AcRxValueType  |  ( |  const ACHAR *  |  name,
|  const IAcRxEnumeration &  |  pEnum,
|  unsigned int  |  size,
|  AcRxMemberCollectionConstructorPtr  |  memberConstruct,
|  void *  |  userData = NULL
)
protected
Warning
Not implemented!
 ACBASE_PORT AcRxValueType::AcRxValueType  |  ( |  const ACHAR *  |  name,
|  const IAcRxEnumeration &  |  pEnum,
|  const IAcRxNonBlittableType &  |  pNonBlittable,
|  unsigned int  |  size,
|  AcRxMemberCollectionConstructorPtr  |  memberConstruct,
|  void *  |  userData = NULL
)
protected
Warning
Not implemented!
 ACBASE_PORT AcRxValueType::AcRxValueType  |  ( |  const ACHAR *  |  name,
|  const IAcRxEnumeration *  |  pEnum,
|  const IAcRxNonBlittableType *  |  pNonBlittable,
|  unsigned int  |  size,
|  AcRxMemberCollectionConstructorPtr  |  memberConstruct,
|  void *  |  userData = NULL
)
protected
Warning
Not implemented!
 ACBASE_PORT AcRxValueType::AcRxValueType  |  ( |  const ACHAR *  |  name,
|  const IAcRxReferenceType &  |  pRef,
|  unsigned int  |  size,
|  AcRxMemberCollectionConstructorPtr  |  memberConstruct,
|  void *  |  userData = NULL
)
protected
Warning
Not implemented!
 ACBASE_PORT AcRxValueType::AcRxValueType  |  ( |  const ACHAR *  |  name,
|  const IAcRxObjectValue &  |  rxObjValue,
|  const IAcRxNonBlittableType &  |  pNonBlittable,
|  unsigned int  |  size,
|  AcRxMemberCollectionConstructorPtr  |  memberConstruct,
|  void *  |  userData = NULL
)
protected
Warning
Not implemented!
Member Function Documentation
 static ACBASE_PORT void AcRxValueType::badCast  |  ( |   | )
static
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxvaluetype.h