Public Types | Public Member Functions | Static Public Member Functions | List of all members
AcDbAssoc2dConstraintGroup Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssoc2dConstraintGroup:
 Public Types
enum  | SolutionStatus {
 kWellDefined = 0, kUnderConstrained, kOverConstrained, kInconsistent,
 kNotEvaluated, kNotAvailable, kRejectedByClient
 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Public Member Functions
AcDbAssoc2dConstraintGroup (const AcGePlane &plane=AcGePlane::kXYPlane)
ACRX_DECLARE_MEMBERS (AcDbAssoc2dConstraintGroup)
Acad::ErrorStatus  | add3PointAngleConstraint (AcConstrainedPoint *pConsPoint1, AcConstrainedPoint *pConsPoint2, AcConstrainedPoint *pConsPoint3, AcAngleConstraint::SectorType sectorType, AcDbObjectId valueDependencyId, AcDbObjectId dimDependencyId, Ac3PointAngleConstraint **ppNewAngConstraint=NULL)
Acad::ErrorStatus  | addAngleConstraint (AcConstrainedLine *pConsLine1, AcConstrainedLine *pConsLine2, AcAngleConstraint::SectorType sectorType, AcDbObjectId valueDependencyId, AcDbObjectId dimDependencyId, AcAngleConstraint **ppNewAngConstraint=NULL)
Acad::ErrorStatus  | addConstrainedGeometry (const AcDbFullSubentPath &subentPath, AcConstrainedGeometry *&pConsGeom)
Acad::ErrorStatus  | addDistanceConstraint (AcConstrainedGeometry *pConsGeom1, AcConstrainedGeometry *pConsGeom2, AcDistanceConstraint::DirectionType directionType, AcDbObjectId valueDependencyId, AcDbObjectId dimDependencyId, const AcGeVector3d *pFixedDirection=NULL, const AcConstrainedLine *pDirectionLine=NULL, AcDistanceConstraint **ppNewDisConstraint=NULL)
Acad::ErrorStatus  | addGeometricalConstraint (AcGeomConstraint::GeomConstraintType type, const AcDbFullSubentPathArray &aPaths, AcGeomConstraint **ppNewConstraint=NULL, const AcGeMatrix3d *pUCSCoord=NULL)
Acad::ErrorStatus  | addGeometricalConstraint (AcGeomConstraint::GeomConstraintType type, const AcArray< AcConstrainedGeometry * > &apConsGeoms, AcGeomConstraint **ppNewConstraint=NULL, const AcGeMatrix3d *pUCSCoord=NULL)
Acad::ErrorStatus  | addRadiusDiameterConstraint (AcConstrainedGeometry *pConsGeom, AcRadiusDiameterConstraint::RadiusDiameterConstrType type, AcDbObjectId valueDependencyId, AcDbObjectId dimDependencyId, AcRadiusDiameterConstraint **ppNewRadDiaConstraint=NULL)
Acad::ErrorStatus  | autoConstrain (const AcDbFullSubentPathArray &aPaths, const AcGeTol &tol, AcAutoConstrainEvaluationCallback *pCallback)
SolutionStatus  | constraintStatus (const AcGeomConstraint *pConstraint) const
Acad::ErrorStatus  | deleteConstrainedGeometry (const AcDbObjectId &geomDependencyId)
Acad::ErrorStatus  | deleteConstraint (AcGeomConstraint *pGeomConst)
Acad::ErrorStatus  | geometryMirrored (AcDbAssocGeomDependency *pGeomDependency)
SolutionStatus  | geometryStatus (const AcConstrainedGeometry *pConsGeom) const
Acad::ErrorStatus  | getAllConnectedGeomDependencies (const AcDbObjectIdArray &srcGeomDependencyIds, AcDbObjectIdArray &allConnectedGeomDependencyIds) const
Acad::ErrorStatus  | getConstrainedGeometries (AcArray< AcConstrainedGeometry * > &aConstGeom) const
Acad::ErrorStatus  | getConstrainedGeometry (const AcDbFullSubentPath &fullSubentPath, AcConstrainedGeometry *&pConsGeom, bool bCreateArcLineMid=false)
Acad::ErrorStatus  | getConstrainedGeometry (const AcDbAssocGeomDependency *pGeomDependency, AcConstrainedGeometry *&pConsGeom, AcDb::ImplicitPointType *pPtType=NULL, int defPtIndex=-1, bool bCreateArcLineMid=false)
Acad::ErrorStatus  | getConstraints (AcArray< AcGeomConstraint * > &apConstraints) const
int  | getDOF ()
AcConstraintGroupNode *  | getGroupNodePtr (const AcGraphNode::Id nodeId) const
const AcGePlane  | getWorkPlane () const
void  | regenDimensionSystem ()
void  | setWorkPlane (const AcGePlane &newPlane)
SolutionStatus  | solutionStatus (bool bAlsoCheckForConstraints=true) const
Acad::ErrorStatus  | transformActionBy (const AcGeMatrix3d &transform)
 Public Member Functions inherited from AcDbAssocAction
AcDbAssocAction (AcDbAssocCreateImpObject createImpObject=kAcDbAssocCreateImpObject)
ACRX_DECLARE_MEMBERS (AcDbAssocAction)
AcDbObjectId  | actionBody () const
Acad::ErrorStatus  | addDependency (const AcDbObjectId &dependencyId, bool setThisActionAsOwningAction=true)
Acad::ErrorStatus  | addDependency (AcRxClass *pDependencyClass, AcRxClass *pDependencyBodyClass, bool isReadDep, bool isWriteDep, int order, AcDbObjectId &dependencyId)
Acad::ErrorStatus  | addMoreObjectsToDeepClone (AcDbIdMapping &idMap, AcDbObjectIdArray &additionalObjectsToClone) const
Acad::ErrorStatus  | addParam (const AcDbObjectId &paramId, int &paramIndex)
Acad::ErrorStatus  | addParam (const AcString &paramName, AcRxClass *pParamClass, AcDbObjectId &paramId, int &paramIndex)
bool  | areDependenciesEqual (const AcDbAssocDependency *pDependency1, const AcDbAssocDependency *pDependency2) const
bool  | areDependenciesOnTheSameThing (const AcDbAssocDependency *pDependency1, const AcDbAssocDependency *pDependency2) const
AcDbAssocEvaluationCallback *  | currentEvaluationCallback () const
void  | dependentObjectCloned (const AcDbAssocDependency *pDependency, const AcDbObject *pDbObj, const AcDbObject *pNewObj)
void  | dragStatus (const AcDb::DragStat status)
void  | evaluate (AcDbAssocEvaluationCallback *pEvaluationCallback)
Acad::ErrorStatus  | evaluateDependencies ()
void  | evaluateDependency (AcDbAssocDependency *pDependency)
AcDbAssocEvaluationPriority  | evaluationPriority () const
Acad::ErrorStatus  | getDependencies (bool readDependenciesWanted, bool writeDependenciesWanted, AcDbObjectIdArray &dependencyIds) const
void  | getDependentActionsToEvaluate (AcDbActionsToEvaluateCallback *pActionsToEvaluateCallback) const
Acad::ErrorStatus  | getDependentObjects (bool readDependenciesWanted, bool writeDependenciesWanted, AcDbObjectIdArray &objectIds) const
Acad::ErrorStatus  | getValueParam (const AcString &paramName, AcDbEvalVariant &value, AcString &expression, AcString &evaluatorId, int valueIndex=0) const
Acad::ErrorStatus  | getValueParamArray (const AcString &paramName, AcArray< AcDbEvalVariant > &values, AcArray< AcString > &expressions, AcArray< AcString > &evaluatorIds) const
bool  | hasDependencyCachedValue (const AcDbAssocDependency *pDependency) const
bool  | isActionBodyAProxy () const
bool  | isActionEvaluationInProgress () const
bool  | isEqualTo (const AcDbAssocAction *pOtherAction) const
bool  | isExternalDependency (const AcDbAssocDependency *pDependency) const
bool  | isOwnedDependency (const AcDbAssocDependency *pDependency) const
bool  | isRelevantDependencyChange (const AcDbAssocDependency *pDependency) const
Acad::ErrorStatus  | notification (AcDbAssocNotificationData *pNotifData)
AcDbObjectId  | objectThatOwnsNetworkInstance () const
Acad::ErrorStatus  | ownedDependencyStatusChanged (AcDbAssocDependency *pOwnedDependency, AcDbAssocStatus previousStatus)
const AcDbObjectIdArray &  | ownedParams () const
void  | ownedValueParamNames (AcArray< AcString > &paramNames) const
AcDbObjectId  | owningNetwork () const
AcDbObjectId  | paramAtIndex (int paramIndex) const
AcDbObjectId  | paramAtName (const AcString &paramName, int index=0) const
int  | paramCount () const
const AcDbObjectIdArray &  | paramsAtName (const AcString &paramName) const
Acad::ErrorStatus  | postProcessAfterDeepClone (AcDbIdMapping &idMap)
Acad::ErrorStatus  | postProcessAfterDeepCloneCancel (AcDbIdMapping &idMap)
Acad::ErrorStatus  | removeAllDependencies (bool alsoEraseThem)
Acad::ErrorStatus  | removeAllParams (bool alsoEraseThem)
Acad::ErrorStatus  | removeDependency (const AcDbObjectId &dependencyId, bool alsoEraseIt)
Acad::ErrorStatus  | removeParam (const AcDbObjectId &paramId, bool alsoEraseIt)
Acad::ErrorStatus  | removeValueParam (const AcString &paramName)
Acad::ErrorStatus  | scaleAllDistanceValueParams (double scaleFactor)
Acad::ErrorStatus  | setActionBody (const AcDbObjectId &actionBodyId)
Acad::ErrorStatus  | setOwningNetwork (const AcDbObjectId &networkId, bool alsoSetAsDatabaseOwner)
Acad::ErrorStatus  | setStatus (AcDbAssocStatus newStatus, bool notifyOwningNetwork=true, bool setInOwnedActions=false)
Acad::ErrorStatus  | setValueParam (const AcString &paramName, const AcDbEvalVariant &value, const AcString &expression, const AcString &evaluatorId, AcString &errorMessage, bool silentMode, int valueIndex=0)
Acad::ErrorStatus  | setValueParamArray (const AcString &paramName, const AcArray< AcDbEvalVariant > &values, const AcArray< AcString > &expressions, const AcArray< AcString > &evaluatorIds, AcArray< AcString > &errorMessages, bool silentMode)
Acad::ErrorStatus  | setValueParamControlledObjectDep (const AcString &paramName, const AcDbObjectId &controlledObjectDepId)
Acad::ErrorStatus  | setValueParamUnitType (const AcString &paramName, AcValue::UnitType unitType)
AcDbAssocStatus  | status () const
Acad::ErrorStatus  | transformActionBy (const AcGeMatrix3d &transform)
Acad::ErrorStatus  | transformAllConstantGeometryParams (const AcGeMatrix3d &transform)
Acad::ErrorStatus  | updateAllObjectsControlledByValueParams () const
Acad::ErrorStatus  | updateValueParamControlledObject (const AcString &paramName) const
Acad::ErrorStatus  | updateValueParamFromControlledObject (const AcString &paramName)
Acad::ErrorStatus  | valueParamInputVariables (const AcString &paramName, AcDbObjectIdArray &variableIds) const
AcValue::UnitType  | valueParamUnitType (const AcString &paramName) const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static void  | addGlobalCallback (class AcDbAssoc2dConstraintCallback *pCallback)
static bool  | doNotCheckNewlyAddedConstraints ()
static class AcDbAssoc2dConstraintCallback *  | globalCallback ()
static void  | removeGlobalCallback (class AcDbAssoc2dConstraintCallback *pCallback)
static void  | setDoNotCheckNewlyAddedConstraints (bool doNotCheck)
 Static Public Member Functions inherited from AcDbAssocAction
static AcDbObjectId  | actionBody (const AcDbObjectId &actionId)
static bool  | doesObjectHaveActiveActions (const AcDbObject *pObject)
static Acad::ErrorStatus  | getActionsDependentOnObject (const AcDbObject *pObject, bool readDependenciesWanted, bool writeDependenciesWanted, AcDbObjectIdArray &actionIds)
static Acad::ErrorStatus  | markDependentActionsToEvaluate (const AcDbObjectId &actionId)
static Acad::ErrorStatus  | removeActionsControllingObject (const AcDbObjectId &objectToRemoveActionsFrom, int readOnlyDependencyHandling=0, const AcDbObjectId &objectToRedirectReadOnlyDependenciesTo=AcDbObjectId::kNull)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Additional Inherited Members
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbAssoc2dConstraintGroup::AcDbAssoc2dConstraintGroup  |  ( |  const AcGePlane &  |  plane = AcGePlane::kXYPlane | )
Warning
Not implemented!
Member Function Documentation
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::add3PointAngleConstraint  |  ( |  AcConstrainedPoint *  |  pConsPoint1,
|  AcConstrainedPoint *  |  pConsPoint2,
|  AcConstrainedPoint *  |  pConsPoint3,
|  AcAngleConstraint::SectorType  |  sectorType,
|  AcDbObjectId  |  valueDependencyId,
|  AcDbObjectId  |  dimDependencyId,
|  Ac3PointAngleConstraint **  |  ppNewAngConstraint = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::addAngleConstraint  |  ( |  AcConstrainedLine *  |  pConsLine1,
|  AcConstrainedLine *  |  pConsLine2,
|  AcAngleConstraint::SectorType  |  sectorType,
|  AcDbObjectId  |  valueDependencyId,
|  AcDbObjectId  |  dimDependencyId,
|  AcAngleConstraint **  |  ppNewAngConstraint = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::addConstrainedGeometry  |  ( |  const AcDbFullSubentPath &  |  subentPath,
|  AcConstrainedGeometry *&  |  pConsGeom
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::addDistanceConstraint  |  ( |  AcConstrainedGeometry *  |  pConsGeom1,
|  AcConstrainedGeometry *  |  pConsGeom2,
|  AcDistanceConstraint::DirectionType  |  directionType,
|  AcDbObjectId  |  valueDependencyId,
|  AcDbObjectId  |  dimDependencyId,
|  const AcGeVector3d *  |  pFixedDirection = NULL,
|  const AcConstrainedLine *  |  pDirectionLine = NULL,
|  AcDistanceConstraint **  |  ppNewDisConstraint = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::addGeometricalConstraint  |  ( |  AcGeomConstraint::GeomConstraintType  |  type,
|  const AcDbFullSubentPathArray &  |  aPaths,
|  AcGeomConstraint **  |  ppNewConstraint = NULL,
|  const AcGeMatrix3d *  |  pUCSCoord = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::addGeometricalConstraint  |  ( |  AcGeomConstraint::GeomConstraintType  |  type,
|  const AcArray< AcConstrainedGeometry * > &  |  apConsGeoms,
|  AcGeomConstraint **  |  ppNewConstraint = NULL,
|  const AcGeMatrix3d *  |  pUCSCoord = NULL
)
Warning
Not implemented!
 static void AcDbAssoc2dConstraintGroup::addGlobalCallback  |  ( |  class AcDbAssoc2dConstraintCallback *  |  pCallback | )
static
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::addRadiusDiameterConstraint  |  ( |  AcConstrainedGeometry *  |  pConsGeom,
|  AcRadiusDiameterConstraint::RadiusDiameterConstrType  |  type,
|  AcDbObjectId  |  valueDependencyId,
|  AcDbObjectId  |  dimDependencyId,
|  AcRadiusDiameterConstraint **  |  ppNewRadDiaConstraint = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::autoConstrain  |  ( |  const AcDbFullSubentPathArray &  |  aPaths,
|  const AcGeTol &  |  tol,
|  AcAutoConstrainEvaluationCallback *  |  pCallback
)
Warning
Not implemented!
 SolutionStatus AcDbAssoc2dConstraintGroup::constraintStatus  |  ( |  const AcGeomConstraint *  |  pConstraint | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::deleteConstrainedGeometry  |  ( |  const AcDbObjectId &  |  geomDependencyId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::deleteConstraint  |  ( |  AcGeomConstraint *  |  pGeomConst | )
Warning
Not implemented!
 static bool AcDbAssoc2dConstraintGroup::doNotCheckNewlyAddedConstraints  |  ( |   | )
static
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::geometryMirrored  |  ( |  AcDbAssocGeomDependency *  |  pGeomDependency | )
Warning
Not implemented!
 SolutionStatus AcDbAssoc2dConstraintGroup::geometryStatus  |  ( |  const AcConstrainedGeometry *  |  pConsGeom | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::getAllConnectedGeomDependencies  |  ( |  const AcDbObjectIdArray &  |  srcGeomDependencyIds,
|  AcDbObjectIdArray &  |  allConnectedGeomDependencyIds
) |   |  const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::getConstrainedGeometries  |  ( |  AcArray< AcConstrainedGeometry * > &  |  aConstGeom | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::getConstrainedGeometry  |  ( |  const AcDbFullSubentPath &  |  fullSubentPath,
|  AcConstrainedGeometry *&  |  pConsGeom,
|  bool  |  bCreateArcLineMid = false
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::getConstrainedGeometry  |  ( |  const AcDbAssocGeomDependency *  |  pGeomDependency,
|  AcConstrainedGeometry *&  |  pConsGeom,
|  AcDb::ImplicitPointType *  |  pPtType = NULL,
|  int  |  defPtIndex = -1,
|  bool  |  bCreateArcLineMid = false
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::getConstraints  |  ( |  AcArray< AcGeomConstraint * > &  |  apConstraints | ) |   const
Warning
Not implemented!
 int AcDbAssoc2dConstraintGroup::getDOF  |  ( |   | )
Warning
Not implemented!
 AcConstraintGroupNode* AcDbAssoc2dConstraintGroup::getGroupNodePtr  |  ( |  const AcGraphNode::Id  |  nodeId | ) |   const
Warning
Not implemented!
 const AcGePlane AcDbAssoc2dConstraintGroup::getWorkPlane  |  ( |   | ) |   const
Warning
Not implemented!
 static class AcDbAssoc2dConstraintCallback* AcDbAssoc2dConstraintGroup::globalCallback  |  ( |   | )
static
Warning
Not implemented!
 void AcDbAssoc2dConstraintGroup::regenDimensionSystem  |  ( |   | )
Warning
Not implemented!
 static void AcDbAssoc2dConstraintGroup::removeGlobalCallback  |  ( |  class AcDbAssoc2dConstraintCallback *  |  pCallback | )
static
Warning
Not implemented!
 static void AcDbAssoc2dConstraintGroup::setDoNotCheckNewlyAddedConstraints  |  ( |  bool  |  doNotCheck | )
static
Warning
Not implemented!
 void AcDbAssoc2dConstraintGroup::setWorkPlane  |  ( |  const AcGePlane &  |  newPlane | )
Warning
Not implemented!
 SolutionStatus AcDbAssoc2dConstraintGroup::solutionStatus  |  ( |  bool  |  bAlsoCheckForConstraints = true | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssoc2dConstraintGroup::transformActionBy  |  ( |  const AcGeMatrix3d &  |  transform | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssoc2dConstraintGroup.h