Public Member Functions | Friends | List of all members
AcGiMarbleTexture Class Reference
AcGi Classes
  Inheritance diagram for AcGiMarbleTexture:
 Public Member Functions
AcGiMarbleTexture (const AcGiMarbleTexture &texture)
ACRX_DECLARE_MEMBERS (AcGiMarbleTexture)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other) override
 AcGiMarbleTexture &  | operator= (const AcGiMarbleTexture &texture)
 virtual bool  | operator== (const AcGiMaterialTexture &texture) const override
 virtual void  | setStoneColor (const AcGiMaterialColor &stoneColor)
 virtual void  | setVeinColor (const AcGiMaterialColor &veinColor)
 virtual void  | setVeinSpacing (double veinSpacing)
 virtual void  | setVeinWidth (double veinWidth)
 virtual const AcGiMaterialColor &  | stoneColor (void) const
 virtual const AcGiMaterialColor &  | veinColor (void) const
 virtual double  | veinSpacing (void) const
 virtual double  | veinWidth (void) const
 Public Member Functions inherited from AcGiProceduralTexture
ACRX_DECLARE_MEMBERS (AcGiProceduralTexture)
 Public Member Functions inherited from AcGiMaterialTexture
ACRX_DECLARE_MEMBERS (AcGiMaterialTexture)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcGiImpMarbleTexture
 Additional Inherited Members
 Public Types inherited from AcGiProceduralTexture
enum  | Type { kWood = 0, kMarble, kGeneric }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgimaterial.h