Public Member Functions | List of all members
AcDbAssocPersSubentIdPE Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocPersSubentIdPE:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbAssocPersSubentIdPE)
 virtual AcDbAssocPersSubentId *  | createNewPersFaceSilhouetteId (AcDbEntity *pEntity, AcDbDatabase *pDatabase, AcRxObject *pContext, const AcDbCompoundObjectId &, const AcDbSubentId &faceSubentId, const AcGeMatrix3d *pEntityTransform, class AcDbGeometryProjector *pGeometryProjector, int transientSilhId)
 virtual AcDbAssocPersSubentId *  | createNewPersSubent (AcDbEntity *pEntity, AcDbDatabase *pDatabase, const AcDbCompoundObjectId &, const AcDbSubentId &subentId)
virtual Acad::ErrorStatus  | getAllSubentities (const AcDbEntity *pEntity, AcDb::SubentType subentType, AcArray< AcDbSubentId > &allSubentIds)
virtual Acad::ErrorStatus  | getAllSubentities (const AcDbEntity *pEntity, const AcRxClass *pSubentClass, AcArray< AcDbSubentId > &allSubentIds)
virtual Acad::ErrorStatus  | getEdgeSubentityGeometry (const AcDbEntity *pEntity, const AcDbSubentId &edgeSubentId, AcGeCurve3d *&pEdgeCurve)
virtual Acad::ErrorStatus  | getEdgeVertexSubentities (const AcDbEntity *pEntity, const AcDbSubentId &edgeSubentId, AcDbSubentId &startVertexSubentId, AcDbSubentId &endVertexSubentId, AcArray< AcDbSubentId > &otherVertexSubentIds)
virtual Acad::ErrorStatus  | getFaceSilhouetteGeometry (AcDbEntity *pEntity, AcRxObject *pContext, const AcDbSubentId &faceSubentId, const AcGeMatrix3d *pEntityTransform, class AcDbGeometryProjector *pGeometryProjector, AcArray< int > &transientSilhIds, AcArray< AcGeCurve3d * > &silhCurves)
virtual Acad::ErrorStatus  | getFaceSubentityGeometry (const AcDbEntity *pEntity, const AcDbSubentId &faceSubentId, AcGeSurface *&pFaceSurface)
 virtual int  | getRigidSetState (const AcDbEntity *pEntity)
 virtual Acad::ErrorStatus  | getRigidSetTransform (const AcDbEntity *pEntity, AcGeMatrix3d &trans)
virtual Acad::ErrorStatus  | getSplineEdgeVertexSubentities (const AcDbEntity *pEntity, const AcDbSubentId &edgeSubentId, AcDbSubentId &startVertexSubentId, AcDbSubentId &endVertexSubentId, AcArray< AcDbSubentId > &controlPointSubentIds, AcArray< AcDbSubentId > &fitPointSubentIds)
 virtual Acad::ErrorStatus  | getSubentGeometryXform (const AcDbEntity *pEntity, const AcDbObjectIdArray &fullSubentPath, AcGeMatrix3d &trans) const
virtual Acad::ErrorStatus  | getSubentityGeometry (const AcDbEntity *pEntity, const AcDbSubentId &subentId, AcGeEntity3d *&pSubentityGeometry)
virtual Acad::ErrorStatus  | getTransientFaceSilhouetteIds (AcDbEntity *pEntity, AcDbDatabase *pDatabase, AcRxObject *pContext, const AcDbSubentId &faceSubentId, const AcGeMatrix3d *pEntityTransform, class AcDbGeometryProjector *pGeometryProjector, const AcDbAssocPersSubentId *pPersSilhId, AcArray< int > &transientSilhIds)
virtual Acad::ErrorStatus  | getTransientSubentIds (const AcDbEntity *pEntity, AcDbDatabase *pDatabase, const AcDbAssocPersSubentId *pPersSubentId, AcArray< AcDbSubentId > &subents) const
virtual Acad::ErrorStatus  | getVertexSubentityGeometry (const AcDbEntity *pEntity, const AcDbSubentId &vertexSubentId, AcGePoint3d &vertexPosition)
 virtual Acad::ErrorStatus  | makePersSubentPurgeable (AcDbEntity *pEntity, AcDbDatabase *pDatabase, const AcDbAssocPersSubentId *pPerSubentId, bool yesNo)
 virtual Acad::ErrorStatus  | mirrorPersSubent (const AcDbEntity *pMirroredEntity, AcDbDatabase *pDatabase, AcDbAssocPersSubentId *pPersSubentIdToMirror)
 virtual Acad::ErrorStatus  | releasePersSubent (AcDbEntity *pEntity, AcDbDatabase *pDatabase, const AcDbAssocPersSubentId *pPerSubentId)
virtual Acad::ErrorStatus  | setEdgeSubentityGeometry (AcDbEntity *pEntity, const AcDbSubentId &edgeSubentId, const AcGeCurve3d *pNewEdgeCurve)
virtual Acad::ErrorStatus  | setFaceSubentityGeometry (AcDbEntity *pEntity, const AcDbSubentId &faceSubentId, const AcGeSurface *pNewFaceSurface)
 virtual Acad::ErrorStatus  | setRigidSetTransform (AcDbEntity *pEntity, const AcGeMatrix3d &trans)
virtual Acad::ErrorStatus  | setSubentityGeometry (AcDbEntity *pEntity, const AcDbSubentId &subentId, const AcGeEntity3d *pNewSubentityGeometry)
virtual Acad::ErrorStatus  | setVertexSubentityGeometry (AcDbEntity *pEntity, const AcDbSubentId &vertexSubentId, const AcGePoint3d &newVertexPosition)
 virtual Acad::ErrorStatus  | transferPersSubentToAnotherEntity (AcDbEntity *pToEntity, AcDbDatabase *pToDatabase, AcDbEntity *pFromEntity, AcDbDatabase *pFromDatabase, const AcDbAssocPersSubentId *pPersSubentId)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::getAllSubentities  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDb::SubentType  |  subentType,
|  AcArray< AcDbSubentId > &  |  allSubentIds
)
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::getAllSubentities  |  ( |  const AcDbEntity *  |  pEntity,
|  const AcRxClass *  |  pSubentClass,
|  AcArray< AcDbSubentId > &  |  allSubentIds
)
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::getEdgeSubentityGeometry  |  ( |  const AcDbEntity *  |  pEntity,
|  const AcDbSubentId &  |  edgeSubentId,
|  AcGeCurve3d *&  |  pEdgeCurve
)
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::getEdgeVertexSubentities  |  ( |  const AcDbEntity *  |  pEntity,
|  const AcDbSubentId &  |  edgeSubentId,
|  AcDbSubentId &  |  startVertexSubentId,
|  AcDbSubentId &  |  endVertexSubentId,
|  AcArray< AcDbSubentId > &  |  otherVertexSubentIds
)
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::getFaceSilhouetteGeometry  |  ( |  AcDbEntity *  |  pEntity,
|  AcRxObject *  |  pContext,
|  const AcDbSubentId &  |  faceSubentId,
|  const AcGeMatrix3d *  |  pEntityTransform,
|  class AcDbGeometryProjector *  |  pGeometryProjector,
|  AcArray< int > &  |  transientSilhIds,
|  AcArray< AcGeCurve3d * > &  |  silhCurves
)
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::getFaceSubentityGeometry  |  ( |  const AcDbEntity *  |  pEntity,
|  const AcDbSubentId &  |  faceSubentId,
|  AcGeSurface *&  |  pFaceSurface
)
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::getSplineEdgeVertexSubentities  |  ( |  const AcDbEntity *  |  pEntity,
|  const AcDbSubentId &  |  edgeSubentId,
|  AcDbSubentId &  |  startVertexSubentId,
|  AcDbSubentId &  |  endVertexSubentId,
|  AcArray< AcDbSubentId > &  |  controlPointSubentIds,
|  AcArray< AcDbSubentId > &  |  fitPointSubentIds
)
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::getSubentityGeometry  |  ( |  const AcDbEntity *  |  pEntity,
|  const AcDbSubentId &  |  subentId,
|  AcGeEntity3d *&  |  pSubentityGeometry
)
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::getTransientFaceSilhouetteIds  |  ( |  AcDbEntity *  |  pEntity,
|  AcDbDatabase *  |  pDatabase,
|  AcRxObject *  |  pContext,
|  const AcDbSubentId &  |  faceSubentId,
|  const AcGeMatrix3d *  |  pEntityTransform,
|  class AcDbGeometryProjector *  |  pGeometryProjector,
|  const AcDbAssocPersSubentId *  |  pPersSilhId,
|  AcArray< int > &  |  transientSilhIds
)
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::getTransientSubentIds  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDbDatabase *  |  pDatabase,
|  const AcDbAssocPersSubentId *  |  pPersSubentId,
|  AcArray< AcDbSubentId > &  |  subents
) |   |  const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::getVertexSubentityGeometry  |  ( |  const AcDbEntity *  |  pEntity,
|  const AcDbSubentId &  |  vertexSubentId,
|  AcGePoint3d &  |  vertexPosition
)
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::setEdgeSubentityGeometry  |  ( |  AcDbEntity *  |  pEntity,
|  const AcDbSubentId &  |  edgeSubentId,
|  const AcGeCurve3d *  |  pNewEdgeCurve
)
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::setFaceSubentityGeometry  |  ( |  AcDbEntity *  |  pEntity,
|  const AcDbSubentId &  |  faceSubentId,
|  const AcGeSurface *  |  pNewFaceSurface
)
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::setSubentityGeometry  |  ( |  AcDbEntity *  |  pEntity,
|  const AcDbSubentId &  |  subentId,
|  const AcGeEntity3d *  |  pNewSubentityGeometry
)
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentIdPE::setVertexSubentityGeometry  |  ( |  AcDbEntity *  |  pEntity,
|  const AcDbSubentId &  |  vertexSubentId,
|  const AcGePoint3d &  |  newVertexPosition
)
inlinevirtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocPersSubentIdPE.h