Public Member Functions | List of all members
OPMPropertyExtensionFactory Class Referenceabstract
OPM Classes
  Inheritance diagram for OPMPropertyExtensionFactory:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (OPMPropertyExtensionFactory, ACDB_PORT)
 virtual OPMPropertyExtension *  | CreateOPMCommandProtocol (const ACHAR *pGlobalCommand, LONG lReserved=0)=0
 virtual OPMPropertyExtension *  | CreateOPMObjectProtocol (AcRxClass *pClass, LONG lReserved=0)=0
 virtual BOOL  | GetOPMManager (const ACHAR *pGlobalCommand, IPropertyManager **pManager)=0
 virtual LONG  | GetPropertyClassArray (AcRxClass *pClass, IDynamicProperty **pPropertyArray)=0
 virtual LONG  | GetPropertyClassArray (AcRxClass *pClass, IUnknown **pPropertyArray)=0
 virtual BOOL  | GetPropertyCount (AcRxClass *pClass, LONG *pPropCount)=0
 virtual BOOL  | GetPropertyCountEx (AcRxClass *pClass, LONG *pPropCount)=0
virtual  | ~OPMPropertyExtensionFactory ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 virtual OPMPropertyExtensionFactory::~OPMPropertyExtensionFactory  |  ( |   | )
inlinevirtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dynprops.h