Public Member Functions | Protected Member Functions | List of all members
AcDbSubentRef Class Reference
AcDb Classes
  Inheritance diagram for AcDbSubentRef:
 Public Member Functions
AcDbSubentRef (const AcDbCompoundObjectId &, const AcDbSubentId &=kNullSubentId)
ACRX_DECLARE_MEMBERS (AcDbSubentRef)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *) override
virtual AcDbEntity *  | createEntity () const override
virtual const AcDbCompoundObjectId &  | entity () const
 virtual Acad::ErrorStatus  | evaluateAndCacheGeometry () override
 virtual bool  | isEmpty () const override
AcDbSubentRef &  | operator= (const AcDbSubentRef &)
virtual void  | reset () override
virtual AcDbSubentId  | subentId () const
 Public Member Functions inherited from AcDbGeomRef
ACRX_DECLARE_MEMBERS (AcDbGeomRef)
 virtual bool  | isValid () const =0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 void  | setEntity (const AcDbCompoundObjectId &entityId)
void  | setFromSubentPath (const AcDbFullSubentPath &)
 void  | setSubent (const AcDbSubentId &subentId)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcDbSubentRef::AcDbSubentRef  |  ( |  const AcDbCompoundObjectId &  |  ,
|  const AcDbSubentId &  |   = kNullSubentId
)
explicit
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbSubentRef::copyFrom  |  ( |  const AcRxObject *  |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcRxObject.
Reimplemented in AcDbVertexRef, AcDbEdgeRef, and AcDbFaceRef.
 virtual AcDbEntity* AcDbSubentRef::createEntity  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
Reimplemented in AcDbVertexRef, AcDbEdgeRef, and AcDbFaceRef.
 virtual const AcDbCompoundObjectId& AcDbSubentRef::entity  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented in AcDbVertexRef.
 AcDbSubentRef& AcDbSubentRef::operator=  |  ( |  const AcDbSubentRef &  |   | )
Warning
Not implemented!
 virtual void AcDbSubentRef::reset  |  ( |   | )
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
Reimplemented in AcDbVertexRef, AcDbEdgeRef, and AcDbFaceRef.
 void AcDbSubentRef::setFromSubentPath  |  ( |  const AcDbFullSubentPath &  |   | )
protected
Warning
Not implemented!
 virtual AcDbSubentId AcDbSubentRef::subentId  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented in AcDbVertexRef.
 The documentation for this class was generated from the following file:
AcDbGeomRef.h