Public Member Functions | Protected Attributes | List of all members
AcRxDbxApp Class Referenceabstract
AcRx Classes
  Inheritance diagram for AcRxDbxApp:
 Public Member Functions
 AcRx::AppRetCode  | acrxEntryPoint (AcRx::AppMsgCode msg, void *pkt)
HINSTANCE &  | GetModuleInstance ()
 virtual AcRx::AppRetCode  | On_kCfgMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kDependencyMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kEndDialogMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kEndMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kInitAppMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kInitDialogMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kInvkSubrMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kLoadDwgMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kNoDependencyMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kNullMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kOleUnloadAppMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kPreQuitMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kQuitMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kSaveMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kUnloadAppMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kUnloadDwgMsg (void *pkt)
 virtual void  | RegisterServerComponents ()=0
 Protected Attributes
 bool  | m_bMDIAware
 bool  | m_bUnlocked
 HINSTANCE  | m_hdllInstance
Member Function Documentation
 HINSTANCE& AcRxDbxApp::GetModuleInstance  |  ( |   | )
inline
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbxEntryPoint.h