Public Member Functions | List of all members
AcDbCustomOsnapMode Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbCustomOsnapMode:
 Public Member Functions
 virtual const AcRxClass *  | entityOsnapClass () const =0
 virtual const ACHAR *  | globalModeString () const =0
 virtual AcGiGlyph *  | glyph () const =0
 virtual const ACHAR *  | localModeString () const =0
 virtual const ACHAR *  | tooltipString () const =0
 The documentation for this class was generated from the following file:
dbosnap.h