Classes | Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | Protected Attributes | List of all members
AcCmEntityColor Class Reference
AcCm Classes
 Classes
union  | RGBM
 Public Types
enum  | ACIcolorMethod {
 kACIbyBlock = 0, kACIforeground = 7, kACIbyLayer = 256, kACIclear = 0,
 kACIstandard = 7, kACImaximum = 255, kACInone = 257, kACIminimum = -255,
 kACIfrozenLayer = -32700
 }
enum  | Color { kRed, kGreen, kBlue }
enum  | ColorMethod {
 kByLayer =0xC0, kByBlock, kByColor, kByACI,
 kByPen, kForeground, kLayerOff, kLayerFrozen,
 kNone
 }
 Public Member Functions
AcCmEntityColor (const AcCmEntityColor &color)
AcCmEntityColor (ColorMethod eColorMethod)
AcCmEntityColor (Adesk::UInt8 red, Adesk::UInt8 green, Adesk::UInt8 blue)
 Adesk::UInt8  | blue () const
 Adesk::UInt32  | color () const
 Adesk::Int16  | colorIndex () const
 ColorMethod  | colorMethod () const
 Adesk::UInt8  | green () const
 bool  | isByACI () const
 bool  | isByBlock () const
 bool  | isByColor () const
 bool  | isByLayer () const
 bool  | isByPen () const
 bool  | isForeground () const
 bool  | isLayerFrozen () const
 bool  | isLayerFrozenOrOff () const
 bool  | isLayerOff () const
 bool  | isNone () const
 Adesk::Int32  | layerIndex () const
 bool  | operator!= (const AcCmEntityColor &color) const
 AcCmEntityColor &  | operator= (const AcCmEntityColor &color)
 bool  | operator== (const AcCmEntityColor &color) const
 Adesk::UInt16  | penIndex () const
 Adesk::UInt8  | red () const
 Acad::ErrorStatus  | setBlue (Adesk::UInt8 blue)
 Acad::ErrorStatus  | setColor (Adesk::UInt32 color)
 Acad::ErrorStatus  | setColorIndex (Adesk::Int16 colorIndex)
 Acad::ErrorStatus  | setColorMethod (ColorMethod eColorMethod)
 Acad::ErrorStatus  | setGreen (Adesk::UInt8 green)
 Acad::ErrorStatus  | setLayerIndex (Adesk::Int32 layerIndex)
 Acad::ErrorStatus  | setPenIndex (Adesk::UInt16 penIndex)
 Acad::ErrorStatus  | setRed (Adesk::UInt8 red)
 Acad::ErrorStatus  | setRGB (Adesk::UInt8 red, Adesk::UInt8 green, Adesk::UInt8 blue)
 Acad::ErrorStatus  | setTrueColor ()
 Acad::ErrorStatus  | setTrueColorMethod ()
 Adesk::UInt32  | trueColor () const
 Adesk::UInt8  | trueColorMethod () const
 Static Public Member Functions
 static Adesk::UInt8  | blue (const RGBM *rgbm)
 static Adesk::UInt32  | color (const RGBM *rgbm)
 static Adesk::Int16  | colorIndex (const RGBM *rgbm)
 static ColorMethod  | colorMethod (const RGBM *rgbm)
 static Adesk::UInt8  | green (const RGBM *rgbm)
 static bool  | isByACI (const RGBM *rgbm)
 static bool  | isByBlock (const RGBM *rgbm)
 static bool  | isByColor (const RGBM *rgbm)
 static bool  | isByLayer (const RGBM *rgbm)
 static bool  | isByPen (const RGBM *rgbm)
 static bool  | isForeground (const RGBM *rgbm)
 static bool  | isLayerFrozen (const RGBM *rgbm)
 static bool  | isLayerOff (const RGBM *rgbm)
 static bool  | isNone (const RGBM *rgbm)
 static Adesk::Int32  | layerIndex (const RGBM *rgbm)
 static Adesk::UInt8  | lookUpACI (Adesk::UInt8 red, Adesk::UInt8 green, Adesk::UInt8 blue)
 static Adesk::UInt32  | lookUpRGB (Adesk::UInt8 colorIndex)
 static Adesk::UInt16  | penIndex (const RGBM *rgbm)
 static Adesk::UInt8  | red (const RGBM *rgbm)
 static Acad::ErrorStatus  | setBlue (RGBM *rgbm, Adesk::UInt8 blue)
 static Acad::ErrorStatus  | setColor (RGBM *rgbm, Adesk::UInt32 color)
 static ACDBCORE2D_PORT Acad::ErrorStatus  | setColorIndex (RGBM *rgbm, Adesk::Int16 colorIndex)
 static Acad::ErrorStatus  | setColorMethod (RGBM *rgbm, ColorMethod eColorMethod)
 static Acad::ErrorStatus  | setGreen (RGBM *rgbm, Adesk::UInt8 green)
 static ACDBCORE2D_PORT Acad::ErrorStatus  | setLayerIndex (RGBM *rgbm, Adesk::Int32 layerIndex)
 static ACDBCORE2D_PORT Acad::ErrorStatus  | setPenIndex (RGBM *rgbm, Adesk::UInt16 penIndex)
 static Acad::ErrorStatus  | setRed (RGBM *rgbm, Adesk::UInt8 red)
 static Acad::ErrorStatus  | setRGB (RGBM *rgbm, Adesk::UInt8 red, Adesk::UInt8 green, Adesk::UInt8 blue)
 static Acad::ErrorStatus  | setTrueColor (RGBM *rgbm)
 static Acad::ErrorStatus  | setTrueColorMethod (RGBM *rgbm)
 static Adesk::UInt32  | trueColor (const RGBM *rgbm)
 static ACDBCORE2D_PORT Adesk::UInt8  | trueColorMethod (Adesk::Int16)
 Static Public Attributes
 static const Adesk::UInt8  | mLUT [256][3]
 Protected Attributes
 RGBM  | mRGBM
 The documentation for this class was generated from the following file:
dbcolor.h