Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcDbTextEditorCursor Class Reference
AcDb Classes
  Inheritance diagram for AcDbTextEditorCursor:
 Public Member Functions
ACDBCORE2D_PORT AcDbTextEditorColumn *  | column ()
ACDBCORE2D_PORT AcDbTextEditorLocation *  | location () const
ACDBCORE2D_PORT AcDbTextEditorParagraph *  | paragraph ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setLocation (const AcDbTextEditorLocation &location)
 Public Member Functions inherited from AcDbTextEditorSelectionBase
ACDBCORE2D_PORT bool  | bold () const
ACDBCORE2D_PORT AcCmColor  | color () const
ACDBCORE2D_PORT FlowAlign  | flowAlign () const
ACDBCORE2D_PORT AcString  | font () const
ACDBCORE2D_PORT double  | height () const
ACDBCORE2D_PORT Acad::ErrorStatus  | inputSpecialChar (Adesk::UInt32 c)
ACDBCORE2D_PORT Acad::ErrorStatus  | insertColumnBreak ()
ACDBCORE2D_PORT Acad::ErrorStatus  | insertImportedText (InsertTextType insertType, void *pData)
ACDBCORE2D_PORT Acad::ErrorStatus  | insertString (const AcString &str)
ACDBCORE2D_PORT Acad::ErrorStatus  | insertSymbol (ACHAR wch, Charset charset)
ACDBCORE2D_PORT bool  | isTrueType () const
ACDBCORE2D_PORT bool  | italic () const
ACDBCORE2D_PORT Charset  | language () const
ACDBCORE2D_PORT double  | obliqueAngle () const
ACDBCORE2D_PORT bool  | overline () const
ACDBCORE2D_PORT Acad::ErrorStatus  | setColor (const AcCmColor &color)
ACDBCORE2D_PORT Acad::ErrorStatus  | setFlowAlign (FlowAlign flowAlign)
ACDBCORE2D_PORT Acad::ErrorStatus  | setFont (const AcString &fontname, bool bTrueType)
ACDBCORE2D_PORT Acad::ErrorStatus  | setHeight (double height)
ACDBCORE2D_PORT Acad::ErrorStatus  | setLanguage (Charset charset)
ACDBCORE2D_PORT Acad::ErrorStatus  | setObliqueAngle (double angle)
ACDBCORE2D_PORT Acad::ErrorStatus  | setTrackingFactor (double factor)
ACDBCORE2D_PORT Acad::ErrorStatus  | setWidthScale (double scale)
ACDBCORE2D_PORT bool  | strikethrough () const
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleBold ()
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleItalic ()
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleOverline ()
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleStrikethrough ()
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleUnderline ()
ACDBCORE2D_PORT double  | trackingFactor () const
ACDBCORE2D_PORT bool  | underline () const
ACDBCORE2D_PORT double  | widthScale () const
 Protected Member Functions
ACDBCORE2D_PORT  | AcDbTextEditorCursor (const TextEditor *pImp)
AcDbTextEditorCursor (const AcDbTextEditorCursor &)
AcDbTextEditorCursor &  | operator= (const AcDbTextEditorCursor &)
ACDBCORE2D_PORT  | ~AcDbTextEditorCursor ()
 Protected Member Functions inherited from AcDbTextEditorSelectionBase
AcDbTextEditorSelectionBase ()
AcDbTextEditorSelectionBase (const AcDbTextEditorSelectionBase &)
AcDbTextEditorSelectionBase &  | operator= (const AcDbTextEditorSelectionBase &)
virtual  | ~AcDbTextEditorSelectionBase ()
 Protected Attributes
 AcDbImpTextEditorCursor *  | m_pImpCursor
 Protected Attributes inherited from AcDbTextEditorSelectionBase
 AcDbImpTextEditorSelectionBase *  | m_pImp
 Friends
 class  | TextEditor
 Additional Inherited Members
 Public Types inherited from AcDbTextEditorSelectionBase
enum  | FlowAlign { kFlowBase, kFlowCenter, kFlowTop }
enum  | InsertTextType {
 kUnicodeMTextFormat, kMTextFormat, kRichTextFormat, kUnicodeDTextFormat,
 kDTextFormat, kUnicodeTextFormat, kMultibyteTextFormat
 }
 Static Public Member Functions inherited from AcDbTextEditorSelectionBase
static ACDBCORE2D_PORT double  | maxObliqueAngle ()
static ACDBCORE2D_PORT double  | maxTrackingFactor ()
static ACDBCORE2D_PORT double  | maxWidthScale ()
static ACDBCORE2D_PORT double  | minObliqueAngle ()
static ACDBCORE2D_PORT double  | minTrackingFactor ()
static ACDBCORE2D_PORT double  | minWidthScale ()
Constructor & Destructor Documentation
 ACDBCORE2D_PORT AcDbTextEditorCursor::AcDbTextEditorCursor  |  ( |  const TextEditor *  |  pImp | )
protected
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbTextEditorCursor::~AcDbTextEditorCursor  |  ( |   | )
protected
Warning
Not implemented!
 AcDbTextEditorCursor::AcDbTextEditorCursor  |  ( |  const AcDbTextEditorCursor &  |   | )
protected
Warning
Not implemented!
Member Function Documentation
 ACDBCORE2D_PORT AcDbTextEditorColumn* AcDbTextEditorCursor::column  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbTextEditorLocation* AcDbTextEditorCursor::location  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbTextEditorCursor& AcDbTextEditorCursor::operator=  |  ( |  const AcDbTextEditorCursor &  |   | )
protected
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbTextEditorParagraph* AcDbTextEditorCursor::paragraph  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorCursor::setLocation  |  ( |  const AcDbTextEditorLocation &  |  location | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbtexteditor.h