Classes | Public Member Functions | Static Public Member Functions | List of all members
AcDbAssocDimDependencyBodyBase Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbAssocDimDependencyBodyBase:
 Classes
class  | NotificationIgnorer
 Public Member Functions
AcDbAssocDimDependencyBodyBase (AcDbAssocCreateImpObject createImpObject=kAcDbAssocCreateImpObject)
ACRX_DECLARE_MEMBERS (AcDbAssocDimDependencyBodyBase)
AcString  | composeEntityText (int requiredNameFormat=-1) const
class AcExplicitConstraint *  | constraint () const
Acad::ErrorStatus  | deactivateConstraint () const
void  | dragStatus (const AcDb::DragStat status)
Acad::ErrorStatus  | entityAttachmentPointMoved (const AcArray< AcDbSubentGeometry > &newAttachedGeometries, double measurement=0.0)
virtual void  | erasedOverride (const AcDbObject *pDbObj, Adesk::Boolean isErasing) override
virtual void  | evaluateOverride () override
Acad::ErrorStatus  | getConstrainedGeoms (AcArray< AcConstrainedGeometry * > &geoms) const
Acad::ErrorStatus  | getConstrainedGeoms (AcArray< AcDbFullSubentPath > &geoms) const
Acad::ErrorStatus  | getConstrainedGeoms (AcArray< AcDbSubentGeometry > &geoms, AcGeVector3d &distanceDirection) const
int  | getCurrentlyUsedEntityNameFormat () const
 virtual double  | getEntityMeasurementOverride () const =0
Acad::ErrorStatus  | getEntityNameAndExpression (AcString &name, AcString &expression) const
 virtual AcString  | getEntityTextOverride () const =0
Acad::ErrorStatus  | getMeasuredValue (double &measurement) const
Acad::ErrorStatus  | getVariableNameAndExpression (AcString &name, AcString &expression, AcString &value) const
bool  | isConstraintActive () const
 virtual bool  | isEntityAttachmentChangedOverride () const =0
virtual Acad::ErrorStatus  | isRelevantChangeOverride (bool &isRelevChange) const override
virtual void  | modifiedOverride (const AcDbObject *pDbObj) override
Acad::ErrorStatus  | reactivateConstraint () const
Acad::ErrorStatus  | setEntityNameAndExpression (const AcString &name, const AcString &expression, const AcString &value)
 virtual Acad::ErrorStatus  | setEntityTextOverride (const AcString &newText)=0
Acad::ErrorStatus  | setIsReferenceOnly (bool yesNo)
Acad::ErrorStatus  | setNameAndExpression (const AcString &name, const AcString &expression)
Acad::ErrorStatus  | setVariableNameAndExpression (const AcString &name, const AcString &expression)
Acad::ErrorStatus  | setVariableValueToMeasuredValue () const
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing) override
virtual Acad::ErrorStatus  | updateDependentOnObjectOverride () override
Acad::ErrorStatus  | updateEntityText ()
Acad::ErrorStatus  | validateEntityText (const AcString &entityTextToValidate, AcString &errorMessage) const
AcDbObjectId  | variable () const
virtual  | ~AcDbAssocDimDependencyBodyBase ()
 Public Member Functions inherited from AcDbAssocDependencyBody
AcDbAssocDependencyBody (AcDbAssocCreateImpObject createImpObject=kAcDbAssocCreateImpObject)
ACRX_DECLARE_MEMBERS (AcDbAssocDependencyBody)
virtual void  | auditAssociativeDataOverride (AcDbAssocStatus &parentActionHandling)
 virtual void  | clonedOverride (const AcDbObject *pDbObj, const AcDbObject *pNewObj)
AcDbAssocEvaluationCallback *  | currentEvaluationCallback () const
AcDbObjectId  | dependentOnObject () const
virtual Acad::ErrorStatus  | hasCachedValueOverride (bool &hasCachedVal) const
bool  | isActionEvaluationInProgress () const
bool  | isAttachedToObject () const
virtual Acad::ErrorStatus  | isDependentOnTheSameThingAsOverride (const AcDbAssocDependency *pOtherDependency, bool &isDependentOnSameThing) const
virtual Acad::ErrorStatus  | isEqualToOverride (const AcDbAssocDependency *pOtherDependency, bool &isEqual) const
AcDbObjectId  | owningAction () const
 AcDbObjectId  | parentDependency () const
Acad::ErrorStatus  | setStatus (AcDbAssocStatus newStatus, bool notifyOwningAction=true)
AcDbAssocStatus  | status () const
virtual  | ~AcDbAssocDependencyBody ()
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static AcString  | formatToCurrentPrecision (const AcString &expression, bool isAngular)
static bool  | getEraseDimensionIfDependencyIsErased ()
static Acad::ErrorStatus  | getFromEntity (const AcDbObjectId &entityId, AcDbObjectId &dimDepBodyId)
static Acad::ErrorStatus  | getNameAndExpressionFromEntityText (const AcString &entityText, bool useMeasurementIfNoText, double measurement, bool isAngular, AcString &name, AcString &expression)
static bool  | setEraseDimensionIfDependencyIsErased (bool yesNo)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbAssocDimDependencyBodyBase::AcDbAssocDimDependencyBodyBase  |  ( |  AcDbAssocCreateImpObject  |  createImpObject = kAcDbAssocCreateImpObject | )
explicit
Warning
Not implemented!
 virtual AcDbAssocDimDependencyBodyBase::~AcDbAssocDimDependencyBodyBase  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 AcString AcDbAssocDimDependencyBodyBase::composeEntityText  |  ( |  int  |  requiredNameFormat = -1 | ) |   const
Warning
Not implemented!
 class AcExplicitConstraint* AcDbAssocDimDependencyBodyBase::constraint  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::deactivateConstraint  |  ( |   | ) |   const
Warning
Not implemented!
 void AcDbAssocDimDependencyBodyBase::dragStatus  |  ( |  const AcDb::DragStat  |  status | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::entityAttachmentPointMoved  |  ( |  const AcArray< AcDbSubentGeometry > &  |  newAttachedGeometries,
|  double  |  measurement = 0.0
)
Warning
Not implemented!
 virtual void AcDbAssocDimDependencyBodyBase::erasedOverride  |  ( |  const AcDbObject *  |  pDbObj,
|  Adesk::Boolean  |  isErasing
)
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocDependencyBody.
 virtual void AcDbAssocDimDependencyBodyBase::evaluateOverride  |  ( |   | )
overridevirtual
Warning
Not implemented!
Implements AcDbAssocDependencyBody.
 static AcString AcDbAssocDimDependencyBodyBase::formatToCurrentPrecision  |  ( |  const AcString &  |  expression,
|  bool  |  isAngular
)
static
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::getConstrainedGeoms  |  ( |  AcArray< AcConstrainedGeometry * > &  |  geoms | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::getConstrainedGeoms  |  ( |  AcArray< AcDbFullSubentPath > &  |  geoms | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::getConstrainedGeoms  |  ( |  AcArray< AcDbSubentGeometry > &  |  geoms,
|  AcGeVector3d &  |  distanceDirection
) |   |  const
Warning
Not implemented!
 int AcDbAssocDimDependencyBodyBase::getCurrentlyUsedEntityNameFormat  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::getEntityNameAndExpression  |  ( |  AcString &  |  name,
|  AcString &  |  expression
) |   |  const
Warning
Not implemented!
 static bool AcDbAssocDimDependencyBodyBase::getEraseDimensionIfDependencyIsErased  |  ( |   | )
static
Warning
Not implemented!
 static Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::getFromEntity  |  ( |  const AcDbObjectId &  |  entityId,
|  AcDbObjectId &  |  dimDepBodyId
)
static
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::getMeasuredValue  |  ( |  double &  |  measurement | ) |   const
Warning
Not implemented!
 static Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::getNameAndExpressionFromEntityText  |  ( |  const AcString &  |  entityText,
|  bool  |  useMeasurementIfNoText,
|  double  |  measurement,
|  bool  |  isAngular,
|  AcString &  |  name,
|  AcString &  |  expression
)
static
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::getVariableNameAndExpression  |  ( |  AcString &  |  name,
|  AcString &  |  expression,
|  AcString &  |  value
) |   |  const
Warning
Not implemented!
 bool AcDbAssocDimDependencyBodyBase::isConstraintActive  |  ( |   | ) |   const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::isRelevantChangeOverride  |  ( |  bool &  |  isRelevChange | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocDependencyBody.
 virtual void AcDbAssocDimDependencyBodyBase::modifiedOverride  |  ( |  const AcDbObject *  |  pDbObj | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocDependencyBody.
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::reactivateConstraint  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::setEntityNameAndExpression  |  ( |  const AcString &  |  name,
|  const AcString &  |  expression,
|  const AcString &  |  value
)
Warning
Not implemented!
 static bool AcDbAssocDimDependencyBodyBase::setEraseDimensionIfDependencyIsErased  |  ( |  bool  |  yesNo | )
static
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::setIsReferenceOnly  |  ( |  bool  |  yesNo | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::setNameAndExpression  |  ( |  const AcString &  |  name,
|  const AcString &  |  expression
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::setVariableNameAndExpression  |  ( |  const AcString &  |  name,
|  const AcString &  |  expression
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::setVariableValueToMeasuredValue  |  ( |   | ) |   const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::subErase  |  ( |  Adesk::Boolean  |  erasing | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::updateDependentOnObjectOverride  |  ( |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbAssocDependencyBody.
Reimplemented in AcDbAssocDimDependencyBody.
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::updateEntityText  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocDimDependencyBodyBase::validateEntityText  |  ( |  const AcString &  |  entityTextToValidate,
|  AcString &  |  errorMessage
) |   |  const
Warning
Not implemented!
 AcDbObjectId AcDbAssocDimDependencyBodyBase::variable  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocDimDependencyBodyBase.h