Public Types | Public Member Functions | Protected Member Functions | List of all members
AcDbDetailViewStyle Class Reference
AcDb Classes
  Inheritance diagram for AcDbDetailViewStyle:
 Public Types
enum  | IdentifierPlacement { kOutsideBoundary =0, kOutsideBoundaryWithLeader, kOnBoundary, kOnBoundaryWithLeader }
enum  | ModelEdge { kSmooth = 0, kSmoothWithBorder, kSmoothWithConnectionLine, kJagged }
 Public Types inherited from AcDbModelDocViewStyle
enum  | AttachmentPoint { kAboveView = 0, kBelowView = 1 }
enum  | TextAlignment { kTextAlignmentLeft = 0, kTextAlignmentCenter = 1, kTextAlignmentRight = 2 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbDetailViewStyle)
AcDbDetailViewStyle ()
AcCmColor  | arrowSymbolColor () const
AcDbObjectId  | arrowSymbolId () const
double  | arrowSymbolSize () const
AcCmColor  | borderLineColor () const
AcDbObjectId  | borderLineTypeId () const
AcDb::LineWeight  | borderLineWeight () const
AcCmColor  | boundaryLineColor () const
AcDbObjectId  | boundaryLineTypeId () const
AcDb::LineWeight  | boundaryLineWeight () const
AcCmColor  | connectionLineColor () const
AcDbObjectId  | connectionLineTypeId () const
AcDb::LineWeight  | connectionLineWeight () const
Acad::ErrorStatus  | getViewLabelPattern (AcString &pattern, AcDbField *pField=NULL) const
AcCmColor  | identifierColor () const
double  | identifierHeight () const
double  | identifierOffset () const
AcDbDetailViewStyle::IdentifierPlacement  | identifierPlacement () const
AcDbObjectId  | identifierStyleId () const
AcDbDetailViewStyle::ModelEdge  | modelEdge () const
Acad::ErrorStatus  | setArrowSymbolColor (const AcCmColor &color)
Acad::ErrorStatus  | setArrowSymbolId (const AcDbObjectId &arrowSymbolId)
Acad::ErrorStatus  | setArrowSymbolSize (double size)
Acad::ErrorStatus  | setBorderLineColor (const AcCmColor &color)
Acad::ErrorStatus  | setBorderLineTypeId (const AcDbObjectId &objId)
Acad::ErrorStatus  | setBorderLineWeight (AcDb::LineWeight lineweight)
Acad::ErrorStatus  | setBoundaryLineColor (const AcCmColor &color)
Acad::ErrorStatus  | setBoundaryLineTypeId (const AcDbObjectId &objId)
Acad::ErrorStatus  | setBoundaryLineWeight (AcDb::LineWeight lineweight)
Acad::ErrorStatus  | setConnectionLineColor (const AcCmColor &color)
Acad::ErrorStatus  | setConnectionLineTypeId (const AcDbObjectId &objId)
Acad::ErrorStatus  | setConnectionLineWeight (AcDb::LineWeight lineweight)
Acad::ErrorStatus  | setIdentifierColor (const AcCmColor &color)
Acad::ErrorStatus  | setIdentifierHeight (double height)
Acad::ErrorStatus  | setIdentifierOffset (double offset)
Acad::ErrorStatus  | setIdentifierPlacement (AcDbDetailViewStyle::IdentifierPlacement placement)
Acad::ErrorStatus  | setIdentifierStyleId (const AcDbObjectId &objId)
Acad::ErrorStatus  | setModelEdge (AcDbDetailViewStyle::ModelEdge placement)
Acad::ErrorStatus  | setShowArrows (bool bValue)
Acad::ErrorStatus  | setShowViewLabel (bool bValue)
Acad::ErrorStatus  | setViewLabelAlignment (AcDbModelDocViewStyle::TextAlignment alignment)
Acad::ErrorStatus  | setViewLabelAttachment (AcDbModelDocViewStyle::AttachmentPoint attachment)
Acad::ErrorStatus  | setViewLabelOffset (double offset)
Acad::ErrorStatus  | setViewLabelPattern (const ACHAR *pattern, const AcDbField *pField=NULL)
Acad::ErrorStatus  | setViewLabelTextColor (const AcCmColor &color)
Acad::ErrorStatus  | setViewLabelTextHeight (double height)
Acad::ErrorStatus  | setViewLabelTextStyleId (const AcDbObjectId &objId)
bool  | showArrows () const
bool  | showViewLabel () const
AcDbModelDocViewStyle::TextAlignment  | viewLabelAlignment () const
AcDbModelDocViewStyle::AttachmentPoint  | viewLabelAttachment () const
double  | viewLabelOffset () const
const ACHAR *  | viewLabelPattern () const
AcCmColor  | viewLabelTextColor () const
double  | viewLabelTextHeight () const
AcDbObjectId  | viewLabelTextStyleId () const
~AcDbDetailViewStyle ()
 Public Member Functions inherited from AcDbModelDocViewStyle
ACDB_DECLARE_MEMBERS (AcDbModelDocViewStyle)
AcString  | defaultViewName (int index) const
virtual const ACHAR *  | description (void) const
virtual void  | getDescription (AcString &strDescription) const
virtual Acad::ErrorStatus  | getName (ACHAR *&pszName) const final
virtual Acad::ErrorStatus  | getName (AcString &strName) const
bool  | isModifiedForRecompute () const
bool  | isViewNameValid (const ACHAR *pName) const
Acad::ErrorStatus  | postViewStyleToDb (AcDbDatabase *pDb, const ACHAR *styleName, AcDbObjectId &viewStyleId)
void  | setDatabaseDefaults (AcDbDatabase *pDb)
virtual Acad::ErrorStatus  | setDescription (const ACHAR *pszDescription)
virtual Acad::ErrorStatus  | setName (const ACHAR *pszName)
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwner, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const override
virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwner, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const override
 Protected Member Functions inherited from AcDbModelDocViewStyle
AcDbModelDocViewStyle ()
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcDbModelDocViewStyle
static AcGePoint3d  | calculateViewLabelPosition (AcGeVector2d &offsetVector, AcDbMText::AttachmentPoint &textAlignment, AcDbModelDocViewStyle::AttachmentPoint attachment, double offset, const AcGePoint3d &minPt, const AcGePoint3d &maxPt)
static AcGeVector2d  | setViewLabelPosition (AcDbMText *pMText, AcDbModelDocViewStyle::AttachmentPoint attachment, double offset, const AcGePoint3d &minPt, const AcGePoint3d &maxPt)
static AcGeVector2d  | updateViewLabelPosition (AcDbMText *pMText, AcDbModelDocViewStyle::AttachmentPoint &attachment, const AcGePoint3d &minPt, const AcGePoint3d &maxPt)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
Constructor & Destructor Documentation
 AcDbDetailViewStyle::AcDbDetailViewStyle  |  ( |   | )
Warning
Not implemented!
 AcDbDetailViewStyle::~AcDbDetailViewStyle  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 AcCmColor AcDbDetailViewStyle::arrowSymbolColor  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbDetailViewStyle::arrowSymbolId  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDetailViewStyle::arrowSymbolSize  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcDbDetailViewStyle::borderLineColor  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbDetailViewStyle::borderLineTypeId  |  ( |   | ) |   const
Warning
Not implemented!
 AcDb::LineWeight AcDbDetailViewStyle::borderLineWeight  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcDbDetailViewStyle::boundaryLineColor  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbDetailViewStyle::boundaryLineTypeId  |  ( |   | ) |   const
Warning
Not implemented!
 AcDb::LineWeight AcDbDetailViewStyle::boundaryLineWeight  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcDbDetailViewStyle::connectionLineColor  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbDetailViewStyle::connectionLineTypeId  |  ( |   | ) |   const
Warning
Not implemented!
 AcDb::LineWeight AcDbDetailViewStyle::connectionLineWeight  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::getViewLabelPattern  |  ( |  AcString &  |  pattern,
|  AcDbField *  |  pField = NULL
) |   |  const
Warning
Not implemented!
 AcCmColor AcDbDetailViewStyle::identifierColor  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDetailViewStyle::identifierHeight  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDetailViewStyle::identifierOffset  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbDetailViewStyle::IdentifierPlacement AcDbDetailViewStyle::identifierPlacement  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbDetailViewStyle::identifierStyleId  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbDetailViewStyle::ModelEdge AcDbDetailViewStyle::modelEdge  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setArrowSymbolColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setArrowSymbolId  |  ( |  const AcDbObjectId &  |  arrowSymbolId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setArrowSymbolSize  |  ( |  double  |  size | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setBorderLineColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setBorderLineTypeId  |  ( |  const AcDbObjectId &  |  objId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setBorderLineWeight  |  ( |  AcDb::LineWeight  |  lineweight | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setBoundaryLineColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setBoundaryLineTypeId  |  ( |  const AcDbObjectId &  |  objId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setBoundaryLineWeight  |  ( |  AcDb::LineWeight  |  lineweight | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setConnectionLineColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setConnectionLineTypeId  |  ( |  const AcDbObjectId &  |  objId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setConnectionLineWeight  |  ( |  AcDb::LineWeight  |  lineweight | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setIdentifierColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setIdentifierHeight  |  ( |  double  |  height | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setIdentifierOffset  |  ( |  double  |  offset | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setIdentifierPlacement  |  ( |  AcDbDetailViewStyle::IdentifierPlacement  |  placement | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setIdentifierStyleId  |  ( |  const AcDbObjectId &  |  objId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setModelEdge  |  ( |  AcDbDetailViewStyle::ModelEdge  |  placement | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setShowArrows  |  ( |  bool  |  bValue | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setShowViewLabel  |  ( |  bool  |  bValue | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelAlignment  |  ( |  AcDbModelDocViewStyle::TextAlignment  |  alignment | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelAttachment  |  ( |  AcDbModelDocViewStyle::AttachmentPoint  |  attachment | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelOffset  |  ( |  double  |  offset | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelPattern  |  ( |  const ACHAR *  |  pattern,
|  const AcDbField *  |  pField = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelTextColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelTextHeight  |  ( |  double  |  height | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbDetailViewStyle::setViewLabelTextStyleId  |  ( |  const AcDbObjectId &  |  objId | )
Warning
Not implemented!
 bool AcDbDetailViewStyle::showArrows  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbDetailViewStyle::showViewLabel  |  ( |   | ) |   const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbDetailViewStyle::subDeepClone  |  ( |  AcDbObject *  |  pOwner,
|  AcDbObject *&  |  pClonedObject,
|  AcDbIdMapping &  |  idMap,
|  Adesk::Boolean  |  isPrimary = true
) |   |  const
overrideprotectedvirtual
Warning
Not implemented!
Reimplemented from AcDbModelDocViewStyle.
 virtual Acad::ErrorStatus AcDbDetailViewStyle::subWblockClone  |  ( |  AcRxObject *  |  pOwner,
|  AcDbObject *&  |  pClonedObject,
|  AcDbIdMapping &  |  idMap,
|  Adesk::Boolean  |  isPrimary = true
) |   |  const
overrideprotectedvirtual
Warning
Not implemented!
Reimplemented from AcDbModelDocViewStyle.
 AcDbModelDocViewStyle::TextAlignment AcDbDetailViewStyle::viewLabelAlignment  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbModelDocViewStyle::AttachmentPoint AcDbDetailViewStyle::viewLabelAttachment  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDetailViewStyle::viewLabelOffset  |  ( |   | ) |   const
Warning
Not implemented!
 const ACHAR* AcDbDetailViewStyle::viewLabelPattern  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcDbDetailViewStyle::viewLabelTextColor  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbDetailViewStyle::viewLabelTextHeight  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbDetailViewStyle::viewLabelTextStyleId  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbDetailViewStyle.h