Public Member Functions | List of all members
AcPublishAggregationInfo Class Referenceabstract
AcPublish Classes
 Public Member Functions
 virtual void  | AddGlobalProperties (AcDMMEPlotPropertyVec props)=0
 virtual void  | AddGlobalResources (AcDMMResourceVec resources)=0
 virtual const ACHAR *  | dwfFileName ()=0
 virtual const ACHAR *  | dwfPassword ()=0
 virtual AcPlPlotLogger *  | GetPlotLogger ()=0
 The documentation for this class was generated from the following file:
AcPublishReactors.h