Public Types | Public Member Functions | List of all members
AcDbField Class Reference
AcDb Classes
  Inheritance diagram for AcDbField:
 Public Types
enum  | EvalContext {
 kOpen = (0x1 << 0), kSave = (0x1 << 1), kPlot = (0x1 << 2), kEtransmit = (0x1 << 3),
 kRegen = (0x1 << 4), kDemand = (0x1 << 5), kPreview = (0x1 << 6), kPlotPreview = (0x1 << 7)
 }
enum  | EvalOption {
 kDisable = 0, kOnOpen = (0x1 << 0), kOnSave = (0x1 << 1), kOnPlot = (0x1 << 2),
 kOnEtransmit = (0x1 << 3), kOnRegen = (0x1 << 4), kOnDemand = (0x1 << 5), kAutomatic
 }
enum  | EvalStatus {
 kNotYetEvaluated = (0x1 << 0), kSuccess = (0x1 << 1), kEvaluatorNotFound = (0x1 << 2), kSyntaxError = (0x1 << 3),
 kInvalidCode = (0x1 << 4), kInvalidContext = (0x1 << 5), kOtherError = (0x1 << 6)
 }
enum  | FieldCodeFlag {
 kFieldCode = (0x1 << 0), kEvaluatedText = (0x1 << 1), kEvaluatedChildren = (0x1 << 2), kObjectReference = (0x1 << 3),
 kAddMarkers = (0x1 << 4), kEscapeBackslash = (0x1 << 5), kStripOptions = (0x1 << 6), kPreserveFields = (0x1 << 7),
 kTextField = (0x1 << 8), kPreserveOptions = (0x1 << 9), kDetachChildren = (0x1 << 10), kChildObjectReference = (0x1 << 11),
 kForExpression = (0x1 << 12)
 }
enum  | FilingOption { kSkipFilingResult = (0x1 << 0) }
enum  | State {
 kInitialized = (0x1 << 0), kCompiled = (0x1 << 1), kModified = (0x1 << 2), kEvaluated = (0x1 << 3),
 kHasCache = (0x1 << 4), kHasFormattedString = (0x1 << 5)
 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbField)
 ACDBCORE2D_PORT  | AcDbField (const ACHAR *pszFieldCode, bool bTextField=false)
 ACDBCORE2D_PORT int  | childCount (void) const
 Acad::ErrorStatus  | convertToTextField (void)
 ACDBCORE2D_PORT AcValue::DataType  | dataType (void) const
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) override
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const override
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) override
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const override
 ACDBCORE2D_PORT Acad::ErrorStatus  | evaluate (int nContext, AcDbDatabase *pDb, int *pNumFound=NULL, int *pNumEvaluated=NULL)
 ACDBCORE2D_PORT AcDbField::EvalOption  | evaluationOption (void) const
 ACDBCORE2D_PORT AcDbField::EvalStatus  | evaluationStatus (int *pnErrCode, AcString *pszErrMsg) const
 AcDbField::EvalStatus  | evaluationStatus (int *pnErrCode) const
 AcDbField::EvalStatus  | evaluationStatus () const
 AcDbField::EvalStatus  | evaluationStatus (int *pnErrCode, ACHAR **pszErrMsg) const
 ACDBCORE2D_PORT const ACHAR *  | evaluatorId (void) const
 ACDBCORE2D_PORT AcDbField::FilingOption  | filingOption (void) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | getChild (int iIndex, AcDbField *&pField, AcDb::OpenMode mode)
 ACDBCORE2D_PORT Acad::ErrorStatus  | getData (const ACHAR *pszKey, AcValue *pData) const
 ACDBCORE2D_PORT const ACHAR *  | getFieldCode (AcDbField::FieldCodeFlag nFlag, AcArray< AcDbField * > *pChildFields=NULL, AcDb::OpenMode mode=AcDb::kForRead) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | getFieldCode (AcString &sFieldCode, AcDbField::FieldCodeFlag nFlag, AcArray< AcDbField * > *pChildFields=nullptr, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getFieldCode (ACHAR *&pszFieldCode, AcDbField::FieldCodeFlag nFlag, AcArray< AcDbField * > *pChildFields=nullptr, AcDb::OpenMode mode=AcDb::kForRead) const
 ACDBCORE2D_PORT const ACHAR *  | getFormat (void) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | getFormat (AcString &sFormat) const
 Acad::ErrorStatus  | getFormat (ACHAR *&pszFormat) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | getHyperlink (AcHyperlink &hlink) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | getHyperlink (AcString *psName, AcString *psDescription, AcString *psSubLocation, AcString *psDisplayString, Adesk::Int32 *pFlag) const
 Acad::ErrorStatus  | getHyperlink (ACHAR **pszName, ACHAR **pszDescription, ACHAR **pszSubLocation, ACHAR **pszDisplayString, Adesk::Int32 *pFlag) const
 ACDBCORE2D_PORT const ACHAR *  | getValue (void) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | getValue (AcString &sValue) const
 Acad::ErrorStatus  | getValue (ACHAR *&pszValue) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | getValue (AcValue &value) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | getValue (AcFdFieldValue &value) const
 ACDBCORE2D_PORT bool  | hasHyperlink (void) const
 bool  | isTextField (void) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | postInDatabase (AcDbDatabase *pDb)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeHyperlink (void)
 ACDBCORE2D_PORT Acad::ErrorStatus  | setData (const ACHAR *pszKey, const AcValue *pData)
 ACDBCORE2D_PORT Acad::ErrorStatus  | setData (const ACHAR *pszKey, const AcValue *pData, bool bRecursive)
 ACDBCORE2D_PORT Acad::ErrorStatus  | setEvaluationOption (AcDbField::EvalOption nEvalOption)
 ACDBCORE2D_PORT Acad::ErrorStatus  | setEvaluatorId (const ACHAR *pszEvaluatorId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | setFieldCode (const ACHAR *pszFieldCode, AcDbField::FieldCodeFlag nFlag=(AcDbField::FieldCodeFlag) 0, AcDbFieldArray *pChildFields=NULL)
 ACDBCORE2D_PORT Acad::ErrorStatus  | setFilingOption (AcDbField::FilingOption nOption)
 ACDBCORE2D_PORT Acad::ErrorStatus  | setFormat (const ACHAR *pszFormat)
 ACDBCORE2D_PORT Acad::ErrorStatus  | setHyperlink (const AcHyperlink &hlink)
 ACDBCORE2D_PORT Acad::ErrorStatus  | setHyperlink (const ACHAR *pszName, const ACHAR *pszDescription, const ACHAR *pszSubLocation=NULL)
 ACDBCORE2D_PORT Acad::ErrorStatus  | setHyperlink (const ACHAR *pszName, const ACHAR *pszDescription, const ACHAR *pszSubLocation, Adesk::Int32 lFlag)
 ACDBCORE2D_PORT Acad::ErrorStatus  | setInObject (AcDbObject *pObj, const ACHAR *pszPropName)
 ACDBCORE2D_PORT AcDbField::State  | state (void) const
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subClose () override
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
DbField.h