Public Member Functions | List of all members
AcGiLineAttributes Class Referenceabstract
AcGi Classes
 Public Member Functions
 virtual AcGiLineAttributes *  | clone () const =0
 virtual AcGiLineEndStyle  | getEndstyle () const =0
 virtual AcGiLineFillStyle  | getFillstyle () const =0
 virtual AcGiLineJoinStyle  | getJoinstyle () const =0
 virtual AcGiLineType  | getLinetype () const =0
 virtual AcDb::LineWeight  | getLineweight () const =0
 virtual bool  | hasCustomLineweight () const =0
 virtual bool  | isLinetypeAdaptive () const =0
 virtual bool  | isLineWeightByLayer () const =0
 virtual bool  | isLineweightDefault () const =0
 virtual void  | setCustomLineweight (bool isCustomLineweight)=0
 virtual void  | setEndstyle (AcGiLineEndStyle endstyle)=0
 virtual void  | setFillstyle (AcGiLineFillStyle fillstyle)=0
 virtual void  | setJoinstyle (AcGiLineJoinStyle joinstyle)=0
 virtual void  | setLinetype (AcGiLineType linetype)=0
 virtual void  | setLinetypeAdaptive (bool isAdaptive)=0
 virtual void  | setLineweight (AcDb::LineWeight lweight)=0
 virtual void  | setLineWeightByLayer (bool isLineweightByLayer)=0
 virtual void  | setLineweightDefault ()=0
 The documentation for this class was generated from the following file:
AcGiLineAttributes.h