Public Types | Public Member Functions | List of all members
AcDbPointCloudCrop Class Reference
AcDb Classes
 Public Types
enum  | CropType { kInvalid = 0, kRectangular, kPolygonal, kCircular }
 Public Member Functions
AcDbPointCloudCrop ()
AcDbPointCloudCrop (const AcDbPointCloudCrop &other)
void  | clear ()
virtual void  | draw (AcGiGeometry &geom)
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler, Adesk::Int16 &dxfInt8, Adesk::Int16 &dxfInt32, Adesk::Int16 &dxfXCoord, Adesk::Int16 &dxfNormalX)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler, Adesk::Int16 &dxfInt8, Adesk::Int16 &dxfInt32, Adesk::Int16 &dxfXCoord, Adesk::Int16 &dxfNormalX) const
const AcGePoint3dArray &  | get ()
bool  | getCropPlane (AcGePlane &plane)
bool  | isInside () const
bool  | isInverted () const
bool  | isValid () const
int  | length () const
bool  | operator!= (const AcDbPointCloudCrop &other) const
AcDbPointCloudCrop &  | operator= (const AcDbPointCloudCrop &other)
bool  | operator== (const AcDbPointCloudCrop &other) const
void  | set (const AcGePoint3dArray &points)
void  | setCropPlane (const AcGePlane &plane)
void  | setCropType (CropType type)
void  | setDxfHandler (AcDbPointCloudDxfHandler *dxfHandler)
void  | setInside (bool bInside)
void  | setInvert (bool toInvert)
virtual Autodesk::RealityStudio::SDK::Interface::ARCSpatialFilter *  | toSpatialFilter () const
CropType  | type () const
virtual  | ~AcDbPointCloudCrop ()
Constructor & Destructor Documentation
 AcDbPointCloudCrop::AcDbPointCloudCrop  |  ( |   | )
Warning
Not implemented!
 AcDbPointCloudCrop::AcDbPointCloudCrop  |  ( |  const AcDbPointCloudCrop &  |  other | )
Warning
Not implemented!
 virtual AcDbPointCloudCrop::~AcDbPointCloudCrop  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 void AcDbPointCloudCrop::clear  |  ( |   | )
Warning
Not implemented!
 virtual void AcDbPointCloudCrop::draw  |  ( |  AcGiGeometry &  |  geom | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbPointCloudCrop::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbPointCloudCrop::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbPointCloudCrop::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler,
|  Adesk::Int16 &  |  dxfInt8,
|  Adesk::Int16 &  |  dxfInt32,
|  Adesk::Int16 &  |  dxfXCoord,
|  Adesk::Int16 &  |  dxfNormalX
)
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbPointCloudCrop::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler,
|  Adesk::Int16 &  |  dxfInt8,
|  Adesk::Int16 &  |  dxfInt32,
|  Adesk::Int16 &  |  dxfXCoord,
|  Adesk::Int16 &  |  dxfNormalX
) |   |  const
virtual
Warning
Not implemented!
 const AcGePoint3dArray& AcDbPointCloudCrop::get  |  ( |   | )
Warning
Not implemented!
 bool AcDbPointCloudCrop::getCropPlane  |  ( |  AcGePlane &  |  plane | )
Warning
Not implemented!
 bool AcDbPointCloudCrop::isInside  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbPointCloudCrop::isInverted  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbPointCloudCrop::isValid  |  ( |   | ) |   const
Warning
Not implemented!
 int AcDbPointCloudCrop::length  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbPointCloudCrop::operator!=  |  ( |  const AcDbPointCloudCrop &  |  other | ) |   const
Warning
Not implemented!
 AcDbPointCloudCrop& AcDbPointCloudCrop::operator=  |  ( |  const AcDbPointCloudCrop &  |  other | )
Warning
Not implemented!
 bool AcDbPointCloudCrop::operator==  |  ( |  const AcDbPointCloudCrop &  |  other | ) |   const
Warning
Not implemented!
 void AcDbPointCloudCrop::set  |  ( |  const AcGePoint3dArray &  |  points | )
Warning
Not implemented!
 void AcDbPointCloudCrop::setCropPlane  |  ( |  const AcGePlane &  |  plane | )
Warning
Not implemented!
 void AcDbPointCloudCrop::setCropType  |  ( |  CropType  |  type | )
Warning
Not implemented!
 void AcDbPointCloudCrop::setDxfHandler  |  ( |  AcDbPointCloudDxfHandler *  |  dxfHandler | )
Warning
Not implemented!
 void AcDbPointCloudCrop::setInside  |  ( |  bool  |  bInside | )
Warning
Not implemented!
 void AcDbPointCloudCrop::setInvert  |  ( |  bool  |  toInvert | )
Warning
Not implemented!
 virtual Autodesk::RealityStudio::SDK::Interface::ARCSpatialFilter* AcDbPointCloudCrop::toSpatialFilter  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 CropType AcDbPointCloudCrop::type  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbPointCloudCrop.h