Public Member Functions | Protected Member Functions | Friends | List of all members
AcRxMethod Class Reference
AcRx Classes
  Inheritance diagram for AcRxMethod:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxMethod, ACBASE_PORT)
ACBASE_PORT Acad::ErrorStatus  | invoke (AcRxObject *pO, AcRxValue &param) const
ACBASE_PORT Acad::ErrorStatus  | isExecutable (const AcRxObject *pO, const AcRxValue &param) const
 Public Member Functions inherited from AcRxMember
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxMember, ACBASE_PORT)
ACBASE_PORT const AcRxAttributeCollection &  | attributes () const throw ()
ACBASE_PORT AcRxAttributeCollection &  | attributes () throw ()
ACBASE_PORT const AcArray< const AcRxMember * > *  | children () const throw ()
ACBASE_PORT AcString  | localName () const throw ()
ACBASE_PORT const ACHAR *  | name () const throw ()
ACBASE_PORT const AcRxObject *  | owner () const throw ()
ACBASE_PORT const AcRxValueType &  | type () const throw ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
ACBASE_PORT  | AcRxMethod (const ACHAR *name, const AcRxValueType &type)
ACBASE_PORT  | AcRxMethod (AcRxMethodImp *)
virtual Acad::ErrorStatus  | subInvoke (AcRxObject *pO, AcRxValue &param) const
virtual Acad::ErrorStatus  | subIsExecutable (const AcRxObject *pO, const AcRxValue &param) const
ACBASE_PORT  | ~AcRxMethod ()
 Protected Member Functions inherited from AcRxMember
ACBASE_PORT  | AcRxMember (AcRxMemberImp *) throw ()
virtual ACBASE_PORT Acad::ErrorStatus  | subChildren (AcArray< const AcRxMember * > &children) const
virtual ACBASE_PORT AcString  | subLocalName () const
virtual ACBASE_PORT  | ~AcRxMember () throw ()
 Protected Member Functions inherited from Pimpl::ApiPart< AcRxObject, AcRxMemberImp >
ApiPart (AcRxMemberImp *pImp) throw ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcRxMethodImp
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxMember
static ACBASE_PORT void  | deleteMember (const AcRxMember *pMember) throw ()
static ACBASE_PORT void *  | operator new (size_t size)
static ACBASE_PORT void *  | operator new (size_t size, const char *pFName, int nLine)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Protected Member Functions inherited from AcRxMember
static ACBASE_PORT void  | operator delete (void *p)
static ACBASE_PORT void  | operator delete (void *p, const char *pFName, int nLine)
static ACBASE_PORT void  | operator delete[] (void *p)
static ACBASE_PORT void  | operator delete[] (void *p, const char *pFName, int nLine)
Constructor & Destructor Documentation
 ACBASE_PORT AcRxMethod::~AcRxMethod  |  ( |   | )
protected
Warning
Not implemented!
 ACBASE_PORT AcRxMethod::AcRxMethod  |  ( |  const ACHAR *  |  name,
|  const AcRxValueType &  |  type
)
protected
Warning
Not implemented!
 ACBASE_PORT AcRxMethod::AcRxMethod  |  ( |  AcRxMethodImp *  |   | )
protected
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT Acad::ErrorStatus AcRxMethod::invoke  |  ( |  AcRxObject *  |  pO,
|  AcRxValue &  |  param
) |   |  const
Warning
Not implemented!
 ACBASE_PORT Acad::ErrorStatus AcRxMethod::isExecutable  |  ( |  const AcRxObject *  |  pO,
|  const AcRxValue &  |  param
) |   |  const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcRxMethod::subInvoke  |  ( |  AcRxObject *  |  pO,
|  AcRxValue &  |  param
) |   |  const
protectedvirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcRxMethod::subIsExecutable  |  ( |  const AcRxObject *  |  pO,
|  const AcRxValue &  |  param
) |   |  const
protectedvirtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxmethod.h