Public Member Functions | List of all members
AcGeCylinder Class Reference
AcGe Classes
  Inheritance diagram for AcGeCylinder:
 Public Member Functions
AcGeCylinder (double radius, const AcGePoint3d &origin, const AcGeVector3d &axisOfSymmetry)
AcGeCylinder (double radius, const AcGePoint3d &origin, const AcGeVector3d &axisOfSymmetry, const AcGeVector3d &refAxis, const AcGeInterval &height, double startAngle, double endAngle)
AcGeCylinder (const AcGeCylinder &)
 AcGeVector3d  | axisOfSymmetry () const
 void  | getAngles (double &start, double &end) const
 void  | getHeight (AcGeInterval &height) const
 double  | heightAt (double u) const
 Adesk::Boolean  | intersectWith (const AcGeLinearEnt3d &linEnt, int &intn, AcGePoint3d &p1, AcGePoint3d &p2, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isClosed (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOuterNormal () const
 AcGeCylinder &  | operator= (const AcGeCylinder &cylinder)
 AcGePoint3d  | origin () const
 double  | radius () const
 AcGeVector3d  | refAxis () const
 AcGeCylinder &  | set (double radius, const AcGePoint3d &origin, const AcGeVector3d &axisOfSym)
 AcGeCylinder &  | set (double radius, const AcGePoint3d &origin, const AcGeVector3d &axisOfSym, const AcGeVector3d &refAxis, const AcGeInterval &height, double startAngle, double endAngle)
 AcGeCylinder &  | setAngles (double start, double end)
 AcGeCylinder &  | setHeight (const AcGeInterval &height)
 AcGeCylinder &  | setRadius (double radius)
 Public Member Functions inherited from AcGeSurface
 AcGePoint3d  | closestPointTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param, int derivOrd, AcGeVector3dArray &derivatives) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param, int derivOrd, AcGeVector3dArray &derivatives, AcGeVector3d &normal) const
 void  | getClosestPointTo (const AcGePoint3d &pnt, AcGePointOnSurface &result, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getEnvelope (AcGeInterval &intrvlX, AcGeInterval &intrvlY) const
 Adesk::Boolean  | isClosedInU (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isClosedInV (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isNormalReversed () const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, AcGePoint2d &paramPoint, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeSurface &  | operator= (const AcGeSurface &otherSurface)
 AcGePoint2d  | paramOf (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeSurface &  | reverseNormal ()
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeSurface
AcGeSurface (const AcGeSurface &)
 Protected Member Functions inherited from AcGeEntity3d
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 class AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
gecylndr.h