Public Types | Public Member Functions | Static Public Member Functions | List of all members
AcDbGeoData Class Reference
AcDb Classes
  Inheritance diagram for AcDbGeoData:
 Public Types
 typedef Acad::ErrorStatus(*  | ACDBGEODATA_DWGTOGEOGRAPHIC) (const AcDbGeoData *pGeoData, const double &dblDwgX, const double &dblDwgY, const double &dblDwgZ, double &dblLongitude, double &dblLatitude, double &dblAltitude)
 typedef Acad::ErrorStatus(*  | ACDBGEODATA_GEOGRAPHICTODWG) (const AcDbGeoData *pGeoData, const double &dblLongitude, const double &dblLatitude, const double &dblAltitude, double &dblDwgX, double &dblDwgY, double &dblDwgZ)
 typedef bool(*  | ACDBGEODATA_VALIDATE_CS) (const ACHAR *coordinateSystem)
enum  | ScaleEstimationMethod { kScaleEstMethodUnity = 1, kScaleEstMethodUserDefined, kScaleEstMethodReferencePoint, kScaleEstMethodPrismoidal }
enum  | TypeOfCoordinates { kCoordTypUnknown = 0, kCoordTypLocal, kCoordTypGrid, kCoordTypGeographic }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Public Member Functions
ACDBCORE2D_DECLARE_MEMBERS (AcDbGeoData)
ACDBCORE2D_PORT  | AcDbGeoData ()
ACDBCORE2D_PORT Acad::ErrorStatus  | addMeshFace (int faceIndex, int p0, int p1, int p2)
ACDBCORE2D_PORT Acad::ErrorStatus  | addMeshPointMap (int index, const AcGePoint2d &sourcePt, const AcGePoint2d &destPt)
ACDBCORE2D_PORT AcDbObjectId  | blockTableRecordId () const
ACDBCORE2D_PORT double  | coordinateProjectionRadius () const
ACDBCORE2D_PORT const ACHAR *  | coordinateSystem () const
ACDBCORE2D_PORT TypeOfCoordinates  | coordinateType () const
ACDBCORE2D_PORT AcGePoint3d  | designPoint () const
ACDBCORE2D_PORT bool  | doSeaLevelCorrection () const
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *) override
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const override
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *) override
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const override
ACDBCORE2D_PORT Acad::ErrorStatus  | eraseFromDb (void)
ACDBCORE2D_PORT const ACHAR *  | geoRSSTag () const
ACDBCORE2D_PORT Acad::ErrorStatus  | getMeshFace (int faceIndex, int &p0, int &p1, int &p2) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getMeshPointMap (int index, AcGePoint2d &sourcePt, AcGePoint2d &destPt) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getMeshPointMaps (AcGePoint2dArray &sourcePts, AcGePoint2dArray &destPts) const
ACDBCORE2D_PORT AcDb::UnitsValue  | horizontalUnits () const
ACDBCORE2D_PORT double  | horizontalUnitScale () const
ACDBCORE2D_PORT double  | northDirection () const
ACDBCORE2D_PORT AcGeVector2d  | northDirectionVector () const
ACDBCORE2D_PORT int  | numMeshFaces () const
ACDBCORE2D_PORT int  | numMeshPoints () const
ACDBCORE2D_PORT const ACHAR *  | observationCoverage () const
ACDBCORE2D_PORT const ACHAR *  | observationFrom () const
ACDBCORE2D_PORT const ACHAR *  | observationTo () const
ACDBCORE2D_PORT Acad::ErrorStatus  | postToDb (AcDbObjectId &objId)
ACDBCORE2D_PORT AcGePoint3d  | referencePoint () const
ACDBCORE2D_PORT Acad::ErrorStatus  | resetMeshPointMaps ()
ACDBCORE2D_PORT ScaleEstimationMethod  | scaleEstimationMethod () const
ACDBCORE2D_PORT double  | scaleFactor () const
ACDBCORE2D_PORT double  | seaLevelElevation () const
ACDBCORE2D_PORT Acad::ErrorStatus  | setBlockTableRecordId (const AcDbObjectId &blockId)
ACDBCORE2D_PORT Acad::ErrorStatus  | setCoordinateProjectionRadius (double value)
ACDBCORE2D_PORT Acad::ErrorStatus  | setCoordinateSystem (const ACHAR *coordinateSystem)
ACDBCORE2D_PORT Acad::ErrorStatus  | setCoordinateType (TypeOfCoordinates designCoordinateType)
ACDBCORE2D_PORT Acad::ErrorStatus  | setDesignPoint (const AcGePoint3d &point)
ACDBCORE2D_PORT Acad::ErrorStatus  | setDoSeaLevelCorrection (bool seaLevelCorrectionOn)
ACDBCORE2D_PORT Acad::ErrorStatus  | setGeoRSSTag (const ACHAR *rssTag)
ACDBCORE2D_PORT Acad::ErrorStatus  | setHorizontalUnits (AcDb::UnitsValue horizUnits)
ACDBCORE2D_PORT Acad::ErrorStatus  | setHorizontalUnitScale (double horzUnitScale)
ACDBCORE2D_PORT Acad::ErrorStatus  | setMeshPointMaps (const AcGePoint2dArray &sourcePts, const AcGePoint2dArray &destPts)
ACDBCORE2D_PORT Acad::ErrorStatus  | setNorthDirectionVector (const AcGeVector2d &north)
ACDBCORE2D_PORT Acad::ErrorStatus  | setObservationCoverage (const ACHAR *coverage)
ACDBCORE2D_PORT Acad::ErrorStatus  | setObservationFrom (const ACHAR *from)
ACDBCORE2D_PORT Acad::ErrorStatus  | setObservationTo (const ACHAR *to)
ACDBCORE2D_PORT Acad::ErrorStatus  | setReferencePoint (const AcGePoint3d &point)
ACDBCORE2D_PORT Acad::ErrorStatus  | setScaleEstimationMethod (ScaleEstimationMethod value)
ACDBCORE2D_PORT Acad::ErrorStatus  | setScaleFactor (double value)
ACDBCORE2D_PORT Acad::ErrorStatus  | setSeaLevelElevation (double value)
ACDBCORE2D_PORT Acad::ErrorStatus  | setUpDirection (const AcGeVector3d &vec)
ACDBCORE2D_PORT Acad::ErrorStatus  | setVerticalUnits (AcDb::UnitsValue vertUnits)
ACDBCORE2D_PORT Acad::ErrorStatus  | setVerticalUnitScale (double vertUnitScale)
ACDBCORE2D_PORT Acad::ErrorStatus  | transformFromLonLatAlt (const AcGePoint3d &geoPt, AcGePoint3d &dwgPt) const
ACDBCORE2D_PORT Acad::ErrorStatus  | transformFromLonLatAlt (double lon, double lat, double alt, double &x, double &y, double &z) const
ACDBCORE2D_PORT Acad::ErrorStatus  | transformToLonLatAlt (const AcGePoint3d &dwgPt, AcGePoint3d &geoPt) const
ACDBCORE2D_PORT Acad::ErrorStatus  | transformToLonLatAlt (double x, double y, double z, double &lon, double &lat, double &alt) const
ACDBCORE2D_PORT Acad::ErrorStatus  | updateTransformationMatrix ()
ACDBCORE2D_PORT AcGeVector3d  | upDirection () const
ACDBCORE2D_PORT AcDb::UnitsValue  | verticalUnits () const
ACDBCORE2D_PORT double  | verticalUnitScale () const
virtual ACDBCORE2D_PORT  | ~AcDbGeoData ()
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static ACDBCORE2D_PORT const ACHAR *  | getTransformCallbacks (ACDBGEODATA_GEOGRAPHICTODWG &pFuncGeoToDwg, ACDBGEODATA_DWGTOGEOGRAPHIC &pFuncDwgToGeo)
static ACDBCORE2D_PORT ACDBGEODATA_VALIDATE_CS  | getValidateCoordinateSystemCallback ()
static ACDBCORE2D_PORT Acad::ErrorStatus  | setTransformCallbacks (const ACHAR *zoneDescription, ACDBGEODATA_GEOGRAPHICTODWG pFuncGeoToDwg, ACDBGEODATA_DWGTOGEOGRAPHIC pFuncDwgToGeo)
static ACDBCORE2D_PORT Acad::ErrorStatus  | setValidateCoordinateSystemCallback (ACDBGEODATA_VALIDATE_CS pFuncValidateCs)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Additional Inherited Members
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 ACDBCORE2D_PORT AcDbGeoData::AcDbGeoData  |  ( |   | )
Warning
Not implemented!
 virtual ACDBCORE2D_PORT AcDbGeoData::~AcDbGeoData  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::addMeshFace  |  ( |  int  |  faceIndex,
|  int  |  p0,
|  int  |  p1,
|  int  |  p2
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::addMeshPointMap  |  ( |  int  |  index,
|  const AcGePoint2d &  |  sourcePt,
|  const AcGePoint2d &  |  destPt
)
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbObjectId AcDbGeoData::blockTableRecordId  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbGeoData::coordinateProjectionRadius  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT const ACHAR* AcDbGeoData::coordinateSystem  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT TypeOfCoordinates AcDbGeoData::coordinateType  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcGePoint3d AcDbGeoData::designPoint  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbGeoData::doSeaLevelCorrection  |  ( |   | ) |   const
Warning
Not implemented!
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::dwgInFields  |  ( |  AcDbDwgFiler *  |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::dwgOutFields  |  ( |  AcDbDwgFiler *  |   | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::dxfInFields  |  ( |  AcDbDxfFiler *  |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::dxfOutFields  |  ( |  AcDbDxfFiler *  |   | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::eraseFromDb  |  ( |  void  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT const ACHAR* AcDbGeoData::geoRSSTag  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::getMeshFace  |  ( |  int  |  faceIndex,
|  int &  |  p0,
|  int &  |  p1,
|  int &  |  p2
) |   |  const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::getMeshPointMap  |  ( |  int  |  index,
|  AcGePoint2d &  |  sourcePt,
|  AcGePoint2d &  |  destPt
) |   |  const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::getMeshPointMaps  |  ( |  AcGePoint2dArray &  |  sourcePts,
|  AcGePoint2dArray &  |  destPts
) |   |  const
Warning
Not implemented!
 static ACDBCORE2D_PORT const ACHAR* AcDbGeoData::getTransformCallbacks  |  ( |  ACDBGEODATA_GEOGRAPHICTODWG &  |  pFuncGeoToDwg,
|  ACDBGEODATA_DWGTOGEOGRAPHIC &  |  pFuncDwgToGeo
)
static
Warning
Not implemented!
 static ACDBCORE2D_PORT ACDBGEODATA_VALIDATE_CS AcDbGeoData::getValidateCoordinateSystemCallback  |  ( |   | )
static
Warning
Not implemented!
 ACDBCORE2D_PORT AcDb::UnitsValue AcDbGeoData::horizontalUnits  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbGeoData::horizontalUnitScale  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbGeoData::northDirection  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcGeVector2d AcDbGeoData::northDirectionVector  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT int AcDbGeoData::numMeshFaces  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT int AcDbGeoData::numMeshPoints  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT const ACHAR* AcDbGeoData::observationCoverage  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT const ACHAR* AcDbGeoData::observationFrom  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT const ACHAR* AcDbGeoData::observationTo  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::postToDb  |  ( |  AcDbObjectId &  |  objId | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcGePoint3d AcDbGeoData::referencePoint  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::resetMeshPointMaps  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT ScaleEstimationMethod AcDbGeoData::scaleEstimationMethod  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbGeoData::scaleFactor  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbGeoData::seaLevelElevation  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setBlockTableRecordId  |  ( |  const AcDbObjectId &  |  blockId | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setCoordinateProjectionRadius  |  ( |  double  |  value | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setCoordinateSystem  |  ( |  const ACHAR *  |  coordinateSystem | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setCoordinateType  |  ( |  TypeOfCoordinates  |  designCoordinateType | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setDesignPoint  |  ( |  const AcGePoint3d &  |  point | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setDoSeaLevelCorrection  |  ( |  bool  |  seaLevelCorrectionOn | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setGeoRSSTag  |  ( |  const ACHAR *  |  rssTag | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setHorizontalUnits  |  ( |  AcDb::UnitsValue  |  horizUnits | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setHorizontalUnitScale  |  ( |  double  |  horzUnitScale | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setMeshPointMaps  |  ( |  const AcGePoint2dArray &  |  sourcePts,
|  const AcGePoint2dArray &  |  destPts
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setNorthDirectionVector  |  ( |  const AcGeVector2d &  |  north | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setObservationCoverage  |  ( |  const ACHAR *  |  coverage | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setObservationFrom  |  ( |  const ACHAR *  |  from | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setObservationTo  |  ( |  const ACHAR *  |  to | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setReferencePoint  |  ( |  const AcGePoint3d &  |  point | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setScaleEstimationMethod  |  ( |  ScaleEstimationMethod  |  value | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setScaleFactor  |  ( |  double  |  value | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setSeaLevelElevation  |  ( |  double  |  value | )
Warning
Not implemented!
 static ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setTransformCallbacks  |  ( |  const ACHAR *  |  zoneDescription,
|  ACDBGEODATA_GEOGRAPHICTODWG  |  pFuncGeoToDwg,
|  ACDBGEODATA_DWGTOGEOGRAPHIC  |  pFuncDwgToGeo
)
static
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setUpDirection  |  ( |  const AcGeVector3d &  |  vec | )
Warning
Not implemented!
 static ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setValidateCoordinateSystemCallback  |  ( |  ACDBGEODATA_VALIDATE_CS  |  pFuncValidateCs | )
static
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setVerticalUnits  |  ( |  AcDb::UnitsValue  |  vertUnits | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::setVerticalUnitScale  |  ( |  double  |  vertUnitScale | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::transformFromLonLatAlt  |  ( |  const AcGePoint3d &  |  geoPt,
|  AcGePoint3d &  |  dwgPt
) |   |  const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::transformFromLonLatAlt  |  ( |  double  |  lon,
|  double  |  lat,
|  double  |  alt,
|  double &  |  x,
|  double &  |  y,
|  double &  |  z
) |   |  const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::transformToLonLatAlt  |  ( |  const AcGePoint3d &  |  dwgPt,
|  AcGePoint3d &  |  geoPt
) |   |  const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::transformToLonLatAlt  |  ( |  double  |  x,
|  double  |  y,
|  double  |  z,
|  double &  |  lon,
|  double &  |  lat,
|  double &  |  alt
) |   |  const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbGeoData::updateTransformationMatrix  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcGeVector3d AcDbGeoData::upDirection  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcDb::UnitsValue AcDbGeoData::verticalUnits  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbGeoData::verticalUnitScale  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbGeoData.h