Public Member Functions | List of all members
AcDbVectorRef Class Reference
AcDb Classes
  Inheritance diagram for AcDbVectorRef:
 Public Member Functions
AcDbVectorRef ()
AcDbVectorRef (const AcDbVectorRef &)
AcDbVectorRef (const AcGeVector3d &)
ACRX_DECLARE_MEMBERS (AcDbVectorRef)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *) override
virtual AcDbEntity *  | createEntity () const override
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry () override
virtual bool  | isEmpty () const override
virtual bool  | isValid () const override
AcDbVectorRef &  | operator= (const AcDbVectorRef &)
virtual void  | reset () override
void  | set (const AcGeVector3d &)
 const AcGeVector3d  | vector () const
virtual  | ~AcDbVectorRef ()
 Public Member Functions inherited from AcDbGeomRef
ACRX_DECLARE_MEMBERS (AcDbGeomRef)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbVectorRef::AcDbVectorRef  |  ( |   | )
explicit
Warning
Not implemented!
 AcDbVectorRef::AcDbVectorRef  |  ( |  const AcDbVectorRef &  |   | )
explicit
Warning
Not implemented!
 AcDbVectorRef::AcDbVectorRef  |  ( |  const AcGeVector3d &  |   | )
explicit
Warning
Not implemented!
 virtual AcDbVectorRef::~AcDbVectorRef  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbVectorRef::copyFrom  |  ( |  const AcRxObject *  |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 virtual AcDbEntity* AcDbVectorRef::createEntity  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 virtual Acad::ErrorStatus AcDbVectorRef::evaluateAndCacheGeometry  |  ( |   | )
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 virtual bool AcDbVectorRef::isEmpty  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 virtual bool AcDbVectorRef::isValid  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 AcDbVectorRef& AcDbVectorRef::operator=  |  ( |  const AcDbVectorRef &  |   | )
Warning
Not implemented!
 virtual void AcDbVectorRef::reset  |  ( |   | )
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 void AcDbVectorRef::set  |  ( |  const AcGeVector3d &  |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbGeomRef.h