Public Types | Public Member Functions | List of all members
AcPlPlotConfigManager Class Reference
AcPl Classes
 Public Types
enum  | RefreshCode {
 kAll, kRefreshDevicesList, kRefreshStyleList, kRefreshSystemDevicesList,
 kRefreshPC3DevicesList
 }
enum  | StdConfigs {
 kNoneDevice, kDefaultWindowsSysPrinter, kDWF6ePlot, kDWFePlotOptForPlotting,
 kDWFePlotOptForViewing, kPublishToWebDWF, kPublishToWebJPG, kPublishToWebPNG,
 kDWFxePlot, kPublishToWebDWFx, kPDFePlot, kPDFePlotGeneralDocs,
 kPDFePlotHighQuality, kPDFePlotSmallerFile, kPDFePlotWebMobile, kSVFePlot
 }
enum  | StyTypes {
 kUndefined = 0, kRegular = 0x01, kTranslation = 0x02, kColorDep = 0x04,
 kAllTypes = 0x07
 }
 Public Member Functions
 virtual HT_Error_Handler *  | acadErrorHandler ()
virtual HT_Error_Handler *  | errorHandler ()
 virtual Acad::ErrorStatus  | getCurrentConfig (AcPlPlotConfig *&pConfig)
 virtual bool  | getDevicesList (AcArray< AcPlPlotConfigInfo, AcArrayObjectCopyReallocator< AcPlPlotConfigInfo > > &deviceList)
 virtual const ACHAR *  | getStdConfigName (StdConfigs stdConfig)
 virtual bool  | getStyleList (AcArray< ACHAR * > &list, long styType=kAllTypes)
 virtual void  | refreshList (RefreshCode refreshCode=kAll)
 virtual Acad::ErrorStatus  | setCurrentConfig (AcPlPlotConfig *&pConfig, const ACHAR *pDeviceName)
virtual HT_Thin_Plot_Config_Manager *  | thinPltCfgMgr ()
Member Function Documentation
 virtual HT_Error_Handler* AcPlPlotConfigManager::errorHandler  |  ( |   | )
virtual
Warning
Not implemented!
 virtual HT_Thin_Plot_Config_Manager* AcPlPlotConfigManager::thinPltCfgMgr  |  ( |   | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acplplotconfigmgr.h