Public Member Functions | List of all members
AcGiRenderEnvironmentTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiRenderEnvironmentTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiRenderEnvironmentTraits)
 virtual bool  | enable (void) const =0
 virtual AcGiMaterialTexture *  | environmentMap (void) const =0
 virtual double  | farDistance (void) const =0
 virtual double  | farPercentage (void) const =0
 virtual AcCmEntityColor  | fogColor (void) const =0
 virtual bool  | isBackground (void) const =0
 virtual double  | nearDistance (void) const =0
 virtual double  | nearPercentage (void) const =0
 virtual void  | setEnable (const bool bEnable)=0
 virtual void  | setEnvironmentMap (const AcGiMaterialTexture *map)=0
 virtual void  | setFarDistance (const double farDist)=0
 virtual void  | setFarPercentage (const double farPct)=0
 virtual void  | setFogColor (const AcCmEntityColor &color)=0
 virtual void  | setIsBackground (const bool bEnable)=0
 virtual void  | setNearDistance (const double nearDist)=0
 virtual void  | setNearPercentage (const double nearPct)=0
 The documentation for this class was generated from the following file:
AcGiEnvironment.h