Public Member Functions | Friends | List of all members
AcDbAssocArrayItem Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocArrayItem:
 Public Member Functions
AcDbAssocArrayItem ()
AcDbAssocArrayItem (AcDbItemLocator &locator, const AcGeMatrix3d &transform)
ACRX_DECLARE_MEMBERS (AcDbAssocArrayItem)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other) override
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
const AcDbObjectId &  | entityProvider () const
Acad::ErrorStatus  | getTransform (AcGeMatrix3d &transform, bool bCompounded=true) const
bool  | hasRelativeTransform () const
bool  | isErased () const
const AcDbItemLocator &  | locator () const
Acad::ErrorStatus  | setDefaultTransform (const AcGeMatrix3d &transform)
void  | setEntityProvider (AcDbObjectId provider)
Acad::ErrorStatus  | setErased (bool bErased)
Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &transform)
virtual  | ~AcDbAssocArrayItem ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpAssocArrayItem
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbAssocArrayItem::AcDbAssocArrayItem  |  ( |   | )
Warning
Not implemented!
 AcDbAssocArrayItem::AcDbAssocArrayItem  |  ( |  AcDbItemLocator &  |  locator,
|  const AcGeMatrix3d &  |  transform
)
Warning
Not implemented!
 virtual AcDbAssocArrayItem::~AcDbAssocArrayItem  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbAssocArrayItem::copyFrom  |  ( |  const AcRxObject *  |  other | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 virtual Acad::ErrorStatus AcDbAssocArrayItem::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocArrayItem::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocArrayItem::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocArrayItem::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
 const AcDbObjectId& AcDbAssocArrayItem::entityProvider  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayItem::getTransform  |  ( |  AcGeMatrix3d &  |  transform,
|  bool  |  bCompounded = true
) |   |  const
Warning
Not implemented!
 bool AcDbAssocArrayItem::hasRelativeTransform  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbAssocArrayItem::isErased  |  ( |   | ) |   const
Warning
Not implemented!
 const AcDbItemLocator& AcDbAssocArrayItem::locator  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayItem::setDefaultTransform  |  ( |  const AcGeMatrix3d &  |  transform | )
Warning
Not implemented!
 void AcDbAssocArrayItem::setEntityProvider  |  ( |  AcDbObjectId  |  provider | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayItem::setErased  |  ( |  bool  |  bErased | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayItem::transformBy  |  ( |  const AcGeMatrix3d &  |  transform | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocArrayItem.h