Public Member Functions | List of all members
AcGePointOnCurve3d Class Reference
AcGe Classes
  Inheritance diagram for AcGePointOnCurve3d:
 Public Member Functions
AcGePointOnCurve3d (const AcGeCurve3d &crv)
AcGePointOnCurve3d (const AcGeCurve3d &crv, double param)
AcGePointOnCurve3d (const AcGePointOnCurve3d &src)
 Adesk::Boolean  | curvature (double &res)
 Adesk::Boolean  | curvature (double param, double &res)
 const AcGeCurve3d *  | curve () const
 AcGeVector3d  | deriv (int order) const
 AcGeVector3d  | deriv (int order, double param)
 AcGeVector3d  | deriv (int order, const AcGeCurve3d &crv, double param)
 Adesk::Boolean  | isSingular (const AcGeTol &tol=AcGeContext::gTol) const
 AcGePointOnCurve3d &  | operator= (const AcGePointOnCurve3d &src)
 double  | parameter () const
 AcGePoint3d  | point () const
 AcGePoint3d  | point (double param)
 AcGePoint3d  | point (const AcGeCurve3d &crv, double param)
 AcGePointOnCurve3d &  | setCurve (const AcGeCurve3d &crv)
 AcGePointOnCurve3d &  | setParameter (double param)
 Public Member Functions inherited from AcGePointEnt3d
operator AcGePoint3d () const
 AcGePointEnt3d &  | operator= (const AcGePointEnt3d &pnt)
 AcGePoint3d  | point3d () const
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGePointEnt3d
AcGePointEnt3d (const AcGePointEnt3d &)
 Protected Member Functions inherited from AcGeEntity3d
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 class AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
geponc3d.h