Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcDbTextEditorSelection Class Reference
AcDb Classes
  Inheritance diagram for AcDbTextEditorSelection:
 Public Member Functions
ACDBCORE2D_PORT bool  | canChangeCase () const
ACDBCORE2D_PORT bool  | canStack () const
ACDBCORE2D_PORT bool  | canUnStack () const
ACDBCORE2D_PORT bool  | changeToLowercase ()
ACDBCORE2D_PORT bool  | changeToUppercase ()
ACDBCORE2D_PORT Acad::ErrorStatus  | combineParagraphs ()
ACDBCORE2D_PORT Acad::ErrorStatus  | convertToPlainText ()
ACDBCORE2D_PORT AcDbField *  | field () const
ACDBCORE2D_PORT bool  | fontSupported (const AcString &fontname, bool bTrueType) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getSelectionText (AcString &txt) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getStack (AcDbTextEditorStack &stack) const
ACDBCORE2D_PORT bool  | languageSupported (Charset charset) const
ACDBCORE2D_PORT void  | paragraph (AcArray< AcDbTextEditorParagraph * > &paragraphs)
ACDBCORE2D_PORT Acad::ErrorStatus  | removeAllFormatting ()
ACDBCORE2D_PORT Acad::ErrorStatus  | removeCharacterFormatting ()
ACDBCORE2D_PORT Acad::ErrorStatus  | removeParagraphFormatting ()
ACDBCORE2D_PORT Acad::ErrorStatus  | setStack (const AcDbTextEditorStack &stack)
ACDBCORE2D_PORT bool  | singleFieldSelected () const
ACDBCORE2D_PORT bool  | singleStackSelected () const
ACDBCORE2D_PORT Acad::ErrorStatus  | stack ()
ACDBCORE2D_PORT Acad::ErrorStatus  | unStack ()
ACDBCORE2D_PORT Acad::ErrorStatus  | updateField ()
 Public Member Functions inherited from AcDbTextEditorSelectionBase
ACDBCORE2D_PORT bool  | bold () const
ACDBCORE2D_PORT AcCmColor  | color () const
ACDBCORE2D_PORT FlowAlign  | flowAlign () const
ACDBCORE2D_PORT AcString  | font () const
ACDBCORE2D_PORT double  | height () const
ACDBCORE2D_PORT Acad::ErrorStatus  | inputSpecialChar (Adesk::UInt32 c)
ACDBCORE2D_PORT Acad::ErrorStatus  | insertColumnBreak ()
ACDBCORE2D_PORT Acad::ErrorStatus  | insertImportedText (InsertTextType insertType, void *pData)
ACDBCORE2D_PORT Acad::ErrorStatus  | insertString (const AcString &str)
ACDBCORE2D_PORT Acad::ErrorStatus  | insertSymbol (ACHAR wch, Charset charset)
ACDBCORE2D_PORT bool  | isTrueType () const
ACDBCORE2D_PORT bool  | italic () const
ACDBCORE2D_PORT Charset  | language () const
ACDBCORE2D_PORT double  | obliqueAngle () const
ACDBCORE2D_PORT bool  | overline () const
ACDBCORE2D_PORT Acad::ErrorStatus  | setColor (const AcCmColor &color)
ACDBCORE2D_PORT Acad::ErrorStatus  | setFlowAlign (FlowAlign flowAlign)
ACDBCORE2D_PORT Acad::ErrorStatus  | setFont (const AcString &fontname, bool bTrueType)
ACDBCORE2D_PORT Acad::ErrorStatus  | setHeight (double height)
ACDBCORE2D_PORT Acad::ErrorStatus  | setLanguage (Charset charset)
ACDBCORE2D_PORT Acad::ErrorStatus  | setObliqueAngle (double angle)
ACDBCORE2D_PORT Acad::ErrorStatus  | setTrackingFactor (double factor)
ACDBCORE2D_PORT Acad::ErrorStatus  | setWidthScale (double scale)
ACDBCORE2D_PORT bool  | strikethrough () const
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleBold ()
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleItalic ()
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleOverline ()
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleStrikethrough ()
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleUnderline ()
ACDBCORE2D_PORT double  | trackingFactor () const
ACDBCORE2D_PORT bool  | underline () const
ACDBCORE2D_PORT double  | widthScale () const
 Protected Member Functions
ACDBCORE2D_PORT  | AcDbTextEditorSelection (const TextEditor *pImp)
AcDbTextEditorSelection (const AcDbTextEditorSelection &)
AcDbTextEditorSelection &  | operator= (const AcDbTextEditorSelection &)
ACDBCORE2D_PORT  | ~AcDbTextEditorSelection ()
 Protected Member Functions inherited from AcDbTextEditorSelectionBase
AcDbTextEditorSelectionBase ()
AcDbTextEditorSelectionBase (const AcDbTextEditorSelectionBase &)
AcDbTextEditorSelectionBase &  | operator= (const AcDbTextEditorSelectionBase &)
virtual  | ~AcDbTextEditorSelectionBase ()
 Protected Attributes
 AcDbImpTextEditorSelection *  | m_pImpSelection
 Protected Attributes inherited from AcDbTextEditorSelectionBase
 AcDbImpTextEditorSelectionBase *  | m_pImp
 Friends
 class  | TextEditor
 Additional Inherited Members
 Public Types inherited from AcDbTextEditorSelectionBase
enum  | FlowAlign { kFlowBase, kFlowCenter, kFlowTop }
enum  | InsertTextType {
 kUnicodeMTextFormat, kMTextFormat, kRichTextFormat, kUnicodeDTextFormat,
 kDTextFormat, kUnicodeTextFormat, kMultibyteTextFormat
 }
 Static Public Member Functions inherited from AcDbTextEditorSelectionBase
static ACDBCORE2D_PORT double  | maxObliqueAngle ()
static ACDBCORE2D_PORT double  | maxTrackingFactor ()
static ACDBCORE2D_PORT double  | maxWidthScale ()
static ACDBCORE2D_PORT double  | minObliqueAngle ()
static ACDBCORE2D_PORT double  | minTrackingFactor ()
static ACDBCORE2D_PORT double  | minWidthScale ()
Constructor & Destructor Documentation
 ACDBCORE2D_PORT AcDbTextEditorSelection::AcDbTextEditorSelection  |  ( |  const TextEditor *  |  pImp | )
protected
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbTextEditorSelection::~AcDbTextEditorSelection  |  ( |   | )
protected
Warning
Not implemented!
 AcDbTextEditorSelection::AcDbTextEditorSelection  |  ( |  const AcDbTextEditorSelection &  |   | )
protected
Warning
Not implemented!
Member Function Documentation
 ACDBCORE2D_PORT bool AcDbTextEditorSelection::canChangeCase  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelection::canStack  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelection::canUnStack  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelection::changeToLowercase  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelection::changeToUppercase  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelection::combineParagraphs  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelection::convertToPlainText  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbField* AcDbTextEditorSelection::field  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelection::fontSupported  |  ( |  const AcString &  |  fontname,
|  bool  |  bTrueType
) |   |  const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelection::getSelectionText  |  ( |  AcString &  |  txt | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelection::getStack  |  ( |  AcDbTextEditorStack &  |  stack | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelection::languageSupported  |  ( |  Charset  |  charset | ) |   const
Warning
Not implemented!
 AcDbTextEditorSelection& AcDbTextEditorSelection::operator=  |  ( |  const AcDbTextEditorSelection &  |   | )
protected
Warning
Not implemented!
 ACDBCORE2D_PORT void AcDbTextEditorSelection::paragraph  |  ( |  AcArray< AcDbTextEditorParagraph * > &  |  paragraphs | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelection::removeAllFormatting  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelection::removeCharacterFormatting  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelection::removeParagraphFormatting  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelection::setStack  |  ( |  const AcDbTextEditorStack &  |  stack | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelection::singleFieldSelected  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelection::singleStackSelected  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelection::stack  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelection::unStack  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelection::updateField  |  ( |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbtexteditor.h