Public Member Functions | List of all members
AcDbCoordSystemRef Class Reference
AcDb Classes
  Inheritance diagram for AcDbCoordSystemRef:
 Public Member Functions
AcDbCoordSystemRef ()
AcDbCoordSystemRef (const AcDbCoordSystemRef &)
AcDbCoordSystemRef (const AcGeMatrix3d &)
AcDbCoordSystemRef (const AcDbCompoundObjectId &, const AcGeMatrix3d &)
AcDbCoordSystemRef (const AcArray< AcDbSubentRef * > &)
ACRX_DECLARE_MEMBERS (AcDbCoordSystemRef)
 const AcGeMatrix3d &  | coordSystem () const
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *) override
 virtual AcDbEntity *  | createEntity () const override
 const AcDbCompoundObjectId &  | entityId () const
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry () override
virtual bool  | isEmpty () const override
virtual bool  | isValid () const override
AcDbCoordSystemRef &  | operator= (const AcDbCoordSystemRef &)
virtual void  | reset () override
void  | set (const AcGeMatrix3d &)
void  | set (const AcDbCompoundObjectId &)
void  | set (const AcArray< AcDbSubentRef * > &)
 const AcArray< AcDbSubentRef * > &  | subentRefs () const
virtual  | ~AcDbCoordSystemRef ()
 Public Member Functions inherited from AcDbGeomRef
ACRX_DECLARE_MEMBERS (AcDbGeomRef)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbCoordSystemRef::AcDbCoordSystemRef  |  ( |   | )
explicit
Warning
Not implemented!
 AcDbCoordSystemRef::AcDbCoordSystemRef  |  ( |  const AcDbCoordSystemRef &  |   | )
explicit
Warning
Not implemented!
 AcDbCoordSystemRef::AcDbCoordSystemRef  |  ( |  const AcGeMatrix3d &  |   | )
explicit
Warning
Not implemented!
 AcDbCoordSystemRef::AcDbCoordSystemRef  |  ( |  const AcDbCompoundObjectId &  |  ,
|  const AcGeMatrix3d &
)
explicit
Warning
Not implemented!
 AcDbCoordSystemRef::AcDbCoordSystemRef  |  ( |  const AcArray< AcDbSubentRef * > &  |   | )
explicit
Warning
Not implemented!
 virtual AcDbCoordSystemRef::~AcDbCoordSystemRef  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbCoordSystemRef::copyFrom  |  ( |  const AcRxObject *  |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 virtual Acad::ErrorStatus AcDbCoordSystemRef::evaluateAndCacheGeometry  |  ( |   | )
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 virtual bool AcDbCoordSystemRef::isEmpty  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 virtual bool AcDbCoordSystemRef::isValid  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 AcDbCoordSystemRef& AcDbCoordSystemRef::operator=  |  ( |  const AcDbCoordSystemRef &  |   | )
Warning
Not implemented!
 virtual void AcDbCoordSystemRef::reset  |  ( |   | )
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 void AcDbCoordSystemRef::set  |  ( |  const AcGeMatrix3d &  |   | )
Warning
Not implemented!
 void AcDbCoordSystemRef::set  |  ( |  const AcDbCompoundObjectId &  |   | )
Warning
Not implemented!
 void AcDbCoordSystemRef::set  |  ( |  const AcArray< AcDbSubentRef * > &  |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbGeomRef.h