Public Member Functions | List of all members
AcGiViewport Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiViewport:
 Public Member Functions
 virtual Adesk::Int16  | acadWindowId () const =0
ACRX_DECLARE_MEMBERS (AcGiViewport)
 virtual const AcGiContextualColors *  | contextualColors () const
 virtual Adesk::Boolean  | doInversePerspective (AcGePoint3d &) const =0
 virtual Adesk::Boolean  | doPerspective (AcGePoint3d &) const =0
 virtual void  | getCameraLocation (AcGePoint3d &location) const =0
 virtual void  | getCameraTarget (AcGePoint3d &target) const =0
 virtual void  | getCameraUpVector (AcGeVector3d &upVector) const =0
 virtual void  | getEyeToModelTransform (AcGeMatrix3d &) const =0
 virtual void  | getEyeToWorldTransform (AcGeMatrix3d &) const =0
 virtual Adesk::Boolean  | getFrontAndBackClipValues (Adesk::Boolean &clip_front, Adesk::Boolean &clip_back, double &front, double &back) const =0
 virtual void  | getModelToEyeTransform (AcGeMatrix3d &) const =0
 virtual void  | getNumPixelsInUnitSquare (const AcGePoint3d &givenWorldpt, AcGePoint2d &pixelArea, bool includePerspective=true) const =0
 virtual void  | getViewportDcCorners (AcGePoint2d &lower_left, AcGePoint2d &upper_right) const =0
 virtual void  | getWorldToEyeTransform (AcGeMatrix3d &) const =0
 virtual Adesk::Boolean  | isPerspective () const =0
 virtual Adesk::Boolean  | layerVisible (const AcDbObjectId &) const
 virtual double  | linetypeGenerationCriteria () const =0
 virtual double  | linetypeScaleMultiplier () const =0
 virtual AcGeVector3d  | viewDir () const
 virtual Adesk::ULongPtr  | viewportId () const =0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgi.h