Public Member Functions | List of all members
AcEdXrefFileLock Class Reference
AcEd Classes
 Public Member Functions
AcEdXrefFileLock ()
Acad::ErrorStatus  | consistencyCheck (int &retstatus, const AcDbObjectId &selectedBTRid, AcDbObjectIdArray &outofSyncBTRids)
Acad::ErrorStatus  | consistencyCheck (int &retstatus, const AcDbObjectId &selectedBTRid)
Acad::ErrorStatus  | consistencyChecklocal (int &retstatus, const AcDbObjectId &selectedBTRid)
AcDbObjectId  | getLockBtrId () const
int  | getlockxloadctlType () const
const AcDbObjectIdArray &  | getoutofSyncIdArray () const
Acad::ErrorStatus  | lockFile (int &retstatus, const AcDbObjectId &selectedBTRid)
Acad::ErrorStatus  | releaseFile (int &retstatus, bool bSkipSaveback=false, bool bReload=true)
Acad::ErrorStatus  | reloadFile (int &retstatus, const AcDbObjectIdArray &BTRids, const int xldctltype=-1)
Acad::ErrorStatus  | reloadFile (int &retstatus, const int xldctltype=-1)
void  | setInternalTNmgmt (bool bTNmgmt)
Acad::ErrorStatus  | xloadctlType (int &retstatus, const AcDbObjectId &selectedBTRid)
~AcEdXrefFileLock ()
Constructor & Destructor Documentation
 AcEdXrefFileLock::AcEdXrefFileLock  |  ( |   | )
Warning
Not implemented!
 AcEdXrefFileLock::~AcEdXrefFileLock  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 Acad::ErrorStatus AcEdXrefFileLock::consistencyCheck  |  ( |  int &  |  retstatus,
|  const AcDbObjectId &  |  selectedBTRid,
|  AcDbObjectIdArray &  |  outofSyncBTRids
)
Warning
Not implemented!
 Acad::ErrorStatus AcEdXrefFileLock::consistencyCheck  |  ( |  int &  |  retstatus,
|  const AcDbObjectId &  |  selectedBTRid
)
Warning
Not implemented!
 Acad::ErrorStatus AcEdXrefFileLock::consistencyChecklocal  |  ( |  int &  |  retstatus,
|  const AcDbObjectId &  |  selectedBTRid
)
Warning
Not implemented!
 AcDbObjectId AcEdXrefFileLock::getLockBtrId  |  ( |   | ) |   const
inline
Warning
Not implemented!
 int AcEdXrefFileLock::getlockxloadctlType  |  ( |   | ) |   const
inline
Warning
Not implemented!
 const AcDbObjectIdArray& AcEdXrefFileLock::getoutofSyncIdArray  |  ( |   | ) |   const
inline
Warning
Not implemented!
 Acad::ErrorStatus AcEdXrefFileLock::lockFile  |  ( |  int &  |  retstatus,
|  const AcDbObjectId &  |  selectedBTRid
)
Warning
Not implemented!
 Acad::ErrorStatus AcEdXrefFileLock::releaseFile  |  ( |  int &  |  retstatus,
|  bool  |  bSkipSaveback = false,
|  bool  |  bReload = true
)
Warning
Not implemented!
 Acad::ErrorStatus AcEdXrefFileLock::reloadFile  |  ( |  int &  |  retstatus,
|  const AcDbObjectIdArray &  |  BTRids,
|  const int  |  xldctltype = -1
)
Warning
Not implemented!
 Acad::ErrorStatus AcEdXrefFileLock::reloadFile  |  ( |  int &  |  retstatus,
|  const int  |  xldctltype = -1
)
Warning
Not implemented!
 void AcEdXrefFileLock::setInternalTNmgmt  |  ( |  bool  |  bTNmgmt | )
Warning
Not implemented!
 Acad::ErrorStatus AcEdXrefFileLock::xloadctlType  |  ( |  int &  |  retstatus,
|  const AcDbObjectId &  |  selectedBTRid
)
Warning
Not implemented!
 The documentation for this class was generated from the following file:
xreflock.h