Public Types | Public Member Functions | Protected Member Functions | List of all members
AcDbHatch Class Reference
AcDb Classes
  Inheritance diagram for AcDbHatch:
 Public Types
enum  | GradientPatternType { kPreDefinedGradient = 0, kUserDefinedGradient = 1 }
enum  | HatchEdgeType { kLine = 1, kCirArc = 2, kEllArc = 3, kSpline = 4 }
enum  | HatchLoopType {
 kDefault = 0, kExternal = 1, kPolyline = 2, kDerived = 4,
 kTextbox = 8, kOutermost = 0x10, kNotClosed = 0x20, kSelfIntersecting = 0x40,
 kTextIsland = 0x80, kDuplicate = 0x100, kIsAnnotative = 0x200, kDoesNotSupportScale = 0x400,
 kForceAnnoAllVisible = 0x800, kOrientToPaper = 0x1000, kIsAnnotativeBlock = 0x2000
 }
enum  | HatchObjectType { kHatchObject = 0, kGradientObject = 1 }
enum  | HatchPatternType { kUserDefined = 0, kPreDefined = 1, kCustomDefined = 2 }
enum  | HatchStyle { kNormal = 0, kOuter = 1, kIgnore = 2 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbHatch)
 Acad::ErrorStatus  | appendLoop (Adesk::Int32 loopType, const AcGeVoidPointerArray &edgePtrs, const AcGeIntArray &edgeTypes)
 Acad::ErrorStatus  | appendLoop (Adesk::Int32 loopType, const AcGePoint2dArray &vertices, const AcGeDoubleArray &bulges)
 Acad::ErrorStatus  | appendLoop (Adesk::Int32 loopType, const AcDbObjectIdArray &dbObjIds)
 bool  | associative () const
 AcCmColor  | backgroundColor () const
 double  | elevation () const
 Acad::ErrorStatus  | evaluateGradientColorAt (float value, AcCmColor &color)
 Acad::ErrorStatus  | evaluateHatch (bool bUnderestimateNumLines=false)
Acad::ErrorStatus  | evaluateHatchAllScales (bool bUnderestimateNumLines=false)
 Acad::ErrorStatus  | getArea (double &a) const
 Acad::ErrorStatus  | getAssocObjIds (AcDbObjectIdArray &dbObjIds) const
 Acad::ErrorStatus  | getAssocObjIdsAt (int loopIndex, AcDbObjectIdArray &dbObjIds) const
 Acad::ErrorStatus  | getGradientColors (unsigned int &count, AcCmColor *&colors, float *&values)
 Adesk::Boolean  | getGradientOneColorMode () const
 Acad::ErrorStatus  | getHatchLineDataAt (int index, AcGePoint2d &startPt, AcGePoint2d &endPt) const
 Acad::ErrorStatus  | getHatchLinesData (AcGePoint2dArray &startPts, AcGePoint2dArray &endPts) const
 Acad::ErrorStatus  | getLoopAt (int loopIndex, Adesk::Int32 &loopType, AcGeVoidPointerArray &edgePtrs, AcGeIntArray &edgeTypes) const
 Acad::ErrorStatus  | getLoopAt (int loopIndex, Adesk::Int32 &loopType, AcGePoint2dArray &vertices, AcGeDoubleArray &bulges) const
 Acad::ErrorStatus  | getPatternDefinitionAt (int index, double &angle, double &baseX, double &baseY, double &offsetX, double &offsetY, AcGeDoubleArray &dashes) const
 virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const override
 AcDbRegion *  | getRegionArea () const
 float  | getShadeTintValue () const
 double  | gradientAngle () const
 const ACHAR *  | gradientName () const
 float  | gradientShift () const
 AcDbHatch::GradientPatternType  | gradientType () const
 AcDbHatch::HatchObjectType  | hatchObjectType () const
 AcDbHatch::HatchStyle  | hatchStyle () const
 Acad::ErrorStatus  | insertLoopAt (int loopIndex, Adesk::Int32 loopType, const AcGeVoidPointerArray &edgePtrs, const AcGeIntArray &edgeTypes)
 Acad::ErrorStatus  | insertLoopAt (int loopIndex, Adesk::Int32 loopType, const AcGePoint2dArray &vertices, const AcGeDoubleArray &bulges)
 Acad::ErrorStatus  | insertLoopAt (int loopIndex, Adesk::Int32 loopType, const AcDbObjectIdArray &dbObjIds)
 virtual Adesk::Boolean  | isGradient () const
 virtual Adesk::Boolean  | isHatch () const
 virtual Adesk::Boolean  | isPlanar () const override
 bool  | isSolidFill () const
 bool  | lineGenerationEnabled () const
 Adesk::Int32  | loopTypeAt (int loopIndex) const
 virtual void  | modifiedGraphics (const AcDbEntity *pObj) override
 AcGeVector3d  | normal () const
 int  | numHatchLines () const
 int  | numLoops () const
 int  | numPatternDefinitions () const
 AcGePoint2d  | originPoint () const
 double  | patternAngle () const
 bool  | patternDouble () const
 ACDBCORE2D_PORT const ACHAR(&  | patternName () const)[HATCH_PATTERN_NAME_LENGTH]
 double  | patternScale () const
 double  | patternSpace () const
 AcDbHatch::HatchPatternType  | patternType () const
 Acad::ErrorStatus  | removeAssocObjIds ()
 void  | removeHatchLines ()
 Acad::ErrorStatus  | removeLoopAt (int loopIndex)
 Acad::ErrorStatus  | setAssociative (bool isAssociative)
 Acad::ErrorStatus  | setBackgroundColor (const AcCmColor &color)
 Acad::ErrorStatus  | setElevation (double elevation)
 Acad::ErrorStatus  | setGradient (AcDbHatch::GradientPatternType gradType, const ACHAR *gradName)
 Acad::ErrorStatus  | setGradientAngle (double angle)
 Acad::ErrorStatus  | setGradientColors (unsigned int count, AcCmColor *colors, float *values)
 Acad::ErrorStatus  | setGradientOneColorMode (Adesk::Boolean oneColorMode)
 Acad::ErrorStatus  | setGradientShift (float shiftValue)
 Acad::ErrorStatus  | setHatchObjectType (AcDbHatch::HatchObjectType type)
 Acad::ErrorStatus  | setHatchStyle (AcDbHatch::HatchStyle hstyle)
 bool  | setLineGenerationEnabled (bool bEnable)
 Acad::ErrorStatus  | setNormal (const AcGeVector3d &normal)
 Acad::ErrorStatus  | setOriginPoint (const AcGePoint2d &pt)
 Acad::ErrorStatus  | setPattern (AcDbHatch::HatchPatternType patType, const ACHAR *patName)
 Acad::ErrorStatus  | setPatternAngle (double angle)
 Acad::ErrorStatus  | setPatternDouble (bool isDouble)
 Acad::ErrorStatus  | setPatternScale (double scale)
 Acad::ErrorStatus  | setPatternSpace (double space)
 Acad::ErrorStatus  | setShadeTintValue (float value)
 Acad::ErrorStatus  | setShadeTintValueAndColor2 (float value)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false) override
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap) override
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths) ADESK_SEALED
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj) override
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo) override
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual bool  | bounds (AcDbExtents &bounds) const override
 virtual bool  | castShadows () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | cloneMeForDragging () ADESK_SEALED
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths) ADESK_SEALED
 virtual void  | dragStatus (const AcDb::DragStat status)
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable () override
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) override
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const override
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) override
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const override
 AcCmEntityColor  | entityColor () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const ADESK_SEALED
 virtual void  | getEcs (AcGeMatrix3d &retVal) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const ADESK_SEALED
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const ADESK_SEALED
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=nullptr) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | gripStatus (const AcDb::GripStat status) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL bool  | hideMeForDragging () const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const ADESK_SEALED
AcGiHighlightStyle  | highlightState (const AcDbFullSubentPath &subId)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const ADESK_SEALED
ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL bool  | isContentSnappable () const ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | layer (AcString &sName) const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACDBCORE2D_PORT Acad::ErrorStatus  | linetype (AcString &sName) const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | list () const ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | material (AcString &sName) const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset) ADESK_SEALED
 ACDBCORE2D_PORT Acad::ErrorStatus  | plotStyleName (AcString &sName) const
 ACHAR *  | plotStyleName () const
Acad::ErrorStatus  | popHighlight (const AcDbFullSubentPath &subId)
Acad::ErrorStatus  | pushHighlight (const AcDbFullSubentPath &subId, AcGiHighlightStyle highlightStyle)
 virtual bool  | receiveShadows () const
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st)
 virtual void  | setCastShadows (bool newVal)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | setColor (const AcCmColor &color, bool doSubents, AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, bool doSubents=true) final
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual void  | setReceiveShadows (bool newVal)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true) ADESK_SEALED
 virtual Acad::ErrorStatus  | setVisualStyle (AcDbObjectId visualStyleId, VisualStyleType vsType=kFullVisualStyle, Adesk::Boolean doSubents=true)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL AcDbEntity *  | subentPtr (const AcDbFullSubentPath &id) const ADESK_SEALED
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform) ADESK_SEALED
 AcCmTransparency  | transparency () const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const ADESK_SEALED
 AcDb::Visibility  | visibility () const
AcDbObjectId  | visualStyleId (VisualStyleType vsType=kFullVisualStyle) const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const override
 Protected Member Functions inherited from AcDbEntity
AcDbEntity (const AcDbEntity &)=delete
 AcDbEntity &  | operator= (const AcDbEntity &)=delete
 virtual Acad::ErrorStatus  | subAddSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Adesk::Boolean  | subCloneMeForDragging ()
 virtual Acad::ErrorStatus  | subDeleteSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual Acad::ErrorStatus  | subExplode (AcDbVoidPtrArray &entitySet) const
 virtual Acad::ErrorStatus  | subGetCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual Acad::ErrorStatus  | subGetGeomExtents (AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | subGetGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | subGetGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | subGetGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | subGetGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | subGetGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const
 virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
virtual Acad::ErrorStatus  | subGetOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | subGetStretchPoints (AcGePoint3dArray &stretchPoints) const
 virtual Acad::ErrorStatus  | subGetSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | subGetSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | subGetSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=nullptr) const
 virtual Acad::ErrorStatus  | subGetTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const
 virtual void  | subGripStatus (const AcDb::GripStat status)
 virtual bool  | subHideMeForDragging () const
 virtual Acad::ErrorStatus  | subHighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
virtual ACDBCORE2D_PORT AcGiHighlightStyle  | subHighlightState (const AcDbFullSubentPath &subId)
 virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | subIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
virtual bool  | subIsContentSnappable () const
 virtual void  | subList () const
 virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual Acad::ErrorStatus  | subMoveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | subMoveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | subMoveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subPopHighlight (const AcDbFullSubentPath &subId)
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subPushHighlight (const AcDbFullSubentPath &subId, AcGiHighlightStyle highlightStyle)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | subSetVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subSubentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual AcDbEntity *  | subSubentPtr (const AcDbFullSubentPath &id) const
 virtual Acad::ErrorStatus  | subTransformBy (const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | subTransformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | subUnhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual ACDBCORE2D_PORT AcDb::Visibility  | subVisibility () const
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
Member Function Documentation
 Acad::ErrorStatus AcDbHatch::evaluateHatchAllScales  |  ( |  bool  |  bUnderestimateNumLines = false | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbhatch.h