Public Types | Public Member Functions | List of all members
AcPlPlotProgressDialog Class Referenceabstract
AcPl Classes
  Inheritance diagram for AcPlPlotProgressDialog:
 Public Types
enum  | PlotMSGIndex {
 kDialogTitle, kSheetName, kSheetNameToolTip, kStatus,
 kSheetProgressCaption, kSheetSetProgressCaption, kMsgCancelling, kMsgCancellingCurrent,
 kCancelSheetBtnMsg, kCancelJobBtnMsg, kMsgCount
 }
 Public Types inherited from AcPlPlotProgress
enum  | PlotCancelStatus { kPlotContinue, kPlotCanceledByCaller, kPlotCanceledByCancelAllButton, kPlotCancelStatusCount }
enum  | SheetCancelStatus {
 kSheetContinue, kSheetCanceledByCancelButton, kSheetCanceledByCancelAllButton, kSheetCanceledByCaller,
 kSheetCancelStatusCount
 }
 Public Member Functions
 virtual void  | destroy ()=0
 virtual bool  | getPlotMsgString (PlotMSGIndex index, ACHAR *&pMsg) const =0
 virtual bool  | isSingleSheetPlot () const =0
 virtual bool  | onBeginPlot ()=0
 virtual bool  | onBeginSheet ()=0
 virtual bool  | onEndPlot ()=0
 virtual bool  | onEndSheet ()=0
 virtual bool  | setPlotMsgString (PlotMSGIndex index, const ACHAR *pMsg)=0
 Public Member Functions inherited from AcPlPlotProgress
 virtual void  | getPlotProgressRange (int &nLower, int &nUpper) const =0
 virtual void  | getSheetProgressRange (int &nLower, int &nUpper) const =0
 virtual bool  | getStatusMsgString (ACHAR *&pMsg) const =0
 virtual void  | heartbeat (void)=0
 virtual bool  | isPlotCancelled () const =0
 virtual bool  | isSheetCancelled () const =0
 virtual bool  | isVisible () const =0
 virtual PlotCancelStatus  | plotCancelStatus () const =0
 virtual int  | plotProgressPos () const =0
 virtual bool  | setIsVisible (bool bVisible)=0
 virtual void  | setPlotCancelStatus (PlotCancelStatus Cancel)=0
 virtual void  | setPlotProgressPos (int nPos)=0
 virtual void  | setPlotProgressRange (int nLower, int nUpper)=0
 virtual void  | setSheetCancelStatus (SheetCancelStatus Cancel)=0
 virtual void  | setSheetProgressPos (int nPos)=0
 virtual void  | setSheetProgressRange (int nLower, int nUpper)=0
 virtual bool  | setStatusMsgString (const ACHAR *pMsg)=0
 virtual SheetCancelStatus  | sheetCancelStatus () const =0
 virtual int  | sheetProgressPos () const =0
 The documentation for this class was generated from the following file:
acplplotprogress.h