Public Types | Public Member Functions | Protected Attributes | List of all members
AcGiShadowParameters Class Reference
AcGi Classes
  Inheritance diagram for AcGiShadowParameters:
 Public Types
enum  | ExtendedLightShape {
 kLinear = 0, kRectangle, kDisk, kCylinder,
 kSphere
 }
enum  | ShadowType { kShadowsRayTraced = 0, kShadowMaps, kAreaSampled }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiShadowParameters)
 virtual double  | extendedLightLength () const
 virtual double  | extendedLightRadius () const
 virtual ExtendedLightShape  | extendedLightShape () const
 virtual double  | extendedLightWidth () const
 bool  | operator== (const AcGiShadowParameters &params) const
 virtual bool  | setExtendedLightLength (double length)
 virtual bool  | setExtendedLightRadius (double radius)
 virtual bool  | setExtendedLightShape (ExtendedLightShape shape)
 virtual bool  | setExtendedLightWidth (double width)
 virtual bool  | setShadowMapSize (Adesk::UInt16 sz)
 virtual bool  | setShadowMapSoftness (Adesk::UInt8 soft)
 virtual bool  | setShadowSamples (Adesk::UInt16 samples)
 virtual void  | setShadowsOn (bool on)
 virtual void  | setShadowType (ShadowType typ)
 virtual void  | setShapeVisibility (bool visible)
 virtual Adesk::UInt16  | shadowMapSize () const
 virtual Adesk::UInt8  | shadowMapSoftness () const
 virtual Adesk::UInt16  | shadowSamples () const
 virtual bool  | shadowsOn () const
 virtual ShadowType  | shadowType () const
 virtual bool  | shapeVisibility () const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Attributes
 bool  | mbShapeVisibility
 double  | mExtLightLength
 double  | mExtLightRadius
 ExtendedLightShape  | mExtLightShape
 double  | mExtLightWidth
 Adesk::UInt16  | mShadowMapSize
 Adesk::UInt8  | mShadowMapSoftness
 Adesk::UInt16  | mShadowSamples
 bool  | mShadowsOn
 ShadowType  | mShadowType
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
AcGiLightTraits.h