Public Member Functions | List of all members
AcAxPoint3d Class Reference
AcAx Classes
  Inheritance diagram for AcAxPoint3d:
 Public Member Functions
AcAxPoint3d (double x, double y, double z)
AcAxPoint3d (const AcGePoint3d &pt)
AcAxPoint3d (const AcGeVector3d &pt)
AcAxPoint3d (const VARIANT *var) throw (HRESULT)
AcAxPoint3d (const VARIANT &var) throw (HRESULT)
AcAxPoint3d (const SAFEARRAY *safeArrayPt) throw (HRESULT)
 SAFEARRAY *  | asSafeArrayPtr () const throw (HRESULT)
 VARIANT *  | asVariantPtr () const throw (HRESULT)
 AcAxPoint3d &  | operator= (const AcGePoint3d &pt)
 AcAxPoint3d &  | operator= (const AcGeVector3d &pt)
 AcAxPoint3d &  | operator= (const VARIANT *var) throw (HRESULT)
 AcAxPoint3d &  | operator= (const VARIANT &var) throw (HRESULT)
 AcAxPoint3d &  | operator= (const SAFEARRAY *safeArrayPt) throw (HRESULT)
 VARIANT &  | setVariant (VARIANT &var) const throw (HRESULT)
 VARIANT *  | setVariant (VARIANT *var) const throw (HRESULT)
 Public Member Functions inherited from AcGePoint3d
 GE_DLLEXPIMPORT  | AcGePoint3d (const AcGePoint3d &pnt)
 GE_DLLEXPIMPORT  | AcGePoint3d (double x, double y, double z)
 GE_DLLEXPIMPORT  | AcGePoint3d (const AcGePlanarEnt &pln, const AcGePoint2d &pnt2d)
 GE_DLLEXPIMPORT AcGeVector3d  | asVector () const
 GE_DLLEXPIMPORT AcGePoint2d  | convert2d (const AcGePlanarEnt &pln) const
 GE_DLLEXPIMPORT double  | distanceTo (const AcGePoint3d &pnt) const
 GE_DLLEXPIMPORT bool  | isEqualTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT AcGePoint3d &  | mirror (const AcGePlane &pln)
 GE_DLLEXPIMPORT bool  | operator!= (const AcGePoint3d &pnt) const
 GE_DLLEXPIMPORT AcGePoint3d  | operator* (double scl) const
 GE_DLLEXPIMPORT AcGePoint3d &  | operator*= (double scl)
 GE_DLLEXPIMPORT AcGePoint3d  | operator+ (const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT AcGePoint3d &  | operator+= (const AcGeVector3d &vec)
 GE_DLLEXPIMPORT AcGePoint3d  | operator- (const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT AcGeVector3d  | operator- (const AcGePoint3d &pnt) const
 GE_DLLEXPIMPORT AcGePoint3d &  | operator-= (const AcGeVector3d &vec)
 GE_DLLEXPIMPORT AcGePoint3d  | operator/ (double scl) const
 GE_DLLEXPIMPORT AcGePoint3d &  | operator/= (double scl)
 GE_DLLEXPIMPORT bool  | operator== (const AcGePoint3d &pnt) const
 GE_DLLEXPIMPORT double  | operator[] (unsigned int i) const
 GE_DLLEXPIMPORT double &  | operator[] (unsigned int idx)
 GE_DLLEXPIMPORT AcGePoint3d  | orthoProject (const AcGePlane &pln) const
 GE_DLLEXPIMPORT AcGePoint3d  | project (const AcGePlane &pln, const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT AcGePoint3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 GE_DLLEXPIMPORT AcGePoint3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 GE_DLLEXPIMPORT AcGePoint3d &  | set (double x, double y, double z)
 GE_DLLEXPIMPORT AcGePoint3d &  | set (const AcGePlanarEnt &pln, const AcGePoint2d &pnt)
 GE_DLLEXPIMPORT AcGePoint3d &  | setToProduct (const AcGeMatrix3d &mat, const AcGePoint3d &pnt)
 GE_DLLEXPIMPORT AcGePoint3d &  | setToSum (const AcGePoint3d &pnt, const AcGeVector3d &vec)
 GE_DLLEXPIMPORT AcGePoint3d &  | transformBy (const AcGeMatrix3d &leftSide)
 Additional Inherited Members
 Public Attributes inherited from AcGePoint3d
 double  | x
 double  | y
 double  | z
 Static Public Attributes inherited from AcGePoint3d
 static GE_DLLDATAEXIMP const AcGePoint3d  | kOrigin
 The documentation for this class was generated from the following file:
axpnt3d.h