Public Types | Public Member Functions | List of all members
AcPlHostAppServices Class Referenceabstract
AcPl Classes
 Public Types
enum  | PlotStatus {
 kSheetIdxAndName = -5, kDisableCancelSheet = -4, kDwfFilePlotted = -3, kPlottingMsg = -2,
 kNoPlotYet = -1, kPlotStart = 0, kViewPlotLog = 1, kPlotSuccessful = 2,
 kPlotHadErrors = 3, kPlotHadSystemError = 4, kViewPlottedFile = 5, kViewFileWhenSuccessful = 6
 }
 Public Member Functions
 virtual const AcadPlotInternalServices *  | acadInternalServices ()=0
 virtual AcPlPlotLogger *  | getPlotLogger (void)=0
 virtual void  | updatePlotJobStatus (enum AcPlHostAppServices::PlotStatus nStatus, const ACHAR *szPlotMsg)=0
 The documentation for this class was generated from the following file:
acplhostappservices.h