Public Member Functions | Static Public Member Functions | List of all members
AcRxResourceLoader Class Referenceabstract
AcRx Classes
  Inheritance diagram for AcRxResourceLoader:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxResourceLoader, ACBASE_PORT)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static ACBASE_PORT Acad::ErrorStatus  | loadString (const AcRxObject *pClass, unsigned int id, unsigned int sourceHint, AcString &result)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 static ACBASE_PORT Acad::ErrorStatus AcRxResourceLoader::loadString  |  ( |  const AcRxObject *  |  pClass,
|  unsigned int  |  id,
|  unsigned int  |  sourceHint,
|  AcString &  |  result
)
static
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxattrib.h