Public Member Functions | List of all members
AcRxDynamicLinker Class Referenceabstract
AcRx Classes
  Inheritance diagram for AcRxDynamicLinker:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcRxDynamicLinker)
 virtual void  | addReactor (AcRxDLinkerReactor *newReactor)=0
 virtual void *  | getSymbolAddress (const ACHAR *serviceName, const char *symbol) const =0
 virtual void *  | getSymbolAddress (const ACHAR *serviceName, const ACHAR *symbol) const =0
 virtual bool  | initListedModules (const ACHAR *fileName)=0
 virtual bool  | isAppBusy (const ACHAR *modulename) const =0
 virtual bool  | isApplicationLocked (const ACHAR *modulename) const =0
 virtual bool  | isAppMDIAware (const ACHAR *modulename) const =0
 virtual bool  | loadApp (const ACHAR *appName, AcadApp::LoadReasons al, bool printit, bool asCmd=false)=0
 virtual bool  | loadModule (const ACHAR *fileName, bool printit, bool asCmd=false)=0
 virtual bool  | lockApplication (void *appId) const =0
virtual AcLocale  | ProductLocale () const =0
virtual AcadApp::ErrorStatus  | registerApp (AcadApp::LoadReasons alr, const ACHAR *logicalName, void *entryPoint=nullptr)=0
 virtual bool  | registerAppMDIAware (void *appId) const =0
 virtual bool  | registerAppNotMDIAware (void *appId) const =0
 virtual AcRxObject *  | registerService (const ACHAR *serviceName, AcRxService *serviceObj)=0
 virtual void  | removeReactor (AcRxDLinkerReactor *oldReactor)=0
 virtual void  | setAppBusy (const ACHAR *modulename, bool bBusyFlag) const =0
 virtual bool  | unloadApp (const ACHAR *appName, bool asCmd=false)=0
 virtual bool  | unloadModule (const ACHAR *fileName, bool asCmd=false)=0
 virtual bool  | unlockApplication (void *appId) const =0
virtual AcadApp::ErrorStatus  | unregisterApp (const ACHAR *logicalName)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual AcLocale AcRxDynamicLinker::ProductLocale  |  ( |   | ) |   const
pure virtual
Warning
Not implemented!
 virtual AcadApp::ErrorStatus AcRxDynamicLinker::registerApp  |  ( |  AcadApp::LoadReasons  |  alr,
|  const ACHAR *  |  logicalName,
|  void *  |  entryPoint = nullptr
)
pure virtual
Warning
Not implemented!
 virtual AcadApp::ErrorStatus AcRxDynamicLinker::unregisterApp  |  ( |  const ACHAR *  |  logicalName | )
pure virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxdlinkr.h