Public Member Functions | List of all members
AcApStatusBar Class Referenceabstract
AcAp Classes
 Public Member Functions
 virtual int  | Add (AcPane *pPane, BOOL bUpdate=TRUE)=0
 virtual int  | Add (AcTrayItem *pTrayItem, BOOL bUpdate=TRUE)=0
 virtual SB_DEPRECATED BOOL  | ClientToScreen (LPPOINT lpPoint)=0
 virtual SB_DEPRECATED BOOL  | ClientToScreen (LPRECT lpRect)=0
 virtual BOOL  | CloseAllBubbleWindows (AcTrayItem *pTrayItem)=0
 virtual UINT  | DisplayContextMenu (CMenu &menu, CPoint point)=0
 virtual UINT  | DisplayPopupPaneMenu (AcPane *pPane, CMenu &menu)=0
 virtual SB_DEPRECATED AcPane *  | GetDefaultPane (AcDefaultPane nPane)=0
 virtual SB_DEPRECATED int  | GetID (AcPane *pPane) const =0
 virtual SB_DEPRECATED int  | GetID (AcTrayItem *pTrayItem) const =0
 virtual SB_DEPRECATED int  | GetID (int nIndex, BOOL bTrayItem=FALSE) const =0
 virtual int  | GetIndex (AcPane *pPane) const =0
 virtual int  | GetIndex (AcTrayItem *pTrayItem) const =0
 virtual int  | GetIndex (int nID, BOOL bTrayItem=FALSE) const =0
 virtual AcPane *  | GetPane (int nIndex)=0
 virtual int  | GetPaneCount () const =0
 virtual SB_DEPRECATED int  | GetTextWidth (const CString &strText) const =0
 virtual AcTrayItem *  | GetTrayItem (int nIndex)=0
 virtual int  | GetTrayItemCount () const =0
 virtual SB_DEPRECATED BOOL  | GetTraySettingsShowIcons () const =0
 virtual SB_DEPRECATED BOOL  | GetTraySettingsShowNotifications () const =0
 virtual BOOL  | Insert (int nIndex, AcPane *pPane, BOOL bUpdate=TRUE)=0
 virtual BOOL  | Insert (int nIndex, AcTrayItem *pTrayItem, BOOL bUpdate=TRUE)=0
 virtual BOOL  | Remove (AcPane *pPane, BOOL bUpdate=TRUE)=0
 virtual BOOL  | Remove (AcTrayItem *pTrayItem, BOOL bUpdate=TRUE)=0
 virtual BOOL  | Remove (int nIndex, BOOL bTrayItem=FALSE, BOOL bUpdate=TRUE)=0
 virtual BOOL  | RemoveAllPanes (BOOL bUpdate=TRUE)=0
 virtual BOOL  | RemoveAllTrayIcons (BOOL bUpdate=TRUE)=0
 virtual SB_DEPRECATED BOOL  | RemoveCleanScreenIcon ()=0
 virtual SB_DEPRECATED BOOL  | RemoveDefaultPane (AcDefaultPane nPane, BOOL bUpdate=TRUE)=0
 virtual SB_DEPRECATED BOOL  | ScreenToClient (LPPOINT lpPoint)=0
 virtual SB_DEPRECATED BOOL  | ScreenToClient (LPRECT lpRect)=0
 virtual SB_DEPRECATED BOOL  | SetStatusBarMenuItem (AcPane *pPane)=0
 virtual SB_DEPRECATED void  | ShowCleanScreenIcon (BOOL bShow)=0
 virtual SB_DEPRECATED void  | ShowStatusBarMenuIcon (BOOL bShow)=0
 virtual SB_DEPRECATED BOOL  | ShowTraySettingsDialog ()=0
 virtual SB_DEPRECATED void  | Update ()=0
 The documentation for this class was generated from the following file:
acStatusBar.h