Public Member Functions | List of all members
OPMPerInstancePropertyExtensionFactory Class Referenceabstract
OPM Classes
  Inheritance diagram for OPMPerInstancePropertyExtensionFactory:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (OPMPerInstancePropertyExtensionFactory, ACDB_PORT)
 virtual OPMPerInstancePropertyExtension *  | CreateOPMPerInstancePropertyExtension (AcRxClass *pClass)=0
virtual  | ~OPMPerInstancePropertyExtensionFactory ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 virtual OPMPerInstancePropertyExtensionFactory::~OPMPerInstancePropertyExtensionFactory  |  ( |   | )
inlinevirtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dynprops.h