Public Member Functions | List of all members
AcPublishUIReactor2 Class Reference
AcPublish Classes
  Inheritance diagram for AcPublishUIReactor2:
 Public Member Functions
 virtual void  | PersistenceRegistryForPubishOptionsDialog (const ACHAR *lpszRegRoot, bool bIsReadRegistry=true)
 Public Member Functions inherited from AcPublishUIReactor
 virtual void  | OnInitAutoPublishSettingsDialog (IUnknown **pUnk, AcPublishUIReactorInfo *pInfo)
 virtual void  | OnInitExportOptionsDialog (IUnknown **pUnk, AcPublishUIReactorInfo *pInfo)
 virtual void  | OnInitPublishOptionsDialog (IUnknown **pUnk, AcPublishUIReactorInfo *pInfo)
 virtual void  | PersistenceRegistryForAutoPublishDialog (const ACHAR *lpszRegRoot, bool bIsReadRegistry=true)
 virtual void  | PersistenceRegistryForExportOptionsDialog (const ACHAR *lpszRegRoot, bool bIsReadRegistry=true)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acpublishuireactors.h