Public Member Functions | List of all members
AcDbTextEditorSelectable Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbTextEditorSelectable:
 Public Member Functions
virtual AcDbTextEditorLocation *  | endOfText ()=0
virtual AcDbTextEditorLocation *  | startOfText ()=0
Member Function Documentation
 virtual AcDbTextEditorLocation* AcDbTextEditorSelectable::endOfText  |  ( |   | )
pure virtual
Warning
Not implemented!
Implemented in AcDbTextEditor, AcDbTextEditorColumn, and AcDbTextEditorParagraph.
 virtual AcDbTextEditorLocation* AcDbTextEditorSelectable::startOfText  |  ( |   | )
pure virtual
Warning
Not implemented!
Implemented in AcDbTextEditor, AcDbTextEditorColumn, and AcDbTextEditorParagraph.
 The documentation for this class was generated from the following file:
dbtexteditor.h