Public Member Functions | List of all members
AcDbDictionaryIterator Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbDictionaryIterator:
 Public Member Functions
AcDbDictionaryIterator (const AcDbDictionaryIterator &)=delete
ACRX_DECLARE_MEMBERS (AcDbDictionaryIterator)
 virtual bool  | done () const =0
 template<class ObjType >
Acad::ErrorStatus  | getObject (ObjType *&pObject, AcDb::OpenMode mode=AcDb::kForRead)
 Acad::ErrorStatus  | getObject (AcDbObject *&pObject, AcDb::OpenMode mode=AcDb::kForRead)
 virtual const ACHAR *  | name () const =0
 virtual bool  | name (AcString &sName) const =0
 virtual bool  | next ()=0
 virtual AcDbObjectId  | objectId () const =0
 AcDbDictionaryIterator &  | operator= (const AcDbDictionaryIterator &)=delete
 virtual bool  | setPosition (AcDbObjectId objId)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbdict.h