Public Attributes | List of all members
RxADSAppTableEntryType Class Reference
Misc Classes
 Public Attributes
 struct resbuf *  | ads_argl
 int  | ads_fcode
 FunHandList *  | ads_fhdl
 int  | ads_invkcnt
 resbuf *  | ads_ret
 int  | ads_rettype
 Adesk::LongPtr  | apphandle
 ACHAR *  | appname
 int  | lflag
 AcRxGenHand *  | modhandle
 The documentation for this class was generated from the following file:
adsrxdef.h