Public Member Functions | List of all members
AcGiViewportDraw Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiViewportDraw:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiViewportDraw)
 virtual AcGiViewportGeometry &  | geometry () const =0
 virtual Adesk::Boolean  | isValidId (const Adesk::ULongPtr acgiId) const =0
 virtual Adesk::UInt32  | sequenceNumber () const =0
 virtual AcGiViewport &  | viewport () const =0
 virtual AcDbObjectId  | viewportObjectId () const =0
 Public Member Functions inherited from AcGiCommonDraw
ACRX_DECLARE_MEMBERS (AcGiCommonDraw)
 virtual AcGiContext *  | context ()=0
 virtual double  | deviation (const AcGiDeviationType, const AcGePoint3d &) const =0
 virtual Adesk::Boolean  | isDragging () const =0
 virtual Adesk::UInt32  | numberOfIsolines () const =0
 virtual AcGiGeometry *  | rawGeometry () const =0
 virtual Adesk::Boolean  | regenAbort () const =0
 virtual AcGiRegenType  | regenType () const =0
 virtual bool  | secondaryCall () const
 virtual AcGiSubEntityTraits &  | subEntityTraits () const =0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgi.h