Public Member Functions | List of all members
AcGiDistantLightTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiDistantLightTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiDistantLightTraits)
 virtual bool  | isSunlight () const =0
 virtual void  | lampColor (AcGiColorRGB &rgbColor) const =0
 virtual AcGeVector3d  | lightDirection () const =0
 virtual double  | physicalIntensity () const =0
 virtual void  | setIsSunlight (bool isSunlight)=0
 virtual void  | setLampColor (const AcGiColorRGB &rgbColor)=0
 virtual void  | setLightDirection (const AcGeVector3d &vec)=0
 virtual void  | setPhysicalIntensity (double physicalIntensity)=0
 virtual void  | setSkyParameters (const AcGiSkyParameters &params)=0
 virtual void  | skyParameters (AcGiSkyParameters &params) const =0
 Public Member Functions inherited from AcGiStandardLightTraits
ACRX_DECLARE_MEMBERS (AcGiStandardLightTraits)
 virtual double  | intensity () const =0
 virtual AcCmColor  | lightColor () const =0
 virtual void  | setIntensity (double inten)=0
 virtual void  | setLightColor (const AcCmColor &color)=0
 virtual void  | setShadowParameters (const AcGiShadowParameters &params)=0
 virtual void  | shadowParameters (AcGiShadowParameters &params) const =0
 Public Member Functions inherited from AcGiLightTraits
ACRX_DECLARE_MEMBERS (AcGiLightTraits)
 virtual bool  | isOn () const =0
 virtual void  | setOn (bool on)=0
 The documentation for this class was generated from the following file:
AcGiLightTraits.h