Public Member Functions | List of all members
AcGiRenderSettingsTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiRenderSettingsTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiRenderSettingsTraits)
 virtual bool  | backFacesEnabled () const =0
 virtual bool  | diagnosticBackgroundEnabled () const =0
 virtual bool  | materialEnabled () const =0
 virtual double  | modelScaleFactor (void) const =0
 virtual void  | setBackFacesEnabled (bool enabled)=0
 virtual void  | setDiagnosticBackgroundEnabled (bool enabled)=0
 virtual void  | setMaterialEnabled (bool enabled)=0
 virtual void  | setModelScaleFactor (double scaleFactor)=0
 virtual void  | setShadowsEnabled (bool enabled)=0
 virtual void  | setTextureSampling (bool enabled)=0
 virtual bool  | shadowsEnabled () const =0
 virtual bool  | textureSampling () const =0
 The documentation for this class was generated from the following file:
AcGiEnvironment.h