Public Member Functions | Protected Member Functions | List of all members
AcDbLayout Class Reference
AcDb Classes
  Inheritance diagram for AcDbLayout:
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbLayout)
 virtual Acad::ErrorStatus  | addToLayoutDict (AcDbDatabase *towhichDb, AcDbObjectId BlockTableRecordId)
 bool  | annoAllVisible () const
 AcDbObjectId  | getBlockTableRecordId () const
 void  | getExtents (AcGePoint3d &extMin, AcGePoint3d &extMax) const
ACDBCORE2D_PORT void  | getExtents (AcDbExtents &extent) const
 ACDBCORE2D_PORT Acad::ErrorStatus  | getLayoutName (const ACHAR *&layoutName) const
 Acad::ErrorStatus  | getLayoutName (ACHAR *&layoutName) const
 void  | getLimits (AcGePoint2d &limMin, AcGePoint2d &limMax) const
ACDBCORE2D_PORT void  | getLimits (AcDbExtents2d &extent) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getName (AcString &sName) const
Acad::ErrorStatus  | getPreviewImage (Atil::Image *&pPreviewImage) const
 int  | getTabOrder () const
 bool  | getTabSelected () const
 Acad::ErrorStatus  | getThumbnail (BITMAPINFO *&thumbnail) const
 AcDbObjectIdArray  | getViewportArray () const
Acad::ErrorStatus  | initialize (AcDbObjectId *paperVportId=NULL)
 Acad::ErrorStatus  | setAnnoAllVisible (bool newVal)
 virtual Acad::ErrorStatus  | setBlockTableRecordId (AcDbObjectId BlockTableRecordId)
 virtual ACDBCORE2D_PORT Acad::ErrorStatus  | setLayoutName (const ACHAR *layoutName)
Acad::ErrorStatus  | setPreviewImage (const Atil::Image *pPreviewImage)
 virtual void  | setTabOrder (int newOrder)
 virtual void  | setTabSelected (Adesk::Boolean tabSelected)
 Acad::ErrorStatus  | setThumbnail (const BITMAPINFO *thumbnail)
 Public Member Functions inherited from AcDbPlotSettings
ACDB_DECLARE_MEMBERS (AcDbPlotSettings)
AcDbPlotSettings (bool ModelType)
 Acad::ErrorStatus  | addToPlotSettingsDict (AcDbDatabase *towhichDb)
 Acad::ErrorStatus  | copyFrom (AcDbPlotSettings *fromPlotSettings)
 Adesk::Boolean  | drawViewportsFirst () const
 Acad::ErrorStatus  | getCanonicalMediaName (const ACHAR *&mediaName) const
 Acad::ErrorStatus  | getCurrentStyleSheet (const ACHAR *&styleSheetName) const
 Acad::ErrorStatus  | getCustomPrintScale (double &numerator, double &denominator) const
 Acad::ErrorStatus  | getPlotCfgName (const ACHAR *&plotCfgName) const
 Acad::ErrorStatus  | getPlotOrigin (double &x, double &y) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getPlotOrigin (AcGePoint2d &origin) const
 Acad::ErrorStatus  | getPlotPaperMargins (double &printableXmin, double &printableYmin, double &printableXmax, double &printableYmax) const
 Acad::ErrorStatus  | getPlotPaperSize (double &paperWidth, double &paperHeight) const
ACDBCORE2D_PORT Acad::ErrorStatus  | getPlotPaperSize (AcGePoint2d &paperSize) const
 Acad::ErrorStatus  | getPlotSettingsName (const ACHAR *&plotSettingsName) const
 Acad::ErrorStatus  | getPlotSettingsName (ACHAR *&plotSettingsName) const
 Acad::ErrorStatus  | getPlotViewName (const ACHAR *&viewName) const
 Acad::ErrorStatus  | getPlotWindowArea (double &xmin, double &ymin, double &xmax, double &ymax) const
 Acad::ErrorStatus  | getStdScale (double &scale) const
ACDBCORE2D_PORT IAcReadStream *  | getStyleSheetReadStream ()
 Adesk::Boolean  | modelType () const
bool  | plotAsRaster () const
 Adesk::Boolean  | plotCentered () const
 Adesk::Boolean  | plotHidden () const
 AcDbPlotSettings::PlotPaperUnits  | plotPaperUnits () const
 Adesk::Boolean  | plotPlotStyles () const
 AcDbPlotSettings::PlotRotation  | plotRotation () const
Adesk::Boolean  | plotTransparency () const
 AcDbPlotSettings::PlotType  | plotType () const
 Adesk::Boolean  | plotViewportBorders () const
bool  | plotWireframe () const
 Adesk::Boolean  | printLineweights () const
 Adesk::Boolean  | scaleLineweights () const
 void  | setDrawViewportsFirst (Adesk::Boolean drawViewportsFirst)
 void  | setPlotHidden (Adesk::Boolean plotHidden)
 void  | setPlotPlotStyles (Adesk::Boolean plotPlotStyles)
 Acad::ErrorStatus  | setPlotSettingsName (const ACHAR *plotSettingsName)
void  | setPlotTransparency (Adesk::Boolean plotTransparency)
 void  | setPlotViewportBorders (Adesk::Boolean plotViewportBorders)
 void  | setPrintLineweights (Adesk::Boolean printLineweights)
 void  | setScaleLineweights (Adesk::Boolean scaleLineweights)
 Acad::ErrorStatus  | setShadePlot (AcDbPlotSettings::ShadePlotType shadePlot)
 Acad::ErrorStatus  | setShadePlot (AcDbPlotSettings::ShadePlotType type, AcDbObjectId shadePlotId)
 Acad::ErrorStatus  | setShadePlotCustomDPI (Adesk::Int16 val)
 Acad::ErrorStatus  | setShadePlotResLevel (AcDbPlotSettings::ShadePlotResLevel resLevel)
 void  | setShowPlotStyles (Adesk::Boolean showPlotStyles)
 AcDbPlotSettings::ShadePlotType  | shadePlot () const
 Adesk::Int16  | shadePlotCustomDPI () const
AcDbObjectId  | shadePlotId () const
 AcDbPlotSettings::ShadePlotResLevel  | shadePlotResLevel () const
 Adesk::Boolean  | showPlotStyles () const
 AcDbPlotSettings::StdScaleType  | stdScaleType () const
 Adesk::Boolean  | useStandardScale () const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const override
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcDbPlotSettings
enum  | PlotPaperUnits { kInches, kMillimeters, kPixels }
enum  | PlotRotation { k0degrees, k90degrees, k180degrees, k270degrees }
enum  | PlotType {
 kDisplay, kExtents, kLimits, kView,
 kWindow, kLayout
 }
enum  | ShadePlotResLevel {
 kDraft, kPreview, kNormal, kPresentation,
 kMaximum, kCustom
 }
enum  | ShadePlotType {
 kAsDisplayed = 0, kWireframe = 1, kHidden = 2, kRendered = 3,
 kVisualStyle = 4, kRenderPreset = 5
 }
enum  | StdScaleType {
 kScaleToFit, k1_128in_1ft, k1_64in_1ft, k1_32in_1ft,
 k1_16in_1ft, k3_32in_1ft, k1_8in_1ft, k3_16in_1ft,
 k1_4in_1ft, k3_8in_1ft, k1_2in_1ft, k3_4in_1ft,
 k1in_1ft, k3in_1ft, k6in_1ft, k1ft_1ft,
 k1_1, k1_2, k1_4, k1_5,
 k1_8, k1_10, k1_16, k1_20,
 k1_30, k1_40, k1_50, k1_100,
 k2_1, k4_1, k8_1, k10_1,
 k100_1, k1000_1, k1and1_2in_1ft
 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
Member Function Documentation
 ACDBCORE2D_PORT void AcDbLayout::getExtents  |  ( |  AcDbExtents &  |  extent | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT void AcDbLayout::getLimits  |  ( |  AcDbExtents2d &  |  extent | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbLayout::getName  |  ( |  AcString &  |  sName | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbLayout::getPreviewImage  |  ( |  Atil::Image *&  |  pPreviewImage | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbLayout::initialize  |  ( |  AcDbObjectId *  |  paperVportId = NULL | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbLayout::setPreviewImage  |  ( |  const Atil::Image *  |  pPreviewImage | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dblayout.h