Public Member Functions | List of all members
AcDbTransactionManager Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbTransactionManager:
 Public Member Functions
 virtual Acad::ErrorStatus  | abortTransaction ()=0
ACRX_DECLARE_MEMBERS (AcDbTransactionManager)
 virtual Acad::ErrorStatus  | addNewlyCreatedDBRObject (AcDbObject *obj, bool add=true)=0
 virtual void  | addReactor (AcTransactionReactor *reactor)=0
 virtual Acad::ErrorStatus  | endTransaction ()=0
 virtual Acad::ErrorStatus  | getAllObjects (AcArray< AcDbObject * > &objs)=0
 virtual Acad::ErrorStatus  | getObject (AcDbObject *&obj, AcDbObjectId id, AcDb::OpenMode mode=AcDb::kForRead, bool openErasedObj=false)=0
 virtual Acad::ErrorStatus  | markObjectPageable (AcDbObject *pObject)=0
 virtual int  | numActiveTransactions ()=0
 virtual int  | numOpenedObjects ()=0
 virtual Acad::ErrorStatus  | queueForGraphicsFlush ()=0
 virtual void  | removeReactor (AcTransactionReactor *reactor)=0
 virtual AcTransaction *  | startTransaction ()=0
 virtual AcTransaction *  | topTransaction ()=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbtrans.h