Public Member Functions | Static Public Member Functions | List of all members
AcDbAssocPersSubentId Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbAssocPersSubentId:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbAssocPersSubentId)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSource) override
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
virtual Acad::ErrorStatus  | getTransientSubentIds (const AcDbEntity *pEntity, AcDbDatabase *pDatabase, AcArray< AcDbSubentId > &subents) const
virtual bool  | isEqualTo (const AcDbEntity *pEntity, AcDbDatabase *pDatabase, const AcDbAssocPersSubentId *pOther) const
virtual bool  | isNull () const =0
virtual Acad::ErrorStatus  | mirror (const AcDbEntity *pMirroredEntity, AcDbDatabase *pDatabase)
virtual Acad::ErrorStatus  | release (AcDbEntity *pEntity, AcDbDatabase *pDatabase) const
 virtual AcDb::SubentType  | subentType (const AcDbEntity *pEntity, AcDbDatabase *pDatabase) const =0
virtual int  | transientSubentCount (const AcDbEntity *pEntity, AcDbDatabase *pDatabase) const
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static Acad::ErrorStatus  | createObjectAndDwgInFields (AcDbDatabase *pDatabase, AcDbDwgFiler *pFiler, AcDbAssocPersSubentId *&pCreatedPersSubentId)
static Acad::ErrorStatus  | createObjectAndDxfInFields (AcDbDxfFiler *pFiler, AcDbAssocPersSubentId *&pCreatedPersSubentId)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual Acad::ErrorStatus AcDbAssocPersSubentId::copyFrom  |  ( |  const AcRxObject *  |  pSource | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 static Acad::ErrorStatus AcDbAssocPersSubentId::createObjectAndDwgInFields  |  ( |  AcDbDatabase *  |  pDatabase,
|  AcDbDwgFiler *  |  pFiler,
|  AcDbAssocPersSubentId *&  |  pCreatedPersSubentId
)
static
Warning
Not implemented!
 static Acad::ErrorStatus AcDbAssocPersSubentId::createObjectAndDxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler,
|  AcDbAssocPersSubentId *&  |  pCreatedPersSubentId
)
static
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentId::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
virtual
Warning
Not implemented!
Reimplemented in AcDbAssocObjectAndIndexPersSubentId, AcDbAssocSimplePersSubentId, AcDbAssocIndexPersSubentId, and AcDbAssocEdgePersSubentId.
 virtual Acad::ErrorStatus AcDbAssocPersSubentId::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
Reimplemented in AcDbAssocObjectAndIndexPersSubentId, AcDbAssocSimplePersSubentId, AcDbAssocIndexPersSubentId, and AcDbAssocEdgePersSubentId.
 virtual Acad::ErrorStatus AcDbAssocPersSubentId::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
virtual
Warning
Not implemented!
Reimplemented in AcDbAssocObjectAndIndexPersSubentId, AcDbAssocSimplePersSubentId, AcDbAssocIndexPersSubentId, and AcDbAssocEdgePersSubentId.
 virtual Acad::ErrorStatus AcDbAssocPersSubentId::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
Reimplemented in AcDbAssocObjectAndIndexPersSubentId, AcDbAssocSimplePersSubentId, AcDbAssocIndexPersSubentId, and AcDbAssocEdgePersSubentId.
 virtual Acad::ErrorStatus AcDbAssocPersSubentId::getTransientSubentIds  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDbDatabase *  |  pDatabase,
|  AcArray< AcDbSubentId > &  |  subents
) |   |  const
virtual
Warning
Not implemented!
 virtual bool AcDbAssocPersSubentId::isEqualTo  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDbDatabase *  |  pDatabase,
|  const AcDbAssocPersSubentId *  |  pOther
) |   |  const
virtual
Warning
Not implemented!
Reimplemented in AcDbAssocSimplePersSubentId, AcDbAssocEdgePersSubentId, and AcDbAssocSingleEdgePersSubentId.
 virtual bool AcDbAssocPersSubentId::isNull  |  ( |   | ) |   const
pure virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentId::mirror  |  ( |  const AcDbEntity *  |  pMirroredEntity,
|  AcDbDatabase *  |  pDatabase
)
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocPersSubentId::release  |  ( |  AcDbEntity *  |  pEntity,
|  AcDbDatabase *  |  pDatabase
) |   |  const
virtual
Warning
Not implemented!
 virtual int AcDbAssocPersSubentId::transientSubentCount  |  ( |  const AcDbEntity *  |  pEntity,
|  AcDbDatabase *  |  pDatabase
) |   |  const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocPersSubentId.h