Classes | Public Types | Public Member Functions | List of all members
AcDbMultiModesGripPE Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbMultiModesGripPE:
 Classes
struct  | GripMode
 Public Types
enum  | GripActionType { kDragOn = 0, kImmediate, kCommand }
enum  | GripCursorType {
 kcNone = 0, kcCrosshairPlus, kcCrosshairMinus, kcCrosshairCurve,
 kcCrosshairLine, kcCrosshairAngle
 }
enum  | GripModeIdentifier { kNone = 0, kMove, kCustomStart = 100 }
enum  | GripType { kPrimary, kSecondary }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbMultiModesGripPE)
 virtual bool  | getGripModes (AcDbEntity *pThis, AcDbGripData *pGripData, AcArray< GripMode > &modes, unsigned int &curMode) const =0
 virtual GripType  | gripType (AcDbEntity *pThis, AcDbGripData *pGripData) const =0
 virtual unsigned int  | mode (AcDbEntity *pThis, AcDbGripData *pGripData) const =0
 virtual GripMode  | modeEx (AcDbEntity *pThis, AcDbGripData *pGripData) const =0
 virtual void  | reset (AcDbEntity *pThis)=0
 virtual bool  | setMode (AcDbEntity *pThis, AcDbGripData *pGripData, unsigned int newMode)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbMultiModesGrip.h