Public Member Functions | Protected Attributes | Friends | List of all members
AcFdFieldEngine Class Reference
AcFd Classes
  Inheritance diagram for AcFdFieldEngine:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcFdFieldEngine)
 ACDBCORE2D_PORT int  | evaluatorLoaderCount (void) const
 ACDBCORE2D_PORT AcFdFieldEvaluator *  | findEvaluator (AcDbField *pField, const ACHAR *&pszEvalId)
 ACDBCORE2D_PORT AcFdFieldEvaluator *  | getEvaluator (const ACHAR *pszEvalId)
 ACDBCORE2D_PORT AcFdFieldEvaluatorLoader *  | getEvaluatorLoader (int iIndex)
 ACDBCORE2D_PORT Acad::ErrorStatus  | registerEvaluatorLoader (AcFdFieldEvaluatorLoader *pLoader)
 ACDBCORE2D_PORT Acad::ErrorStatus  | unregisterEvaluatorLoader (AcFdFieldEvaluatorLoader *pLoader)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Attributes
 void *  | mpImpObj
 Friends
 class  | AcFdSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
AcField.h