Public Member Functions | Public Attributes | Static Public Attributes | Friends | List of all members
AcGePoint3d Class Reference
AcGe Classes
  Inheritance diagram for AcGePoint3d:
 Public Member Functions
 GE_DLLEXPIMPORT  | AcGePoint3d (const AcGePoint3d &pnt)
 GE_DLLEXPIMPORT  | AcGePoint3d (double x, double y, double z)
 GE_DLLEXPIMPORT  | AcGePoint3d (const AcGePlanarEnt &pln, const AcGePoint2d &pnt2d)
 GE_DLLEXPIMPORT AcGeVector3d  | asVector () const
 GE_DLLEXPIMPORT AcGePoint2d  | convert2d (const AcGePlanarEnt &pln) const
 GE_DLLEXPIMPORT double  | distanceTo (const AcGePoint3d &pnt) const
 GE_DLLEXPIMPORT bool  | isEqualTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 GE_DLLEXPIMPORT AcGePoint3d &  | mirror (const AcGePlane &pln)
 GE_DLLEXPIMPORT bool  | operator!= (const AcGePoint3d &pnt) const
 GE_DLLEXPIMPORT AcGePoint3d  | operator* (double scl) const
 GE_DLLEXPIMPORT AcGePoint3d &  | operator*= (double scl)
 GE_DLLEXPIMPORT AcGePoint3d  | operator+ (const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT AcGePoint3d &  | operator+= (const AcGeVector3d &vec)
 GE_DLLEXPIMPORT AcGePoint3d  | operator- (const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT AcGeVector3d  | operator- (const AcGePoint3d &pnt) const
 GE_DLLEXPIMPORT AcGePoint3d &  | operator-= (const AcGeVector3d &vec)
 GE_DLLEXPIMPORT AcGePoint3d  | operator/ (double scl) const
 GE_DLLEXPIMPORT AcGePoint3d &  | operator/= (double scl)
 GE_DLLEXPIMPORT bool  | operator== (const AcGePoint3d &pnt) const
 GE_DLLEXPIMPORT double  | operator[] (unsigned int i) const
 GE_DLLEXPIMPORT double &  | operator[] (unsigned int idx)
 GE_DLLEXPIMPORT AcGePoint3d  | orthoProject (const AcGePlane &pln) const
 GE_DLLEXPIMPORT AcGePoint3d  | project (const AcGePlane &pln, const AcGeVector3d &vec) const
 GE_DLLEXPIMPORT AcGePoint3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 GE_DLLEXPIMPORT AcGePoint3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 GE_DLLEXPIMPORT AcGePoint3d &  | set (double x, double y, double z)
 GE_DLLEXPIMPORT AcGePoint3d &  | set (const AcGePlanarEnt &pln, const AcGePoint2d &pnt)
 GE_DLLEXPIMPORT AcGePoint3d &  | setToProduct (const AcGeMatrix3d &mat, const AcGePoint3d &pnt)
 GE_DLLEXPIMPORT AcGePoint3d &  | setToSum (const AcGePoint3d &pnt, const AcGeVector3d &vec)
 GE_DLLEXPIMPORT AcGePoint3d &  | transformBy (const AcGeMatrix3d &leftSide)
 Public Attributes
 double  | x
 double  | y
 double  | z
 Static Public Attributes
 static GE_DLLDATAEXIMP const AcGePoint3d  | kOrigin
 Friends
 GE_DLLEXPIMPORT AcGePoint3d  | operator* (const AcGeMatrix3d &mat, const AcGePoint3d &pnt)
 GE_DLLEXPIMPORT friend AcGePoint3d  | operator* (double scl, const AcGePoint3d &pnt)
 The documentation for this class was generated from the following file:
gepnt3d.h