Public Member Functions | List of all members
AcDbSoftOwnershipId Class Reference
AcDb Classes
  Inheritance diagram for AcDbSoftOwnershipId:
 Public Member Functions
AcDbSoftOwnershipId (const AcDbObjectId &)
AcDbSoftOwnershipId (const AcDbStub *)
operator AcDbStub * () const
 bool  | operator!= (const AcDbObjectId &) const
 bool  | operator!= (const AcDbStub *) const
 AcDbSoftOwnershipId &  | operator= (const AcDbSoftOwnershipId &)
 AcDbSoftOwnershipId &  | operator= (const AcDbObjectId &)
 AcDbSoftOwnershipId &  | operator= (const AcDbStub *)
 bool  | operator== (const AcDbObjectId &) const
 bool  | operator== (const AcDbStub *) const
 Public Member Functions inherited from AcDbObjectId
AcDbObjectId (const AcDbStub *)
 Adesk::IntDbId  | asOldId () const
 ACDBCORE2D_PORT bool  | convertToRedirectedId ()
 AcDbDatabase *  | database () const
 AcDbHandle  | handle () const
 bool  | isEffectivelyErased () const
 bool  | isErased () const
 bool  | isNull () const
bool  | isResident () const
 ACDBCORE2D_PORT bool  | isValid () const
ACDBCORE2D_PORT bool  | isWellBehaved () const
 AcDbHandle  | nonForwardedHandle () const
AcRxClass *  | objectClass () const
 bool  | objectLeftOnDisk () const
operator AcDbStub * () const
 bool  | operator!= (const AcDbObjectId &) const
 bool  | operator!= (const AcDbStub *) const
 bool  | operator< (const AcDbObjectId &) const
 bool  | operator< (const AcDbStub *) const
 bool  | operator<= (const AcDbObjectId &) const
 bool  | operator<= (const AcDbStub *) const
 AcDbObjectId &  | operator= (const AcDbObjectId &)
 AcDbObjectId &  | operator= (const AcDbStub *)
 bool  | operator== (const AcDbObjectId &) const
 bool  | operator== (const AcDbStub *) const
 bool  | operator> (const AcDbObjectId &) const
 bool  | operator> (const AcDbStub *) const
 bool  | operator>= (const AcDbObjectId &) const
 bool  | operator>= (const AcDbStub *) const
 AcDbDatabase *  | originalDatabase () const
 AcDbObjectId &  | setFromOldId (Adesk::IntDbId oldId)
 AcDbObjectId &  | setFromOldId (Adesk::UIntPtr nUnsignedId)
 void  | setNull ()
 Additional Inherited Members
 Static Public Attributes inherited from AcDbObjectId
 static const AcDbObjectId  | kNull
 Protected Attributes inherited from AcDbObjectId
 AcDbStub *  | mId
 The documentation for this class was generated from the following file:
dbid.h