Public Types | Public Member Functions | Protected Attributes | List of all members
AcGiStyleAttributes Class Referenceabstract
AcGi Classes
 Public Types
enum  | AttributeFlags {
 kNothing = 0x00, kColor = 0x01, kLine = 0x02, kLineType = 0x04,
 kPlotStyle = 0x08, kEverything = 0x0F
 }
 Public Member Functions
AcGiStyleAttributes (const AcGiStyleAttributes &source)
 virtual void  | EnsureColorVisibility (AcCmEntityColor &color)=0
 AcCmEntityColor &  | getColorAttribute ()
 const AcCmEntityColor &  | getColorAttribute () const
 virtual AcGiLineAttributes *  | getLineAttribute ()=0
 virtual const AcGiLineAttributes *  | getLineAttribute () const =0
 AcDbObjectId  | linetypeObjectId () const
 AcDbObjectId  | plotStyleNameId () const
 void  | setColorAttribute (const AcCmEntityColor &color)
 virtual void  | setLineAttribute (const AcGiLineAttributes *pLineAttributes)=0
 void  | setLinetypeObjectId (const AcDbObjectId &newId)
 void  | setPlotStyleName (const AcDbObjectId &newId)
 Protected Attributes
 AcCmEntityColor  | m_colorAttribute
 AcDbObjectId  | m_idLinetype
 AcDbObjectId  | m_idPlotstyle
 The documentation for this class was generated from the following file:
AcGiStyleAttributes.h