Public Member Functions | List of all members
AcGiGroundPlaneBackgroundTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiGroundPlaneBackgroundTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiGroundPlaneBackgroundTraits)
 virtual AcCmEntityColor  | colorGroundPlaneFar (void) const =0
 virtual AcCmEntityColor  | colorGroundPlaneNear (void) const =0
 virtual AcCmEntityColor  | colorSkyHorizon (void) const =0
 virtual AcCmEntityColor  | colorSkyZenith (void) const =0
 virtual AcCmEntityColor  | colorUndergroundAzimuth (void) const =0
 virtual AcCmEntityColor  | colorUndergroundHorizon (void) const =0
 virtual void  | setColorGroundPlaneFar (const AcCmEntityColor &color)=0
 virtual void  | setColorGroundPlaneNear (const AcCmEntityColor &color)=0
 virtual void  | setColorSkyHorizon (const AcCmEntityColor &color)=0
 virtual void  | setColorSkyZenith (const AcCmEntityColor &color)=0
 virtual void  | setColorUndergroundAzimuth (const AcCmEntityColor &color)=0
 virtual void  | setColorUndergroundHorizon (const AcCmEntityColor &color)=0
 The documentation for this class was generated from the following file:
AcGiEnvironment.h