Public Member Functions | List of all members
AcEdSolidSubentitySelector Class Reference
AcEd Classes
 Public Member Functions
AcEdSolidSubentitySelector ()
Acad::ErrorStatus  | selectFaces (AcDbObjectId &selectedSolidId, AcArray< AcDbSubentId * > &faceSet)
~AcEdSolidSubentitySelector ()
Constructor & Destructor Documentation
 AcEdSolidSubentitySelector::AcEdSolidSubentitySelector  |  ( |   | )
Warning
Not implemented!
 AcEdSolidSubentitySelector::~AcEdSolidSubentitySelector  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 Acad::ErrorStatus AcEdSolidSubentitySelector::selectFaces  |  ( |  AcDbObjectId &  |  selectedSolidId,
|  AcArray< AcDbSubentId * > &  |  faceSet
)
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acedsel.h