Public Member Functions | List of all members
AcGiSolidBackgroundTraits Class Referenceabstract
AcGi Classes
  Inheritance diagram for AcGiSolidBackgroundTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiSolidBackgroundTraits)
 virtual AcCmEntityColor  | colorSolid (void) const =0
 virtual void  | setColorSolid (const AcCmEntityColor &color)=0
 The documentation for this class was generated from the following file:
AcGiEnvironment.h