Public Member Functions | Friends | List of all members
AcDbIdMappingIter Class Reference
AcDb Classes
  Inheritance diagram for AcDbIdMappingIter:
 Public Member Functions
AcDbIdMappingIter (const AcDbIdMapping &)
ACRX_DECLARE_MEMBERS (AcDbIdMappingIter)
 virtual bool  | done ()
 virtual bool  | getMap (AcDbIdPair &)
 virtual Acad::ErrorStatus  | iterateOn (const AcDbIdMapping &)
 virtual bool  | next ()
 virtual void  | start ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbidmap.h