Public Member Functions | List of all members
AcTrayItem Class Reference
AcTrayItem Classes
  Inheritance diagram for AcTrayItem:
 Public Member Functions
ACAD_PORT  | AcTrayItem (const CString &strId)
virtual BOOL  | CloseAllBubbleWindows ()
SB_DEPRECATED AcTrayItemAnimationControl *  | GetAnimationControl () const
virtual AcTrayItemBubbleWindowControl *  | GetBubbleWindowControl () const
 virtual HICON  | GetIcon () const
ACAD_PORT void  | GoToState (const CString &state, AcRxValue *parameter=NULL)
SB_DEPRECATED BOOL  | PlayAnimation (AcTrayItemAnimationControl *pAnimationControl)
 virtual BOOL  | SetIcon (HICON hIcon)
virtual BOOL  | ShowBubbleWindow (AcTrayItemBubbleWindowControl *pBubbleWindowControl)
SB_DEPRECATED void  | StopAnimation ()
 Public Member Functions inherited from AcStatusBarItem
ACAD_PORT  | AcStatusBarItem (const CString &strId, bool isTrayItem)
 virtual SB_DEPRECATED BOOL  | ClientToScreen (LPPOINT lpPoint)
 virtual SB_DEPRECATED BOOL  | ClientToScreen (LPRECT lpRect)
 virtual SB_DEPRECATED BOOL  | ContentChanged () const
 virtual UINT  | DisplayContextMenu (CMenu &menu, CPoint point)
 virtual void  | Enable (BOOL bValue)
ACAD_PORT CString &  | GetActiveImageState () const
void *  | GetData ()
ACAD_PORT int  | GetID () const
 virtual SB_DEPRECATED void *  | GetInternalData (BOOL bForDocSwitch=TRUE) const
ACAD_PORT const CString &  | GetName () const
 virtual BOOL  | GetToolTipText (CString &strText) const
 virtual BOOL  | IsEnabled ()
ACAD_PORT bool  | IsTrayItem () const
 virtual BOOL  | IsVisible ()
virtual void  | OnDelete ()
virtual void  | OnLButtonDblClk (UINT nFlags, CPoint point)
virtual void  | OnLButtonDown (UINT nFlags, CPoint point)
virtual void  | OnRButtonDown (UINT nFlags, CPoint point)
 virtual SB_DEPRECATED BOOL  | QueryToolTipText (CString &strText) const
 virtual SB_DEPRECATED BOOL  | ScreenToClient (LPPOINT lpPoint)
 virtual SB_DEPRECATED BOOL  | ScreenToClient (LPRECT lpRect)
ACAD_PORT void  | SetActiveImageState (const CString &strActiveImageState)
 virtual SB_DEPRECATED void  | SetContentChanged (BOOL bChanged)
ACAD_PORT void  | SetID (int id)
 virtual SB_DEPRECATED void  | SetInternalData (void *pData, BOOL bForDocSwitch=FALSE)
 virtual BOOL  | SetToolTipText (const CString &strText)
 virtual SB_DEPRECATED void  | SetVisibilityChanged (BOOL bChanged)
 virtual void  | SetVisible (BOOL bIsVisible)
 virtual SB_DEPRECATED BOOL  | ShowTraySettingsDialog ()
 virtual SB_DEPRECATED BOOL  | VisibilityChanged () const
Constructor & Destructor Documentation
 ACAD_PORT AcTrayItem::AcTrayItem  |  ( |  const CString &  |  strId | )
Warning
Not implemented!
Member Function Documentation
 virtual BOOL AcTrayItem::CloseAllBubbleWindows  |  ( |   | )
virtual
Warning
Not implemented!
 SB_DEPRECATED AcTrayItemAnimationControl* AcTrayItem::GetAnimationControl  |  ( |   | ) |   const
Warning
Not implemented!
 virtual AcTrayItemBubbleWindowControl* AcTrayItem::GetBubbleWindowControl  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 ACAD_PORT void AcTrayItem::GoToState  |  ( |  const CString &  |  state,
|  AcRxValue *  |  parameter = NULL
)
Warning
Not implemented!
 SB_DEPRECATED BOOL AcTrayItem::PlayAnimation  |  ( |  AcTrayItemAnimationControl *  |  pAnimationControl | )
Warning
Not implemented!
 virtual BOOL AcTrayItem::ShowBubbleWindow  |  ( |  AcTrayItemBubbleWindowControl *  |  pBubbleWindowControl | )
virtual
Warning
Not implemented!
 SB_DEPRECATED void AcTrayItem::StopAnimation  |  ( |   | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acStatusBar.h