Public Member Functions | Protected Member Functions | List of all members
AcGiSkyParameters Class Reference
AcGi Classes
  Inheritance diagram for AcGiSkyParameters:
 Public Member Functions
AcGiSkyParameters ()
ACRX_DECLARE_MEMBERS (AcGiSkyParameters)
bool  | aerialPerspective () const
double  | diskIntensity () const
double  | diskScale () const
double  | glowIntensity () const
AcCmColor  | groundColor () const
double  | haze () const
double  | horizonBlur () const
double  | horizonHeight () const
bool  | illumination () const
double  | intensityFactor () const
AcCmColor  | nightColor () const
bool  | operator== (const AcGiSkyParameters &params) const
double  | redBlueShift (void) const
double  | saturation (void) const
void  | setAerialPerspective (bool apply)
bool  | setDiskIntensity (double intensity)
bool  | setDiskScale (double scale)
bool  | setGlowIntensity (double intensity)
void  | setGroundColor (const AcCmColor &color)
bool  | setHaze (double haze)
bool  | setHorizonBlur (double blur)
bool  | setHorizonHeight (double height)
void  | setIllumination (bool enable)
bool  | setIntensityFactor (double intensity)
void  | setNightColor (const AcCmColor &color)
bool  | setRedBlueShift (double redBlueShift)
bool  | setSaturation (double saturation)
bool  | setSolarDiskSamples (Adesk::UInt16 samples)
bool  | setSunDirection (const AcGeVector3d &sundir)
bool  | setVisibilityDistance (double distance)
Adesk::UInt16  | solarDiskSamples () const
const AcGeVector3d &  | sunDirection () const
double  | visibilityDistance () const
virtual  | ~AcGiSkyParameters ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual bool  | aerialPerspectiveImp () const
 virtual double  | diskIntensityImp () const
 virtual double  | diskScaleImp () const
 virtual double  | glowIntensityImp () const
 virtual AcCmColor  | groundColorImp () const
 virtual double  | hazeImp (void) const
 virtual double  | horizonBlurImp () const
 virtual double  | horizonHeightImp (void) const
 virtual bool  | illuminationImp (void) const
 virtual double  | intensityFactorImp () const
 virtual AcCmColor  | nightColorImp () const
 virtual double  | redBlueShiftImp (void) const
 virtual double  | saturationImp (void) const
 virtual void  | setAerialPerspectiveImp (bool apply)
 virtual bool  | setDiskIntensityImp (double intensity)
 virtual bool  | setDiskScaleImp (double scale)
 virtual bool  | setGlowIntensityImp (double intensity)
 virtual void  | setGroundColorImp (const AcCmColor &color)
 virtual bool  | setHazeImp (double haze)
 virtual bool  | setHorizonBlurImp (double blur)
 virtual bool  | setHorizonHeightImp (double height)
 virtual void  | setIlluminationImp (bool enable)
 virtual bool  | setIntensityFactorImp (double intensity)
 virtual void  | setNightColorImp (const AcCmColor &color)
 virtual bool  | setRedBlueShiftImp (double redBlueShift)
 virtual bool  | setSaturationImp (double saturation)
 virtual bool  | setSolarDiskSamplesImp (Adesk::UInt16 samples)
 virtual bool  | setSunDirectionImp (const AcGeVector3d &sundir)
 virtual bool  | setVisibilityDistanceImp (double distance)
 virtual Adesk::UInt16  | solarDiskSamplesImp (void) const
 virtual const AcGeVector3d &  | sunDirectionImp (void) const
 virtual double  | visibilityDistanceImp () const
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiSkyParameters::AcGiSkyParameters  |  ( |   | )
Warning
Not implemented!
 virtual AcGiSkyParameters::~AcGiSkyParameters  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 bool AcGiSkyParameters::aerialPerspective  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcGiSkyParameters::diskIntensity  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcGiSkyParameters::diskScale  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcGiSkyParameters::glowIntensity  |  ( |   | ) |   const
inline
Warning
Not implemented!
 AcCmColor AcGiSkyParameters::groundColor  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcGiSkyParameters::haze  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcGiSkyParameters::horizonBlur  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcGiSkyParameters::horizonHeight  |  ( |   | ) |   const
inline
Warning
Not implemented!
 bool AcGiSkyParameters::illumination  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcGiSkyParameters::intensityFactor  |  ( |   | ) |   const
inline
Warning
Not implemented!
 AcCmColor AcGiSkyParameters::nightColor  |  ( |   | ) |   const
inline
Warning
Not implemented!
 bool AcGiSkyParameters::operator==  |  ( |  const AcGiSkyParameters &  |  params | ) |   const
Warning
Not implemented!
 double AcGiSkyParameters::redBlueShift  |  ( |  void  |   | ) |   const
inline
Warning
Not implemented!
 double AcGiSkyParameters::saturation  |  ( |  void  |   | ) |   const
inline
Warning
Not implemented!
 void AcGiSkyParameters::setAerialPerspective  |  ( |  bool  |  apply | )
inline
Warning
Not implemented!
 bool AcGiSkyParameters::setDiskIntensity  |  ( |  double  |  intensity | )
inline
Warning
Not implemented!
 bool AcGiSkyParameters::setDiskScale  |  ( |  double  |  scale | )
inline
Warning
Not implemented!
 bool AcGiSkyParameters::setGlowIntensity  |  ( |  double  |  intensity | )
inline
Warning
Not implemented!
 void AcGiSkyParameters::setGroundColor  |  ( |  const AcCmColor &  |  color | )
inline
Warning
Not implemented!
 bool AcGiSkyParameters::setHaze  |  ( |  double  |  haze | )
inline
Warning
Not implemented!
 bool AcGiSkyParameters::setHorizonBlur  |  ( |  double  |  blur | )
inline
Warning
Not implemented!
 bool AcGiSkyParameters::setHorizonHeight  |  ( |  double  |  height | )
inline
Warning
Not implemented!
 void AcGiSkyParameters::setIllumination  |  ( |  bool  |  enable | )
inline
Warning
Not implemented!
 bool AcGiSkyParameters::setIntensityFactor  |  ( |  double  |  intensity | )
inline
Warning
Not implemented!
 void AcGiSkyParameters::setNightColor  |  ( |  const AcCmColor &  |  color | )
inline
Warning
Not implemented!
 bool AcGiSkyParameters::setRedBlueShift  |  ( |  double  |  redBlueShift | )
inline
Warning
Not implemented!
 bool AcGiSkyParameters::setSaturation  |  ( |  double  |  saturation | )
inline
Warning
Not implemented!
 bool AcGiSkyParameters::setSolarDiskSamples  |  ( |  Adesk::UInt16  |  samples | )
inline
Warning
Not implemented!
 bool AcGiSkyParameters::setSunDirection  |  ( |  const AcGeVector3d &  |  sundir | )
inline
Warning
Not implemented!
 bool AcGiSkyParameters::setVisibilityDistance  |  ( |  double  |  distance | )
inline
Warning
Not implemented!
 Adesk::UInt16 AcGiSkyParameters::solarDiskSamples  |  ( |   | ) |   const
inline
Warning
Not implemented!
 const AcGeVector3d& AcGiSkyParameters::sunDirection  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcGiSkyParameters::visibilityDistance  |  ( |   | ) |   const
inline
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcGiLightTraits.h