Public Types | Public Member Functions | Static Public Member Functions | List of all members
AcDbCompoundObjectId Class Reference
AcDb Classes
  Inheritance diagram for AcDbCompoundObjectId:
 Public Types
enum  | Status {
 kValid = 0, kWasLoadedNowUnloaded = 1, kCouldNotResolveNonTerminal = 2, kCouldNotResolveTerminal = 3,
 kCouldNotResolveTooEarly = 4, kIncompatibleIdType = 1000
 }
 Public Member Functions
AcDbCompoundObjectId ()
AcDbCompoundObjectId (const AcDbObjectId &id, AcDbDatabase *pHostDatabase=NULL)
AcDbCompoundObjectId (const AcDbCompoundObjectId &)
AcDbCompoundObjectId (const AcDbObjectId &id, const AcDbObjectIdArray &path, AcDbDatabase *pHostDatabase=NULL)
ACRX_DECLARE_MEMBERS (AcDbCompoundObjectId)
Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler, int ownerVersion)
Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler, AcDbDatabase *pHostDatabase) const
Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler, AcDbDatabase *pHostDatabase, int ownerVersion)
Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler, AcDbDatabase *pHostDatabase) const
Acad::ErrorStatus  | getFullPath (AcDbObjectIdArray &fullPath) const
Acad::ErrorStatus  | getPath (AcDbObjectIdArray &path) const
Acad::ErrorStatus  | getTransform (AcGeMatrix3d &trans) const
bool  | isEmpty () const
bool  | isExternal () const
bool  | isSimpleObjectId () const
bool  | isValid (int validityCheckingLevel=1) const
AcDbObjectId  | leafId () const
 bool  | operator!= (const AcDbCompoundObjectId &other) const
AcDbCompoundObjectId &  | operator= (const AcDbObjectId &)
AcDbCompoundObjectId &  | operator= (const AcDbCompoundObjectId &)
bool  | operator== (const AcDbCompoundObjectId &) const
bool  | remap (const AcDbIdMapping &idMap)
Acad::ErrorStatus  | set (const AcDbObjectId &, AcDbDatabase *pHostDatabase=NULL)
Acad::ErrorStatus  | set (const AcDbCompoundObjectId &, AcDbDatabase *pHostDatabase=NULL)
Acad::ErrorStatus  | set (const AcDbObjectId &id, const AcDbObjectIdArray &path, AcDbDatabase *pHostDatabase=NULL)
void  | setEmpty ()
Acad::ErrorStatus  | setFullPath (const AcDbObjectIdArray &fullPath, AcDbDatabase *pHostDatabase=NULL)
Status  | status () const
AcDbObjectId  | topId () const
virtual  | ~AcDbCompoundObjectId ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static const AcDbCompoundObjectId &  | nullId ()
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbCompoundObjectId::AcDbCompoundObjectId  |  ( |   | )
Warning
Not implemented!
 AcDbCompoundObjectId::AcDbCompoundObjectId  |  ( |  const AcDbObjectId &  |  id,
|  AcDbDatabase *  |  pHostDatabase = NULL
)
Warning
Not implemented!
 AcDbCompoundObjectId::AcDbCompoundObjectId  |  ( |  const AcDbCompoundObjectId &  |   | )
Warning
Not implemented!
 AcDbCompoundObjectId::AcDbCompoundObjectId  |  ( |  const AcDbObjectId &  |  id,
|  const AcDbObjectIdArray &  |  path,
|  AcDbDatabase *  |  pHostDatabase = NULL
)
Warning
Not implemented!
 virtual AcDbCompoundObjectId::~AcDbCompoundObjectId  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 Acad::ErrorStatus AcDbCompoundObjectId::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler,
|  int  |  ownerVersion
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbCompoundObjectId::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler,
|  AcDbDatabase *  |  pHostDatabase
) |   |  const
Warning
Not implemented!
 Acad::ErrorStatus AcDbCompoundObjectId::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler,
|  AcDbDatabase *  |  pHostDatabase,
|  int  |  ownerVersion
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbCompoundObjectId::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler,
|  AcDbDatabase *  |  pHostDatabase
) |   |  const
Warning
Not implemented!
 Acad::ErrorStatus AcDbCompoundObjectId::getFullPath  |  ( |  AcDbObjectIdArray &  |  fullPath | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbCompoundObjectId::getPath  |  ( |  AcDbObjectIdArray &  |  path | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbCompoundObjectId::getTransform  |  ( |  AcGeMatrix3d &  |  trans | ) |   const
Warning
Not implemented!
 bool AcDbCompoundObjectId::isEmpty  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbCompoundObjectId::isExternal  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbCompoundObjectId::isSimpleObjectId  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbCompoundObjectId::isValid  |  ( |  int  |  validityCheckingLevel = 1 | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbCompoundObjectId::leafId  |  ( |   | ) |   const
Warning
Not implemented!
 static const AcDbCompoundObjectId& AcDbCompoundObjectId::nullId  |  ( |   | )
static
Warning
Not implemented!
 AcDbCompoundObjectId& AcDbCompoundObjectId::operator=  |  ( |  const AcDbObjectId &  |   | )
Warning
Not implemented!
 AcDbCompoundObjectId& AcDbCompoundObjectId::operator=  |  ( |  const AcDbCompoundObjectId &  |   | )
Warning
Not implemented!
 bool AcDbCompoundObjectId::operator==  |  ( |  const AcDbCompoundObjectId &  |   | ) |   const
Warning
Not implemented!
 bool AcDbCompoundObjectId::remap  |  ( |  const AcDbIdMapping &  |  idMap | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbCompoundObjectId::set  |  ( |  const AcDbObjectId &  |  ,
|  AcDbDatabase *  |  pHostDatabase = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbCompoundObjectId::set  |  ( |  const AcDbCompoundObjectId &  |  ,
|  AcDbDatabase *  |  pHostDatabase = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbCompoundObjectId::set  |  ( |  const AcDbObjectId &  |  id,
|  const AcDbObjectIdArray &  |  path,
|  AcDbDatabase *  |  pHostDatabase = NULL
)
Warning
Not implemented!
 void AcDbCompoundObjectId::setEmpty  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbCompoundObjectId::setFullPath  |  ( |  const AcDbObjectIdArray &  |  fullPath,
|  AcDbDatabase *  |  pHostDatabase = NULL
)
Warning
Not implemented!
 Status AcDbCompoundObjectId::status  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbCompoundObjectId::topId  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbCompoundObjectId.h