Public Member Functions | List of all members
AcRxVariableChangingEventArgs Class Reference
AcRx Classes
  Inheritance diagram for AcRxVariableChangingEventArgs:
 Public Member Functions
AcRxVariableChangingEventArgs (AcRxImpVariableChangingEventArgs *)
ACDBCORE2D_PORT bool  | isResetting () const
ACDBCORE2D_PORT Acad::ErrorStatus  | setNewValue (const resbuf &value, void *ownerId=NULL)
ACDBCORE2D_PORT void  | veto (const ACHAR *failReason)
 Public Member Functions inherited from AcRxVariableChangedEventArgs
AcRxVariableChangedEventArgs (AcRxImpVariableChangingEventArgs *)
ACDBCORE2D_PORT const resbuf &  | newValue () const
ACDBCORE2D_PORT const resbuf &  | oldValue () const
 Additional Inherited Members
 Protected Attributes inherited from AcRxVariableChangedEventArgs
 AcRxImpVariableChangingEventArgs *  | m_pImp
Constructor & Destructor Documentation
 AcRxVariableChangingEventArgs::AcRxVariableChangingEventArgs  |  ( |  AcRxImpVariableChangingEventArgs *  |   | )
Warning
Not implemented!
Member Function Documentation
 ACDBCORE2D_PORT bool AcRxVariableChangingEventArgs::isResetting  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcRxVariableChangingEventArgs::setNewValue  |  ( |  const resbuf &  |  value,
|  void *  |  ownerId = NULL
)
Warning
Not implemented!
 ACDBCORE2D_PORT void AcRxVariableChangingEventArgs::veto  |  ( |  const ACHAR *  |  failReason | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxvar.h