Public Member Functions | List of all members
AcPlPlotEngine Class Reference
AcPl Classes
 Public Member Functions
virtual Acad::ErrorStatus  | beginDocument (AcPlPlotInfo &plotInfo, const ACHAR *pDocname, void *pParams=NULL, Adesk::Int32 nCopies=1, bool bPlotToFile=false, const ACHAR *pFileName=NULL)
virtual Acad::ErrorStatus  | beginGenerateGraphics (void *pParams=NULL)
virtual Acad::ErrorStatus  | beginGenerateGraphics (AcViewport *&pViewport, void *pParams=NULL)
virtual Acad::ErrorStatus  | beginPage (AcPlPlotPageInfo &pageInfo, AcPlPlotInfo &plotInfo, bool bLastPage, void *pParams=NULL)
virtual Acad::ErrorStatus  | beginPlot (AcPlPlotProgress *pPlotProgress, void *pParams=NULL)
virtual void  | destroy ()
virtual Acad::ErrorStatus  | endDocument (void *pParams=NULL)
virtual Acad::ErrorStatus  | endGenerateGraphics (void *pParams=NULL)
virtual Acad::ErrorStatus  | endPage (void *pParams=NULL)
virtual Acad::ErrorStatus  | endPlot (void *pParams=NULL)
virtual bool  | isBackgroundPackaging () const
Member Function Documentation
 virtual Acad::ErrorStatus AcPlPlotEngine::beginDocument  |  ( |  AcPlPlotInfo &  |  plotInfo,
|  const ACHAR *  |  pDocname,
|  void *  |  pParams = NULL,
|  Adesk::Int32  |  nCopies = 1,
|  bool  |  bPlotToFile = false,
|  const ACHAR *  |  pFileName = NULL
)
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcPlPlotEngine::beginGenerateGraphics  |  ( |  void *  |  pParams = NULL | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcPlPlotEngine::beginGenerateGraphics  |  ( |  AcViewport *&  |  pViewport,
|  void *  |  pParams = NULL
)
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcPlPlotEngine::beginPage  |  ( |  AcPlPlotPageInfo &  |  pageInfo,
|  AcPlPlotInfo &  |  plotInfo,
|  bool  |  bLastPage,
|  void *  |  pParams = NULL
)
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcPlPlotEngine::beginPlot  |  ( |  AcPlPlotProgress *  |  pPlotProgress,
|  void *  |  pParams = NULL
)
virtual
Warning
Not implemented!
 virtual void AcPlPlotEngine::destroy  |  ( |   | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcPlPlotEngine::endDocument  |  ( |  void *  |  pParams = NULL | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcPlPlotEngine::endGenerateGraphics  |  ( |  void *  |  pParams = NULL | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcPlPlotEngine::endPage  |  ( |  void *  |  pParams = NULL | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcPlPlotEngine::endPlot  |  ( |  void *  |  pParams = NULL | )
virtual
Warning
Not implemented!
 virtual bool AcPlPlotEngine::isBackgroundPackaging  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acplplotengine.h