Public Member Functions | Protected Attributes | List of all members
AcGiVariant::EnumType Class Reference
AcGi Classes
 Public Member Functions
EnumType (int value)
 template<typename T >
operator T ()
 template<typename T >
bool  | operator!= (T right) const
 template<typename T >
bool  | operator== (T right) const
 Protected Attributes
 int  | m_value
 The documentation for this class was generated from the following file:
acgi.h