Public Member Functions | Static Public Member Functions | List of all members
AcRxCategory Class Reference
AcRx Classes
  Inheritance diagram for AcRxCategory:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxCategory, ACBASE_PORT)
ACBASE_PORT  | AcRxCategory (const ACHAR *name, AcRxCategory *pOwner) throw ()
ACBASE_PORT AcRxCategory *  | findDescendant (const ACHAR *name) const
ACBASE_PORT Acad::ErrorStatus  | removeChild (AcRxCategory *pChildCategory)
 Public Member Functions inherited from AcRxMember
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxMember, ACBASE_PORT)
ACBASE_PORT const AcRxAttributeCollection &  | attributes () const throw ()
ACBASE_PORT AcRxAttributeCollection &  | attributes () throw ()
ACBASE_PORT const AcArray< const AcRxMember * > *  | children () const throw ()
ACBASE_PORT AcString  | localName () const throw ()
ACBASE_PORT const ACHAR *  | name () const throw ()
ACBASE_PORT const AcRxObject *  | owner () const throw ()
ACBASE_PORT const AcRxValueType &  | type () const throw ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static ACBASE_PORT AcRxCategory *  | rootCategory ()
 Static Public Member Functions inherited from AcRxMember
static ACBASE_PORT void  | deleteMember (const AcRxMember *pMember) throw ()
static ACBASE_PORT void *  | operator new (size_t size)
static ACBASE_PORT void *  | operator new (size_t size, const char *pFName, int nLine)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Additional Inherited Members
 Protected Member Functions inherited from AcRxMember
ACBASE_PORT  | AcRxMember (AcRxMemberImp *) throw ()
virtual ACBASE_PORT Acad::ErrorStatus  | subChildren (AcArray< const AcRxMember * > &children) const
virtual ACBASE_PORT AcString  | subLocalName () const
virtual ACBASE_PORT  | ~AcRxMember () throw ()
 Protected Member Functions inherited from Pimpl::ApiPart< AcRxObject, AcRxMemberImp >
ApiPart (AcRxMemberImp *pImp) throw ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Static Protected Member Functions inherited from AcRxMember
static ACBASE_PORT void  | operator delete (void *p)
static ACBASE_PORT void  | operator delete (void *p, const char *pFName, int nLine)
static ACBASE_PORT void  | operator delete[] (void *p)
static ACBASE_PORT void  | operator delete[] (void *p, const char *pFName, int nLine)
Constructor & Destructor Documentation
 ACBASE_PORT AcRxCategory::AcRxCategory  |  ( |  const ACHAR *  |  name,
|  AcRxCategory *  |  pOwner
)
 throw  | (
)
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT AcRxCategory* AcRxCategory::findDescendant  |  ( |  const ACHAR *  |  name | ) |   const
Warning
Not implemented!
 ACBASE_PORT Acad::ErrorStatus AcRxCategory::removeChild  |  ( |  AcRxCategory *  |  pChildCategory | )
Warning
Not implemented!
 static ACBASE_PORT AcRxCategory* AcRxCategory::rootCategory  |  ( |   | )
static
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxcategory.h