Public Member Functions | List of all members
AcHelpParameter Class Reference
AcDb Classes
  Inheritance diagram for AcHelpParameter:
 Public Member Functions
AcHelpParameter (bool bCreateImp=true)
ACRX_DECLARE_MEMBERS (AcHelpParameter)
Acad::ErrorStatus  | getConnectedConstraint (AcGeomConstraint *&pConstraint) const
Acad::ErrorStatus  | getConnectedEqualparamConstraints (AcArray< AcEqualHelpParameterConstraint * > &apEqualParamConstrs) const
Acad::ErrorStatus  | getConnectedGeometry (AcConstrainedGeometry *&pGeometry) const
double  | getValue () const
 Public Member Functions inherited from AcConstraintGroupNode
ACRX_DECLARE_MEMBERS (AcConstraintGroupNode)
AcDbObjectId  | owningConstraintGroupId () const
virtual  | ~AcConstraintGroupNode ()
 Public Member Functions inherited from AcGraphNode
ACRX_DECLARE_MEMBERS (AcGraphNode)
virtual void  | backup ()
Acad::ErrorStatus  | connectNode (AcGraphNode *pNode)
Acad::ErrorStatus  | disconnectAllNodes ()
Acad::ErrorStatus  | disconnectNode (AcGraphNode *pNode)
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
Acad::ErrorStatus  | getAdjacentNodes (AcArray< AcGraphNode * > &adjacentNodes) const
bool  | isAdjacentTo (AcGraphNode *pNode) const
Id  | nodeId () const
virtual Acad::ErrorStatus  | nodeToBeConnectedNotification (AcGraphNode *pNode)
virtual Acad::ErrorStatus  | nodeToBeDisconnectedNotification (AcGraphNode *pNode)
virtual Acad::ErrorStatus  | nodeToBeMovedNotification (AcGraph *pGraph, AcArray< AcGraphNode * > &otherNodesToMove)
AcGraph *  | owningGraph () const
virtual  | ~AcGraphNode ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcGraphNode
enum  | { kNullId = 0 }
 typedef Adesk::UInt32  | Id
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Protected Member Functions inherited from AcConstraintGroupNode
AcConstraintGroupNode ()
 Protected Member Functions inherited from AcGraphNode
AcGraphNode (bool bCreateImp=true)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Protected Attributes inherited from AcGraphNode
 AcImpGraphNode *  | mpImpGraphNode
Constructor & Destructor Documentation
 AcHelpParameter::AcHelpParameter  |  ( |  bool  |  bCreateImp = true | )
Warning
Not implemented!
Member Function Documentation
 Acad::ErrorStatus AcHelpParameter::getConnectedConstraint  |  ( |  AcGeomConstraint *&  |  pConstraint | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcHelpParameter::getConnectedEqualparamConstraints  |  ( |  AcArray< AcEqualHelpParameterConstraint * > &  |  apEqualParamConstrs | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcHelpParameter::getConnectedGeometry  |  ( |  AcConstrainedGeometry *&  |  pGeometry | ) |   const
Warning
Not implemented!
 double AcHelpParameter::getValue  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcGeomConstraint.h