Public Member Functions | List of all members
AcDbPathRef Class Reference
AcDb Classes
  Inheritance diagram for AcDbPathRef:
 Public Member Functions
AcDbPathRef ()
AcDbPathRef (const AcDbPathRef &)
AcDbPathRef (const AcArray< AcDbEdgeRef > &)
AcDbPathRef (const AcDbFullSubentPathArray &edgeSubentPathArr, const AcDbFullSubentPathArray &faceSubentPathArr)
ACRX_DECLARE_MEMBERS (AcDbPathRef)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *) override
virtual AcDbEntity *  | createEntity () const override
 const AcArray< AcDbEdgeRef > &  | edgeRefs () const
virtual Acad::ErrorStatus  | evaluateAndCacheGeometry () override
Acad::ErrorStatus  | getEntityArray (AcArray< AcDbEntity * > &entities, bool concatenate) const
virtual bool  | isEmpty () const override
bool  | isEqualTo (const AcGeCurve3d *)
bool  | isReferencePath ()
virtual bool  | isValid () const override
virtual void  | reset () override
void  | setEdgeRefs (const AcArray< AcDbEdgeRef > &edges)
virtual  | ~AcDbPathRef ()
 Public Member Functions inherited from AcDbGeomRef
ACRX_DECLARE_MEMBERS (AcDbGeomRef)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbPathRef::AcDbPathRef  |  ( |   | )
Warning
Not implemented!
 AcDbPathRef::AcDbPathRef  |  ( |  const AcDbPathRef &  |   | )
Warning
Not implemented!
 AcDbPathRef::AcDbPathRef  |  ( |  const AcArray< AcDbEdgeRef > &  |   | )
explicit
Warning
Not implemented!
 AcDbPathRef::AcDbPathRef  |  ( |  const AcDbFullSubentPathArray &  |  edgeSubentPathArr,
|  const AcDbFullSubentPathArray &  |  faceSubentPathArr
)
Warning
Not implemented!
 virtual AcDbPathRef::~AcDbPathRef  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbPathRef::copyFrom  |  ( |  const AcRxObject *  |   | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 virtual AcDbEntity* AcDbPathRef::createEntity  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 virtual Acad::ErrorStatus AcDbPathRef::evaluateAndCacheGeometry  |  ( |   | )
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 Acad::ErrorStatus AcDbPathRef::getEntityArray  |  ( |  AcArray< AcDbEntity * > &  |  entities,
|  bool  |  concatenate
) |   |  const
Warning
Not implemented!
 virtual bool AcDbPathRef::isEmpty  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 bool AcDbPathRef::isEqualTo  |  ( |  const AcGeCurve3d *  |   | )
Warning
Not implemented!
 bool AcDbPathRef::isReferencePath  |  ( |   | )
Warning
Not implemented!
 virtual bool AcDbPathRef::isValid  |  ( |   | ) |   const
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 virtual void AcDbPathRef::reset  |  ( |   | )
overridevirtual
Warning
Not implemented!
Implements AcDbGeomRef.
 void AcDbPathRef::setEdgeRefs  |  ( |  const AcArray< AcDbEdgeRef > &  |  edges | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbGeomRef.h