Public Types | Public Member Functions | Protected Member Functions | Friends | List of all members
AcDbMentalRayRenderSettings Class Reference
AcDb Classes
  Inheritance diagram for AcDbMentalRayRenderSettings:
 Public Types
enum  | ShadowSamplingMultiplier {
 kSamplingMultiplierZero = 0, kSamplingMultiplierOneEighth, kSamplingMultiplierOneFourth, kSamplingMultiplierOneHalf,
 kSamplingMultiplierOne, kSamplingMultiplierTwo
 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Public Member Functions
AcDbMentalRayRenderSettings ()
ACRX_DECLARE_MEMBERS (AcDbMentalRayRenderSettings)
Acad::ErrorStatus  | copyFrom (const AcRxObject *other) override
AcGiMrDiagnosticBSPMode  | diagnosticBSPMode () const
void  | diagnosticGridMode (AcGiMrDiagnosticGridMode &eDiagnosticGridMode, float &fSize) const
AcGiMrDiagnosticMode  | diagnosticMode () const
AcGiMrDiagnosticPhotonMode  | diagnosticPhotonMode () const
bool  | diagnosticSamplesMode () const
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) override
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const override
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) override
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const override
float  | energyMultiplier () const
bool  | exportMIEnabled () const
AcString  | exportMIFileName () const
AcGiMrExportMIMode  | exportMIMode () const
int  | fgRayCount () const
void  | fgSampleRadius (double &fMin, double &fMax) const
void  | fgSampleRadiusState (bool &bMin, bool &bMax, bool &bPixels) const
bool  | finalGatheringEnabled () const
AcGiMrFinalGatheringMode  | finalGatheringMode () const
int  | giPhotonsPerLight () const
int  | giSampleCount () const
double  | giSampleRadius () const
bool  | giSampleRadiusEnabled () const
bool  | globalIlluminationEnabled () const
double  | lightLuminanceScale () const
int  | memoryLimit () const
virtual bool  | operator== (const AcDbMentalRayRenderSettings &settings)
void  | photonTraceDepth (int &iReflection, int &iRefraction, int &iSum) const
void  | rayTraceDepth (int &iReflection, int &iRefraction, int &iSum) const
bool  | rayTracingEnabled () const
void  | sampling (int &iMin, int &iMax) const
void  | samplingContrastColor (float &r, float &g, float &b, float &a) const
void  | SamplingFilter (AcGiMrFilter &eFilter, double &fWidth, double &fHeight) const
void  | setDiagnosticBSPMode (AcGiMrDiagnosticBSPMode eDiagnosticBSPMode)
Acad::ErrorStatus  | setDiagnosticGridMode (AcGiMrDiagnosticGridMode eDiagnosticGridMode, float fSize)
void  | setDiagnosticMode (AcGiMrDiagnosticMode eDiagnosticMode)
void  | setDiagnosticPhotonMode (AcGiMrDiagnosticPhotonMode eDiagnosticPhotonMode)
void  | setDiagnosticSamplesMode (bool bDiagnosticSamplesMode)
Acad::ErrorStatus  | setEnergyMultiplier (float fScale)
void  | setExportMIEnabled (bool bEnabled)
Acad::ErrorStatus  | setExportMIFileName (const AcString &strFileName)
Acad::ErrorStatus  | setExportMIMode (AcGiMrExportMIMode eExportMIMode)
void  | setFGRadiusState (bool bMin, bool bMax, bool bPixels)
Acad::ErrorStatus  | setFGRayCount (int iNum)
Acad::ErrorStatus  | setFGSampleRadius (double fMin, double fMax)
void  | setFinalGatheringEnabled (bool bEnabled)
Acad::ErrorStatus  | setFinalGatheringMode (AcGiMrFinalGatheringMode mode)
Acad::ErrorStatus  | setGIPhotonsPerLight (int iNum)
Acad::ErrorStatus  | setGISampleCount (int iNum)
Acad::ErrorStatus  | setGISampleRadius (double fRadius)
void  | setGISampleRadiusEnabled (bool bEnabled)
void  | setGlobalIlluminationEnabled (bool bEnabled)
Acad::ErrorStatus  | setLightLuminanceScale (double fLuminance)
Acad::ErrorStatus  | setMemoryLimit (int iMemoryLimit)
Acad::ErrorStatus  | setPhotonTraceDepth (int iReflection, int iRefraction, int iSum)
Acad::ErrorStatus  | setRayTraceDepth (int iReflection, int iRefraction, int iSum)
void  | setRayTracingEnabled (bool bEnabled)
Acad::ErrorStatus  | setSampling (int iMin, int iMax)
Acad::ErrorStatus  | setSamplingContrastColor (float r, float g, float b, float a)
Acad::ErrorStatus  | setSamplingFilter (AcGiMrFilter eFilter, double fWidth, double fHeight)
void  | setShadowMapsEnabled (bool bEnabled)
void  | setShadowMode (AcGiMrShadowMode eShadowMode)
Acad::ErrorStatus  | setShadowSamplingMultiplier (AcDbMentalRayRenderSettings::ShadowSamplingMultiplier multiplier)
void  | setTileOrder (AcGiMrTileOrder eTileOrder)
Acad::ErrorStatus  | setTileSize (int iTileSize)
bool  | shadowMapsEnabled () const
AcGiMrShadowMode  | shadowMode () const
AcDbMentalRayRenderSettings::ShadowSamplingMultiplier  | shadowSamplingMultiplier () const
AcGiMrTileOrder  | tileOrder () const
int  | tileSize () const
virtual  | ~AcDbMentalRayRenderSettings ()
 Public Member Functions inherited from AcDbRenderSettings
AcDbRenderSettings ()
AcDbRenderSettings (AcDbImpRenderSettings *)
ACRX_DECLARE_MEMBERS (AcDbRenderSettings)
bool  | backFacesEnabled () const
AcString  | description () const
bool  | diagnosticBackgroundEnabled () const
int  | displayIndex () const
virtual AcGiDrawable *  | drawable () override
bool  | isPredefined () const
bool  | materialsEnabled () const
AcString  | name () const
virtual bool  | operator== (const AcDbRenderSettings &settings)
AcString  | previewImageFileName () const
void  | setBackFacesEnabled (bool bEnabled)
void  | setDescription (const AcString &strDes)
void  | setDiagnosticBackgroundEnabled (bool bEnabled)
void  | setDisplayIndex (int idx)
Acad::ErrorStatus  | setIsPredefined (bool bPredefined)
void  | setMaterialsEnabled (bool bEnabled)
Acad::ErrorStatus  | setName (const AcString &strName)
Acad::ErrorStatus  | setPreviewImageFileName (const AcString &strFileName)
void  | setShadowsEnabled (bool bEnabled)
void  | setTextureSampling (bool bSampling)
bool  | shadowsEnabled () const
bool  | textureSampling () const
virtual  | ~AcDbRenderSettings ()
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpMentalRayRenderSettings
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Protected Attributes inherited from AcDbRenderSettings
 AcDbImpRenderSettings *  | mpImp
Constructor & Destructor Documentation
 AcDbMentalRayRenderSettings::AcDbMentalRayRenderSettings  |  ( |   | )
Warning
Not implemented!
 virtual AcDbMentalRayRenderSettings::~AcDbMentalRayRenderSettings  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 Acad::ErrorStatus AcDbMentalRayRenderSettings::copyFrom  |  ( |  const AcRxObject *  |  other | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRenderSettings.
 AcGiMrDiagnosticBSPMode AcDbMentalRayRenderSettings::diagnosticBSPMode  |  ( |   | ) |   const
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::diagnosticGridMode  |  ( |  AcGiMrDiagnosticGridMode &  |  eDiagnosticGridMode,
|  float &  |  fSize
) |   |  const
Warning
Not implemented!
 AcGiMrDiagnosticMode AcDbMentalRayRenderSettings::diagnosticMode  |  ( |   | ) |   const
Warning
Not implemented!
 AcGiMrDiagnosticPhotonMode AcDbMentalRayRenderSettings::diagnosticPhotonMode  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbMentalRayRenderSettings::diagnosticSamplesMode  |  ( |   | ) |   const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbMentalRayRenderSettings::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRenderSettings.
 virtual Acad::ErrorStatus AcDbMentalRayRenderSettings::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRenderSettings.
 virtual Acad::ErrorStatus AcDbMentalRayRenderSettings::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRenderSettings.
 virtual Acad::ErrorStatus AcDbMentalRayRenderSettings::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
overridevirtual
Warning
Not implemented!
Reimplemented from AcDbRenderSettings.
 float AcDbMentalRayRenderSettings::energyMultiplier  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbMentalRayRenderSettings::exportMIEnabled  |  ( |   | ) |   const
Warning
Not implemented!
 AcString AcDbMentalRayRenderSettings::exportMIFileName  |  ( |   | ) |   const
Warning
Not implemented!
 AcGiMrExportMIMode AcDbMentalRayRenderSettings::exportMIMode  |  ( |   | ) |   const
Warning
Not implemented!
 int AcDbMentalRayRenderSettings::fgRayCount  |  ( |   | ) |   const
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::fgSampleRadius  |  ( |  double &  |  fMin,
|  double &  |  fMax
) |   |  const
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::fgSampleRadiusState  |  ( |  bool &  |  bMin,
|  bool &  |  bMax,
|  bool &  |  bPixels
) |   |  const
Warning
Not implemented!
 bool AcDbMentalRayRenderSettings::finalGatheringEnabled  |  ( |   | ) |   const
Warning
Not implemented!
 AcGiMrFinalGatheringMode AcDbMentalRayRenderSettings::finalGatheringMode  |  ( |   | ) |   const
Warning
Not implemented!
 int AcDbMentalRayRenderSettings::giPhotonsPerLight  |  ( |   | ) |   const
Warning
Not implemented!
 int AcDbMentalRayRenderSettings::giSampleCount  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbMentalRayRenderSettings::giSampleRadius  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbMentalRayRenderSettings::giSampleRadiusEnabled  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbMentalRayRenderSettings::globalIlluminationEnabled  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbMentalRayRenderSettings::lightLuminanceScale  |  ( |   | ) |   const
Warning
Not implemented!
 int AcDbMentalRayRenderSettings::memoryLimit  |  ( |   | ) |   const
Warning
Not implemented!
 virtual bool AcDbMentalRayRenderSettings::operator==  |  ( |  const AcDbMentalRayRenderSettings &  |  settings | )
virtual
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::photonTraceDepth  |  ( |  int &  |  iReflection,
|  int &  |  iRefraction,
|  int &  |  iSum
) |   |  const
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::rayTraceDepth  |  ( |  int &  |  iReflection,
|  int &  |  iRefraction,
|  int &  |  iSum
) |   |  const
Warning
Not implemented!
 bool AcDbMentalRayRenderSettings::rayTracingEnabled  |  ( |   | ) |   const
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::sampling  |  ( |  int &  |  iMin,
|  int &  |  iMax
) |   |  const
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::samplingContrastColor  |  ( |  float &  |  r,
|  float &  |  g,
|  float &  |  b,
|  float &  |  a
) |   |  const
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::SamplingFilter  |  ( |  AcGiMrFilter &  |  eFilter,
|  double &  |  fWidth,
|  double &  |  fHeight
) |   |  const
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setDiagnosticBSPMode  |  ( |  AcGiMrDiagnosticBSPMode  |  eDiagnosticBSPMode | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setDiagnosticGridMode  |  ( |  AcGiMrDiagnosticGridMode  |  eDiagnosticGridMode,
|  float  |  fSize
)
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setDiagnosticMode  |  ( |  AcGiMrDiagnosticMode  |  eDiagnosticMode | )
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setDiagnosticPhotonMode  |  ( |  AcGiMrDiagnosticPhotonMode  |  eDiagnosticPhotonMode | )
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setDiagnosticSamplesMode  |  ( |  bool  |  bDiagnosticSamplesMode | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setEnergyMultiplier  |  ( |  float  |  fScale | )
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setExportMIEnabled  |  ( |  bool  |  bEnabled | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setExportMIFileName  |  ( |  const AcString &  |  strFileName | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setExportMIMode  |  ( |  AcGiMrExportMIMode  |  eExportMIMode | )
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setFGRadiusState  |  ( |  bool  |  bMin,
|  bool  |  bMax,
|  bool  |  bPixels
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setFGRayCount  |  ( |  int  |  iNum | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setFGSampleRadius  |  ( |  double  |  fMin,
|  double  |  fMax
)
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setFinalGatheringEnabled  |  ( |  bool  |  bEnabled | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setFinalGatheringMode  |  ( |  AcGiMrFinalGatheringMode  |  mode | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setGIPhotonsPerLight  |  ( |  int  |  iNum | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setGISampleCount  |  ( |  int  |  iNum | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setGISampleRadius  |  ( |  double  |  fRadius | )
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setGISampleRadiusEnabled  |  ( |  bool  |  bEnabled | )
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setGlobalIlluminationEnabled  |  ( |  bool  |  bEnabled | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setLightLuminanceScale  |  ( |  double  |  fLuminance | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setMemoryLimit  |  ( |  int  |  iMemoryLimit | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setPhotonTraceDepth  |  ( |  int  |  iReflection,
|  int  |  iRefraction,
|  int  |  iSum
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setRayTraceDepth  |  ( |  int  |  iReflection,
|  int  |  iRefraction,
|  int  |  iSum
)
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setRayTracingEnabled  |  ( |  bool  |  bEnabled | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setSampling  |  ( |  int  |  iMin,
|  int  |  iMax
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setSamplingContrastColor  |  ( |  float  |  r,
|  float  |  g,
|  float  |  b,
|  float  |  a
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setSamplingFilter  |  ( |  AcGiMrFilter  |  eFilter,
|  double  |  fWidth,
|  double  |  fHeight
)
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setShadowMapsEnabled  |  ( |  bool  |  bEnabled | )
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setShadowMode  |  ( |  AcGiMrShadowMode  |  eShadowMode | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setShadowSamplingMultiplier  |  ( |  AcDbMentalRayRenderSettings::ShadowSamplingMultiplier  |  multiplier | )
Warning
Not implemented!
 void AcDbMentalRayRenderSettings::setTileOrder  |  ( |  AcGiMrTileOrder  |  eTileOrder | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMentalRayRenderSettings::setTileSize  |  ( |  int  |  iTileSize | )
Warning
Not implemented!
 bool AcDbMentalRayRenderSettings::shadowMapsEnabled  |  ( |   | ) |   const
Warning
Not implemented!
 AcGiMrShadowMode AcDbMentalRayRenderSettings::shadowMode  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbMentalRayRenderSettings::ShadowSamplingMultiplier AcDbMentalRayRenderSettings::shadowSamplingMultiplier  |  ( |   | ) |   const
Warning
Not implemented!
 virtual Adesk::UInt32 AcDbMentalRayRenderSettings::subSetAttributes  |  ( |  AcGiDrawableTraits *  |  pTraits | )
overrideprotectedvirtual
Warning
Not implemented!
Reimplemented from AcDbRenderSettings.
 AcGiMrTileOrder AcDbMentalRayRenderSettings::tileOrder  |  ( |   | ) |   const
Warning
Not implemented!
 int AcDbMentalRayRenderSettings::tileSize  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbRender.h