Public Member Functions | List of all members
AcApDocWindowManagerReactor Class Reference
AcAp Classes
 Public Member Functions
virtual ACAD_PORT void  | documentWindowActivated (AcApDocWindow *docWindow)
warning Not implemented! More...
virtual ACAD_PORT void  | documentWindowCreated (AcApDocWindow *docWindow)
warning Not implemented! More...
virtual ACAD_PORT void  | documentWindowDestroyed (AcApDocWindow *docWindow)
warning Not implemented! More...
virtual ACAD_PORT void  | documentWindowMoved (AcApDocWindow *docWindow, int newIndex, int oldIndex)
warning Not implemented! More...
virtual ACAD_PORT void  | documentWindowReplaced (AcApDocWindow *newDocWindow, AcApDocWindow *oldDocWindow)
warning Not implemented! More...
Member Function Documentation
 virtual ACAD_PORT void AcApDocWindowManagerReactor::documentWindowActivated  |  ( |  AcApDocWindow *  |  docWindow | )
virtual
warning Not implemented!
 virtual ACAD_PORT void AcApDocWindowManagerReactor::documentWindowCreated  |  ( |  AcApDocWindow *  |  docWindow | )
virtual
warning Not implemented!
 virtual ACAD_PORT void AcApDocWindowManagerReactor::documentWindowDestroyed  |  ( |  AcApDocWindow *  |  docWindow | )
virtual
warning Not implemented!
 virtual ACAD_PORT void AcApDocWindowManagerReactor::documentWindowMoved  |  ( |  AcApDocWindow *  |  docWindow,
|  int  |  newIndex,
|  int  |  oldIndex
)
virtual
warning Not implemented!
 virtual ACAD_PORT void AcApDocWindowManagerReactor::documentWindowReplaced  |  ( |  AcApDocWindow *  |  newDocWindow,
|  AcApDocWindow *  |  oldDocWindow
)
virtual
warning Not implemented!
 The documentation for this class was generated from the following file:
AcApDocWindow.h