Public Types | Public Member Functions | Static Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcDbTextEditorSelectionBase Class Reference
AcDb Classes
  Inheritance diagram for AcDbTextEditorSelectionBase:
 Public Types
enum  | FlowAlign { kFlowBase, kFlowCenter, kFlowTop }
enum  | InsertTextType {
 kUnicodeMTextFormat, kMTextFormat, kRichTextFormat, kUnicodeDTextFormat,
 kDTextFormat, kUnicodeTextFormat, kMultibyteTextFormat
 }
 Public Member Functions
ACDBCORE2D_PORT bool  | bold () const
ACDBCORE2D_PORT AcCmColor  | color () const
ACDBCORE2D_PORT FlowAlign  | flowAlign () const
ACDBCORE2D_PORT AcString  | font () const
ACDBCORE2D_PORT double  | height () const
ACDBCORE2D_PORT Acad::ErrorStatus  | inputSpecialChar (Adesk::UInt32 c)
ACDBCORE2D_PORT Acad::ErrorStatus  | insertColumnBreak ()
ACDBCORE2D_PORT Acad::ErrorStatus  | insertImportedText (InsertTextType insertType, void *pData)
ACDBCORE2D_PORT Acad::ErrorStatus  | insertString (const AcString &str)
ACDBCORE2D_PORT Acad::ErrorStatus  | insertSymbol (ACHAR wch, Charset charset)
ACDBCORE2D_PORT bool  | isTrueType () const
ACDBCORE2D_PORT bool  | italic () const
ACDBCORE2D_PORT Charset  | language () const
ACDBCORE2D_PORT double  | obliqueAngle () const
ACDBCORE2D_PORT bool  | overline () const
ACDBCORE2D_PORT Acad::ErrorStatus  | setColor (const AcCmColor &color)
ACDBCORE2D_PORT Acad::ErrorStatus  | setFlowAlign (FlowAlign flowAlign)
ACDBCORE2D_PORT Acad::ErrorStatus  | setFont (const AcString &fontname, bool bTrueType)
ACDBCORE2D_PORT Acad::ErrorStatus  | setHeight (double height)
ACDBCORE2D_PORT Acad::ErrorStatus  | setLanguage (Charset charset)
ACDBCORE2D_PORT Acad::ErrorStatus  | setObliqueAngle (double angle)
ACDBCORE2D_PORT Acad::ErrorStatus  | setTrackingFactor (double factor)
ACDBCORE2D_PORT Acad::ErrorStatus  | setWidthScale (double scale)
ACDBCORE2D_PORT bool  | strikethrough () const
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleBold ()
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleItalic ()
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleOverline ()
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleStrikethrough ()
ACDBCORE2D_PORT Acad::ErrorStatus  | toggleUnderline ()
ACDBCORE2D_PORT double  | trackingFactor () const
ACDBCORE2D_PORT bool  | underline () const
ACDBCORE2D_PORT double  | widthScale () const
 Static Public Member Functions
static ACDBCORE2D_PORT double  | maxObliqueAngle ()
static ACDBCORE2D_PORT double  | maxTrackingFactor ()
static ACDBCORE2D_PORT double  | maxWidthScale ()
static ACDBCORE2D_PORT double  | minObliqueAngle ()
static ACDBCORE2D_PORT double  | minTrackingFactor ()
static ACDBCORE2D_PORT double  | minWidthScale ()
 Protected Member Functions
AcDbTextEditorSelectionBase ()
AcDbTextEditorSelectionBase (const AcDbTextEditorSelectionBase &)
AcDbTextEditorSelectionBase &  | operator= (const AcDbTextEditorSelectionBase &)
virtual  | ~AcDbTextEditorSelectionBase ()
 Protected Attributes
 AcDbImpTextEditorSelectionBase *  | m_pImp
 Friends
 class  | AcDbTextEditor
Constructor & Destructor Documentation
 AcDbTextEditorSelectionBase::AcDbTextEditorSelectionBase  |  ( |   | )
protected
Warning
Not implemented!
 virtual AcDbTextEditorSelectionBase::~AcDbTextEditorSelectionBase  |  ( |   | )
protectedvirtual
Warning
Not implemented!
 AcDbTextEditorSelectionBase::AcDbTextEditorSelectionBase  |  ( |  const AcDbTextEditorSelectionBase &  |   | )
protected
Warning
Not implemented!
Member Function Documentation
 ACDBCORE2D_PORT bool AcDbTextEditorSelectionBase::bold  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcCmColor AcDbTextEditorSelectionBase::color  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT FlowAlign AcDbTextEditorSelectionBase::flowAlign  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT AcString AcDbTextEditorSelectionBase::font  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbTextEditorSelectionBase::height  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::inputSpecialChar  |  ( |  Adesk::UInt32  |  c | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::insertColumnBreak  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::insertImportedText  |  ( |  InsertTextType  |  insertType,
|  void *  |  pData
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::insertString  |  ( |  const AcString &  |  str | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::insertSymbol  |  ( |  ACHAR  |  wch,
|  Charset  |  charset
)
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelectionBase::isTrueType  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelectionBase::italic  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Charset AcDbTextEditorSelectionBase::language  |  ( |   | ) |   const
Warning
Not implemented!
 static ACDBCORE2D_PORT double AcDbTextEditorSelectionBase::maxObliqueAngle  |  ( |   | )
static
Warning
Not implemented!
 static ACDBCORE2D_PORT double AcDbTextEditorSelectionBase::maxTrackingFactor  |  ( |   | )
static
Warning
Not implemented!
 static ACDBCORE2D_PORT double AcDbTextEditorSelectionBase::maxWidthScale  |  ( |   | )
static
Warning
Not implemented!
 static ACDBCORE2D_PORT double AcDbTextEditorSelectionBase::minObliqueAngle  |  ( |   | )
static
Warning
Not implemented!
 static ACDBCORE2D_PORT double AcDbTextEditorSelectionBase::minTrackingFactor  |  ( |   | )
static
Warning
Not implemented!
 static ACDBCORE2D_PORT double AcDbTextEditorSelectionBase::minWidthScale  |  ( |   | )
static
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbTextEditorSelectionBase::obliqueAngle  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbTextEditorSelectionBase& AcDbTextEditorSelectionBase::operator=  |  ( |  const AcDbTextEditorSelectionBase &  |   | )
protected
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelectionBase::overline  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::setColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::setFlowAlign  |  ( |  FlowAlign  |  flowAlign | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::setFont  |  ( |  const AcString &  |  fontname,
|  bool  |  bTrueType
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::setHeight  |  ( |  double  |  height | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::setLanguage  |  ( |  Charset  |  charset | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::setObliqueAngle  |  ( |  double  |  angle | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::setTrackingFactor  |  ( |  double  |  factor | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::setWidthScale  |  ( |  double  |  scale | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelectionBase::strikethrough  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::toggleBold  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::toggleItalic  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::toggleOverline  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::toggleStrikethrough  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus AcDbTextEditorSelectionBase::toggleUnderline  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbTextEditorSelectionBase::trackingFactor  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT bool AcDbTextEditorSelectionBase::underline  |  ( |   | ) |   const
Warning
Not implemented!
 ACDBCORE2D_PORT double AcDbTextEditorSelectionBase::widthScale  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbtexteditor.h