Public Member Functions | List of all members
AcGiTransientManager Class Referenceabstract
AcGi Classes
 Public Member Functions
 virtual bool  | addChildTransient (AcGiDrawable *pDrawable, AcGiDrawable *pParentDrawable)=0
 virtual bool  | addTransient (AcGiDrawable *pDrawable, AcGiTransientDrawingMode mode, int subDrawingMode, const AcArray< int > &viewportNumbers)=0
 virtual bool  | eraseChildTransient (AcGiDrawable *pDrawable, AcGiDrawable *pParentDrawable)=0
 virtual bool  | eraseTransient (AcGiDrawable *pDrawable, const AcArray< int > &viewportNumbers)=0
 virtual bool  | eraseTransients (AcGiTransientDrawingMode mode, int subDrawingMode, const AcArray< int > &viewportNumbers)=0
 virtual int  | getFreeSubDrawingMode (AcGiTransientDrawingMode mode, int &subDrawingMode, const AcArray< int > &viewportNumbers)=0
 virtual void  | updateChildTransient (AcGiDrawable *pDrawable, AcGiDrawable *pParentDrawable)=0
 virtual void  | updateTransient (AcGiDrawable *pDrawable, const AcArray< int > &viewportNumbers)=0
 The documentation for this class was generated from the following file:
acgitransient.h