Public Member Functions | List of all members
AcGiPixelBGRA32 Class Reference
AcGi Classes
 Public Member Functions
AcGiPixelBGRA32 (Adesk::UInt32 bgra)
AcGiPixelBGRA32 (Adesk::UInt8 blue, Adesk::UInt8 green, Adesk::UInt8 red, Adesk::UInt8 alpha)
 Adesk::UInt8  | alpha () const
 Adesk::UInt8  | blue () const
 Adesk::UInt32  | getBGRA () const
 Adesk::UInt32  | getRGBA () const
 Adesk::UInt8  | green () const
 Adesk::UInt8  | red () const
 void  | setAlpha (Adesk::UInt8 alpha)
 void  | setBGRA (Adesk::UInt32 bgra)
 void  | setBGRA (Adesk::UInt8 blue, Adesk::UInt8 green, Adesk::UInt8 red, Adesk::UInt8 alpha)
 void  | setBlue (Adesk::UInt8 blue)
 void  | setGreen (Adesk::UInt8 green)
 void  | setRed (Adesk::UInt8 red)
 void  | setRGBA (Adesk::UInt32 rgba)
 void  | setRGBA (Adesk::UInt8 red, Adesk::UInt8 green, Adesk::UInt8 blue, Adesk::UInt8 alpha)
 The documentation for this class was generated from the following file:
acgi.h