Public Member Functions | Friends | List of all members
AcDbPointCloudClassificationColorRamp Class Reference
AcDb Classes
 Public Member Functions
AcDbPointCloudClassificationColorRamp ()
AcCmEntityColor  | color (int c) const
const AcString  | name () const
Adesk::Int32  | numColors () const
void  | setColor (int c, AcCmEntityColor color)
void  | setFrom (const AcDbPointCloudClassificationColorRamp *source)
Acad::ErrorStatus  | setName (const AcString &name)
void  | setVisibility (int c, bool visibility)
bool  | visibility (int c) const
~AcDbPointCloudClassificationColorRamp ()
 Friends
 class  | PointCloudColorMapImp
Constructor & Destructor Documentation
 AcDbPointCloudClassificationColorRamp::AcDbPointCloudClassificationColorRamp  |  ( |   | )
Warning
Not implemented!
 AcDbPointCloudClassificationColorRamp::~AcDbPointCloudClassificationColorRamp  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 AcCmEntityColor AcDbPointCloudClassificationColorRamp::color  |  ( |  int  |  c | ) |   const
Warning
Not implemented!
 const AcString AcDbPointCloudClassificationColorRamp::name  |  ( |   | ) |   const
Warning
Not implemented!
 Adesk::Int32 AcDbPointCloudClassificationColorRamp::numColors  |  ( |   | ) |   const
Warning
Not implemented!
 void AcDbPointCloudClassificationColorRamp::setColor  |  ( |  int  |  c,
|  AcCmEntityColor  |  color
)
Warning
Not implemented!
 void AcDbPointCloudClassificationColorRamp::setFrom  |  ( |  const AcDbPointCloudClassificationColorRamp *  |  source | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbPointCloudClassificationColorRamp::setName  |  ( |  const AcString &  |  name | )
Warning
Not implemented!
 void AcDbPointCloudClassificationColorRamp::setVisibility  |  ( |  int  |  c,
|  bool  |  visibility
)
Warning
Not implemented!
 bool AcDbPointCloudClassificationColorRamp::visibility  |  ( |  int  |  c | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbPointCloudColorMap.h