Public Types | Public Member Functions | Protected Member Functions | List of all members
AcDbMaterial Class Reference
AcDb Classes
  Inheritance diagram for AcDbMaterial:
 Public Types
enum  | MaterialFlags {
 kNone = 0, kIsLegacy = 0x1, kIsModifiedIsValid = 0x2, kIsModified = 0x4,
 kIsModifiedAndValid = 0x6
 }
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbMaterial)
 virtual void  | ambient (AcGiMaterialColor &color) const
 virtual void  | bump (AcGiMaterialMap &map) const
 virtual AcGiMaterialTraits::ChannelFlags  | channelFlags () const
void  | clearAdskMaterialCache ()
 double  | colorBleedScale () const
 virtual const ACHAR *  | description (void) const
 virtual void  | diffuse (AcGiMaterialColor &color, AcGiMaterialMap &map) const
 virtual AcGiDrawable *  | drawable (void) override
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler) override
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const override
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler) override
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const override
 AcGiMaterialTraits::FinalGatherMode  | finalGather () const
void *  | getAdskMaterialData ()
Acad::ErrorStatus  | getAdskMaterialFlags (MaterialFlags &flags) const
 AcGiMaterialTraits::GlobalIlluminationMode  | globalIllumination () const
 virtual AcGiMaterialTraits::IlluminationModel  | illuminationModel () const
 double  | indirectBumpScale () const
 Adesk::Boolean  | isAnonymous () const
bool  | isRenamable () const
 double  | luminance () const
 AcGiMaterialTraits::LuminanceMode  | luminanceMode () const
 virtual AcGiMaterialTraits::Mode  | mode () const
 virtual const ACHAR *  | name (void) const
 Acad::ErrorStatus  | normalMap (AcGiMaterialMap &map, AcGiMaterialTraits::NormalMapMethod &method, double &strength) const
 virtual void  | opacity (double &dPercentage, AcGiMaterialMap &map) const
 double  | reflectanceScale () const
 virtual void  | reflection (AcGiMaterialMap &map) const
 virtual double  | reflectivity () const
 virtual void  | refraction (double &dIndex, AcGiMaterialMap &map) const
 virtual double  | selfIllumination () const
Acad::ErrorStatus  | setAdskMaterialData (const void *pMatObj, bool bCacheIt=false)
Acad::ErrorStatus  | setAdskMaterialFlags (MaterialFlags flags)
 virtual void  | setAmbient (const AcGiMaterialColor &color)
 Acad::ErrorStatus  | setAnonymous (Adesk::Boolean isAnonymous)
 virtual void  | setBump (const AcGiMaterialMap &map)
 virtual Acad::ErrorStatus  | setChannelFlags (AcGiMaterialTraits::ChannelFlags value)
 Acad::ErrorStatus  | setColorBleedScale (double value)
 virtual Acad::ErrorStatus  | setDescription (const ACHAR *pDescription)
 virtual void  | setDiffuse (const AcGiMaterialColor &color, const AcGiMaterialMap &map)
 void  | setFinalGather (AcGiMaterialTraits::FinalGatherMode mode)
 void  | setGlobalIllumination (AcGiMaterialTraits::GlobalIlluminationMode mode)
 virtual Acad::ErrorStatus  | setIlluminationModel (AcGiMaterialTraits::IlluminationModel model)
 Acad::ErrorStatus  | setIndirectBumpScale (double value)
 Acad::ErrorStatus  | setLuminance (double value)
 Acad::ErrorStatus  | setLuminanceMode (AcGiMaterialTraits::LuminanceMode value)
 virtual Acad::ErrorStatus  | setMode (AcGiMaterialTraits::Mode value)
 virtual Acad::ErrorStatus  | setName (const ACHAR *pName)
 Acad::ErrorStatus  | setNormalMap (const AcGiMaterialMap &map, AcGiMaterialTraits::NormalMapMethod method, double strength)
 virtual void  | setOpacity (double dPercentage, const AcGiMaterialMap &map)
 Acad::ErrorStatus  | setReflectanceScale (double value)
 virtual void  | setReflection (const AcGiMaterialMap &map)
 virtual Acad::ErrorStatus  | setReflectivity (double value)
 virtual void  | setRefraction (double dIndex, const AcGiMaterialMap &map)
 virtual Acad::ErrorStatus  | setSelfIllumination (double value)
 Acad::ErrorStatus  | setShininess (double value)
 virtual void  | setSpecular (const AcGiMaterialColor &color, const AcGiMaterialMap &map, double dGloss)
 virtual Acad::ErrorStatus  | setTranslucence (double value)
 Acad::ErrorStatus  | setTransmittanceScale (double value)
 Acad::ErrorStatus  | setTwoSided (Adesk::Boolean value)
 double  | shininess () const
 virtual void  | specular (AcGiMaterialColor &color, AcGiMaterialMap &map, double &dGloss) const
 virtual double  | translucence () const
 double  | transmittanceScale () const
 Adesk::Boolean  | twoSided () const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const override
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
Member Function Documentation
 void AcDbMaterial::clearAdskMaterialCache  |  ( |   | )
Warning
Not implemented!
 void* AcDbMaterial::getAdskMaterialData  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMaterial::getAdskMaterialFlags  |  ( |  MaterialFlags &  |  flags | ) |   const
Warning
Not implemented!
 bool AcDbMaterial::isRenamable  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbMaterial::setAdskMaterialData  |  ( |  const void *  |  pMatObj,
|  bool  |  bCacheIt = false
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbMaterial::setAdskMaterialFlags  |  ( |  MaterialFlags  |  flags | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbmaterial.h