Public Types | Public Member Functions | Friends | List of all members
AcDbAuditInfo Class Reference
AcDb Classes
 Public Types
enum  | AuditPass { PASS1 = 1, PASS2 = 2 }
 Public Member Functions
 AuditPass  | auditPass (void) const
 void  | errorsFixed (int count)
 void  | errorsFound (int count)
 Acad::ErrorStatus  | fetchObject (AcDbObjectId originalObjId, AcDbObjectId &newObjId, AcRxClass *pObjClass, bool uneraseIfPossible=false, bool createIfNotFound=true, bool externalDbOk=false)
 bool  | fixErrors (void) const
 void  | incNumEntities ()
 int  | numEntities ()
 int  | numErrors () const
 int  | numFixes (void) const
 void  | printError (const ACHAR *name, const ACHAR *value, const ACHAR *validation, const ACHAR *defaultValue)
 void  | printError (const AcDbObject *pObj, const ACHAR *value, const ACHAR *validation, const ACHAR *defaultValue)
 void  | printNumEntities (const ACHAR *msg)
Acad::ErrorStatus  | registerObject (AcDbHandle handle, bool objIsValid, AcRxClass *pObjClass)
 void  | requestRegen ()
 void  | resetNumEntities ()
Acad::ErrorStatus  | updateObject (AcDbHandle handle, bool setFileObjIsValid, bool setNewObjIsValid, bool setFileObjClass, bool setNewObjClass, bool setNewObjId, bool fileObjIsValid, bool newObjIsValid, AcRxClass *pFileObjClass, AcRxClass *pNewObjClass, AcDbObjectId newObjId)
 Friends
 class  | AcDbAuditImp
 class  | AcDbImpAuditInfo
Member Function Documentation
 Acad::ErrorStatus AcDbAuditInfo::registerObject  |  ( |  AcDbHandle  |  handle,
|  bool  |  objIsValid,
|  AcRxClass *  |  pObjClass
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAuditInfo::updateObject  |  ( |  AcDbHandle  |  handle,
|  bool  |  setFileObjIsValid,
|  bool  |  setNewObjIsValid,
|  bool  |  setFileObjClass,
|  bool  |  setNewObjClass,
|  bool  |  setNewObjId,
|  bool  |  fileObjIsValid,
|  bool  |  newObjIsValid,
|  AcRxClass *  |  pFileObjClass,
|  AcRxClass *  |  pNewObjClass,
|  AcDbObjectId  |  newObjId
)
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbaudita.h