Public Member Functions | List of all members
AcDbAnnotativeObjectPE Class Referenceabstract
AcDb Classes
  Inheritance diagram for AcDbAnnotativeObjectPE:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbAnnotativeObjectPE)
 virtual bool  | annotative (AcDbObject *pObject) const =0
virtual bool  | forceAnnoAllVisible (AcDbObject *pObj) const
virtual Acad::ErrorStatus  | resetScaleDependentProperties (AcDbObject *pObject)
 virtual Acad::ErrorStatus  | setAnnotative (AcDbObject *pObject, const bool bAnnotative)=0
virtual Acad::ErrorStatus  | setForceAnnoAllVisible (AcDbObject *pObj, bool bForce) const
 virtual Acad::ErrorStatus  | setFromStyle (AcDbObject *pObject, bool &bUpdated)=0
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Member Function Documentation
 virtual bool AcDbAnnotativeObjectPE::forceAnnoAllVisible  |  ( |  AcDbObject *  |  pObj | ) |   const
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAnnotativeObjectPE::resetScaleDependentProperties  |  ( |  AcDbObject *  |  pObject | )
inlinevirtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAnnotativeObjectPE::setForceAnnoAllVisible  |  ( |  AcDbObject *  |  pObj,
|  bool  |  bForce
) |   |  const
inlinevirtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbAnnotativeObjectPE.h