Public Types | Public Member Functions | Static Public Attributes | List of all members
AcGiMapper Class Reference
AcGi Classes
  Inheritance diagram for AcGiMapper:
 Public Types
enum  | AutoTransform { kInheritAutoTransform = 0x0, kNone = 0x1, kObject = 0x2, kModel = 0x4 }
enum  | Projection {
 kInheritProjection = 0, kPlanar, kBox, kCylinder,
 kSphere
 }
enum  | Tiling {
 kInheritTiling = 0, kTile, kCrop, kClamp,
 kMirror
 }
 Public Member Functions
AcGiMapper (const AcGiMapper &mapper)
ACRX_DECLARE_MEMBERS_READWRITE (AcGiMapper, AcGiImpMapper)
 virtual AutoTransform  | autoTransform (void) const
 bool  | operator!= (const AcGiMapper &mapper) const
 AcGiMapper &  | operator= (const AcGiMapper &mapper)
 bool  | operator== (const AcGiMapper &mapper) const
 virtual Projection  | projection (void) const
 virtual void  | set (const AcGiMapper &mapper)
 virtual void  | setAutoTransform (AutoTransform autoTransform)
 virtual void  | setProjection (Projection projection)
 virtual void  | setTransform (const AcGeMatrix3d &transform)
 void  | setUTiling (Tiling tiling)
 void  | setVTiling (Tiling tiling)
 virtual const AcGeMatrix3d &  | transform (void) const
 Tiling  | uTiling (void) const
 Tiling  | vTiling (void) const
 Public Member Functions inherited from AcGiParameter
AcGiParameter (AcGiParameterImp *pImp)
AcGiParameter (const AcGiParameter &other)
ACRX_DECLARE_MEMBERS_READWRITE (AcGiParameter, AcGiParameterImp)
 const AcGiParameter &  | operator= (const AcGiParameter &other)
 Public Member Functions inherited from AcRxCopyOnWriteObject
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxCopyOnWriteObject, ACBASE_PORT)
ACBASE_PORT  | AcRxCopyOnWriteObject (AcRxObject *pData)
ACBASE_PORT  | AcRxCopyOnWriteObject (const AcRxCopyOnWriteObject &other)
ACBASE_PORT const AcRxCopyOnWriteObject &  | operator= (const AcRxCopyOnWriteObject &other)
ACBASE_PORT  | ~AcRxCopyOnWriteObject ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Attributes
 static ACGIMAT_IMPEXP const AcGiMapper  | kIdentity
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxCopyOnWriteObject
ACBASE_PORT const AcRxObject *  | read () const
ACBASE_PORT void  | unshare ()
ACBASE_PORT AcRxObject *  | write ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
acgimaterial.h