Public Member Functions | Static Public Member Functions | Protected Member Functions | Static Protected Member Functions | Friends | List of all members
AcRxMember Class Reference
AcRx Classes
  Inheritance diagram for AcRxMember:
 Public Member Functions
ACRX_DECLARE_MEMBERS_EXPIMP (AcRxMember, ACBASE_PORT)
ACBASE_PORT const AcRxAttributeCollection &  | attributes () const throw ()
ACBASE_PORT AcRxAttributeCollection &  | attributes () throw ()
ACBASE_PORT const AcArray< const AcRxMember * > *  | children () const throw ()
ACBASE_PORT AcString  | localName () const throw ()
ACBASE_PORT const ACHAR *  | name () const throw ()
ACBASE_PORT const AcRxObject *  | owner () const throw ()
ACBASE_PORT const AcRxValueType &  | type () const throw ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static ACBASE_PORT void  | deleteMember (const AcRxMember *pMember) throw ()
static ACBASE_PORT void *  | operator new (size_t size)
static ACBASE_PORT void *  | operator new (size_t size, const char *pFName, int nLine)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions
ACBASE_PORT  | AcRxMember (AcRxMemberImp *) throw ()
virtual ACBASE_PORT Acad::ErrorStatus  | subChildren (AcArray< const AcRxMember * > &children) const
virtual ACBASE_PORT AcString  | subLocalName () const
virtual ACBASE_PORT  | ~AcRxMember () throw ()
 Protected Member Functions inherited from Pimpl::ApiPart< AcRxObject, AcRxMemberImp >
ApiPart (AcRxMemberImp *pImp) throw ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Static Protected Member Functions
static ACBASE_PORT void  | operator delete (void *p)
static ACBASE_PORT void  | operator delete (void *p, const char *pFName, int nLine)
static ACBASE_PORT void  | operator delete[] (void *p)
static ACBASE_PORT void  | operator delete[] (void *p, const char *pFName, int nLine)
 Friends
 class  | AcRxMemberImp
Constructor & Destructor Documentation
 virtual ACBASE_PORT AcRxMember::~AcRxMember  |  ( |   | )
 throw  | (
)
protectedvirtual
Warning
Not implemented!
 ACBASE_PORT AcRxMember::AcRxMember  |  ( |  AcRxMemberImp *  |   | )
 throw  | (
)
protected
Warning
Not implemented!
Member Function Documentation
 ACBASE_PORT const AcRxAttributeCollection& AcRxMember::attributes  |  ( |   | ) |   const
 throw  | (
)
Warning
Not implemented!
 ACBASE_PORT AcRxAttributeCollection& AcRxMember::attributes  |  ( |   | )
 throw  | (
)
Warning
Not implemented!
 ACBASE_PORT const AcArray<const AcRxMember*>* AcRxMember::children  |  ( |   | ) |   const
 throw  | (
)
Warning
Not implemented!
 static ACBASE_PORT void AcRxMember::deleteMember  |  ( |  const AcRxMember *  |  pMember | )
 throw  | (
)
static
Warning
Not implemented!
 ACBASE_PORT AcString AcRxMember::localName  |  ( |   | ) |   const
 throw  | (
)
Warning
Not implemented!
 ACBASE_PORT const ACHAR* AcRxMember::name  |  ( |   | ) |   const
 throw  | (
)
Warning
Not implemented!
 static ACBASE_PORT void AcRxMember::operator delete  |  ( |  void *  |  p | )
staticprotected
Warning
Not implemented!
 static ACBASE_PORT void AcRxMember::operator delete  |  ( |  void *  |  p,
|  const char *  |  pFName,
|  int  |  nLine
)
staticprotected
Warning
Not implemented!
 static ACBASE_PORT void AcRxMember::operator delete[]  |  ( |  void *  |  p | )
staticprotected
Warning
Not implemented!
 static ACBASE_PORT void AcRxMember::operator delete[]  |  ( |  void *  |  p,
|  const char *  |  pFName,
|  int  |  nLine
)
staticprotected
Warning
Not implemented!
 static ACBASE_PORT void* AcRxMember::operator new  |  ( |  size_t  |  size | )
static
Warning
Not implemented!
 static ACBASE_PORT void* AcRxMember::operator new  |  ( |  size_t  |  size,
|  const char *  |  pFName,
|  int  |  nLine
)
static
Warning
Not implemented!
 ACBASE_PORT const AcRxObject* AcRxMember::owner  |  ( |   | ) |   const
 throw  | (
)
Warning
Not implemented!
 virtual ACBASE_PORT Acad::ErrorStatus AcRxMember::subChildren  |  ( |  AcArray< const AcRxMember * > &  |  children | ) |   const
protectedvirtual
Warning
Not implemented!
 virtual ACBASE_PORT AcString AcRxMember::subLocalName  |  ( |   | ) |   const
protectedvirtual
Warning
Not implemented!
 ACBASE_PORT const AcRxValueType& AcRxMember::type  |  ( |   | ) |   const
 throw  | (
)
Warning
Not implemented!
 The documentation for this class was generated from the following file:
rxmember.h