Public Member Functions | Static Public Member Functions | List of all members
AcDbAssocOffsetSurfaceActionBody Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocOffsetSurfaceActionBody:
 Public Member Functions
AcDbAssocOffsetSurfaceActionBody (AcDbAssocCreateImpObject createImpObject=kAcDbAssocCreateImpObject)
ACRX_DECLARE_MEMBERS (AcDbAssocOffsetSurfaceActionBody)
double  | distance (AcString &expression=dummyString(), AcString &evaluatorId=dummyString()) const
Acad::ErrorStatus  | setDistance (double distance, const AcString &expression=AcString(), const AcString &evaluatorId=AcString())
 Public Member Functions inherited from AcDbAssocSurfaceActionBody
AcDbAssocSurfaceActionBody (AcDbAssocCreateImpObject createImpObject=kAcDbAssocCreateImpObject)
ACRX_DECLARE_MEMBERS (AcDbAssocSurfaceActionBody)
virtual Acad::ErrorStatus  | addMoreObjectsToDeepCloneOverride (AcDbIdMapping &, AcDbObjectIdArray &additionalObjectsToClone) const override
virtual Acad::ErrorStatus  | dragStatusOverride (const AcDb::DragStat) override
virtual void  | evaluateOverride () override
virtual Acad::ErrorStatus  | getDependentActionsToEvaluateOverride (AcDbActionsToEvaluateCallback *) const override
virtual Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const
virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
virtual void  | gripStatus (const AcDb::GripStat status)
bool  | isSemiAssociative () const
virtual bool  | isSemiAssociativitySatisfiedOverride () const
virtual void  | list () const
virtual Acad::ErrorStatus  | moveGripPoints (const AcDbIntArray &indices, const AcGeVector3d &offset)
virtual Acad::ErrorStatus  | moveGripPoints (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
virtual Acad::ErrorStatus  | moveStretchPoints (const AcDbIntArray &indices, const AcGeVector3d &offset)
AcDbObjectId  | resultingSurface () const
AcDbObjectId  | resultingSurfaceDep (bool createIfDoesNotExist, bool isWriteOnlyDependency=true)
Acad::ErrorStatus  | setResultingSurface (const AcDbObjectId &surfaceId, bool isWriteOnlyDependency=true)
 Public Member Functions inherited from AcDbAssocParamBasedActionBody
AcDbAssocParamBasedActionBody (AcDbAssocCreateImpObject createImpObject=kAcDbAssocCreateImpObject)
ACRX_DECLARE_MEMBERS (AcDbAssocParamBasedActionBody)
 Public Member Functions inherited from AcDbAssocActionBody
AcDbAssocActionBody (AcDbAssocCreateImpObject createImpObject=kAcDbAssocCreateImpObject)
ACRX_DECLARE_MEMBERS (AcDbAssocActionBody)
Acad::ErrorStatus  | addDependency (const AcDbObjectId &dependencyId, bool setThisActionAsOwningAction=true) const
Acad::ErrorStatus  | addDependency (AcRxClass *pDependencyClass, AcRxClass *pDependencyBodyClass, bool isReadDep, bool isWriteDep, int order, AcDbObjectId &dependencyId) const
Acad::ErrorStatus  | addParam (const AcDbObjectId &paramId, int &paramIndex) const
Acad::ErrorStatus  | addParam (const AcString &paramName, AcRxClass *pParamClass, AcDbObjectId &paramId, int &paramIndex) const
virtual Acad::ErrorStatus  | areDependenciesEqualOverride (const AcDbAssocDependency *pDependency1, const AcDbAssocDependency *pDependency2, bool &areEqual) const
virtual Acad::ErrorStatus  | areDependenciesOnTheSameThingOverride (const AcDbAssocDependency *pDependency1, const AcDbAssocDependency *pDependency2, bool &areDependentOnSameThing) const
virtual void  | auditAssociativeDataOverride (AcDbAssocStatus &parentActionHandling)
virtual Acad::ErrorStatus  | clonePersSubentNamingDataOverride (class AcDbAssocPersSubentManagerCloner *pCloner)
virtual Acad::ErrorStatus  | collectPersSubentNamingDataOverride (AcDbPersStepIdArray &stepIds, AcDbPersSubentIdArray &persSubentIds) const
AcDbAssocEvaluationCallback *  | currentEvaluationCallback () const
virtual Acad::ErrorStatus  | dependentObjectClonedOverride (const AcDbAssocDependency *pDependency, const AcDbObject *pDbObj, const AcDbObject *pNewObj)
Acad::ErrorStatus  | evaluateDependencies () const
virtual Acad::ErrorStatus  | evaluateDependencyOverride (AcDbAssocDependency *pDependency)
virtual Acad::ErrorStatus  | evaluationPriorityOverride (AcDbAssocEvaluationPriority &priority) const
Acad::ErrorStatus  | getDependencies (bool readDependenciesWanted, bool writeDependenciesWanted, AcDbObjectIdArray &dependencyIds) const
virtual Acad::ErrorStatus  | getDependenciesOverride (bool readDependenciesWanted, bool writeDependenciesWanted, AcDbObjectIdArray &dependencyIds) const
virtual Acad::ErrorStatus  | getDependentObjectsOverride (bool readDependenciesWanted, bool writeDependenciesWanted, AcDbObjectIdArray &objectIds) const
Acad::ErrorStatus  | getValueParam (const AcString &paramName, AcDbEvalVariant &value, AcString &expression, AcString &evaluatorId, int valueIndex=0) const
Acad::ErrorStatus  | getValueParamArray (const AcString &paramName, AcArray< AcDbEvalVariant > &values, AcArray< AcString > &expressions, AcArray< AcString > &evaluatorIds) const
bool  | hasAnyErasedOrBrokenDependencies () const
virtual Acad::ErrorStatus  | hasDependencyCachedValueOverride (const AcDbAssocDependency *pDependency, bool &hasDepCachedValue) const
bool  | isActionEvaluationInProgress () const
virtual Acad::ErrorStatus  | isEqualToOverride (const AcDbAssocAction *pOtherAction, bool &isEqual) const
virtual Acad::ErrorStatus  | isExternalDependencyOverride (const AcDbAssocDependency *pDependency, bool &isExternalDependency) const
virtual Acad::ErrorStatus  | isOwnedDependencyOverride (const AcDbAssocDependency *pDependency, bool &isOwnedDependency) const
virtual Acad::ErrorStatus  | isRelevantDependencyChangeOverride (const AcDbAssocDependency *pDependency, bool &isRelevantDepChange) const
virtual Acad::ErrorStatus  | notificationOverride (class AcDbAssocNotificationData *pNotificationData)
virtual Acad::ErrorStatus  | ownedDependencyStatusChangedOverride (AcDbAssocDependency *pOwnedDependency, AcDbAssocStatus previousStatus)
const AcDbObjectIdArray &  | ownedParams () const
void  | ownedValueParamNames (AcArray< AcString > &paramNames) const
AcDbObjectId  | owningNetwork () const
AcDbObjectId  | paramAtIndex (int paramIndex) const
AcDbObjectId  | paramAtName (const AcString &paramName, int index=0) const
int  | paramCount () const
const AcDbObjectIdArray &  | paramsAtName (const AcString &paramName) const
 AcDbObjectId  | parentAction () const
virtual Acad::ErrorStatus  | postProcessAfterDeepCloneCancelOverride (AcDbIdMapping &)
virtual Acad::ErrorStatus  | postProcessAfterDeepCloneOverride (AcDbIdMapping &)
virtual Acad::ErrorStatus  | removeActionsControllingObjectOverride (AcDbObject *pControlledObject)
Acad::ErrorStatus  | removeAllDependencies (bool alsoEraseThem) const
virtual Acad::ErrorStatus  | removeAllDependenciesOverride (bool alsoEraseThem)
Acad::ErrorStatus  | removeAllParams (bool alsoEraseThem) const
Acad::ErrorStatus  | removeDependency (const AcDbObjectId &dependencyId, bool alsoEraseIt) const
Acad::ErrorStatus  | removeParam (const AcDbObjectId &paramId, bool alsoEraseIt) const
Acad::ErrorStatus  | removeValueParam (const AcString &paramName) const
Acad::ErrorStatus  | scaleAllDistanceValueParams (double scaleFactor) const
Acad::ErrorStatus  | setStatus (AcDbAssocStatus newStatus, bool notifyOwningNetwork=true, bool setInOwnedActions=false) const
Acad::ErrorStatus  | setValueParam (const AcString &paramName, const AcDbEvalVariant &value, const AcString &expression, const AcString &evaluatorId, AcString &errorMessage, bool silentMode, int valueIndex=0) const
Acad::ErrorStatus  | setValueParamArray (const AcString &paramName, const AcArray< AcDbEvalVariant > &values, const AcArray< AcString > &expressions, const AcArray< AcString > &evaluatorIds, AcArray< AcString > &errorMessages, bool silentMode) const
Acad::ErrorStatus  | setValueParamControlledObjectDep (const AcString &paramName, const AcDbObjectId &controlledObjectDepId) const
Acad::ErrorStatus  | setValueParamUnitType (const AcString &paramName, AcValue::UnitType unitType) const
AcDbAssocStatus  | status () const
virtual Acad::ErrorStatus  | transformActionByOverride (const AcGeMatrix3d &)
Acad::ErrorStatus  | transformAllConstantGeometryParams (const AcGeMatrix3d &transform) const
Acad::ErrorStatus  | updateAllObjectsControlledByValueParams () const
Acad::ErrorStatus  | updateValueParamControlledObject (const AcString &paramName) const
Acad::ErrorStatus  | updateValueParamFromControlledObject (const AcString &paramName) const
Acad::ErrorStatus  | valueParamInputVariables (const AcString &paramName, AcDbObjectIdArray &variableIds) const
AcValue::UnitType  | valueParamUnitType (const AcString &paramName) const
virtual  | ~AcDbAssocActionBody ()
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addPersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | addReactor (AcDbObjectReactor *pReactor) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const override
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc) override
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 ACDBCORE2D_PORT Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, bool bAllXdata, const AcDbObjectIdArray *pRegAppIds) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean bErasing)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, Adesk::Int32 &size, char *&data) const
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | getClassID (CLSID *pClsid) const ADESK_SEALED
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode=AcDb::kForRead) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode=AcDb::kForRead) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 ACDBCORE2D_PORT bool  | hasPersistentReactor (AcDbObjectId objId) const
ACDBCORE2D_PORT bool  | hasReactor (const AcDbObjectReactor *pReactor) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const override
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const override
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
bool  | isUndoRecordingDisabled () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 ACDBCORE2D_PORT const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 ACDBCORE2D_PORT Acad::ErrorStatus  | removeReactor (AcDbObjectReactor *pReactor) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, Adesk::Int32 size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const ADESK_SEALED
 virtual resbuf *  | xData (const ACHAR *regappName=nullptr) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACDBCORE2D_PORT  | AcGiDrawable ()
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual bool  | bounds (AcDbExtents &) const
 virtual DrawableType  | drawableType (void) const
virtual ACDBCORE2D_PORT AcGiDrawStream *  | drawStream (void) const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr, Adesk::ULongPtr, Adesk::Boolean)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | setAttributes (AcGiDrawableTraits *traits) ADESK_SEALED
virtual ACDBCORE2D_PORT void  | setDrawStream (AcGiDrawStream *pStream)
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL void  | viewportDraw (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd) ADESK_SEALED
 ACDBCORE2D_PORT ADESK_SEALED_VIRTUAL Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd) ADESK_SEALED
ACDBCORE2D_PORT  | ~AcGiDrawable ()
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static Acad::ErrorStatus  | createInstance (const AcDbObjectId &resultingSurfaceId, const AcDbObjectId &inputSurfaceId, double distance, bool bEnabled, AcDbObjectId &createdActionId)
 Static Public Member Functions inherited from AcDbAssocSurfaceActionBody
static Acad::ErrorStatus  | findActionsThatAffectedTopologicalSubentity (const AcDbEntity *pAsmBasedEntity, const AcDbSubentId &, AcDbObjectIdArray &actionIds)
static Acad::ErrorStatus  | getSurfacesDirectlyDependentOnObject (const AcDbObject *, AcDbObjectIdArray &dependentSurfaceIds)
static Acad::ErrorStatus  | getTopologicalSubentitiesForActionsOnEntity (const AcDbEntity *pAsmBasedEntity, bool alsoUseAdjacentTopology, AcDbObjectIdArray &actionIds, AcArray< AcArray< AcDbSubentId > > &actionSubentIds)
 Static Public Member Functions inherited from AcDbAssocActionBody
static Acad::ErrorStatus  | createActionAndActionBodyAndPostToDatabase (AcRxClass *pActionBodyClass, const AcDbObjectId &objectId, AcDbObjectId &createdActionId, AcDbObjectId &createdActionBodyId)
static Acad::ErrorStatus  | getActionBodiesOnObject (const AcDbObject *pObject, bool ignoreInternalActions, bool ignoreSuppressedActions, AcDbObjectId *pWriteOnlyActionBodyId, AcDbObjectIdArray *pReadWriteActionBodyIds, AcDbObjectIdArray *pReadOnlyActionBodyIds=NULL)
static AcDbObjectId  | parentAction (const AcDbObjectId &actionBodyId)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *, int)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *, int)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *, int)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *, int)
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground,
 kImageBasedLightingBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependentGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096, kDrawableIsExternalReference = 8192, kDrawableNotPlottable = 16384,
 kDrawableNotAllowLCS = 32768, kDrawableMergeControlOff = 65536
 }
 Protected Member Functions inherited from AcDbObject
 virtual Acad::ErrorStatus  | subDeepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 virtual Adesk::UInt32  | subSetAttributes (AcGiDrawableTraits *pTraits) override
 virtual void  | subViewportDraw (AcGiViewportDraw *pVd) override
 virtual Acad::ErrorStatus  | subWblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | subWorldDraw (AcGiWorldDraw *pWd) override
 Protected Member Functions inherited from AcGiDrawable
 virtual Adesk::UInt32  | subViewportDrawLogicalFlags (AcGiViewportDraw *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
Constructor & Destructor Documentation
 AcDbAssocOffsetSurfaceActionBody::AcDbAssocOffsetSurfaceActionBody  |  ( |  AcDbAssocCreateImpObject  |  createImpObject = kAcDbAssocCreateImpObject | )
explicit
Warning
Not implemented!
Member Function Documentation
 static Acad::ErrorStatus AcDbAssocOffsetSurfaceActionBody::createInstance  |  ( |  const AcDbObjectId &  |  resultingSurfaceId,
|  const AcDbObjectId &  |  inputSurfaceId,
|  double  |  distance,
|  bool  |  bEnabled,
|  AcDbObjectId &  |  createdActionId
)
static
Warning
Not implemented!
 double AcDbAssocOffsetSurfaceActionBody::distance  |  ( |  AcString &  |  expression = dummyString(),
|  AcString &  |  evaluatorId = dummyString()
) |   |  const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocOffsetSurfaceActionBody::setDistance  |  ( |  double  |  distance,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString()
)
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocOffsetSurfaceActionBody.h