Public Types | Public Member Functions | Protected Member Functions | Friends | List of all members
AcDbAssocArrayPathParameters Class Reference
AcDb Classes
  Inheritance diagram for AcDbAssocArrayPathParameters:
 Public Types
enum  | GripModes {
 kStretchGrip = 1 << 0, kRowCountGrip = 1 << 1, kRowSpacingGrip = 1 << 2, kUniformRowSpacingGrip = 1 << 3,
 kLevelCountGrip = 1 << 4, kLevelSpacingGrip = 1 << 5, kUniformLevelSpacingGrip = 1 << 6, kItemCountGrip = 1 << 7,
 kItemSpacingGrip = 1 << 8, kUniformItemSpacingGrip = 1 << 9
 }
enum  | Method { kDivide, kMeasure }
 Public Member Functions
AcDbAssocArrayPathParameters (double itemSpacing=1, double rowSpacing=1, double levelSpacing=1, int itemCount=1, int rowCount=1, int levelCount=1, double rowElevation=1)
ACRX_DECLARE_MEMBERS (AcDbAssocArrayPathParameters)
bool  | alignItems () const
double  | endOffset (AcString &expression, AcString &evaluatorId) const
double  | endOffset () const
virtual Acad::ErrorStatus  | getItemPosition (const AcDbItemLocator &locator, AcGePoint3d &position, AcGeMatrix3d &xform) const
Acad::ErrorStatus  | getItemPosition (const AcDbItemLocator &locator, AcGePoint3d &position) const
virtual Acad::ErrorStatus  | getItems (AcArray< AcDbAssocArrayItem * > &items) const
int  | itemCount (AcString &expression, AcString &evaluatorId) const
int  | itemCount () const
int  | itemCount (AcString &expression) const
double  | itemSpacing (AcString &expression, AcString &evaluatorId) const
double  | itemSpacing () const
double  | itemSpacing (AcString &expression) const
Method  | method () const
AcDbEdgeRef  | path () const
Acad::ErrorStatus  | setAlignItems (bool bAlignItems)
Acad::ErrorStatus  | setEndOffset (double endOffset, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setItemCount (int nItems, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setItemSpacing (double offset, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setMethod (Method method)
Acad::ErrorStatus  | setPath (const AcDbEdgeRef &edgeRef)
Acad::ErrorStatus  | setPathDirection (bool bAlongParams)
Acad::ErrorStatus  | setStartOffset (double startOffset, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
double  | startOffset (AcString &expression, AcString &evaluatorId) const
double  | startOffset () const
virtual  | ~AcDbAssocArrayPathParameters (void)
 Public Member Functions inherited from AcDbAssocArrayCommonParameters
ACRX_DECLARE_MEMBERS (AcDbAssocArrayCommonParameters)
Acad::ErrorStatus  | getBasePlane (AcDbVertexRef &basePoint, AcGeVector3d &normal, AcDbFaceRef *pFace=NULL) const
virtual AcDbItemLocator  | getCanonicalForm (const AcDbItemLocator &locator) const
int  | levelCount (AcString &expression, AcString &evaluatorId) const
 int  | levelCount () const
int  | levelCount (AcString &expression) const
double  | levelSpacing (AcString &expression, AcString &evaluatorId) const
double  | levelSpacing () const
double  | levelSpacing (AcString &expression) const
int  | rowCount (AcString &expression, AcString &evaluatorId) const
int  | rowCount () const
int  | rowCount (AcString &expression) const
double  | rowElevation (AcString &expression, AcString &evaluatorId) const
double  | rowElevation () const
double  | rowElevation (AcString &expression) const
double  | rowSpacing (AcString &expression, AcString &evaluatorId) const
double  | rowSpacing () const
double  | rowSpacing (AcString &expression) const
Acad::ErrorStatus  | setBasePlane (const AcDbVertexRef &basePoint, const AcGeVector3d &normal, const AcDbFaceRef *pFace=NULL)
Acad::ErrorStatus  | setLevelCount (int nLevels, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setLevelSpacing (double offset, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRowCount (int nRows, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRowElevation (double elevation, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
Acad::ErrorStatus  | setRowSpacing (double offset, const AcString &expression=AcString(), const AcString &evaluatorId=AcString(), AcString &errorMessage=dummyString())
virtual  | ~AcDbAssocArrayCommonParameters (void)
 Public Member Functions inherited from AcDbAssocArrayParameters
ACRX_DECLARE_MEMBERS (AcDbAssocArrayParameters)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
Acad::ErrorStatus  | getGeomParam (const AcString &paramName, AcDbGeomRef *&pGeomRef, AcDbObjectId &paramId) const
virtual Acad::ErrorStatus  | getGripPointAt (unsigned int mode, AcDbArrayGripAppData *&pGrip) const
virtual Acad::ErrorStatus  | getGripPoints (AcArray< AcDbArrayGripAppData * > &grips) const
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints)
Acad::ErrorStatus  | getValueParam (const AcString &paramName, AcDbEvalVariant &value, AcString &expression, AcString &evaluatorId, AcValue::UnitType &unitType) const
virtual Acad::ErrorStatus  | moveGripPointAt (const AcDbArrayGripAppData *pGrip, const AcGeVector3d &offset, int &modificationBit)
void  | ownedGeomParamNames (AcArray< AcString > &paramNames) const
void  | ownedValueParamNames (AcArray< AcString > &paramNames) const
const AcDbAssocArrayActionBody *  | owner () const
AcDbAssocArrayActionBody *  | owner ()
Acad::ErrorStatus  | setGeomParam (const AcString &paramName, const AcDbGeomRef *pGeomRef, AcDbObjectId &paramId)
Acad::ErrorStatus  | setOwner (class AcDbAssocArrayActionBody *pOwner)
Acad::ErrorStatus  | setValueParam (const AcString &paramName, const AcDbEvalVariant &value, const AcString &expression, const AcString &evaluatorId, AcString &errorMessage, AcValue::UnitType *pUnitType=NULL)
virtual  | ~AcDbAssocArrayParameters (void)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
AcDbAssocArrayPathParameters (AcDbImpAssocArrayPathParameters *pSelf)
 Protected Member Functions inherited from AcDbAssocArrayCommonParameters
AcDbAssocArrayCommonParameters (AcDbImpAssocArrayCommonParameters *pSelf)
 Protected Member Functions inherited from AcDbAssocArrayParameters
AcDbAssocArrayParameters (AcDbImpAssocArrayParameters *pSelf=NULL)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpAssocArrayPathParameters
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Attributes inherited from AcDbAssocArrayParameters
 AcDbImpAssocArrayParameters *  | mpSelf
Constructor & Destructor Documentation
 AcDbAssocArrayPathParameters::AcDbAssocArrayPathParameters  |  ( |  double  |  itemSpacing = 1,
|  double  |  rowSpacing = 1,
|  double  |  levelSpacing = 1,
|  int  |  itemCount = 1,
|  int  |  rowCount = 1,
|  int  |  levelCount = 1,
|  double  |  rowElevation = 1
)
Warning
Not implemented!
 virtual AcDbAssocArrayPathParameters::~AcDbAssocArrayPathParameters  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 AcDbAssocArrayPathParameters::AcDbAssocArrayPathParameters  |  ( |  AcDbImpAssocArrayPathParameters *  |  pSelf | )
explicitprotected
Warning
Not implemented!
Member Function Documentation
 bool AcDbAssocArrayPathParameters::alignItems  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbAssocArrayPathParameters::endOffset  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 double AcDbAssocArrayPathParameters::endOffset  |  ( |   | ) |   const
inline
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocArrayPathParameters::getItemPosition  |  ( |  const AcDbItemLocator &  |  locator,
|  AcGePoint3d &  |  position,
|  AcGeMatrix3d &  |  xform
) |   |  const
virtual
Warning
Not implemented!
Implements AcDbAssocArrayParameters.
 Acad::ErrorStatus AcDbAssocArrayPathParameters::getItemPosition  |  ( |  const AcDbItemLocator &  |  locator,
|  AcGePoint3d &  |  position
) |   |  const
inline
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbAssocArrayPathParameters::getItems  |  ( |  AcArray< AcDbAssocArrayItem * > &  |  items | ) |   const
virtual
Warning
Not implemented!
Implements AcDbAssocArrayParameters.
 int AcDbAssocArrayPathParameters::itemCount  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 int AcDbAssocArrayPathParameters::itemCount  |  ( |   | ) |   const
inline
Warning
Not implemented!
 int AcDbAssocArrayPathParameters::itemCount  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayPathParameters::itemSpacing  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 double AcDbAssocArrayPathParameters::itemSpacing  |  ( |   | ) |   const
inline
Warning
Not implemented!
 double AcDbAssocArrayPathParameters::itemSpacing  |  ( |  AcString &  |  expression | ) |   const
inline
Warning
Not implemented!
 Method AcDbAssocArrayPathParameters::method  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbEdgeRef AcDbAssocArrayPathParameters::path  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPathParameters::setAlignItems  |  ( |  bool  |  bAlignItems | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPathParameters::setEndOffset  |  ( |  double  |  endOffset,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPathParameters::setItemCount  |  ( |  int  |  nItems,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPathParameters::setItemSpacing  |  ( |  double  |  offset,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPathParameters::setMethod  |  ( |  Method  |  method | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPathParameters::setPath  |  ( |  const AcDbEdgeRef &  |  edgeRef | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPathParameters::setPathDirection  |  ( |  bool  |  bAlongParams | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAssocArrayPathParameters::setStartOffset  |  ( |  double  |  startOffset,
|  const AcString &  |  expression = AcString(),
|  const AcString &  |  evaluatorId = AcString(),
|  AcString &  |  errorMessage = dummyString()
)
Warning
Not implemented!
 double AcDbAssocArrayPathParameters::startOffset  |  ( |  AcString &  |  expression,
|  AcString &  |  evaluatorId
) |   |  const
Warning
Not implemented!
 double AcDbAssocArrayPathParameters::startOffset  |  ( |   | ) |   const
inline
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcDbAssocArrayPathParameters.h