Public Member Functions | Friends | List of all members
AcEdInputPointFilterResult Class Reference
AcEd Classes
 Public Member Functions
 bool  | displayOsnapGlyph () const
 const AcGePoint3d &  | newPoint () const
 const ACHAR *  | newTooltipString () const
 bool  | retry () const
 void  | setDisplayOsnapGlyph (bool newValue)
 void  | setNewPoint (const AcGePoint3d &newValue)
 void  | setNewTooltipString (const ACHAR *newValue)
 void  | setRetry (bool newValue)
 Friends
 class  | AcEdImpInputPointManager
 The documentation for this class was generated from the following file:
acedinpt.h