Public Member Functions | Friends | List of all members
AcEdInputPointMonitorResult Class Reference
AcEd Classes
 Public Member Functions
 const ACHAR *  | additionalTooltipString () const
 bool  | appendToTooltipStr () const
 void  | setAdditionalTooltipString (const ACHAR *)
 Friends
 class  | AcEdImpInputPointManager
 The documentation for this class was generated from the following file:
acedinpt.h