Public Member Functions | Friends | List of all members
AcDbWblockCloneFiler Class Reference
AcDb Classes
  Inheritance diagram for AcDbWblockCloneFiler:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbWblockCloneFiler)
 virtual Acad::ErrorStatus  | addReferences (AcDbIdRefQueue &) override
 virtual AcDb::FilerType  | filerType () const override
 virtual bool  | getNextHardObject (AcDbObjectId &id)
 virtual bool  | moreHardObjects () const
 virtual bool  | usesReferences () const override
 Public Member Functions inherited from AcDbDeepCloneFiler
ACRX_DECLARE_MEMBERS (AcDbDeepCloneFiler)
 virtual AcDbFilerController &  | controller () const override
 virtual Acad::ErrorStatus  | filerStatus () const override
 virtual bool  | getNextOwnedObject (AcDbObjectId &id)
 virtual bool  | moreOwnedObjects () const
 virtual Acad::ErrorStatus  | readAcDbHandle (AcDbHandle *) override
 virtual Acad::ErrorStatus  | readAddress (void **) override
 virtual Acad::ErrorStatus  | readBChunk (ads_binary *) override
 virtual Acad::ErrorStatus  | readBool (bool *) override
 virtual Acad::ErrorStatus  | readBoolean (Adesk::Boolean *) override
 virtual Acad::ErrorStatus  | readBytes (void *, Adesk::UIntPtr) override
 virtual Acad::ErrorStatus  | readDouble (double *) override
 virtual Acad::ErrorStatus  | readHardOwnershipId (AcDbHardOwnershipId *) override
 virtual Acad::ErrorStatus  | readHardPointerId (AcDbHardPointerId *) override
 virtual Acad::ErrorStatus  | readInt16 (Adesk::Int16 *) override
 virtual Acad::ErrorStatus  | readInt32 (Adesk::Int32 *) override
 virtual Acad::ErrorStatus  | readInt64 (Adesk::Int64 *) override
 virtual Acad::ErrorStatus  | readInt8 (Adesk::Int8 *) override
 virtual Acad::ErrorStatus  | readPoint2d (AcGePoint2d *) override
 virtual Acad::ErrorStatus  | readPoint3d (AcGePoint3d *) override
 virtual Acad::ErrorStatus  | readScale3d (AcGeScale3d *) override
 virtual Acad::ErrorStatus  | readSoftOwnershipId (AcDbSoftOwnershipId *) override
 virtual Acad::ErrorStatus  | readSoftPointerId (AcDbSoftPointerId *) override
 virtual Acad::ErrorStatus  | readString (ACHAR **) override
 virtual Acad::ErrorStatus  | readString (AcString &) override
 virtual Acad::ErrorStatus  | readUInt16 (Adesk::UInt16 *) override
 virtual Acad::ErrorStatus  | readUInt32 (Adesk::UInt32 *) override
 virtual Acad::ErrorStatus  | readUInt64 (Adesk::UInt64 *) override
 virtual Acad::ErrorStatus  | readUInt8 (Adesk::UInt8 *) override
 virtual Acad::ErrorStatus  | readVector2d (AcGeVector2d *) override
 virtual Acad::ErrorStatus  | readVector3d (AcGeVector3d *) override
 virtual void  | resetFilerStatus () override
 virtual Acad::ErrorStatus  | seek (Adesk::Int64 nOffset, int nMethod) override
 virtual void  | setFilerStatus (Acad::ErrorStatus) override
 virtual Adesk::Int64  | tell () const override
 virtual Acad::ErrorStatus  | writeAcDbHandle (const AcDbHandle &) override
 virtual Acad::ErrorStatus  | writeAddress (const void *) override
 virtual Acad::ErrorStatus  | writeBChunk (const ads_binary &) override
 virtual Acad::ErrorStatus  | writeBool (bool) override
 virtual Acad::ErrorStatus  | writeBoolean (Adesk::Boolean) override
 virtual Acad::ErrorStatus  | writeBytes (const void *, Adesk::UIntPtr) override
 virtual Acad::ErrorStatus  | writeDouble (double) override
 virtual Acad::ErrorStatus  | writeHardOwnershipId (const AcDbHardOwnershipId &) override
 virtual Acad::ErrorStatus  | writeHardPointerId (const AcDbHardPointerId &) override
 virtual Acad::ErrorStatus  | writeInt16 (Adesk::Int16) override
 virtual Acad::ErrorStatus  | writeInt32 (Adesk::Int32) override
 virtual Acad::ErrorStatus  | writeInt64 (Adesk::Int64) override
 virtual Acad::ErrorStatus  | writeInt8 (Adesk::Int8) override
 virtual Acad::ErrorStatus  | writePoint2d (const AcGePoint2d &) override
 virtual Acad::ErrorStatus  | writePoint3d (const AcGePoint3d &) override
 virtual Acad::ErrorStatus  | writeScale3d (const AcGeScale3d &) override
 virtual Acad::ErrorStatus  | writeSoftOwnershipId (const AcDbSoftOwnershipId &) override
 virtual Acad::ErrorStatus  | writeSoftPointerId (const AcDbSoftPointerId &) override
 virtual Acad::ErrorStatus  | writeString (const ACHAR *) override
 virtual Acad::ErrorStatus  | writeString (const AcString &) override
 virtual Acad::ErrorStatus  | writeUInt16 (Adesk::UInt16) override
 virtual Acad::ErrorStatus  | writeUInt32 (Adesk::UInt32) override
 virtual Acad::ErrorStatus  | writeUInt64 (Adesk::UInt64) override
 virtual Acad::ErrorStatus  | writeUInt8 (Adesk::UInt8) override
 virtual Acad::ErrorStatus  | writeVector2d (const AcGeVector2d &) override
 virtual Acad::ErrorStatus  | writeVector3d (const AcGeVector3d &) override
 Public Member Functions inherited from AcDbDwgFiler
ACRX_DECLARE_MEMBERS (AcDbDwgFiler)
 virtual Acad::ErrorStatus  | dwgVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer) const
virtual ACDBCORE2D_PORT Acad::ErrorStatus  | extendedDwgMaintenanceReleaseVersion (AcDb::MaintenanceReleaseVersion &maintVer) const
 virtual AcDbAuditInfo *  | getAuditInfo () const
 Acad::ErrorStatus  | readItem (AcDbHardOwnershipId *pId)
 Acad::ErrorStatus  | readItem (AcDbSoftOwnershipId *pId)
 Acad::ErrorStatus  | readItem (AcDbHardPointerId *pId)
 Acad::ErrorStatus  | readItem (AcDbSoftPointerId *pId)
 Acad::ErrorStatus  | readItem (ACHAR **pVal)
 Acad::ErrorStatus  | readItem (ads_binary *pVal)
 Acad::ErrorStatus  | readItem (AcDbHandle *pVal)
 Acad::ErrorStatus  | readItem (Adesk::Int32 *pVal)
 Acad::ErrorStatus  | readItem (Adesk::Int16 *pVal)
 Acad::ErrorStatus  | readItem (Adesk::Int8 *pVal)
 Acad::ErrorStatus  | readItem (Adesk::UInt32 *pVal)
 Acad::ErrorStatus  | readItem (Adesk::UInt16 *pVal)
 Acad::ErrorStatus  | readItem (Adesk::UInt8 *pVal)
 Acad::ErrorStatus  | readItem (Adesk::Boolean *pVal)
 Acad::ErrorStatus  | readItem (bool *pVal)
 Acad::ErrorStatus  | readItem (double *pVal)
 Acad::ErrorStatus  | readItem (AcGePoint2d *pVal)
 Acad::ErrorStatus  | readItem (AcGePoint3d *pVal)
 Acad::ErrorStatus  | readItem (AcGeVector2d *pVal)
 Acad::ErrorStatus  | readItem (AcGeVector3d *pVal)
 Acad::ErrorStatus  | readItem (AcGeScale3d *pVal)
 Acad::ErrorStatus  | readItem (void *pDest, Adesk::UIntPtr nBytes)
 Acad::ErrorStatus  | readItem (void **pp)
 Acad::ErrorStatus  | writeItem (const AcDbHardOwnershipId &id)
 Acad::ErrorStatus  | writeItem (const AcDbSoftOwnershipId &id)
 Acad::ErrorStatus  | writeItem (const AcDbHardPointerId &id)
 Acad::ErrorStatus  | writeItem (const AcDbSoftPointerId &id)
 Acad::ErrorStatus  | writeItem (const ACHAR *val)
Acad::ErrorStatus  | writeItem (const AcString &val)
 Acad::ErrorStatus  | writeItem (const ads_binary &val)
 Acad::ErrorStatus  | writeItem (const AcDbHandle &val)
 Acad::ErrorStatus  | writeItem (Adesk::Int32 val)
 Acad::ErrorStatus  | writeItem (Adesk::Int16 val)
 Acad::ErrorStatus  | writeItem (Adesk::Int8 val)
 Acad::ErrorStatus  | writeItem (Adesk::UInt32 val)
 Acad::ErrorStatus  | writeItem (Adesk::UInt16 val)
 Acad::ErrorStatus  | writeItem (Adesk::UInt8 val)
 Acad::ErrorStatus  | writeItem (Adesk::Boolean val)
 Acad::ErrorStatus  | writeItem (bool val)
 Acad::ErrorStatus  | writeItem (double val)
 Acad::ErrorStatus  | writeItem (const AcGePoint2d &val)
 Acad::ErrorStatus  | writeItem (const AcGePoint3d &val)
 Acad::ErrorStatus  | writeItem (const AcGeVector2d &val)
 Acad::ErrorStatus  | writeItem (const AcGeVector3d &val)
 Acad::ErrorStatus  | writeItem (const AcGeScale3d &val)
 Acad::ErrorStatus  | writeItem (const void *pSrc, Adesk::UIntPtr nBytes)
 Acad::ErrorStatus  | writeItem (const void *p)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcDbDeepCloneFiler
AcDbDeepCloneFiler (AcDbSystemInternals *)
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbcfilrs.h