Public Member Functions | Friends | List of all members
AcApDocWindowManager Class Reference
AcAp Classes
 Public Member Functions
ACAD_PORT AcApDocWindow *  | activeDocumentWindow ()
warning Not implemented! More...
ACAD_PORT bool  | addDocumentWindow (AcApDocWindow *docWindow)
warning Not implemented! More...
ACAD_PORT void  | addReactor (AcApDocWindowManagerReactor *pReactor)
warning Not implemented! More...
ACAD_PORT int  | documentWindowCount () const
warning Not implemented! More...
ACAD_PORT bool  | moveDocumentWindow (AcApDocWindow *docWindow, int newIndex)
warning Not implemented! More...
ACAD_PORT AcApDocWindowIterator *  | newIterator () const
warning Not implemented! More...
ACAD_PORT void  | removeReactor (AcApDocWindowManagerReactor *pReactor)
warning Not implemented! More...
 Friends
 class  | AcApDocWindowManagerImp
Member Function Documentation
 ACAD_PORT AcApDocWindow* AcApDocWindowManager::activeDocumentWindow  |  ( |   | )
warning Not implemented!
 ACAD_PORT bool AcApDocWindowManager::addDocumentWindow  |  ( |  AcApDocWindow *  |  docWindow | )
warning Not implemented!
 ACAD_PORT void AcApDocWindowManager::addReactor  |  ( |  AcApDocWindowManagerReactor *  |  pReactor | )
warning Not implemented!
 ACAD_PORT int AcApDocWindowManager::documentWindowCount  |  ( |   | ) |   const
warning Not implemented!
 ACAD_PORT bool AcApDocWindowManager::moveDocumentWindow  |  ( |  AcApDocWindow *  |  docWindow,
|  int  |  newIndex
)
warning Not implemented!
 ACAD_PORT AcApDocWindowIterator* AcApDocWindowManager::newIterator  |  ( |   | ) |   const
warning Not implemented!
 ACAD_PORT void AcApDocWindowManager::removeReactor  |  ( |  AcApDocWindowManagerReactor *  |  pReactor | )
warning Not implemented!
 The documentation for this class was generated from the following file:
AcApDocWindow.h