Public Member Functions | List of all members
AcTransactionReactor Class Reference
AcDb Classes
  Inheritance diagram for AcTransactionReactor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcTransactionReactor)
 virtual void  | endCalledOnOutermostTransaction (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | objectIdSwapped (const AcDbObject *pTransResObj, const AcDbObject *pOtherObj, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | transactionAborted (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | transactionAboutToAbort (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | transactionAboutToEnd (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | transactionAboutToStart (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | transactionEnded (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | transactionStarted (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 Public Member Functions inherited from AcRxObject
 virtual ACBASE_PORT AcRxObject *  | clone () const
 virtual ACBASE_PORT AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual ACBASE_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual ACBASE_PORT AcRxClass *  | isA () const
 virtual ACBASE_PORT bool  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 ACBASE_PORT AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 ACBASE_PORT AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static ACBASE_PORT AcRxClass *  | desc ()
 Protected Member Functions inherited from AcRxObject
virtual ACBASE_PORT AcRxObject *  | subQueryX (const AcRxClass *protocolClass) const
 The documentation for this class was generated from the following file:
dbtrans.h