Macros | Typedefs | Enumerations | Functions
Global Functions
 Macros
 #define  | acdbTransactionManager acdbTransactionManagerPtr()
 #define  | acDocManager acDocManagerPtr()
 #define  | acedCmd MustSwitchTo_acedCmdC_or_acedCmdS - - !
 #define  | acedCommand MustSwitchTo_acedCommandC_or_acedCommandS - - !
 #define  | acedGetIDispatch AcadGetIDispatch
 #define  | acedServices AcEdServices::cast(acrxServiceDictionary->at(ACED_SERVICES))
 #define  | acProfileManager acProfileManagerPtr()
 #define  | actrTransactionManager acTransactionManagerPtr()
 #define  | adsw_hwndAcad adsw_acadMainWnd()
 #define  | HELP_CONTENTS 0x0003L
 #define  | HELP_HELPONHELP 0x0004L
 #define  | HELP_PARTIALKEY 0x0105L
 Typedefs
 typedef AcDbSymbolUtilities::Services  | AcDbSymUtilServices
 typedef void(ADESK_STDCALL *  | AcEdColorDialogCallbackFunction) (void *pCallbackData, const AcCmColor &newColor)
 typedef HBITMAP(*  | AcedCommandBitmapQueryFn) (const wchar_t *cmdName, const COLORREF &backgroundColor)
 typedef int(*  | AcEdCoroutineCallback) (void *pData)
 typedef bool(*  | AcedFilterWinMsgFn) (MSG *)
 typedef void(*  | AcedOnIdleMsgFn) ()
 typedef void(*  | AcedOnModalFn) (bool bModal)
 typedef BOOL(*  | AcedPreTranslateMsgFn) (MSG *)
 typedef void(*  | AcedRunLoopFn) (void *pContext)
 typedef void(*  | AcedWatchWinMsgFn) (const MSG *)
 typedef void(__cdecl *  | ACGLOBADDDMMREACTOR) (AcDMMReactor *pReactor)
 typedef void(__cdecl *  | ACGLOBREMOVEDMMREACTOR) (AcDMMReactor *pReactor)
 typedef void(*  | acgsCustomUpdateMethod) (void *pParm, int left, int right, int bottom, int top)
 typedef HRESULT  | ADUI_LOADFN(IUnknown **ppAdUiRootNode)
 typedef HRESULT  | ADUI_SAVEFN(IUnknown *pAdUiRootNode)
 typedef CAdUiRegistryAccess  | CAcUiRegistryAccess
 typedef CAdUiRegistryDeleteAccess  | CAcUiRegistryDeleteAccess
 typedef CAdUiRegistryWriteAccess  | CAcUiRegistryWriteAccess
 typedef CAcUiTabChildDialog  | CAcUiTabExtension
 typedef AcArray< AcFdFieldReactor * >  | FieldReactors
 typedef void(*  | FileDiaCallbackFuncPtr) (CAcUiNavDialog *)
 Enumerations
enum  | AcEdDrawOrderCmdType {
 kDrawOrderNone = 0, kDrawOrderBottom, kDrawOrderTop, kDrawOrderBelow,
 kDrawOrderAbove
 }
enum  | BlockEditModeFlags { kBlkEditModeNone = 0x0, kBlkEditModeActive = 0x01, kBlkEditModeOpen = 0x02, kBlkEditModeDirty = 0x04 }
enum  | DimstyleTabSuppressed {
 kSymbolsArrowsTabSuppressed = 0x01, kTextTabSuppressed = 0x02, kFitTabSuppressed = 0x04, kPrimaryTabSuppressed = 0x08,
 kAlternateTabSuppressed = 0x10, kToleranceTabSuppressed = 0x20
 }
 Functions
void  | acad__assert (const ACHAR *, const ACHAR *, int)
 ACDBCORE2D_PORT size_t  | acad__msize (void *p)
 ACDBCORE2D_PORT ACHAR *  | acad__strdup (const ACHAR *p)
 ACDBCORE2D_PORT void *  | acad_calloc (size_t num, size_t size)
 ACDBCORE2D_PORT void  | acad_free (void *p)
 ACDBCORE2D_PORT void *  | acad_malloc (size_t size)
 ACDBCORE2D_PORT void *  | acad_realloc (void *p, size_t size)
 const ACHAR *  | acadErrorStatusText (Acad::ErrorStatus)
 ACPAL_PORT void *  | acAllocAligned (size_t alignment, size_t size)
 template<class T >
void  | AcArrayValidateParams (bool bSameBuffer, T *pDest, size_t nBufLen, const T *pSource, size_t nCount)
 HRESULT AXAUTOEXP  | AcAxArrayPolar (AcDbObjectId &objId, LPDISPATCH pAppDisp, int numObjs, double fillAngle, VARIANT basePoint, VARIANT *pArrayObjs)
 HRESULT AXAUTOEXP  | AcAxArrayPolar (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, int numObjs, double fillAngle, VARIANT basePoint, VARIANT *pArrayObjs)
 HRESULT AXAUTOEXP  | AcAxArrayRectangular (AcDbObjectId &objId, LPDISPATCH pAppDisp, int numRows, int numCols, int numLvls, double disRows, double disCols, double disLvls, VARIANT *pArrayObjs)
 HRESULT AXAUTOEXP  | AcAxArrayRectangular (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, int numRows, int numCols, int numLvls, double disRows, double disCols, double disLvls, VARIANT *pArrayObjs)
 HRESULT AXAUTOEXP  | AcAxCopy (AcDbObjectId &objId, LPDISPATCH pAppDisp, LPDISPATCH *pCopyObj, AcDbObjectId ownerId=AcDbObjectId::kNull)
 HRESULT AXAUTOEXP  | AcAxCopy (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, LPDISPATCH *pCopyObj, AcDbObjectId ownerId=AcDbObjectId::kNull)
HRESULT AXAUTOEXP  | AcAxEnableShadowDisplay (AcDbObjectId &objId, bool *pEnabled)
HRESULT AXAUTOEXP  | AcAxEnableShadowDisplay (AcAxObjectRef &objRef, bool *pEnabled)
 HRESULT AXAUTOEXP  | AcAxErase (AcDbObjectId &objId)
 HRESULT AXAUTOEXP  | AcAxErase (AcAxObjectRef &objRef)
HRESULT AXAUTOEXP  | AcAxGet_UIsolineDensity (AcDbObjectId &objId, long *density)
HRESULT AXAUTOEXP  | AcAxGet_VIsolineDensity (AcDbObjectId &objId, long *density)
HRESULT AXAUTOEXP  | AcAxGet_WireframeType (AcDbObjectId &objId, AcWireframeType *type)
 HRESULT AXAUTOEXP  | AcAxGetBoundingBox (AcDbObjectId &objId, VARIANT *minPoint, VARIANT *maxPoint)
 HRESULT AXAUTOEXP  | AcAxGetBoundingBox (AcAxObjectRef &objRef, VARIANT *minPoint, VARIANT *maxPoint)
 HRESULT AXAUTOEXP  | AcAxGetColor (AcDbObjectId &objId, AcColor *pColor)
 HRESULT AXAUTOEXP  | AcAxGetColor (AcAxObjectRef &objRef, AcColor *pColor)
 HRESULT AXAUTOEXP  | AcAxGetDatabase (AcDbDatabase *pDb, LPDISPATCH pAppDisp, LPDISPATCH *pDisp)
HRESULT AXAUTOEXP  | AcAxGetEdgeExtensionDistances (AcDbObjectId &objId, VARIANT *extDistances)
 HRESULT AXAUTOEXP  | AcAxGetExtensionDictionary (AcDbObjectId &objId, LPDISPATCH pAppDisp, IAcadDictionary **pExtDictionary)
 HRESULT AXAUTOEXP  | AcAxGetExtensionDictionary (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, IAcadDictionary **pExtDictionary)
 HRESULT AXAUTOEXP  | AcAxGetHandle (AcDbObjectId &objId, BSTR *pHandle)
 HRESULT AXAUTOEXP  | AcAxGetHandle (AcAxObjectRef &objRef, BSTR *pHandle)
 HRESULT AXAUTOEXP  | AcAxGetHyperlinks (AcDbObjectId &objId, LPDISPATCH pAppDisp, IAcadHyperlinks **pHyperlinks)
 HRESULT AXAUTOEXP  | AcAxGetHyperlinks (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, IAcadHyperlinks **pHyperlinks)
 HRESULT AXAUTOEXP  | AcAxGetIUnknownOfObject (LPUNKNOWN *ppUnk, AcDbObjectId &objId, LPDISPATCH pApp)
 HRESULT AXAUTOEXP  | AcAxGetIUnknownOfObject (LPUNKNOWN *ppUnk, AcDbObject *pObj, LPDISPATCH pApp)
 HRESULT AXAUTOEXP  | AcAxGetLayer (AcDbObjectId &objId, BSTR *pLayer)
 HRESULT AXAUTOEXP  | AcAxGetLayer (AcAxObjectRef &objRef, BSTR *pLayer)
 HRESULT AXAUTOEXP  | AcAxGetLinetype (AcDbObjectId &objId, BSTR *pLinetype)
 HRESULT AXAUTOEXP  | AcAxGetLinetype (AcAxObjectRef &objRef, BSTR *pLinetype)
 HRESULT AXAUTOEXP  | AcAxGetLinetypeScale (AcDbObjectId &objId, double *pLinetypeScale)
 HRESULT AXAUTOEXP  | AcAxGetLinetypeScale (AcAxObjectRef &objRef, double *pLinetypeScale)
 HRESULT AXAUTOEXP  | AcAxGetLineWeight (AcDbObjectId &objId, ACAD_LWEIGHT *lineWeight)
 HRESULT AXAUTOEXP  | AcAxGetLineWeight (AcAxObjectRef &objRef, ACAD_LWEIGHT *lineWeight)
HRESULT AXAUTOEXP  | AcAxGetMaintainAssociativity (AcDbObjectId &objId, int *maintainAssoc)
 HRESULT AXAUTOEXP  | AcAxGetMaterial (AcDbObjectId &objId, BSTR *pMaterial)
 HRESULT AXAUTOEXP  | AcAxGetMaterial (AcAxObjectRef &objRef, BSTR *pMaterial)
Adesk::Int32 AXAUTOEXP  | AcAxGetObjectId32 (const Adesk::IntDbId &objId)
Adesk::IntDbId AXAUTOEXP  | AcAxGetObjectId64 (const Adesk::Int32 &objId)
 HRESULT AXAUTOEXP  | AcAxGetObjectName (AcDbObjectId &objId, BSTR *pName)
 HRESULT AXAUTOEXP  | AcAxGetObjectName (AcAxObjectRef &objRef, BSTR *pName)
 HRESULT AXAUTOEXP  | AcAxGetOwnerId (AcDbObjectId &objId, Adesk::IntDbId *pOwnerId)
 HRESULT AXAUTOEXP  | AcAxGetOwnerId (AcAxObjectRef &objRef, Adesk::IntDbId *pOwnerId)
 HRESULT AXAUTOEXP  | AcAxGetPlotStyleName (AcDbObjectId &objId, BSTR *plotStyleName)
 HRESULT AXAUTOEXP  | AcAxGetPlotStyleName (AcAxObjectRef &objRef, BSTR *plotStyleName)
HRESULT AXAUTOEXP  | AcAxGetShadowDisplay (AcDbObjectId &objId, AcShadowDisplayType *pShadowDisplay)
HRESULT AXAUTOEXP  | AcAxGetShadowDisplay (AcAxObjectRef &objRef, AcShadowDisplayType *pShadowDisplay)
HRESULT AXAUTOEXP  | AcAxGetShowAssociativity (AcDbObjectId &objId, VARIANT_BOOL *bEnabled)
HRESULT AXAUTOEXP  | AcAxGetSurfTrimAssociativity (AcDbObjectId &objId, VARIANT *associative)
 HRESULT AXAUTOEXP  | AcAxGetTransparency (AcDbObjectId &objId, BSTR *pTransparency)
 HRESULT AXAUTOEXP  | AcAxGetTransparency (AcAxObjectRef &objRef, BSTR *pTransparency)
 HRESULT AXAUTOEXP  | AcAxGetTrueColor (AcDbObjectId &objId, IAcadAcCmColor **pColor)
 HRESULT AXAUTOEXP  | AcAxGetTrueColor (AcAxObjectRef &objRef, IAcadAcCmColor **pColor)
 HRESULT AXAUTOEXP  | AcAxGetVisible (AcDbObjectId &objId, VARIANT_BOOL *pVisible)
 HRESULT AXAUTOEXP  | AcAxGetVisible (AcAxObjectRef &objRef, VARIANT_BOOL *pVisible)
 HRESULT AXAUTOEXP  | AcAxGetXData (AcDbObjectId &objId, BSTR bstrName, VARIANT *type, VARIANT *data)
 HRESULT AXAUTOEXP  | AcAxGetXData (AcAxObjectRef &objRef, BSTR bstrName, VARIANT *type, VARIANT *data)
 HRESULT AXAUTOEXP  | AcAxHasExtensionDictionary (AcDbObjectId &objId, VARIANT_BOOL *bHasDictionary)
 HRESULT AXAUTOEXP  | AcAxHasExtensionDictionary (AcAxObjectRef &objRef, VARIANT_BOOL *bHasDictionary)
 HRESULT AXAUTOEXP  | AcAxHighlight (AcDbObjectId &objId, VARIANT_BOOL bHighlight)
 HRESULT AXAUTOEXP  | AcAxHighlight (AcAxObjectRef &objRef, VARIANT_BOOL bHighlight)
 HRESULT AXAUTOEXP  | AcAxIntersectWith (AcDbObjectId &objId, LPDISPATCH pEntity, AcExtendOption option, VARIANT *intPoints)
 HRESULT AXAUTOEXP  | AcAxIntersectWith (AcAxObjectRef &objRef, LPDISPATCH pEntity, AcExtendOption option, VARIANT *intPoints)
 HRESULT AXAUTOEXP  | AcAxMirror (AcDbObjectId &objId, LPDISPATCH pAppDisp, VARIANT point1, VARIANT point2, LPDISPATCH *pMirrorObj)
 HRESULT AXAUTOEXP  | AcAxMirror (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, VARIANT point1, VARIANT point2, LPDISPATCH *pMirrorObj)
 HRESULT AXAUTOEXP  | AcAxMirror3D (AcDbObjectId &objId, LPDISPATCH pAppDisp, VARIANT point1, VARIANT point2, VARIANT point3, LPDISPATCH *pMirrorObj)
 HRESULT AXAUTOEXP  | AcAxMirror3D (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, VARIANT point1, VARIANT point2, VARIANT point3, LPDISPATCH *pMirrorObj)
 HRESULT AXAUTOEXP  | AcAxMove (AcDbObjectId &objId, VARIANT fromPoint, VARIANT toPoint)
 HRESULT AXAUTOEXP  | AcAxMove (AcAxObjectRef &objRef, VARIANT fromPoint, VARIANT toPoint)
HRESULT AXAUTOEXP  | AcAxPut_UIsolineDensity (AcDbObjectId &objId, long density)
HRESULT AXAUTOEXP  | AcAxPut_VIsolineDensity (AcDbObjectId &objId, long density)
HRESULT AXAUTOEXP  | AcAxPut_WireframeType (AcDbObjectId &objId, AcWireframeType type)
 HRESULT AXAUTOEXP  | AcAxPutColor (AcDbObjectId &objId, AcColor color)
 HRESULT AXAUTOEXP  | AcAxPutColor (AcAxObjectRef &objRef, AcColor color)
HRESULT AXAUTOEXP  | AcAxPutEdgeExtensionDistances (AcDbObjectId &objId, VARIANT extDistances)
 HRESULT AXAUTOEXP  | AcAxPutLayer (AcDbObjectId &objId, BSTR layer)
 HRESULT AXAUTOEXP  | AcAxPutLayer (AcAxObjectRef &objRef, BSTR layer)
 HRESULT AXAUTOEXP  | AcAxPutLinetype (AcDbObjectId &objId, BSTR linetype)
 HRESULT AXAUTOEXP  | AcAxPutLinetype (AcAxObjectRef &objRef, BSTR linetype)
 HRESULT AXAUTOEXP  | AcAxPutLinetypeScale (AcDbObjectId &objId, double linetypeScale)
 HRESULT AXAUTOEXP  | AcAxPutLinetypeScale (AcAxObjectRef &objRef, double linetypeScale)
 HRESULT AXAUTOEXP  | AcAxPutLineWeight (AcDbObjectId &objId, ACAD_LWEIGHT lineWeight)
 HRESULT AXAUTOEXP  | AcAxPutLineWeight (AcAxObjectRef &objRef, ACAD_LWEIGHT lineWeight)
HRESULT AXAUTOEXP  | AcAxPutMaintainAssociativity (AcDbObjectId &objId, int maintainAssoc)
 HRESULT AXAUTOEXP  | AcAxPutMaterial (AcDbObjectId &objId, BSTR material)
 HRESULT AXAUTOEXP  | AcAxPutMaterial (AcAxObjectRef &objRef, BSTR material)
 HRESULT AXAUTOEXP  | AcAxPutPlotStyleName (AcDbObjectId &objId, BSTR plotStyleName)
 HRESULT AXAUTOEXP  | AcAxPutPlotStyleName (AcAxObjectRef &objRef, BSTR plotStyleName)
HRESULT AXAUTOEXP  | AcAxPutShadowDisplay (AcDbObjectId &objId, AcShadowDisplayType shadowDisplay)
HRESULT AXAUTOEXP  | AcAxPutShadowDisplay (AcAxObjectRef &objRef, AcShadowDisplayType shadowDisplay)
HRESULT AXAUTOEXP  | AcAxPutShowAssociativity (AcDbObjectId &objId, VARIANT_BOOL bEnabled)
HRESULT AXAUTOEXP  | AcAxPutSurfTrimAssociativity (AcDbObjectId &objId, VARIANT associative)
 HRESULT AXAUTOEXP  | AcAxPutTransparency (AcDbObjectId &objId, BSTR transparency)
 HRESULT AXAUTOEXP  | AcAxPutTransparency (AcAxObjectRef &objRef, BSTR transparency)
 HRESULT AXAUTOEXP  | AcAxPutTrueColor (AcDbObjectId &objId, IAcadAcCmColor *color)
 HRESULT AXAUTOEXP  | AcAxPutTrueColor (AcAxObjectRef &objRef, IAcadAcCmColor *color)
 HRESULT AXAUTOEXP  | AcAxPutVisible (AcDbObjectId &objId, VARIANT_BOOL visible)
 HRESULT AXAUTOEXP  | AcAxPutVisible (AcAxObjectRef &objRef, VARIANT_BOOL visible)
 HRESULT AXAUTOEXP  | AcAxRotate (AcDbObjectId &objId, VARIANT basePoint, double rotationAngle)
 HRESULT AXAUTOEXP  | AcAxRotate (AcAxObjectRef &objRef, VARIANT basePoint, double rotationAngle)
 HRESULT AXAUTOEXP  | AcAxRotate3D (AcDbObjectId &objId, VARIANT point1, VARIANT point2, double rotationAngle)
 HRESULT AXAUTOEXP  | AcAxRotate3D (AcAxObjectRef &objRef, VARIANT point1, VARIANT point2, double rotationAngle)
 HRESULT AXAUTOEXP  | AcAxScaleEntity (AcDbObjectId &objId, VARIANT basePoint, double scaleFactor)
 HRESULT AXAUTOEXP  | AcAxScaleEntity (AcAxObjectRef &objRef, VARIANT basePoint, double scaleFactor)
 HRESULT AXAUTOEXP  | AcAxSetXData (AcDbObjectId &objId, VARIANT type, VARIANT data)
 HRESULT AXAUTOEXP  | AcAxSetXData (AcAxObjectRef &objRef, VARIANT type, VARIANT data)
 HRESULT AXAUTOEXP  | AcAxTransformBy (AcDbObjectId &objId, VARIANT transMatrix)
 HRESULT AXAUTOEXP  | AcAxTransformBy (AcAxObjectRef &objRef, VARIANT transMatrix)
 HRESULT AXAUTOEXP  | AcAxUpdate (AcDbObjectId &objId)
 HRESULT AXAUTOEXP  | AcAxUpdate (AcAxObjectRef &objRef)
 void  | acByteSwap (wchar_t &wch)
ACDBCORE2D_PORT Acad::ErrorStatus  | accessAcDbObjectForRead (AcDbObject *&pObj, AcDbObjectId id, AcRxClass *(*pfDesc)(), bool &bWasOpened, bool bOpenErased)
 template<class ACDB_CLASS >
Acad::ErrorStatus  | accessAcDbObjectForRead (ACDB_CLASS *&pObj, AcDbObjectId id, bool &bWasOpened, bool bOpenErased=false)
 template<>
Acad::ErrorStatus  | accessAcDbObjectForRead< AcDbObject > (AcDbObject *&pObj, AcDbObjectId id, bool &bWasOpened, bool bOpenErased)
ACDBCORE2D_PORT Acad::ErrorStatus  | accessAcDbObjectForWrite (AcDbObject *pObj, bool &bWasNotifyEnabled, bool &bWasWriteEnabled, int &readCountClosed, bool openOnLockedLayer)
 Acad::ErrorStatus  | accmGetColorFromACIName (AcCmColor &clr, const ACHAR *pInput)
 Acad::ErrorStatus  | accmGetColorFromColorBookName (AcCmColor &clr, const ACHAR *pBookName, const ACHAR *pColorName)
 Acad::ErrorStatus  | accmGetColorFromRGBName (AcCmColor &clr, const ACHAR *pInput)
Acad::ErrorStatus ACDBCORE2D_PORT  | accmGetFromHSBName (AcCmHSB &hsb, const ACHAR *pInput)
 void  | accmGetLocalizedColorNames (const ACHAR *colors[9])
 ACDBCORE2D_PORT const AcArray< AcDbDatabase * > &  | acdbActiveDatabaseArray ()
 ACDBCORE2D_PORT bool  | acdbAddAnnotationScaleReactor (AcDbAnnotationScaleReactor *pReactor)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbAddConstrainedGeometryDraggingInfo (const AcConstrainedGeometryDraggingInfo *pDraggingInfo)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbAddFieldReactor (AcFdFieldReactor *pReactor)
 void *  | acdbAlloc (size_t)
 int  | acdbAngToF (const ACHAR *str, int unit, ads_real *v)
 int  | acdbAngToS (ads_real v, int unit, int prec, ACHAR *str, size_t nBufLen)
 const ACDBCORE2D_PORT AcString &  | acdbAnnotationScaleCollectionName ()
Acad::ErrorStatus  | acdbAssignGelibCurveToAcDbCurve (const AcGeCurve3d &geCurve, AcDbCurve *pDbCurve, AcGeVector3d *normal=NULL, const AcGeTol &tol=AcGeContext::gTol)
 ACDBCORE2D_PORT AcDbAssocAction *  | acdbAssocGetCurrentlyEvaluatedActionPointer (const AcDbDatabase *)
ACDB_PORT Acad::ErrorStatus  | acdbAttachPointCloudEntity (AcDbObjectId &newPointCloudId, const AcString &indexFile, const AcString &sourceFile, AcGePoint3d &location, double scale=1.0, double rotation=0.0, AcDbDatabase *pDb=NULL)
ACDB_PORT Acad::ErrorStatus  | acdbAttachPointCloudExEntity (AcDbObjectId &newPointCloudExId, const AcString &pointCloudFile, AcGePoint3d &location, double scale=1.0, double rotation=0.0, AcDbDatabase *pDb=NULL)
 Acad::ErrorStatus  | acdbAttachXref (AcDbDatabase *pHostDb, const ACHAR *pFilename, const ACHAR *pBlockName, AcDbObjectId &xrefBlkId)
 Acad::ErrorStatus  | acdbBindXrefs (AcDbDatabase *pHostDb, const AcDbObjectIdArray &xrefBlkIds, const bool bInsertBind, const bool bAllowUnresolved=false, const bool bQuiet=true)
 bool  | acdbCanonicalToSystemRange (int eUnits, const AcString &strIn, AcString &strOut)
 Acad::ErrorStatus  | acdbCleanUp ()
 Acad::ErrorStatus  | acdbClearSetupForLayouts (Adesk::ULongPtr contextHandle)
Acad::ErrorStatus  | acdbConvertAcDbCurveToGelibCurve (const AcDbCurve *dbCurve, AcGeCurve3d *&pGeCurve, const AcGeTol &tol=AcGeContext::gTol)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbConvertFieldsToText (AcDbDatabase *pDb, const AcStringArray *pEvalIds, AcFd::ConvertFieldToText nOption)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbConvertFieldsToText (const AcDbObjectIdArray &objIds, const AcStringArray *pEvalIds, AcFd::ConvertFieldToText nOption)
Acad::ErrorStatus  | acdbConvertGelibCurveToAcDbCurve (const AcGeCurve3d &geCurve, AcDbCurve *&pDbCurve, AcGeVector3d *normal=NULL, const AcGeTol &tol=AcGeContext::gTol)
ACDBCORE2D_PORT void  | acdbConvertHslToRgb (const AcGeVector3d &hsl, AcGeVector3d &rgb)
ACDBCORE2D_PORT void  | acdbConvertRgbToHsl (const AcGeVector3d &rgb, AcGeVector3d &hsl)
ACDB_PORT Acad::ErrorStatus  | acdbCreatePointCloudEntity (AcDbEntity *&newPointCloud, const AcString &indexFile, const AcString &sourceFile, AcGePoint3d &location, double scale=1.0, double rotation=0.0)
 Acad::ErrorStatus  | acdbCreateViewByViewport (AcDbDatabase *pDb, AcDbObjectId viewportId, const ACHAR *name, const ACHAR *categoryName, AcDbObjectId labelBlockId, AcDbObjectId &view)
 AcDbCustomOsnapManager *  | acdbCustomOsnapManager ()
 Acad::ErrorStatus  | acdbDetachXref (AcDbDatabase *pHostDb, const AcDbObjectId &xrefBlkId)
 int  | acdbDictAdd (const ads_name dictname, const ACHAR *symname, const ads_name newobj)
 struct resbuf *  | acdbDictNext (const ads_name dict, int rewind)
 int  | acdbDictRemove (const ads_name dictname, const ACHAR *symname)
 int  | acdbDictRename (const ads_name dictname, const ACHAR *oldsym, const ACHAR *newsym)
 struct resbuf *  | acdbDictSearch (const ads_name dict, const ACHAR *sym, int setnext)
ACDBCORE2D_PORT bool  | acdbDisableAssociativityAlertIcon (AcDbEntity *pEnt, bool disable)
 ACDB_PORT bool  | acdbDisplayPreviewFromDwg (const ACHAR *pszDwgfilename, void *pPreviewWnd, const Adesk::UInt32 *pBgColor=nullptr)
 int  | acdbDisToF (const ACHAR *str, int unit, ads_real *v)
 Acad::ErrorStatus  | acdbDoSetupForLayouts (AcDbDatabase *pDatabase, Adesk::ULongPtr &contextHandle)
 ACDBCORE2D_PORT bool ADESK_STDCALL  | acdbDwkFileExists (const ACHAR *pszFileName)
 Acad::ErrorStatus  | acdbDxfOutAs2000 (AcDbDatabase *pDb, const ACHAR *fileName, const int precision=16)
 Acad::ErrorStatus  | acdbDxfOutAs2004 (AcDbDatabase *pDb, const ACHAR *fileName, const int precision=16)
 Acad::ErrorStatus  | acdbDxfOutAsR12 (AcDbDatabase *pDb, const ACHAR *fileName, const int precision=16)
 bool  | acdbEcs2Ucs (ads_point p, ads_point q, ads_point norm, bool vec)
 bool  | acdbEcs2Wcs (ads_point p, ads_point q, ads_point norm, bool vec)
 int  | acdbEntDel (const ads_name ent)
 struct resbuf *  | acdbEntGet (const ads_name ent)
 struct resbuf *  | acdbEntGetX (const ads_name ent, const struct resbuf *args)
 int  | acdbEntLast (ads_name result)
 int  | acdbEntMake (const struct resbuf *ent)
 int  | acdbEntMakeX (const struct resbuf *entm, ads_name result)
 int  | acdbEntMod (const struct resbuf *ent)
 int  | acdbEntNext (const ads_name ent, ads_name result)
 int  | acdbEntUpd (const ads_name ent)
 ACDBCORE2D_PORT Acad::ErrorStatus  | acdbEvaluateFields (const AcDbObjectId &objId, int nContext, const ACHAR *pszPropName=NULL, AcDbDatabase *pDb=NULL, AcFd::EvalFields nEvalFlag=AcFd::kEvalRecursive, int *pNumFound=NULL, int *pNumEvaluated=NULL)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbEvaluateFields (const AcDbObjectId &objId, int nContext, const AcDbObjectIdArray *pFieldsToEvaluate, const ACHAR *pszEvaluatorId, AcDbDatabase *pDb, AcFd::EvalFields nEvalFlag, int *pNumFound, int *pNumEvaluated)
 ACDBCORE2D_PORT Acad::ErrorStatus  | acdbEvaluateFields (const AcDbObjectIdArray &objIds, int nContext, const ACHAR *pszPropName=NULL, AcDbDatabase *pDb=NULL, AcFd::EvalFields nEvalFlag=AcFd::kEvalRecursive, int *pNumFound=NULL, int *pNumEvaluated=NULL)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbEvaluateFields (const AcDbObjectIdArray &objIds, int nContext, const AcDbObjectIdArray *pFieldsToEvaluate, const ACHAR *pszEvaluatorId, AcDbDatabase *pDb, AcFd::EvalFields nEvalFlag, int *pNumFound, int *pNumEvaluated)
 void  | acdbFail (const ACHAR *str)
 ACDBCORE2D_PORT bool  | acdbFindField (const ACHAR *pszText, int iSearchFrom, int &nStartPos, int &nEndPos)
Acad::ErrorStatus  | acdbForceTextAdjust (const AcDbObjectIdArray &objIds)
 void  | acdbFree (void *)
 void  | acdbFreeResBufContents (resbuf *pField)
 Acad::ErrorStatus  | acdbGetAdsName (ads_name &objName, AcDbObjectId objId)
 bool  | acdbGetArcLengthSymbolPlacement (AcDbObject *pObj, int &nValue)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbGetAssocAnnotationActionBody (const AcDbObjectId &idDim, AcDbObjectId &idActionBody)
ACDBCORE2D_PORT bool  | acdbGetAssociativityOverride (AcDbEntity *pEnt, int &nValue)
ACDBCORE2D_PORT AcDbUnderlayHost *  | acdbGetCurrentDgnDocHost ()
ACDBCORE2D_PORT AcDbUnderlayHost *  | acdbGetCurrentDgnHost ()
ACDBCORE2D_PORT AcDbUnderlayHost *  | acdbGetCurrentDwfHost ()
ACDBCORE2D_PORT AcDbUnderlayHost *  | acdbGetCurrentPdfHost ()
Acad::ErrorStatus  | acdbGetCurUserViewportId (AcDbDatabase *pDb, AcDbObjectId &vpId)
 AcDbObjectId  | acdbGetCurVportId (AcDbDatabase *pDb)
 AcDbObjectId  | acdbGetCurVportTableRecordId (AcDbDatabase *pDb)
Acad::ErrorStatus  | acdbGetDgnFileReferences (const ACHAR *fileName, const ACHAR *pwd, AcDbRefFileDataPtrArray &files)
bool  | acdbGetDimAngExtOn (AcDbObject *pObj, int &dimExtFlag)
 Acad::ErrorStatus  | acdbGetDimAssocId (AcDbObjectId dimId, AcDbObjectId &dimAssocId)
 Acad::ErrorStatus  | acdbGetDimAssocIds (AcDbObjectId entId, AcDbObjectIdArray &dimAssocIds)
bool  | acdbGetDimBreakSize (AcDbObject *pObj, double &dimBreakSize)
 bool  | acdbGetDimExt1Linetype (AcDbObject *pObj, AcDbObjectId &oidValue)
 bool  | acdbGetDimExt2Linetype (AcDbObject *pObj, AcDbObjectId &oidValue)
 bool  | acdbGetDimExtensionLength (AcDbObject *pObj, double &fValue)
 bool  | acdbGetDimFlipArrow (AcDbObject *pObj, int &nValue)
 bool  | acdbGetDimFlipArrowWhich (AcDbObject *pObj, int &nValue)
bool  | acdbGetDimJogSymbolPosition (AcDbObject *pObj, int &dimJagFlag, AcGePoint3d &pos)
bool  | acdbGetDimJogSymbolSize (AcDbObject *pObj, int &dimJagFlag, double &dimJagSize)
 bool  | acdbGetDimLineLinetype (AcDbObject *pObj, AcDbObjectId &oidValue)
 bool  | acdbGetDimTextBackground (AcDbObject *pObj, int &bgFlag, AcCmColor &bgColor)
bool  | acdbGetDimTextDirection (AcDbObject *pObj, int &nValue)
bool  | acdbGetDimTolAlign (AcDbObject *pObj, int &dimTolAlignFlag)
 AcDbObjectId  | acdbGetDynDimStyleId (AcDbDatabase *pDb=NULL)
bool  | acdbGetExemptCheckFlag (AcDbObject *pObj, int &bitFlags)
 Acad::ErrorStatus  | acdbGetExtnames (bool &value, AcDbDatabase *pDb)
 ACDBCORE2D_PORT AcFdFieldEngine *  | acdbGetFieldEngine (void)
 ACDBCORE2D_PORT bool  | acdbGetFieldMarkers (const ACHAR *&pszPrefix, const ACHAR *&pszSuffix)
 bool  | acdbGetFixedLengthExtLineEnabled (AcDbObject *pObj, int &nValue)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbGetGeoDataObjId (AcDbDatabase *pDb, AcDbObjectId &objId)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbGetGeoDataTransform (AcDbDatabase *pDbSource, AcDbDatabase *pDbTarget, AcGePoint3d &insertionPt, double &rotation, double &scale)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbGetHomeView (AcDbDatabase *pDb, AcDbHomeView &hmView)
 Acad::ErrorStatus  | acdbGetHostDwgXrefGraph (AcDbDatabase *pHostDb, AcDbXrefGraph &graph, Adesk::Boolean includeGhosts=Adesk::kFalse)
 bool  | acdbGetLargeRadDimJogAngle (AcDbObject *pObj, double &fJogAngle)
ACDBCORE2D_PORT const ACHAR *  | acdbGetMappedFontName (const ACHAR *fontName)
ACDB_PORT int  | acdbGetModelerDwgVer (AcDb::AcDbDwgVersion dwgVer, AcDbObject *pObj=nullptr)
Acad::ErrorStatus SCENEDLLIMPEXP  | acdbGetMotionPathDictionary (AcDbDatabase *pDb, AcDbDictionary *&pDict, AcDb::OpenMode mode, bool createIfNonExist)
Acad::ErrorStatus SCENEDLLIMPEXP  | acdbGetMotionPathDictionary (AcDbDatabase *pDb, AcDbDictionary *&pDict, AcDb::OpenMode mode)
Acad::ErrorStatus SCENEDLLIMPEXP  | acdbGetNamedPathDictionary (AcDbDatabase *pDb, AcDbDictionary *&pDict, AcDb::OpenMode mode, bool createIfNonExist)
Acad::ErrorStatus SCENEDLLIMPEXP  | acdbGetNamedPathDictionary (AcDbDatabase *pDb, AcDbDictionary *&pDict, AcDb::OpenMode mode)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbGetNonAssocAnnotations (AcDbDatabase *pDb, bool isPaperSpace, AcDbObjectId &blockId, AcDbObjectIdArray &annoIds, bool ignoreOffOrFrozenLayers=false)
 Acad::ErrorStatus  | acdbGetObjectId (AcDbObjectId &objId, const ads_name objName)
ACDB_PORT Acad::ErrorStatus  | acdbGetObjectMesh (AcDbObject *pObj, const AcDbFaceterSettings *faceter, AcGePoint3dArray &vertexArray, AcArray< Adesk::Int32 > &faceArray, AcGiFaceData *&faceData)
 ACDB_PORT bool  | acdbGetPreviewBitmapFromDwg (const ACHAR *pszDwgfilename, HBITMAP *pPreviewBmp, HPALETTE *pRetPal)
 Acad::ErrorStatus  | acdbGetProxyInfo (AcDbObject *pObj, ACHAR *&dxfName, ACHAR *&className, ACHAR *&appName)
bool  | acdbGetRadialExtensionAngles (AcDbObject *pObj, int &dimExtFlag, double &dimExtAng1, double &dimExtAng2)
 const ACHAR *  | acdbGetReservedString (AcDb::reservedStringEnumType reservedType, bool bGetLocalized=true)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbGetShowCompass (AcDbDatabase *pDb, bool &bShow)
Acad::ErrorStatus  | acdbGetThumbnailBitmapFromDxfFile (const ACHAR *filename, void *&pBitmap)
 Acad::ErrorStatus  | acdbGetUnitsConversion (AcDb::UnitsValue from, AcDb::UnitsValue to, double &conversionFactor)
AcDbObjectId  | acdbGetViewportVisualStyle ()
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbGetVisualStyleIdByIndex (AcDbObjectId &visualStyleId, int visualStyleIndex)
ACDBCORE2D_PORT int  | acdbGetVisualStyleIndexById (AcDbObjectId visualStyleId)
ACDBCORE2D_PORT int  | acdbGetVisualStyleIndexByName (const wchar_t *visualStyleName)
 AcDb::DwgDataType  | acdbGroupCodeToType (AcDb::DxfCode pCode)
 int  | acdbHandEnt (const ACHAR *handle, ads_name entres)
 ACDBCORE2D_PORT bool  | acdbHasFields (const ACHAR *pszText)
 ACDBCORE2D_PORT AcDbHostApplicationServices *  | acdbHostApplicationServices ()
ACDB_PORT void  | acdbInitialize ()
 int  | acdbInters (const ads_point from1, const ads_point to1, const ads_point from2, const ads_point to2, int teston, ads_point result)
ACDBCORE2D_PORT bool  | acdbIsAnnoMonitorOn ()
ACDBCORE2D_PORT bool  | acdbIsAssociativeAnnotation (AcDbObject *pObj, bool *pIsPartialAssoc=NULL)
ACDBCORE2D_PORT bool  | acdbIsAssociativityAlertIconDisabled (AcDbEntity *pEnt)
 bool  | acdbIsCustomObject (const AcDbObjectId &id)
bool  | acdbIsDgnToDwgInProgress ()
ACDBCORE2D_PORT bool  | acdbIsEntityInBlockOrXref (const AcDbEntity *pEnt)
ACDBCORE2D_PORT bool  | acdbIsExpressionAConstant (const AcString &expression, AcDbEvalVariant &val)
ACDBCORE2D_PORT bool  | acdbIsExpressionANegativeConstant (const AcString &expression)
ACDBCORE2D_PORT bool  | acdbIsIdentifier (const AcString &name)
bool  | acdbIsInLongTransaction (AcDbObjectId id)
 Adesk::Boolean  | acdbIsModelerStarted ()
 bool  | acdbIsPersistentReactor (const void *pSomething)
 bool  | acdbIsReservedString (const ACHAR *strString, AcDb::reservedStringEnumType reservedType)
 bool  | acdbIsTransSpatial (const AcDbFullSubentPath &idPath)
 Acad::ErrorStatus  | acdbLoadLineTypeFile (const ACHAR *ltname, const ACHAR *fname, AcDbDatabase *pDb)
 Acad::ErrorStatus  | acdbLoadMlineStyleFile (const ACHAR *sname, const ACHAR *fname)
 ACDBCORE2D_PORT Acad::ErrorStatus  | acdbMakeFieldCode (const ACHAR *pszFieldExpr, AcString &sFieldCode, const ACHAR *pszEvalId=nullptr, const ACHAR *pszFormat=nullptr, const AcHyperlink *pHyperlink=nullptr)
 Acad::ErrorStatus  | acdbMakeFieldCode (const ACHAR *pszFieldExpr, ACHAR *&pszFieldCode, const ACHAR *pszEvalId, const ACHAR *pszFormat, const AcHyperlink *pHyperlink)
 void  | acdbModelerEnd ()
ACDB_PORT Acad::ErrorStatus  | acdbModelerRestoreEntitiesFromDwgFiler (AcDbDwgFiler *filer, AcArray< ENTITY * > &entities, int *pModelerVersion=nullptr, unsigned restoreOptions=kReadStrangerEntityDefault)
ACDB_PORT Acad::ErrorStatus  | acdbModelerRestoreEntityFromDwgFiler (AcDbDwgFiler *filer, ENTITY *&pEntity, int *pModelerVersion=nullptr, unsigned restoreOptions=kReadStrangerEntityDefault)
ACDB_PORT Acad::ErrorStatus  | acdbModelerRestoreEntityFromDxfFiler (AcDbDxfFiler *filer, ENTITY *&pEntity, int *pModelerVersion=nullptr, unsigned restoreOptions=kReadStrangerEntityDefault)
ACDB_PORT Acad::ErrorStatus  | acdbModelerSaveEntitiesToDwgFiler (AcDbDwgFiler *filer, const AcArray< ENTITY * > &entities, AcDbDatabase *pDb, int modelerVersion=-1)
ACDB_PORT Acad::ErrorStatus  | acdbModelerSaveEntitiesToDxfFiler (AcDbDxfFiler *filer, const AcArray< ENTITY * > &entities, AcDbDatabase *pDb, int modelerVersion=-1)
ACDB_PORT Acad::ErrorStatus  | acdbModelerSaveEntityToDwgFiler (AcDbDwgFiler *filer, ENTITY *entity, AcDbDatabase *pDb, int modelerVersion=-1)
ACDB_PORT Acad::ErrorStatus  | acdbModelerSaveEntityToDxfFiler (AcDbDxfFiler *filer, ENTITY *entity, AcDbDatabase *pDb, int modelerVersion=-1)
 void  | acdbModelerStart ()
ACDB_PORT Acad::ErrorStatus  | acdbModifyPointCloudDataView (AcDbEntity *pEnt, IAcPcPointFilter *pFilter)
 int  | acdbNamedObjDict (ads_name result)
 Acad::ErrorStatus  | acdbOleGetOriginalSelectedFontName (const AcDbOle2Frame *pOleEnt, ACHAR *&fontName)
 Acad::ErrorStatus  | acdbOleGetOriginalSelectedFontPointSize (const AcDbOle2Frame *pOleEnt, int &pointSize)
 Acad::ErrorStatus  | acdbOleGetOriginalSelectedTextSizeInAcadUnits (const AcDbOle2Frame *pOleEnt, double &sizeInAcadUnits)
 Acad::ErrorStatus  | acdbOleGetOriginalWidthHeight (const AcDbOle2Frame *pOleEnt, double &width, double &height)
 Acad::ErrorStatus  | acdbOleGetRotationMatrix (const AcDbOle2Frame *pOleEnt, AcGeMatrix3d &rotMat)
 Acad::ErrorStatus  | acdbOleGetSelectedFontName (const AcDbOle2Frame *pOleEnt, ACHAR *&fontName)
 Acad::ErrorStatus  | acdbOleGetSelectedFontPointSize (const AcDbOle2Frame *pOleEnt, int &pointSize)
 Acad::ErrorStatus  | acdbOleGetSelectedTextSizeInAcadUnits (const AcDbOle2Frame *pOleEnt, double &sizeInAcadUnits)
 Acad::ErrorStatus  | acdbOleHitTest (const AcDbOle2Frame *pOleEnt, const AcGePoint3d &wvpt, const AcGeVector3d &wvwdir)
 Acad::ErrorStatus  | acdbOleSetOriginalSelectedFontName (const AcDbOle2Frame *pOleEnt, const ACHAR *fontName)
 Acad::ErrorStatus  | acdbOleSetOriginalSelectedFontPointSize (const AcDbOle2Frame *pOleEnt, const int pointSize)
 Acad::ErrorStatus  | acdbOleSetOriginalSelectedTextSizeInAcadUnits (const AcDbOle2Frame *pOleEnt, const double sizeInAcadUnits)
 Acad::ErrorStatus  | acdbOleSetOriginalWidthHeight (const AcDbOle2Frame *pOleEnt, const double width, const double height)
 Acad::ErrorStatus  | acdbOleSetSelectedFontName (const AcDbOle2Frame *pOleEnt, const ACHAR *fontName)
 Acad::ErrorStatus  | acdbOleSetSelectedFontPointSize (const AcDbOle2Frame *pOleEnt, const int pointSize)
 Acad::ErrorStatus  | acdbOleSetSelectedTextSizeInAcadUnits (const AcDbOle2Frame *pOleEnt, const double sizeInAcadUnits)
 Acad::ErrorStatus  | acdbOpenAcDbEntity (AcDbEntity *&pEnt, AcDbObjectId id, AcDb::OpenMode mode, bool openErasedEntity=false)
 Acad::ErrorStatus  | acdbOpenAcDbObject (AcDbObject *&pObj, AcDbObjectId id, AcDb::OpenMode mode, bool openErasedObject=false)
 ACDBCORE2D_PORT Acad::ErrorStatus  | acdbOpenObject (AcDbObject *&pObj, AcDbObjectId id, AcDb::OpenMode mode, bool openErased, const AcRxClass *pClass)
 ACDBCORE2D_PORT Acad::ErrorStatus  | acdbOpenObject (AcDbObject *&pObj, AcDbObjectId id, AcRxClass *(*pfDesc)(), AcDb::OpenMode mode, bool openErased)
 template<class T_OBJECT >
Acad::ErrorStatus  | acdbOpenObject (T_OBJECT *&pObj, AcDbObjectId id, AcDb::OpenMode mode=AcDb::kForRead, bool openErased=false)
 Acad::ErrorStatus  | acdbOpenObject (AcDbObject *&pObj, AcDbObjectId id, AcDb::OpenMode mode=AcDb::kForRead, bool openErased=false)
 ACDBCORE2D_PORT Acad::ErrorStatus  | acdbOpenObject (AcDbEntity *&pEnt, AcDbObjectId id, AcDb::OpenMode mode=AcDb::kForRead, bool openErased=false)
 const ACHAR *  | acdbOriginalXrefFullPathFor (const AcDbDatabase *)
 Acad::ErrorStatus  | acdbOverlayXref (AcDbDatabase *pHostDb, const ACHAR *pFilename, const ACHAR *pBlockName, AcDbObjectId &xrefBlkId)
 ACDBCORE2D_PORT AcDbObjectId  | acdbPersistentReactorObjectId (const void *pSomething)
 Acad::ErrorStatus  | acdbPostDimAssoc (AcDbObjectId dimId, AcDbDimAssoc *pDimAssoc, AcDbObjectId &dimAssocId, bool isActive=true)
ACDB_PORT Acad::ErrorStatus  | acdbProcessPointCloudData (AcDbEntity *pEnt, const AcDbExtents &ext, int levelOfDetail, IAcPcPointProcessor *pCallback)
ACDB_PORT Acad::ErrorStatus  | acdbProcessPointCloudData (AcDbEntity *pEnt, const AcViewFrustum &frustum, int levelOfDetail, IAcPcPointProcessor *pCallback)
bool  | acdbPSLayoutAnnoAllVisible (AcDbObjectId viewportEntityId)
bool  | acdbPSLayoutAnnoAllVisible (AcDbViewport *pVport)
Acad::ErrorStatus  | acdbQueueAnnotationEntitiesForRegen (AcDbDatabase *pDb)
 int ADESK_STDCALL  | acdbQueueForRegen (const AcDbObjectId *pIdArray, int nNumIds)
int  | acdbRawAngToF (const ACHAR *str, int unit, ads_real *v)
 int  | acdbRawAngToS (ads_real v, int unit, int prec, ACHAR *str, size_t nBufLen)
 void *  | acdbRealloc (void *, size_t)
 int  | acdbRegApp (const ACHAR *appname)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbRegisterGeoDataReactor (AcDbGeoDataReactor *reactor)
 void  | acdbReleaseHostDwg (AcDbDatabase *pHostDb)
 Acad::ErrorStatus  | acdbReloadXrefs (AcDbDatabase *pHostDb, const AcDbObjectIdArray &xrefBlkIds, bool bQuiet=true)
 ACDBCORE2D_PORT bool  | acdbRemoveAnnotationScaleReactor (AcDbAnnotationScaleReactor *pReactor)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbRemoveFieldReactor (AcFdFieldReactor *pReactor)
ACDBCORE2D_PORT void  | acdbRemoveGeoDataReactor (AcDbGeoDataReactor *reactor)
ACDB_PORT Acad::ErrorStatus  | acdbResetPointCloudDataView (AcDbEntity *pEnt)
 Acad::ErrorStatus  | acdbResolveCurrentXRefs (AcDbDatabase *pHostDb, bool useThreadEngine=true, bool doNewOnly=false)
 Acad::ErrorStatus  | acdbResurrectMeNow (const AcDbObjectId &id)
 int  | acdbRToS (ads_real val, int unit, int prec, ACHAR *str, size_t nBufLen)
 Acad::ErrorStatus  | acdbSaveAs2000 (AcDbDatabase *pDb, const ACHAR *fileName)
 Acad::ErrorStatus  | acdbSaveAs2004 (AcDbDatabase *pDb, const ACHAR *fileName)
 Acad::ErrorStatus  | acdbSaveAsR14 (AcDbDatabase *pDb, const ACHAR *fileName)
 ACDBCORE2D_PORT Acad::ErrorStatus  | acdbSendInitialDwgFileOpenComplete (AcDbDatabase *pDb)
 bool  | acdbSetArcLengthSymbolPlacement (AcDbObject *pObj, int nValue, bool autoClearOverride=true)
ACDBCORE2D_PORT bool  | acdbSetAssociativityOverride (AcDbEntity *pEnt, int nValue)
Acad::ErrorStatus  | acdbSetBreak3dQueueForRegen (bool)
ACDBCORE2D_PORT AcDbUnderlayHost *  | acdbSetCurrentDgnDocHost (AcDbUnderlayHost *pHost)
ACDBCORE2D_PORT AcDbUnderlayHost *  | acdbSetCurrentDgnHost (AcDbUnderlayHost *pHost)
ACDBCORE2D_PORT AcDbUnderlayHost *  | acdbSetCurrentDwfHost (AcDbUnderlayHost *pHost)
ACDBCORE2D_PORT AcDbUnderlayHost *  | acdbSetCurrentPdfHost (AcDbUnderlayHost *pHost)
 AcGiContext *  | acdbSetDefaultAcGiContext (AcGiContext *)
bool  | acdbSetDimAngExtOn (AcDbObject *pObj, int dimExtFlag)
bool  | acdbSetDimBreakSize (AcDbObject *pObj, double dimBreakSize, bool autoClearOverride=true)
 bool  | acdbSetDimExt1Linetype (AcDbObject *pObj, AcDbObjectId oidValue, bool autoClearOverride=true)
 bool  | acdbSetDimExt2Linetype (AcDbObject *pObj, AcDbObjectId oidValue, bool autoClearOverride=true)
 bool  | acdbSetDimExtensionLength (AcDbObject *pObj, double fValue, bool autoClearOverride=true)
 bool  | acdbSetDimFlipArrow (AcDbObject *pObj, int nValue, bool autoClearOverride=true)
 bool  | acdbSetDimFlipArrowWhich (AcDbObject *pObj, int nValue, bool autoClearOverride=true)
bool  | acdbSetDimJogSymbolPosition (AcDbObject *pObj, int &dimJagFlag, const AcGePoint3d &pos, bool autoClearOverride=true)
bool  | acdbSetDimJogSymbolSize (AcDbObject *pObj, int dimJagFlag, const double dimJagSize, bool autoClearOverride=true)
 bool  | acdbSetDimLineLinetype (AcDbObject *pObj, AcDbObjectId oidValue, bool autoClearOverride=true)
 bool  | acdbSetDimTextBackground (AcDbObject *pObj, int bgFlag, AcCmColor *pBgColor, bool autoClearOverride=true)
bool  | acdbSetDimTextDirection (AcDbObject *pObj, int nValue, bool autoClearOverride=true)
bool  | acdbSetDimTolAlign (AcDbObject *pObj, int dimTolAlignFlag, bool autoClearOverride=true)
bool  | acdbSetExemptCheckFlag (AcDbObject *pObj, int bitFlags)
 Acad::ErrorStatus  | acdbSetExtnames (AcDbDatabase *pDb, bool value)
 bool  | acdbSetFixedLengthExtLineEnabled (AcDbObject *pObj, int nValue, bool autoClearOverride=true)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbSetHomeView (AcDbDatabase *pDb, const AcDbHomeView &hmView)
 ACDBCORE2D_PORT Acad::ErrorStatus  | acdbSetHostApplicationServices (AcDbHostApplicationServices *pServices)
 bool  | acdbSetLargeRadDimJogAngle (AcDbObject *pObj, double fJogAngle, bool autoClearOverride=true)
ACDB_PORT Acad::ErrorStatus  | acdbSetPointCloudFilter (AcDbEntity *pEnt, IPointCloudFilter *pFilter)
 bool  | acdbSetRadialExtensionAngles (AcDbObject *pObj, int dimExtFlag, double dimExtAng1, double dimExtAng2)
 Acad::ErrorStatus  | acdbSetReferenced (AcDbObjectId objId)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbSetShowCompass (AcDbDatabase *pDb, bool bShow)
Acad::ErrorStatus  | acdbSetViewportVisualStyle (AcDbObjectId visualStyleId)
 int  | acdbSNValid (const ACHAR *tbstr, int pipetest)
ACDBCORE2D_PORT AcDbSummaryInfoManager *  | acdbSummaryInfoManager ()
 const AcDbSymUtilServices *  | acdbSymUtil ()
 bool  | acdbSystemRangeToCanonical (int eUnits, const AcString &strIn, AcString &strOut)
 struct resbuf *  | acdbTblNext (const ACHAR *tblname, int rewind)
 int  | acdbTblObjName (const ACHAR *tblname, const ACHAR *sym, ads_name result)
 struct resbuf *  | acdbTblSearch (const ACHAR *tblname, const ACHAR *sym, int setnext)
ACDB_PORT void  | acdbTerminate ()
bool  | acdbTextFind (AcDbDatabase *pDatabase, AcDbObjectIdArray &resultSet, const ACHAR *findString, const ACHAR *replaceString=nullptr, Adesk::UInt8 searchOptions=AC_SRCH_DEFAULT, const AcDbObjectIdArray &selSet=0)
 AcDbTransactionManager *  | acdbTransactionManagerPtr ()
void  | acdbTriggerAcadOctTreeReclassification ()
 bool  | acdbUcs2Ecs (ads_point p, ads_point q, ads_point norm, bool vec)
 bool  | acdbUcs2Wcs (ads_point p, ads_point q, bool vec)
 bool  | acdbUcsMatrix (AcGeMatrix3d &mat, AcDbDatabase *pDb=nullptr)
 Acad::ErrorStatus  | acdbUnloadXrefs (AcDbDatabase *pHostDb, const AcDbObjectIdArray &xrefBlkIds, const bool bQuiet=true)
Acad::ErrorStatus  | acdbUpdateAllDimensions (AcDbDatabase *pDb)
 Acad::ErrorStatus  | acdbUpdateDimension (AcDbObjectId dimId)
Acad::ErrorStatus  | acdbValidateDbConsistency (AcDbObject *pHostObject, AcDbObjectId objId, Acad::ErrorStatus es=Acad::eOk)
Acad::ErrorStatus  | acdbValidateDbConsistency (AcDbObject *pHostObject, AcDbDatabase *pDatabase, Acad::ErrorStatus es=Acad::eOk)
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbValidateSetup (const AcLocale &loc)
 Acad::ErrorStatus  | acdbValKey (const ads_name lname)
 bool  | acdbWcs2Ecs (ads_point p, ads_point q, ads_point norm, bool vec)
 bool  | acdbWcs2Ucs (ads_point p, ads_point q, bool vec)
 Acad::ErrorStatus  | acdbXBindXrefs (AcDbDatabase *pHostDb, const AcDbObjectIdArray xrefSymbolIds, const bool bInsertBind, const bool bQuiet=true)
 ACDBCORE2D_PORT int  | acdbXdRoom (const ads_name ent, Adesk::Int32 *result)
 ACDBCORE2D_PORT int  | acdbXdSize (const resbuf *rb, Adesk::Int32 *result)
 const ACHAR *  | acdbXlateReservedString (const ACHAR *strSource, bool bGetLocalized=true)
 ACDBCORE2D_PORT int  | acdbXStrCase (ACHAR *str, size_t strLen)
ACDBCORE2D_PORT ACHAR *  | acdbXStrSave (ACHAR *pSource, ACHAR **pDest)
 ACCORE_PORT AcApDocManager *  | acDocManagerPtr ()
 ACAD_PORT AcApDocWindowManager *  | acDocWindowManagerPtr ()
 AcDbObjectId  | acedActiveViewportId ()
 Adesk::Boolean  | acedAddDefaultContextMenu (AcEdUIContext *pContext, const void *appId, const ACHAR *appName=NULL)
AcApDocWindow *  | acedAddHTMLDocWindow (const ACHAR *title, const ACHAR *uriOfHtmlPage)
int  | acedAddHTMLPalette (CAdUiPaletteSet *ps, const ACHAR *name, const ACHAR *uriOfHtmlPage)
 Adesk::Boolean  | acedAddObjectContextMenu (AcRxClass *pClass, AcEdUIContext *pContext, const void *appId)
ACCORE_PORT bool  | acedAddSupplementalCursorImage (const AcGiImageBGRA32 *pSuppCursorImage, int priorityOrder=0)
 int  | acedAlert (const ACHAR *str)
 int  | acedArxLoad (const ACHAR *app)
 struct resbuf *  | acedArxLoaded (void)
 int  | acedArxUnload (const ACHAR *app)
ACAD_PORT Acad::ErrorStatus  | acedAudit (AcDbDatabase *pDb, bool bFixErrors, bool bCmdLnEcho=false)
ACAD_PORT void  | acedCallBackOnCancel ()
 ACAD_PORT bool  | acedClearOLELock (int handle)
 ACCORE_PORT const ACHAR *  | acedClipFormatName ()
ACAD_PORT int  | acedCmdC (AcEdCoroutineCallback pCallback, void *pReturnFcnParms, const struct resbuf *rb)
ACAD_PORT bool  | acedCmdCWasCancelled ()
 bool  | acedCmdLookup (const ACHAR *cmdStr, bool globalLookup, AcEdCommandStruc *retStruc, bool skipUndef=false)
 ACAD_PORT bool  | acedCmdLookup2 (const ACHAR *cmdStr, bool globalLookup, AcEdCommandStruc *retStruc, int sf=ACRX_CMD_DEFUN)
 int  | acedCmdS (const resbuf *rb, bool forFutureUse=false, AcApDocument *pForFutureUse=NULL)
 ACAD_PORT int  | acedCmdUndefine (const ACHAR *cmdStr, int undefIt)
ACAD_PORT int  | acedCommandC (AcEdCoroutineCallback pCallback, void *pReturnFcnParms, int rtype,...)
 int  | acedCommandS (int rtype,...)
bool  | acedCompareToCurrentViewport (const AcDbViewTableRecord *pVwRec)
 Acad::ErrorStatus  | acedConvertEntityToHatch (AcDbHatch *pHatch, AcDbEntity *&pEnt, bool transferId)
 ACCORE_PORT void  | acedCoordFromPixelToWorld (const CPoint &ptIn, acedDwgPoint ptOut)
 ACCORE_PORT bool  | acedCoordFromPixelToWorld (int windnum, CPoint ptIn, acedDwgPoint ptOut)
 ACCORE_PORT bool  | acedCoordFromWorldToPixel (int windnum, const acedDwgPoint ptIn, CPoint &ptOut)
ACAD_PORT Acad::ErrorStatus  | acedCreateEnhancedViewportOnDrop (const ACHAR *filename, const ACHAR *viewName, const AcGePoint2d &location, double scale, AcDbObjectId labelBlockId, AcDbObjectId &sheetViewId, AcDbObjectId &viewportId)
ACAD_PORT Acad::ErrorStatus  | acedCreateEnhancedViewportOnDropDWG (const ACHAR *filename, AcDbExtents *extents, const AcGePoint2d &location, double scale, AcDbObjectId labelBlockId, AcDbObjectId &sheetViewId, AcDbObjectId &viewportId)
ACAD_PORT Adesk::Boolean  | acedCreateInternetShortcut (const ACHAR *szURL, const ACHAR *szShortcutPath)
ACAD_PORT Adesk::Boolean  | acedCreateShortcut (void *pvHwndParent, const ACHAR *szLinkPath, const ACHAR *szObjectPath, const ACHAR *szDesc)
 AcEdSteeringWheel *  | acedCreateSteeringWheel ()
AcEdViewCube *  | acedCreateViewCube (AcGsView *pGsView)
 Acad::ErrorStatus  | acedCreateViewportByView (AcDbDatabase *pDb, const AcDbObjectId &view, const AcGePoint2d &location, double scale, AcDbObjectId &viewportId)
 int  | acedDefun (const ACHAR *pszName, int nFuncNum)
 int  | acedDefunEx (const ACHAR *pszGlobalName, const ACHAR *pszLocalName, int nFuncNum)
 void  | acedDestroySteeringWheel (AcEdSteeringWheel *pWheel)
void  | acedDestroyViewCube (AcEdViewCube *pCube)
void  | acedDisableDefaultARXExceptionHandler (Adesk::Boolean disable=Adesk::kTrue)
 void  | acedDisableUsrbrk ()
Acad::ErrorStatus  | acedDowngradeDocOpen (bool bPromptForSave)
 int  | acedDragGen (const ads_name ss, const ACHAR *pmt, int cursor, int(*scnf)(ads_point pt, ads_matrix mt), ads_point p)
ACCORE_PORT bool  | acedDrawingStatusBarsVisible ()
 Acad::ErrorStatus  | acedDrawOrderInherit (AcDbObjectId parent, AcDbObjectIdArray &childArray, AcEdDrawOrderCmdType cmd)
int  | acedEatCommandThroat (void)
int  | acedEditDimstyleInteractiveEx (AcDbDatabase *pDb, AcDbDimStyleTableRecord *pRec, int familyType, const ACHAR *title=NULL, int tabCtrlFlags=0)
 int  | acedEditMTextInteractive (AcDbMText *pMText, bool useNewUI=false, bool allowTabs=false)
void  | acedEditToleranceInteractive (AcDbFcf *pTol)
 void  | acedEnableUsrbrk ()
 int  | acedEntSel (const ACHAR *str, ads_name entres, ads_point ptres)
 ACCORE_PORT int  | acedEntSel (const ACHAR *str, ads_name entres, ads_point ptres, AcSelectionPreview *pSelectionPreview)
ACCORE_PORT TaskId  | acedExecuteOnMainThread (const AcedRunLoopFn pfn, void *pContext, bool bWaitUntilDone=false)
ACCORE_PORT TaskId  | acedExecuteOnMainThread (IAcEdRunLoopTask *pTask, bool bWaitUntilDone=false)
 ACAD_PORT bool  | acedFiberWorld ()
 int  | acedFindFile (const ACHAR *fname, ACHAR *result, size_t nBufLen)
int  | acedFindTrustedFile (const ACHAR *fname, ACHAR *result, size_t nBufLen)
int  | acedFNSplit (const ACHAR *pathToSplit, ACHAR *prebuf, size_t nPreBufLen, ACHAR *namebuf, size_t nNameBufLen, ACHAR *extbuf, size_t nExtBufLen)
HINSTANCE  | acedGetAcadBrandingResourceInstance ()
ACCORE_PORT HINSTANCE  | acedGetAcadResourceInstance ()
 int  | acedGetAngle (const ads_point pt, const ACHAR *prompt, ads_real *result)
Adesk::UInt32  | acedGetAnimationFrameId (void)
AdApplicationFrame *  | acedGetApplicationFrame ()
 ACCORE_PORT AcApStatusBar *  | acedGetApplicationStatusBar ()
 const ACHAR *  | acedGetAppName ()
 struct resbuf *  | acedGetArgs (void)
ACCORE_PORT HBITMAP  | acedGetBitmapForCommand (const wchar_t *cmdName, const COLORREF &backgroundColor)
 unsigned int  | acedGetBlockEditMode ()
ACCORE_PORT HBITMAP  | acedGetCachedBitmapForCommand (const wchar_t *cmdName, const COLORREF &backgroundColor)
 int  | acedGetCfg (const ACHAR *sym, ACHAR *var, size_t len)
const wchar_t *  | acedGetCMBaseAlias (AcadContextMenuMode mode)
 int  | acedGetCName (const ACHAR *cmd, ACHAR **result)
 ACAD_PORT Acad::ErrorStatus  | acedGetCommandForDocument (const AcApDocument *pDoc, AcString &sCmdName, bool bLocalized=false)
ACAD_PORT Acad::ErrorStatus  | acedGetCommandForDocument (const AcApDocument *pDoc, ACHAR *&pGlobalCmdName)
Adesk::UInt8  | acedGetCommandVersion ()
struct flagmat *  | acedGetComplexLineTypeTransformPtr ()
 int  | acedGetCorner (const ads_point pt, const ACHAR *prompt, ads_point result)
 ACCORE_PORT bool  | acedGetCurrentColors (AcColorSettings *pColorSettings)
ACCORE_PORT bool  | acedGetCurrentColorsEx (AcColorSettings *pColorSettings, AcColorSettingsEx *pColorSettingsEx)
ACCORE_PORT bool  | acedGetCurrentColorsEx2 (AcColorSettings *pColorSettings, AcColorSettingsEx *pColorSettingsEx, AcColorSettingsEx2 *pColorSettingsEx2)
ACCORE_PORT bool  | acedGetCurrentColorsEx3 (AcColorSettings *pColorSettings, AcColorSettingsEx *pColorSettingsEx, AcColorSettingsEx2 *pColorSettingsEx2, AcColorSettingsEx3 *pColorSettingsEx3)
 Acad::ErrorStatus  | acedGetCurrentSelectionSet (AcDbObjectIdArray &sset)
 Acad::ErrorStatus  | acedGetCurrentUCS (AcGeMatrix3d &mat)
 AcDbObjectId  | acedGetCurViewportObjectId ()
short  | acedGetCurVportCircleSides ()
void  | acedGetCurVportPixelToDisplay (double &xFactor, double &yFactor)
void  | acedGetCurVportScreenToDisplay (double &xFactor, double &yFactor)
 int  | acedGetDist (const ads_point pt, const ACHAR *prompt, ads_real *result)
ACCORE_PORT float  | acedGetDpiScalingValue ()
int  | acedGetDrawComplexShape ()
 int  | acedGetEnv (const ACHAR *sym, ACHAR *var, size_t nBufLen)
 int  | acedGetFileD (const ACHAR *title, const ACHAR *defawlt, const ACHAR *ext, int flags, struct resbuf *result)
 int  | acedGetFileNavDialog (const ACHAR *title, const ACHAR *defawlt, const ACHAR *ext, const ACHAR *dlgname, int flags, struct resbuf **result)
Acad::ErrorStatus  | acedGetFullSubentPathsForCurrentSelection (const AcDbObjectId &selectedObject, AcDbFullSubentPathArray &selectedSubentities)
 int  | acedGetFunCode (void)
 IDispatch *  | acedGetIDispatch (bool bAddRef)
 int  | acedGetInput (ACHAR *str, size_t nBufLen)
 ACCORE_PORT int  | acedGetInput (AcString &sOut)
 int  | acedGetInt (const ACHAR *prompt, int *result)
BOOL  | acedGetIUnknownForCurrentCommand (LPUNKNOWN &pUnk)
 int  | acedGetKword (const ACHAR *prompt, ACHAR *result, size_t nBufLen)
 ACCORE_PORT int  | acedGetKword (const ACHAR *prompt, AcString &sResult)
HMENU  | acedGetMenu (const wchar_t *pszAlias)
 int  | acedGetOrient (const ads_point pt, const ACHAR *prompt, ads_real *result)
 int  | acedGetPoint (const ads_point pt, const ACHAR *prompt, ads_point result)
 int  | acedGetReal (const ACHAR *prompt, ads_real *result)
int  | acedGetRecursingLinetypeVectorGeneration ()
 const CString &  | acedGetRegistryCompany ()
 Adesk::UInt32  | acedGetRGB (int color)
 int  | acedGetString (int cronly, const ACHAR *prompt, ACHAR *result, size_t bufsize)
 ACCORE_PORT int  | acedGetString (int cronly, const ACHAR *prompt, AcString &sResult)
ACAD_PORT void  | acedGetSupplementalCursorOffset (int &x, int &y)
 int  | acedGetSym (const ACHAR *sname, struct resbuf **value)
 ACCORE_PORT bool  | acedGetSystemColors (AcColorSettings *pColorSettings)
ACCORE_PORT bool  | acedGetSystemColorsEx (AcColorSettings *pColorSettings, AcColorSettingsEx *pColorSettingsEx)
ACCORE_PORT bool  | acedGetSystemColorsEx2 (AcColorSettings *pColorSettings, AcColorSettingsEx *pColorSettingsEx, AcColorSettingsEx2 *pColorSettingsEx2)
ACCORE_PORT bool  | acedGetSystemColorsEx3 (AcColorSettings *pColorSettings, AcColorSettingsEx *pColorSettingsEx, AcColorSettingsEx2 *pColorSettingsEx2, AcColorSettingsEx3 *pColorSettingsEx3)
ACCORE_PORT bool  | acedGetToolTipInfoForCommand (const ACHAR *cmdName, AcCommandToolTipInfo *pInfo)
bool  | acedGetUnitsConversion (AcDb::UnitsValue blkInsunits, double &conversionFactor)
 ACAD_PORT Acad::ErrorStatus  | acedGetUnitsValueString (AcDb::UnitsValue units, AcString &sUnits)
 const AcString *  | acedGetUnitsValueString (AcDb::UnitsValue units)
ACAD_PORT Adesk::Boolean  | acedGetUserFavoritesDir (ACHAR *szFavoritesDir)
 int  | acedGetVar (const ACHAR *sym, struct resbuf *result)
 int  | acedGetWinNum (int ptx, int pty)
 int  | acedGraphScr (void)
 int  | acedGrDraw (const ads_point from, const ads_point to, int color, int hl)
 int  | acedGrRead (int track, int *type, struct resbuf *result)
 int  | acedGrText (int box, const ACHAR *text, int hl)
 int  | acedGrVecs (const struct resbuf *vlist, ads_matrix mat)
ACAD_PORT bool  | acedHasSupplementalCursorImage ()
 int  | acedHelp (const ACHAR *szFilename, const ACHAR *szTopic, int iCmd)
int  | acedHelpForExternal (const ACHAR *pszFunctionName)
ACAD_PORT bool  | acedHideConstraintBar (AcDbFullSubentPathArray &subentPaths)
Adesk::UInt8  | acedInitCommandVersion (Adesk::UInt8 nVersion=0)
 Adesk::Boolean  | acedInitDialog (Adesk::Boolean useDialog=Adesk::kTrue)
 int  | acedInitGet (int val, const ACHAR *kwl)
 int  | acedInvoke (const struct resbuf *args, struct resbuf **result)
 int  | acedIsDragging (void)
bool  | acedIsInBackgroundMode ()
 ACCORE_PORT bool  | acedIsInputPending ()
 Adesk::Boolean  | acedIsMenuGroupLoaded (const ACHAR *pszGroupName)
bool  | acedIsOsnapOverride ()
 bool  | acedIsUpdateDisplayPaused (void)
 bool  | acedIsUsrbrkDisabled ()
void  | acedLoadJSScript (const ACHAR *pUriOfJSFile)
 bool  | acedLoadPartialMenu (const wchar_t *pszMenuFile)
Acad::ErrorStatus  | acedManageHatchEditorReactor (AcDbObjectId hatchId, AcHatchEdReact action, AcDbObjectId boundaryId=AcDbObjectId::kNull, AcHatchNotifier notifyType=kNobody, bool transformed=false)
void  | acedMarkForDelayXRefRelativePathResolve (const AcDbObjectId &xrefDefId)
 int  | acedMenuCmd (const ACHAR *str)
 Acad::ErrorStatus  | acedMspace ()
 int  | acedNEntSel (const ACHAR *str, ads_name entres, ads_point ptres, ads_point xformres[4], struct resbuf **refstkres)
 int  | acedNEntSelP (const ACHAR *str, ads_name entres, ads_point ptres, int pickflag, ads_matrix xformres, struct resbuf **refstkres)
int  | acedNumberOfViewports ()
void  | acedOpenDocWindowsMinimized (bool bMinimized)
 int  | acedOsnap (const ads_point pt, const ACHAR *mode, ads_point result)
ACAD_PORT bool  | acedPendingCmdCTokens ()
ACAD_PORT bool  | acedPendingFiberlessDocSwitch (AcApDocument **pNextActiveDocument=NULL)
 ACAD_PORT int  | acedPopCommandDirectory (const ACHAR *cmdDirName)
 ACAD_PORT void  | acedPostCommandPrompt ()
 int  | acedPrompt (const ACHAR *str)
 Acad::ErrorStatus  | acedPspace ()
 int  | acedPutSym (const ACHAR *sname, struct resbuf *value)
 int  | acedRedraw (const ads_name ent, int mode)
 int  | acedRegFunc (int(*fhdl)(void), int fcode)
ACCORE_PORT bool  | acedRegisterCommandBitmapQuery (const AcedCommandBitmapQueryFn pfn)
 BOOL  | acedRegisterExtendedTab (const wchar_t *szAppName, const wchar_t *szDialogName)
 ACCORE_PORT bool  | acedRegisterFilterWinMsg (const AcedFilterWinMsgFn pfn)
BOOL  | acedRegisterMainFramePreTranslateObserver (const AcedPreTranslateMsgFn pfn)
ACAD_PORT void  | acedRegisterNavDialogCallbackFunction (FileDiaCallbackFuncPtr funcPtr)
 ACCORE_PORT bool  | acedRegisterOnIdleWinMsg (const AcedOnIdleMsgFn pfn)
 ACCORE_PORT bool  | acedRegisterOnModal (const AcedOnModalFn pfn)
 ACCORE_PORT bool  | acedRegisterWatchWinMsg (const AcedWatchWinMsgFn pfn)
void  | acedReloadMenus (bool bIncrementalReloading)
ACCORE_PORT bool  | acedRemoveCommandBitmapQuery (const AcedCommandBitmapQueryFn pfn)
 Adesk::Boolean  | acedRemoveDefaultContextMenu (AcEdUIContext *pContext)
 ACCORE_PORT bool  | acedRemoveFilterWinMsg (const AcedFilterWinMsgFn pfn)
BOOL  | acedRemoveMainFramePreTranslateObserver (const AcedPreTranslateMsgFn pfn)
 Adesk::Boolean  | acedRemoveObjectContextMenu (AcRxClass *pClass, AcEdUIContext *pContext)
 ACCORE_PORT bool  | acedRemoveOnIdleWinMsg (const AcedOnIdleMsgFn pfn)
 ACCORE_PORT bool  | acedRemoveOnModal (const AcedOnModalFn pfn)
ACCORE_PORT void  | acedRemoveRunLoopTask (TaskId taskId)
ACCORE_PORT bool  | acedRemoveSupplementalCursorImage (const AcGiImageBGRA32 *pSuppCursorImage)
 ACCORE_PORT bool  | acedRemoveWatchWinMsg (const AcedWatchWinMsgFn pfn)
ACAD_PORT Adesk::Boolean  | acedResolveInternetShortcut (const ACHAR *szLinkFile, ACHAR *szUrl)
ACAD_PORT Adesk::Boolean  | acedResolveShortcut (void *pvHwndParent, const ACHAR *szLinkPath, ACHAR *szObjectPath)
Acad::ErrorStatus  | acedRestoreCurrentView (const AcDbObjectId &namedViewId)
 Acad::ErrorStatus  | acedRestorePreviousUCS ()
 void  | acedRestoreStatusBar ()
ACAD_PORT bool  | acedResumingInvocation ()
 int  | acedRetInt (int ival)
 int  | acedRetList (const struct resbuf *rbuf)
 int  | acedRetName (const ads_name aname, int type)
 int  | acedRetNil (void)
 int  | acedRetPoint (const ads_point pt)
 int  | acedRetReal (ads_real rval)
 int  | acedRetStr (const ACHAR *s)
 int  | acedRetT (void)
 int  | acedRetVal (const struct resbuf *rbuf)
 int  | acedRetVoid (void)
ACAD_PORT bool  | acedScaleImageWithGDIPlus (const AcGiImageBGRA32 *pSrcImg, const AcGiImageBGRA32 *pDstImg)
Acad::ErrorStatus  | acedSelectTransients (const AcGsDCRect &rect, int viewportNumber, AcArray< AcEdSelectedTransient > &result)
 void  | acedSendModelessOperationEnded (const ACHAR *strContext)
 void  | acedSendModelessOperationStart (const ACHAR *strContext)
 int  | acedSetCfg (const ACHAR *sym, const ACHAR *val)
bool  | acedSetCMBaseAlias (const wchar_t *strAlias, AcadContextMenuMode mode)
 Adesk::Boolean  | acedSetColorDialog (int &nColor, Adesk::Boolean bAllowMetaColor, int nCurLayerColor)
 Adesk::Boolean  | acedSetColorDialogTrueColor (AcCmColor &color, Adesk::Boolean bAllowMetaColor, const AcCmColor &curLayerColor, AcCm::DialogTabs tabs=(AcCm::DialogTabs)(AcCm::kACITab|AcCm::kTrueColorTab|AcCm::kColorBookTab))
ACAD_PORT Adesk::Boolean  | acedSetColorDialogTrueColorWithCallback (AcCmColor &color, Adesk::Boolean bAllowMetaColor, const AcCmColor &curLayerColor, AcCm::DialogTabs tabs=(AcCm::DialogTabs)(AcCm::kACITab|AcCm::kTrueColorTab|AcCm::kColorBookTab), AcEdColorDialogCallbackFunction callback=NULL, void *pCallbackData=NULL)
 Adesk::Boolean  | acedSetColorPrompt (ACHAR *promptString, AcCmColor &color, Adesk::Boolean bAllowMetaColor)
 ACCORE_PORT bool  | acedSetCurrentColors (AcColorSettings *pColorSettings)
ACCORE_PORT bool  | acedSetCurrentColorsEx (AcColorSettings *pColorSettings, AcColorSettingsEx *pColorSettingsEx)
ACCORE_PORT bool  | acedSetCurrentColorsEx2 (AcColorSettings *pColorSettings, AcColorSettingsEx *pColorSettingsEx, AcColorSettingsEx2 *pColorSettingsEx2)
ACCORE_PORT bool  | acedSetCurrentColorsEx3 (AcColorSettings *pColorSettings, AcColorSettingsEx *pColorSettingsEx, AcColorSettingsEx2 *pColorSettingsEx2, AcColorSettingsEx3 *pColorSettingsEx3)
 Acad::ErrorStatus  | acedSetCurrentUCS (const AcGeMatrix3d &mat)
 Acad::ErrorStatus  | acedSetCurrentView (AcDbViewTableRecord *pVwRec, AcDbViewport *pVP)
 Acad::ErrorStatus  | acedSetCurrentVPort (int vpnumber)
 Acad::ErrorStatus  | acedSetCurrentVPort (const AcDbViewport *pVp)
Acad::ErrorStatus  | acedSetCurVportCircleSides (short value)
void  | acedSetDrawComplexShape (int val)
 int  | acedSetEnv (const ACHAR *sym, const ACHAR *val)
 int  | acedSetFunHelp (const ACHAR *pszFunctionName, const ACHAR *pszHelpfile, const ACHAR *pszTopic, int iCmd)
BOOL  | acedSetIUnknownForCurrentCommand (const LPUNKNOWN)
 ACAD_PORT bool  | acedSetOLELock (int handle, int flags=0)
void  | acedSetRecursingLinetypeVectorGeneration (int val)
 int  | acedSetStatusBarProgressMeter (const ACHAR *pszLabel, int nMinPos, int nMaxPos)
 int  | acedSetStatusBarProgressMeterPos (int nPos)
 ACCORE_PORT void  | acedSetSupplementalCursorOffset (int x, int y)
 int  | acedSetVar (const ACHAR *sym, const struct resbuf *val)
 int  | acedSetView (const struct resbuf *view, int vport)
Acad::ErrorStatus ACDB_PORT  | acedSetXrefResolvedWithUpdateStatus (AcDbBlockTableRecord *pBTR)
ACAD_PORT bool  | acedShowConstraintBar (AcDbFullSubentPathArray &subentPaths)
ACAD_PORT bool  | acedShowConstraintBarForAll (bool bToShow)
BOOL  | acedShowDrawingStatusBars (BOOL bShow=TRUE)
bool  | acedShowHTMLModalWindow (HWND owner, const ACHAR *uriOfHtmlPage, bool persistSizeAndPosition=true)
bool  | acedShowHTMLModalWindow (HWND owner, const ACHAR *uriOfHtmlPage, HtmlWindowOptions opts)
HWND  | acedShowHTMLModelessWindow (HWND owner, const ACHAR *uriOfHtmlPage, bool persistSizeAndPosition=true)
Acad::ErrorStatus  | acedSkipXrefNotification (AcDbDatabase *pHostDb, const ACHAR *xrefName)
 int  | acedSSAdd (const ads_name ename, const ads_name sname, ads_name result)
 int  | acedSSDel (const ads_name ename, const ads_name ss)
 int  | acedSSFree (const ads_name sname)
 int  | acedSSGet (const ACHAR *str, const void *pt1, const void *pt2, const struct resbuf *filter, ads_name ss)
ACCORE_PORT int  | acedSSGet (const ACHAR *str, const void *pt1, const void *pt2, const struct resbuf *filter, ads_name ss, AcSelectionPreview *pSelectionPreview)
 int  | acedSSGetFirst (struct resbuf **gset, struct resbuf **pset)
 int  | acedSSGetKwordCallbackPtr (struct resbuf *(**pFunc)(const ACHAR *))
 int  | acedSSGetOtherCallbackPtr (struct resbuf *(**pFunc)(const ACHAR *))
 int  | acedSSLength (const ads_name sname, Adesk::Int32 *len)
 int  | acedSSMemb (const ads_name ename, const ads_name ss)
 int  | acedSSName (const ads_name ss, int i, ads_name entres)
 int  | acedSSNameX (struct resbuf **rbpp, const ads_name ss, int i)
 int  | acedSSNameXEx (struct resbuf **rbpp, const ads_name ss, int i, unsigned int flags)
 int  | acedSSSetFirst (const ads_name pset, const ads_name unused)
 int  | acedSSSetKwordCallbackPtr (struct resbuf *(*pFunc)(const ACHAR *))
 int  | acedSSSetOtherCallbackPtr (struct resbuf *(*pFunc)(const ACHAR *))
int  | acedSSSetSubentTypes (const AcArray< AcDb::SubentType > &types)
 int  | acedSSSubentAdd (const AcDbFullSubentPath &subentity, const ads_name sname, ads_name result)
 int  | acedSSSubentDel (const AcDbFullSubentPath &subentity, const ads_name ss)
 int  | acedSSSubentLength (const ads_name sname, Adesk::Int32 index, Adesk::Int32 *len)
 int  | acedSSSubentMemb (const AcDbFullSubentPath &subentity, const ads_name ss)
 int  | acedSSSubentName (const ads_name ss, Adesk::Int32 entIndex, Adesk::Int32 subentIndex, AcDbFullSubentPath &subentity)
 int  | acedSSSubentNameX (struct resbuf **rbpp, const ads_name ss, const Adesk::Int32 entIndex, const Adesk::Int32 subentIndex, unsigned int flags)
void  | acedSuppressFileMRU (bool bSuppress)
 Acad::ErrorStatus  | acedSyncFileOpen (const ACHAR *pszFileToOpen, const wchar_t *wszPassword=NULL)
int  | acedTablet (const struct resbuf *args, struct resbuf **result)
 int  | acedTextBox (const struct resbuf *args, ads_point pt1, ads_point pt2)
int  | acedTextPage (void)
 int  | acedTextScr (void)
 Acad::ErrorStatus  | acedTraceBoundary (const AcGePoint3d &seedPoint, bool detectIslands, AcDbVoidPtrArray &resultingBoundarySet)
 int  | acedTrans (const ads_point pt, const struct resbuf *from, const struct resbuf *to, int disp, ads_point result)
 int  | acedUndef (const ACHAR *sname, int nFuncNum)
 bool  | acedUnloadPartialMenu (const wchar_t *pszMenuFile)
void  | acedUnmarkForDelayXRefRelativePathResolve (const AcDbObjectId &xrefDefId)
ACAD_PORT void  | acedUnregisterNavDialogCallbackFunction (FileDiaCallbackFuncPtr funcPtr)
int  | acedUpdate (int vport, ads_point p1, ads_point p2)
 void  | acedUpdateDisplay ()
 void  | acedUpdateDisplayPause (bool bEnable)
Acad::ErrorStatus  | acedUpgradeDocOpen ()
 int  | acedUsrBrk (void)
 AcDbObjectId  | acedViewportIdFromNumber (int nVpNum)
Acad::ErrorStatus  | acedVPLayer (const AcDbObjectId &vpId, const AcDbObjectIdArray &layerIds, AcDb::VpFreezeOps operation)
 int  | acedVports (struct resbuf **vlist)
 Acad::ErrorStatus  | acedVports2VportTableRecords ()
 Acad::ErrorStatus  | acedVportTableRecords2Vports ()
 int  | acedXformSS (const ads_name ssname, ads_matrix genmat)
 Acad::ErrorStatus  | acedXrefAttach (const ACHAR *XrefPathname, const ACHAR *XrefBlockname, AcDbObjectId *pXrefBTRid=NULL, AcDbObjectId *pXrefRefid=NULL, const AcGePoint3d *pXrefInsertPt=NULL, const AcGeScale3d *pXrefScale=NULL, const double *pXrefRotateAngle=NULL, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL, const wchar_t *wszPassword=NULL)
 Acad::ErrorStatus  | acedXrefBind (const ACHAR *XrefBlockname, const bool bInsertBind=false, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL)
 Acad::ErrorStatus  | acedXrefCreateBlockname (const ACHAR *XrefPathname, ACHAR *&XrefBlockname)
 Acad::ErrorStatus  | acedXrefDetach (const ACHAR *XrefBlockname, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL)
Acad::ErrorStatus  | acedXrefNotifyCheckFileChanged (AcDbObjectId btrId, bool &hasChanged)
 Acad::ErrorStatus  | acedXrefOverlay (const ACHAR *XrefPathname, const ACHAR *XrefBlockname, AcDbObjectId *pXrefBTRid=NULL, AcDbObjectId *pXrefRefid=NULL, const AcGePoint3d *pXrefInsertPt=NULL, const AcGeScale3d *pXrefScale=NULL, const double *pXrefRotateAngle=NULL, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL, const wchar_t *wszPassword=NULL)
 Acad::ErrorStatus  | acedXrefReload (const ACHAR *XrefBlockname, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL)
 Acad::ErrorStatus  | acedXrefReload (const AcDbObjectIdArray &XrefBTRids, bool bQuiet=true, AcDbDatabase *pHostDb=NULL)
 Acad::ErrorStatus  | acedXrefResolve (AcDbDatabase *pHostDb, const bool bQuiet=true)
 Acad::ErrorStatus  | acedXrefUnload (const ACHAR *XrefBlockname, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL)
 Acad::ErrorStatus  | acedXrefXBind (const AcDbObjectIdArray symbolIds, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL)
ACFD_PORT bool  | AcFdExtractData (AcDbField *pField, AcString &sSheetSetFile, AcString &sSheetSetId, AcString &sCompName, AcString &sCompId, AcString &sPropName)
 bool  | AcFdExtractData (AcDbField *pField, ACHAR *&pszSheetSetFile, ACHAR *&pszSheetSetId, ACHAR *&pszCompName, ACHAR *&pszCompId, ACHAR *&pszPropName)
ACFD_PORT bool  | AcFdExtractData (AcDbField *pField, AcDbObjectId &objId, AcString &sPropName)
 bool  | AcFdExtractData (AcDbField *pField, AcDbObjectId &objId, ACHAR *&pszPropName)
ACFD_PORT bool  | AcFdMakeFieldCode (const AcDbObjectId &objId, AcDbEvalNodeId blockParamId, const ACHAR *pszPropOrConnectionName, AcFdEval::ObjectFieldOption nOption, const ACHAR *pszFormat, AcHyperlink *pHyperlink, AcString &pszFieldCode)
 bool  | AcFdMakeFieldCode (const AcDbObjectId &objId, AcDbEvalNodeId blockParamId, const ACHAR *pszPropOrConnectionName, AcFdEval::ObjectFieldOption nOption, const ACHAR *pszFormat, AcHyperlink *pHyperlink, ACHAR *&pszFieldCode)
ACFD_PORT bool  | AcFdMakeFieldCode (IAcSmDatabase *pSmDb, IAcSmSheetSet *pSmSheetSet, IAcSmComponent *pSmComp, const ACHAR *pszCompName, const ACHAR *pszPropName, AcFdEval::SheetSetFieldOption nOption, const ACHAR *pszFormat, AcString &pszFieldCode)
 bool  | AcFdMakeFieldCode (IAcSmDatabase *pSmDb, IAcSmSheetSet *pSmSheetSet, IAcSmComponent *pSmComp, const ACHAR *pszCompName, const ACHAR *pszPropName, AcFdEval::SheetSetFieldOption nOption, const ACHAR *pszFormat, ACHAR *&pszFieldCode)
ACFD_PORT bool  | AcFdMakeFieldCode (const AcDbObjectId &tableId, const AcDbObjectId &targetTableId, AcFdEval::ExpressionFieldOption nOption, const AcCellRangeArray &cellRanges, const ACHAR *pszFormat, AcHyperlink *pHyperlink, AcString &sFieldCode)
 bool  | AcFdMakeFieldCode (const AcDbObjectId &tableId, const AcDbObjectId &targetTableId, AcFdEval::ExpressionFieldOption nOption, const AcCellRangeArray &cellRanges, const ACHAR *pszFormat, AcHyperlink *pHyperlink, ACHAR *&pszFieldCode)
 ACFDUI_PORT CAcFdUiFieldManager *  | AcFdUiGetFieldManager (void)
 ACFDUI_PORT int  | AcFdUiInvokeFieldDialog (AcDbField *&pNewField, BOOL bEdit, AcDbDatabase *pDb, CWnd *pParent=NULL)
 ACPAL_PORT void  | acFreeAligned (void *p)
Acad::ErrorStatus  | acgiGetRegenBlockRefStack (AcDbObjectIdArray &blkRefs)
 AcGiTransientManager *  | acgiGetTransientManager ()
 bool  | acgiIsValidClipBoundary (const AcGePoint2dArray &pts)
 void  | acgiSetTransientManager (AcGiTransientManager *transientManager)
void  | AcGlobAddDMMReactor (AcDMMReactor *pReactor)
void  | AcGlobAddPublishReactor (AcPublishReactor *pReactor)
 void  | AcGlobAddPublishUIReactor (AcPublishUIReactor *pReactor)
void  | AcGlobRemoveDMMReactor (AcDMMReactor *pReactor)
void  | AcGlobRemovePublishReactor (AcPublishReactor *pReactor)
 void  | AcGlobRemovePublishUIReactor (AcPublishUIReactor *pReactor)
AcGs2DViewLimitManager *  | acgsCreate2DViewLimitManager (int viewportNumber)
 void  | acgsDestroy2DViewLimitManager (AcGs2DViewLimitManager *pLimitManager)
Adesk::Boolean  | acgsDisplayImage (int viewportNumber, Adesk::Int32 originLeft, Adesk::Int32 originTop, int imageWidth, int imageHeight, void const *imageData, int hasTransparency)
ACCORE_PORT Adesk::Boolean  | acgsDrawableCached (AcGiDrawable *pDrawable)
Adesk::Boolean  | acgsDrawableErased (AcGiDrawable *pDrawable, AcGiDrawable *pParentDrawable)
Adesk::Boolean  | acgsDrawableModified (AcGiDrawable *pDrawable, AcGiDrawable *pParentDrawable)
 ACCORE_PORT AcGsView *  | acgsGetCurrent3dAcGsView (int vpNum)
 ACCORE_PORT AcGsView *  | acgsGetCurrentAcGsView (int vpNum)
ACCORE_PORT AcGsManager *  | acgsGetCurrentGsManager ()
Adesk::Boolean  | acgsGetDisplayInfo (int &drawingWidth, int &drawingHeight, int &aspectWidth, int &aspectHeight)
ACCORE_PORT AcGsModel *  | acgsGetGsHighlightModel (const AcDbDatabase *pDb)
 AcGsManager *  | acgsGetGsManager (CView *pView=nullptr)
AcGsModel *  | acgsGetGsModel (AcGiTransientDrawingMode mode, int subDrawingMode, int viewportNumber)
ACCORE_PORT AcGsModel *  | acgsGetGsModel (const AcDbDatabase *pDb)
 ACCORE_PORT Adesk::UInt16  | acgsGetHighlightColor (void)
 ACCORE_PORT AcGs::LinePattern  | acgsGetHighlightLinePattern (void)
 ACCORE_PORT Adesk::UInt16  | acgsGetHighlightLineWeight (void)
ACCORE_PORT AcGiHighlightStyle  | acgsGetHighlightStyle (void)
 Adesk::Boolean  | acgsGetLensLength (int viewportNumber, double &lensLength)
Adesk::Boolean  | acgsGetOrthoViewParameters (int viewportNumber, AcDb::OrthographicView view, AcGeVector3d *pViewDir, AcGeVector3d *pUpVector)
 AcGsScreenShot *  | acgsGetScreenShot (int viewportNumber)
 Adesk::Boolean  | acgsGetViewParameters (int viewportNumber, AcGsView *pView)
 Adesk::Boolean  | acgsGetViewportInfo (int viewportNumber, int &left, int &bottom, int &right, int &top)
ACCORE_PORT AcGsView *  | acgsObtainAcGsView (int vpNum, const class AcGsKernelDescriptor &)
ACCORE_PORT void  | acgsRedrawShortTermGraphics (int minx, int miny, int maxx, int maxy)
 Adesk::Boolean  | acgsRemoveAnonymousGraphics (int viewportNumber)
 Adesk::Boolean  | acgsSetCustomUpdateMethod (acgsCustomUpdateMethod custom_update_method, void *pParm)
ACCORE_PORT void  | acgsSetGsHighlightModel (const AcDbDatabase *pDb, AcGsModel *pModel)
ACCORE_PORT void  | acgsSetGsModel (const AcDbDatabase *pDb, AcGsModel *pModel)
 ACCORE_PORT void  | acgsSetHighlightColor (Adesk::UInt16 colorIndex)
 ACCORE_PORT void  | acgsSetHighlightLinePattern (AcGs::LinePattern pattern)
 ACCORE_PORT void  | acgsSetHighlightLineWeight (Adesk::UInt16 weight)
ACCORE_PORT void  | acgsSetHighlightStyle (AcGiHighlightStyle style)
 Adesk::Boolean  | acgsSetLensLength (int viewportNumber, const double &lensLength)
Adesk::Boolean  | acgsSetView2D (int viewportNumber)
 Adesk::Boolean  | acgsSetViewParameters (int viewportNumber, const AcGsView *pView, bool bRegenRequired, bool bRescaleRequired, bool bSyncRequired=false)
void  | acgsSetViewportRenderFlag (int viewportNumber)
 void  | acgsWriteViewToUndoController (int viewportNumber)
 ACPAL_PORT void *  | acHeapAlloc (AcHeapHandle heap, size_t size)
 ACPAL_PORT AcHeapHandle  | acHeapCreate (Adesk::UInt32 flags)
 ACPAL_PORT void  | acHeapDestroy (AcHeapHandle heap)
 ACPAL_PORT void  | acHeapFree (AcHeapHandle heap, void *p)
 ACPAL_PORT void *  | acHeapReAlloc (AcHeapHandle heap, void *p, size_t size)
 ACPAL_PORT size_t  | acHeapSize (AcHeapHandle heap, const void *p)
 ACPAL_PORT bool  | acHeapValidate (AcHeapHandle heap, const void *p)
ACJSCORESTUB_PORT Acad::ErrorStatus  | acjsDefun (const TCHAR *name, AcJsFunctionPtr funcAddr, Adesk::Int32 funcFlags=0)
ACJSCORESTUB_PORT Acad::ErrorStatus  | acjsInvokeAsync (const TCHAR *name, const TCHAR *jsonArgs)
ACJSCORESTUB_PORT Acad::ErrorStatus  | acjsInvokeAsyncA (const char *name, const char *jsonArgs)
 AcLyLayerFilterManager *  | aclyGetLayerFilterManager (AcDbDatabase *pDb)
 ACPAL_PORT size_t  | acMsizeAligned (void *p, size_t alignment)
 ACPL_PORT AcPlPlotProgressDialog *ADESK_STDCALL  | acplCreatePlotProgressDialog (HWND hParent, bool bPreview=false, int nSheets=1, ACPLPLTPRGHELPPROC hlpProc=NULL, bool bShowCancelSheetButton=true)
ACPL_PORT AcPlHostAppServices *  | AcPlGetHostAppServices ()
 ACPL_PORT AcPlPlotConfigManager *ADESK_STDCALL  | acplPlotConfigManagerPtr ()
 ACPL_PORT AcPlPlotReactorMgr *__stdcall  | acplPlotReactorMgrPtr ()
 ACPL_PORT ProcessPlotState ADESK_STDCALL  | acplProcessPlotState ()
 void  | acplPublishExecute (AcPlDSDData dsdDataObj, AcPlPlotConfig *pConfig, bool bShowPlotProgress)
ACPL_PORT Acad::ErrorStatus  | AcPlSetHostAppServices (AcPlHostAppServices *pHostServices)
 AcApProfileManager *  | acProfileManagerPtr ()
 bool  | acReadAnsiCharFromCFile (CFile *pCFile, wchar_t &wch, AdCharFormatter *pChFmtr)
 bool  | acReadCIFFromCFile (CFile *pCFile, wchar_t &wch)
 bool  | acReadUtf16CharFromCFile (CFile *pCFile, wchar_t &wch, AdCharFormatter *pChFmtr)
 bool  | acReadUtf8CharFromCFile (CFile *pCFile, wchar_t &wch, AdCharFormatter *pChFmtr)
 ACDBCORE2D_PORT bool  | acrxAppIsLoaded (const ACHAR *pAppName)
 bool  | acrxApplicationIsLocked (const ACHAR *modulename)
 void *  | acrxGetServiceSymbolAddr (const ACHAR *serviceName, const ACHAR *symbol)
 bool  | acrxIsAppMDIAware (const ACHAR *moduleName)
 bool  | acrxLoadApp (const ACHAR *appname, bool asCmd=false)
ACDBCORE2D_PORT bool  | acrxLoadAutoloadApps (const ACHAR *appname)
 ACDBCORE2D_PORT AcArray< wchar_t * > *  | acrxLoadedApps ()
 bool  | acrxLoadModule (const ACHAR *moduleName, bool printit, bool asCmd=false)
 bool  | acrxLockApplication (void *appId)
const ACHAR *  | acrxObjectDBXRegistryKey ()
ACDBCORE2D_PORT AcLocale  | acrxProductLocale ()
 ACDBCORE2D_PORT AcadApp::ErrorStatus  | acrxRegisterApp (AcadApp::LoadReasons alr, const ACHAR *logicalName)
 bool  | acrxRegisterAppMDIAware (void *appId)
 bool  | acrxRegisterAppNotMDIAware (void *appId)
 void *  | acrxRegisterService (const ACHAR *serviceName)
 bool  | acrxServiceIsRegistered (const ACHAR *serviceName)
 bool  | acrxUnloadApp (const ACHAR *appName, bool asCmd=false)
ACDBCORE2D_PORT bool  | acrxUnloadAutoloadApps (const ACHAR *appname)
 bool  | acrxUnloadModule (const ACHAR *moduleName, bool asCmd=false)
 bool  | acrxUnlockApplication (void *appId)
 ACDBCORE2D_PORT AcadApp::ErrorStatus  | acrxUnregisterApp (const ACHAR *logicalname)
ACBASE_PORT void *  | acStackHeapAlloc (size_t size, const void *pParent)
ACBASE_PORT void  | acStackHeapFree (void *p)
ACBASE_PORT void *  | acStackHeapRealloc (void *p, size_t size)
 ACTC_PORT BOOL  | AcTcDownloadItem (LPCTSTR pszUrl, AcTcCatalogItem *&pNewItem, DWORD dwItemTypes=-1, DWORD dwDownloadFlag=kDownloadAll, LPCTSTR pszDownloadPath=NULL)
 ACTC_PORT int  | AcTcDownloadItem (LPTSTR *pUrls, int nNumUrls, AcTcCatalogItem **pItems, DWORD dwItemTypes=-1, DWORD dwDownloadFlag=kDownloadAll, LPCTSTR pszDownloadPath=NULL)
 ACTC_PORT AcTcManager *  | AcTcGetManager (void)
 ACTC_PORT BOOL  | AcTcInitialize (void)
 ACTC_PORT BOOL  | AcTcRefreshItem (AcTcCatalogItem **pItems, int nNumItems, DWORD dwItemTypes=-1, DWORD dwRefreshFlag=kRefreshAll)
ACTC_PORT BOOL  | AcTcSetHostInfo (long lCurrentMajorVersion, long lCurrentMinorVersion, bool bBldEnv)
 ACTC_PORT BOOL  | AcTcSort (AcTcCatalogItem **pItems, int nNumItems, int nSortOption)
 ACTCUI_PORT BOOL  | AcTcUiCopyItems (COleDataSource *pDataSource, const AcTcCatalogItemArray *pItems, BOOL bAutoCADSource)
 ACTCUI_PORT BOOL  | AcTcUiFilterShapesDialog (AcTcCatalogItem *pPackage, AcTcCatalogItemArray *pActiveShapes, AcTcTool *&pCurrentShape, CWnd *pParentWnd)
 ACTCUI_PORT BOOL  | AcTcUiGetDragInfo (IDataObject *pDataObject, ACTCUI_DRAG_HEADER *pHeader)
 ACTCUI_PORT CAcTcUiManager *  | AcTcUiGetManager (void)
 ACTCUI_PORT CAcTcUiToolPaletteSet *  | AcTcUiGetToolPaletteWindow (void)
 ACTCUI_PORT void  | AcTcUiInitialize ()
 ACTCUI_PORT BOOL  | AcTcUiPasteItems (IDataObject *pDataObject, AcTcCatalogItemArray *pItems, AcTcCatalogItemArray *pStockTools, DWORD dwFlag=ACTCUI_PI_SHOW_PROGRESS)
 ACTC_PORT BOOL  | AcTcUninitialize (void)
 AcTransactionManager *  | acTransactionManagerPtr ()
 ACPAL_PORT void *  | acTryHeapAlloc (AcHeapHandle heap, size_t size)
ACUI_PORT HINSTANCE  | AcUiAppBrandingResourceInstance ()
 ACUI_PORT HINSTANCE  | AcUiAppResourceInstance ()
 ACUI_PORT LPCTSTR  | AcUiContextHelpFileName ()
 ACUI_PORT BOOL  | AcUiEnableToolTips ()
 ACUI_PORT BOOL  | AcUiFindContextHelpFullPath (LPCTSTR fileName, CString &fullPath)
 ACUI_PORT BOOL  | AcUiIsInputPending ()
 ACUI_PORT CWnd *  | AcUiMainWindow ()
 ACUI_PORT void  | AcUiRootKey (CString &rootKey)
 ACHAR *  | acutAcStringToAChar (const AcString &s, Acad::ErrorStatus es)
 Acad::ErrorStatus  | acutAcStringToAChar (const AcString &s, ACHAR *&pBuf, Acad::ErrorStatus es)
 ads_real  | acutAngle (const ads_point pt1, const ads_point pt2)
ACPAL_PORT void  | acutAssertMessage (const ACHAR *condition, const ACHAR *filename, int lineNumber, const ACHAR *status)
 struct resbuf *  | acutBuildList (int rtype,...)
ACDBCORE2D_PORT Acad::ErrorStatus  | acutCopyStringToBuffer (const ACHAR *pInput, ACHAR *pOutput, size_t nOutputSize)
 int  | acutCvUnit (ads_real value, const ACHAR *oldunit, const ACHAR *newunit, ads_real *result)
 void  | acutDelBuffer (void *&pBuffer)
 void  | acutDelBuffer (char *&pString)
 void  | acutDelString (char *&pString)
 void  | acutDelString (wchar_t *&pString)
 ads_real  | acutDistance (const ads_point pt1, const ads_point pt2)
 template<class ObjType >
Acad::ErrorStatus  | acutGetAcStringConvertToAChar (const ObjType *pObj, Acad::ErrorStatus(ObjType::*pFunc)(AcString &) const, ACHAR *&pOutput)
 template<class ObjType >
ACHAR *  | acutGetAcStringConvertToAChar (const ObjType *pObj, Acad::ErrorStatus(ObjType::*pFunc)(AcString &) const)
 int  | acutIsAlNum (int c)
 int  | acutIsAlpha (int c)
 int  | acutIsCntrl (int c)
 int  | acutIsDigit (int c)
int  | acutIsGraph (int c)
 int  | acutIsLower (int c)
 int  | acutIsPrint (int c)
 int  | acutIsPunct (int c)
 int  | acutIsSpace (int c)
 int  | acutIsUpper (int c)
int  | acutIsXDigit (int c)
 Acad::ErrorStatus  | acutNewBuffer (void *&pOutput, size_t size)
 Acad::ErrorStatus  | acutNewBuffer (char *&pOutput, size_t size)
 struct resbuf *  | acutNewRb (int v)
 Acad::ErrorStatus  | acutNewString (ACHAR *&pOutput, Adesk::Int32 nNumChars)
Acad::ErrorStatus  | acutNewString (const ACHAR *pInput, ACHAR *&pOutput)
 void  | acutPolar (const ads_point pt, ads_real angle, ads_real dist, ads_point ptres)
 int  | acutPrintf (const ACHAR *format,...)
 int  | acutRbDup (const struct resbuf *source, struct resbuf **result)
 int  | acutRelRb (struct resbuf *rb)
 bool  | acutSplitString (size_t &numLeftBytes, const ACHAR *&pRight, const ACHAR *source, unsigned int delimiter)
 int  | acutSPrintf (ACHAR *buffer, size_t nBufLen, const ACHAR *format,...)
 template<size_t nBufLen>
int  | acutSPrintf (wchar_t(&buf)[nBufLen], const ACHAR *format,...)
 int  | acutToLower (int c)
 int  | acutToUpper (int c)
void  | acutTrimWhiteSpace (ACHAR *pStr)
 Acad::ErrorStatus  | acutUpdString (const ACHAR *pInput, ACHAR *&pOutput)
 int  | acutVSPrintf (wchar_t *buf, size_t nBufLen, const wchar_t *fmt, va_list va)
 template<size_t nBufLen>
int  | acutVSPrintf (wchar_t(&buf)[nBufLen], const ACHAR *format, va_list va)
 int  | acutWcMatch (const ACHAR *string, const ACHAR *pattern)
 bool  | acutWcMatchEx (const ACHAR *string, const ACHAR *pattern, bool ignoreCase)
size_t  | acutXStrLength (const ACHAR *str)
 Acad::ErrorStatus  | acutXStrNormalize (ACHAR *&pStr, bool preserveCase)
 Acad::ErrorStatus  | acutXStrUppercase (ACHAR *&pStr)
 void  | acWriteWCharToCFile (wchar_t wch, CFile *pFile, unsigned nFmt, bool bUseCIF)
 Acad::ErrorStatus  | AcDbIndexFilterManager::addFilter (AcDbBlockReference *pBlkRef, AcDbFilter *pFilter)
 Acad::ErrorStatus  | AcDbIndexFilterManager::addIndex (AcDbBlockTableRecord *pBTR, AcDbIndex *pIndex)
 Acad::ErrorStatus  | addSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetFilter *pFilter)
 Acad::ErrorStatus  | addSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetFilter2 *pFilter)
 Acad::ErrorStatus  | addSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetFilter3 *pFilter)
Acad::ErrorStatus  | addSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetFilter4 *pFilter)
 Acad::ErrorStatus  | addSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetSubSelectFilter *pFilter)
 int  | ads_action_tile (ads_hdlg hdlg, const ACHAR *key, CLIENTFUNC tilefunc)
 int  | ads_add_list (const ACHAR *item)
 int  | ads_client_data_tile (ads_hdlg hdlg, const ACHAR *key, void *clientdata)
 int  | ads_dimensions_tile (ads_hdlg hdlg, const ACHAR *key, short *cx, short *cy)
 int  | ads_done_dialog (ads_hdlg hdlg, int status)
 int  | ads_done_positioned_dialog (ads_hdlg hdlg, int status, int *x_result, int *y_result)
 int  | ads_end_image (void)
 int  | ads_end_list (void)
 int  | ads_fill_image (short x1, short y1, short x2, short y2, short color)
 int  | ads_get_attr (ads_hdlg hdlg, const ACHAR *key, ACHAR *attr, ACHAR *value, int len)
 int  | ads_get_attr_string (ads_htile tile, ACHAR *attr, ACHAR *value, int len)
 int  | ads_get_tile (ads_hdlg hdlg, const ACHAR *key, ACHAR *value, int maxlen)
 int  | ads_load_dialog (const ACHAR *dclfile, int *dcl_id)
 int  | ads_mode_tile (ads_hdlg hdlg, const ACHAR *key, short mode)
 int  | ads_new_dialog (const ACHAR *dlgname, int dcl_id, CLIENTFUNC def_callback, ads_hdlg *hdlg)
 int  | ads_new_positioned_dialog (const ACHAR *dlgname, int dcl_id, CLIENTFUNC def_callback, int x, int y, ads_hdlg *hdlg)
 int  | ads_queueexpr (const ACHAR *expr)
 int  | ads_set_tile (ads_hdlg hdlg, const ACHAR *key, const ACHAR *value)
 int  | ads_slide_image (short x1, short y1, short x2, short y2, const ACHAR *slnam)
 int  | ads_start_dialog (ads_hdlg hdlg, int *status)
 int  | ads_start_image (ads_hdlg hdlg, const ACHAR *key)
 int  | ads_start_list (ads_hdlg hdlg, const ACHAR *key, short operation, short index)
 int  | ads_term_dialog (void)
 int  | ads_unload_dialog (int dcl_id)
 int  | ads_vector_image (short x1, short y1, short x2, short y2, short color)
 ACCORE_PORT HWND  | adsw_acadDocWnd ()
 HWND  | adsw_acadMainWnd ()
int ADUI_PORT  | AdUiAlertDialog (LPCTSTR captionText, LPCTSTR msg0Text, LPCTSTR button0Text, LPCTSTR button1Text, UINT defButton=0)
 int ADUI_PORT  | AdUiDataValidationLevel ()
void ADUI_PORT  | AdUiEnableDockControlBars (BOOL bEnable, CStringArray *pToolIds=NULL)
 void ADUI_PORT  | AdUiEnableDocking (CFrameWnd *pFrame, DWORD dwDockStyle, ADUI_LOADFN *pLoadFcn, ADUI_SAVEFN *pSaveFcn)
 BOOL ADUI_PORT  | AdUiFindContextHelpFullPath (LPCTSTR fileName, CString &fullPath)
 ADUI_PORT CRuntimeClass *  | AdUiGetRegisteredPaletteSetFloatingFrameClass (void)
HWND ADUI_PORT  | AdUiGetSafeParentHwnd ()
ADUI_PORT CWnd *  | AdUiGetSafeParentWnd ()
 CAdUiThemeManager ADUI_PORT *  | AdUiGetThemeManager ()
 void ADUI_PORT  | AdUiHideBalloonTip (CWnd *control)
 const UINT ADUI_PORT  | AdUiMessage ()
 ADUI_NOTIFY ADUI_PORT  | AdUiNotification (WPARAM wp)
 ADUI_REPLY ADUI_PORT  | AdUiNotify (CWnd &w, UINT id, ADUI_NOTIFY n, DWORD_PTR lParam)
 ADUI_REPLY ADUI_PORT  | AdUiNotify (CWnd *w, UINT id, ADUI_NOTIFY n, DWORD_PTR lParam)
 UINT ADUI_PORT  | AdUiNotifyId (WPARAM wp)
 BOOL ADUI_PORT  | AdUiPostNotify (CWnd &w, UINT id, ADUI_NOTIFY n, DWORD_PTR lParam)
 BOOL ADUI_PORT  | AdUiPostNotify (CWnd *w, UINT id, ADUI_NOTIFY n, DWORD_PTR lParam)
bool ADUI_PORT  | AdUiRegisterDockingTool (LPCTSTR lpszToolName, LPCTSTR lpszCommand, UINT nToolbarID)
 ADUI_PORT void  | AdUiRegisterFloatingFrameClassAddress (CRuntimeClass **pClass)
 ADUI_PORT void  | AdUiRegisterPaletteSetFloatingFrameClass (CRuntimeClass *pClass)
bool ADUI_PORT  | AdUiRegisterTool (LPCTSTR lpszToolName, LPCTSTR lpszCommand, CLSID *pID)
void ADUI_PORT  | AdUiSaveDockingToolPositions ()
 bool ADUI_PORT  | AdUiSetDockBarMinWidth (int width)
 ADUI_PORT CRuntimeClass *  | AdUiSetFloatingFrameClass (CRuntimeClass *pNewClass)
 BOOL ADUI_PORT  | AdUiShowBalloonTip (CWnd *owner, CWnd *control, LPCTSTR text, BOOL beep)
 BOOL ADUI_PORT  | AdUiShowBalloonTip (CWnd *owner, CWnd *control, CRect &rect, LPCTSTR text, BOOL beep)
void ADUI_PORT  | AdUiShowDockControlBars (bool bShow)
 void ADUI_PORT  | AdUiSubstituteShellFont (CWnd &dlg, CFont &font)
 double *  | asDblArray (const AcGePoint2d &pnt)
 double *  | asDblArray (const AcGeVector2d &vec)
 double *  | asDblArray (const AcGePoint3d &pnt)
 double *  | asDblArray (const AcGeVector3d &vec)
 AcGePoint2d &  | asPnt2d (const double *pnt)
 AcGePoint3d &  | asPnt3d (const double *pnt)
 AcGeVector2d &  | asVec2d (const double *vec)
 AcGeVector3d &  | asVec3d (const double *vec)
bool ADUI_PORT  | CanStealFocusFromDockedWindow ()
ACDBCORE2D_PORT Acad::ErrorStatus  | checkTopLevelNetworkIntegrity (const AcDbDatabase *)
ACCORE_PORT CAcGradientThumbnailEngine *  | createGradientThumbnailEngine ()
 AcApDocument *  | curDoc ()
 void  | delBuffer (char *&pString)
 void  | delString (ACHAR *&pString)
 Acad::ErrorStatus  | AcDbDictUtil::dictionaryGetAt (AcDbObjectId &id, const ACHAR *name, AcDbObjectId ownerDictId)
 Acad::ErrorStatus  | AcDbDictUtil::dictionaryNameAt (AcString &name, AcDbObjectId itemId, AcDbObjectId ownerDictId)
 Acad::ErrorStatus  | AcDbDictUtil::dictionaryNameAt (ACHAR *&pName, AcDbObjectId itemId, AcDbObjectId ownerDictId)
 Acad::ErrorStatus  | AcDbDictUtil::dictionaryNameAt (AcString &name, AcDbObjectId itemId)
 Acad::ErrorStatus  | AcDbDictUtil::dictionaryNameAt (ACHAR *&pName, AcDbObjectId itemId)
 virtual int  | dimadec () const
 virtual bool  | dimalt () const
 virtual int  | dimaltd () const
 virtual double  | dimaltf () const
 virtual double  | dimaltmzf () const
 virtual const ACHAR *  | dimaltmzs () const
 virtual double  | dimaltrnd () const
 virtual int  | dimalttd () const
 virtual int  | dimalttz () const
 virtual int  | dimaltu () const
 virtual int  | dimaltz () const
 virtual const ACHAR *  | dimapost () const
virtual int  | dimarcsym () const
 virtual double  | dimasz () const
 virtual int  | dimatfit () const
 virtual int  | dimaunit () const
 virtual int  | dimazin () const
 virtual AcDbObjectId  | dimblk () const
 virtual AcDbObjectId  | dimblk1 () const
 virtual AcDbObjectId  | dimblk2 () const
 virtual double  | dimcen () const
 virtual AcCmColor  | dimclrd () const
 virtual AcCmColor  | dimclre () const
 virtual AcCmColor  | dimclrt () const
 virtual int  | dimdec () const
 virtual double  | dimdle () const
 virtual double  | dimdli () const
 virtual ACHAR  | dimdsep () const
 virtual double  | dimexe () const
 virtual double  | dimexo () const
virtual int  | dimfrac () const
virtual double  | dimfxlen () const
virtual bool  | dimfxlenOn () const
 virtual double  | dimgap () const
virtual double  | dimjogang () const
 virtual int  | dimjust () const
 virtual AcDbObjectId  | dimldrblk () const
 virtual double  | dimlfac () const
 virtual bool  | dimlim () const
virtual AcDbObjectId  | dimltex1 () const
virtual AcDbObjectId  | dimltex2 () const
virtual AcDbObjectId  | dimltype () const
virtual int  | dimlunit () const
 virtual AcDb::LineWeight  | dimlwd () const
 virtual AcDb::LineWeight  | dimlwe () const
 virtual double  | dimmzf () const
 virtual const ACHAR *  | dimmzs () const
 virtual const ACHAR *  | dimpost () const
 virtual double  | dimrnd () const
 virtual bool  | dimsah () const
 virtual double  | dimscale () const
 virtual bool  | dimsd1 () const
 virtual bool  | dimsd2 () const
 virtual bool  | dimse1 () const
 virtual bool  | dimse2 () const
 virtual bool  | dimsoxd () const
 virtual int  | dimtad () const
 virtual int  | dimtdec () const
 virtual double  | dimtfac () const
virtual int  | dimtfill () const
virtual AcCmColor  | dimtfillclr () const
 virtual bool  | dimtih () const
 virtual bool  | dimtix () const
 virtual double  | dimtm () const
virtual int  | dimtmove () const
 virtual bool  | dimtofl () const
 virtual bool  | dimtoh () const
 virtual bool  | dimtol () const
 virtual int  | dimtolj () const
 virtual double  | dimtp () const
 virtual double  | dimtsz () const
 virtual double  | dimtvp () const
 virtual AcDbObjectId  | dimtxsty () const
 virtual double  | dimtxt () const
 virtual bool  | dimtxtdirection () const
 virtual int  | dimtzin () const
 virtual bool  | dimupt () const
 virtual int  | dimzin () const
ACDBCORE2D_PORT AcString &  | dummyString ()
bool  | duplicateSelectionsAllowed (AcApDocument *pDoc)
 Acad::ErrorStatus  | fromAcDbTextStyle (AcGiTextStyle &, const AcDbObjectId &AcDbStyleId)
 Acad::ErrorStatus  | fromAcDbTextStyle (AcGiTextStyle &, const ACHAR *AcDbStyleName)
 AdHostImageAppServices *  | getAdHostImageAppServices ()
Acad::ErrorStatus SCENEDLLIMPEXP  | getBackgroundDictionary (AcDbDatabase *pDb, AcDbDictionary *&pDict, AcDb::OpenMode mode, bool createIfNonExist)
Acad::ErrorStatus SCENEDLLIMPEXP  | getBackgroundDictionary (AcDbDatabase *pDb, AcDbDictionary *&pDict, AcDb::OpenMode mode)
AcDbGlobals *  | getDefaultGlobals ()
AcString  | GetDriveForRoottypePath (const CAdUiVolumeDescriptor *const)
 Acad::ErrorStatus  | AcDbIndexFilterManager::getFilter (const AcDbBlockReference *pRef, const AcRxClass *key, AcDb::OpenMode readOrWrite, AcDbFilter *&pFilter)
 Acad::ErrorStatus  | AcDbIndexFilterManager::getFilter (const AcDbBlockReference *pRef, int index, AcDb::OpenMode readOrWrite, AcDbFilter *&pFilter)
 Acad::ErrorStatus  | AcDbIndexFilterManager::getIndex (const AcDbBlockTableRecord *pBTR, const AcRxClass *key, AcDb::OpenMode readOrWrite, AcDbIndex *&pIndex)
 Acad::ErrorStatus  | AcDbIndexFilterManager::getIndex (const AcDbBlockTableRecord *pBTR, int index, AcDb::OpenMode readOrWrite, AcDbIndex *&pIndex)
 void ADUI_PORT  | GetSystemVirtualScreen (RECT &rect)
ACDBCORE2D_PORT Acad::ErrorStatus  | getTableStyleNameFromDbById (const AcDbObjectId &objId, AcString &sName)
Acad::ErrorStatus  | getTableStyleNameFromDbById (const AcDbObjectId &objId, ACHAR *&pName)
 ACUI_PORT void  | InitAcUiDLL ()
 void ADUI_PORT  | InitAdUiDLL ()
ACDBCORE2D_PORT bool  | isMSpaceActive (AcDbDatabase *pDb)
bool  | IsValidOnColon (const AcString *work)
 Acad::ErrorStatus  | newBuffer (char *&pOutput, size_t size)
 Acad::ErrorStatus  | newString (const ACHAR *pInput, ACHAR *&pOutput)
 Acad::ErrorStatus  | newString (ACHAR *&pOutput, int nNumChars)
 int  | AcDbIndexFilterManager::numFilters (const AcDbBlockReference *pBlkRef)
int  | AcDbIndexFilterManager::numIndexes (const AcDbBlockTableRecord *pBtr)
 bool  | operator!= (wchar_t wch, const AcString &acs)
 bool  | operator!= (const wchar_t *pwsz, const AcString &acs)
 AcString  | operator+ (wchar_t wch, const AcString &acs)
 AcString  | operator+ (const wchar_t *pwsz, const AcString &acs)
 bool  | operator< (wchar_t wch, const AcString &acs)
 bool  | operator< (const wchar_t *pwsz, const AcString &acs)
 bool  | operator<= (wchar_t wch, const AcString &acs)
 bool  | operator<= (const wchar_t *pwsz, const AcString &acs)
 bool  | operator== (wchar_t wch, const AcString &acs)
 bool  | operator== (const wchar_t *pwsz, const AcString &acs)
 bool  | operator> (wchar_t wch, const AcString &acs)
 bool  | operator> (const wchar_t *pwsz, const AcString &acs)
 bool  | operator>= (wchar_t wch, const AcString &acs)
 bool  | operator>= (const wchar_t *pwsz, const AcString &acs)
 HRESULT AXAUTOEXP  | RaiseAcAXException (REFGUID iid, HRESULT hRes, DWORD dwException,...)
 HRESULT AXAUTOEXP  | RaiseArxException (REFGUID iid, HRESULT hRes, Acad::ErrorStatus es)
 Acad::ErrorStatus  | AcDbIndexFilterManager::removeFilter (AcDbBlockReference *pBlkRef, const AcRxClass *key)
 Acad::ErrorStatus  | AcDbIndexFilterManager::removeIndex (AcDbBlockTableRecord *pBTR, const AcRxClass *key)
 Acad::ErrorStatus  | removeSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetFilter *pFilter)
 Acad::ErrorStatus  | removeSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetFilter2 *pFilter)
 Acad::ErrorStatus  | removeSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetFilter3 *pFilter)
Acad::ErrorStatus  | removeSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetFilter4 *pFilter)
 Acad::ErrorStatus  | removeSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetSubSelectFilter *pFilter)
ACDBCORE2D_PORT Acad::ErrorStatus  | revertAcDbObjectFromWrite (AcDbObject *pObj, Acad::ErrorStatus accessStatus, bool bWasNotifyEnabled, bool bWasWriteEnabled, int readCountClosed)
Acad::ErrorStatus  | setAllowDuplicateSelection (AcApDocument *pDoc, unsigned char flag)
 virtual Acad::ErrorStatus  | setDimadec (int v)
 virtual Acad::ErrorStatus  | setDimalt (bool v)
 virtual Acad::ErrorStatus  | setDimaltd (int v)
 virtual Acad::ErrorStatus  | setDimaltf (double v)
 virtual Acad::ErrorStatus  | setDimaltmzf (double v)
 virtual Acad::ErrorStatus  | setDimaltmzs (const ACHAR *v)
 virtual Acad::ErrorStatus  | setDimaltrnd (double v)
 virtual Acad::ErrorStatus  | setDimalttd (int v)
 virtual Acad::ErrorStatus  | setDimalttz (int v)
 virtual Acad::ErrorStatus  | setDimaltu (int v)
 virtual Acad::ErrorStatus  | setDimaltz (int v)
 virtual Acad::ErrorStatus  | setDimapost (const ACHAR *v)
virtual Acad::ErrorStatus  | setDimarcsym (int v)
 virtual Acad::ErrorStatus  | setDimasz (double v)
 virtual Acad::ErrorStatus  | setDimatfit (int v)
 virtual Acad::ErrorStatus  | setDimaunit (int v)
 virtual Acad::ErrorStatus  | setDimazin (int v)
 virtual Acad::ErrorStatus  | setDimblk (AcDbObjectId v)
 virtual Acad::ErrorStatus  | setDimblk (const ACHAR *v)
 virtual Acad::ErrorStatus  | setDimblk1 (AcDbObjectId v)
 virtual Acad::ErrorStatus  | setDimblk1 (const ACHAR *v)
 virtual Acad::ErrorStatus  | setDimblk2 (AcDbObjectId v)
 virtual Acad::ErrorStatus  | setDimblk2 (const ACHAR *v)
 virtual Acad::ErrorStatus  | setDimcen (double v)
 virtual Acad::ErrorStatus  | setDimclrd (const AcCmColor &v)
 virtual Acad::ErrorStatus  | setDimclre (const AcCmColor &v)
 virtual Acad::ErrorStatus  | setDimclrt (const AcCmColor &v)
 virtual Acad::ErrorStatus  | setDimdec (int v)
 virtual Acad::ErrorStatus  | setDimdle (double v)
 virtual Acad::ErrorStatus  | setDimdli (double v)
 virtual Acad::ErrorStatus  | setDimdsep (ACHAR v)
 virtual Acad::ErrorStatus  | setDimexe (double v)
 virtual Acad::ErrorStatus  | setDimexo (double v)
 virtual Acad::ErrorStatus  | setDimfrac (int v)
virtual Acad::ErrorStatus  | setDimfxlen (double v)
virtual Acad::ErrorStatus  | setDimfxlenOn (bool v)
 virtual Acad::ErrorStatus  | setDimgap (double v)
virtual Acad::ErrorStatus  | setDimjogang (double v)
 virtual Acad::ErrorStatus  | setDimjust (int v)
 virtual Acad::ErrorStatus  | setDimldrblk (AcDbObjectId v)
 virtual Acad::ErrorStatus  | setDimldrblk (const ACHAR *v)
 virtual Acad::ErrorStatus  | setDimlfac (double v)
 virtual Acad::ErrorStatus  | setDimlim (bool v)
virtual Acad::ErrorStatus  | setDimltex1 (AcDbObjectId v)
virtual Acad::ErrorStatus  | setDimltex2 (AcDbObjectId v)
virtual Acad::ErrorStatus  | setDimltype (AcDbObjectId v)
 virtual Acad::ErrorStatus  | setDimlunit (int v)
 virtual Acad::ErrorStatus  | setDimlwd (AcDb::LineWeight v)
 virtual Acad::ErrorStatus  | setDimlwe (AcDb::LineWeight v)
 virtual Acad::ErrorStatus  | setDimmzf (double v)
 virtual Acad::ErrorStatus  | setDimmzs (const ACHAR *v)
 virtual Acad::ErrorStatus  | setDimpost (const ACHAR *v)
 virtual Acad::ErrorStatus  | setDimrnd (double v)
 virtual Acad::ErrorStatus  | setDimsah (bool v)
 virtual Acad::ErrorStatus  | setDimscale (double v)
 virtual Acad::ErrorStatus  | setDimsd1 (bool v)
 virtual Acad::ErrorStatus  | setDimsd2 (bool v)
 virtual Acad::ErrorStatus  | setDimse1 (bool v)
 virtual Acad::ErrorStatus  | setDimse2 (bool v)
 virtual Acad::ErrorStatus  | setDimsoxd (bool v)
 virtual Acad::ErrorStatus  | setDimtad (int v)
 virtual Acad::ErrorStatus  | setDimtdec (int v)
 virtual Acad::ErrorStatus  | setDimtfac (double v)
virtual Acad::ErrorStatus  | setDimtfill (int v)
virtual Acad::ErrorStatus  | setDimtfillclr (const AcCmColor &v)
 virtual Acad::ErrorStatus  | setDimtih (bool v)
 virtual Acad::ErrorStatus  | setDimtix (bool v)
 virtual Acad::ErrorStatus  | setDimtm (double v)
 virtual Acad::ErrorStatus  | setDimtmove (int v)
 virtual Acad::ErrorStatus  | setDimtofl (bool v)
 virtual Acad::ErrorStatus  | setDimtoh (bool v)
 virtual Acad::ErrorStatus  | setDimtol (bool v)
 virtual Acad::ErrorStatus  | setDimtolj (int v)
 virtual Acad::ErrorStatus  | setDimtp (double v)
 virtual Acad::ErrorStatus  | setDimtsz (double v)
 virtual Acad::ErrorStatus  | setDimtvp (double v)
 virtual Acad::ErrorStatus  | setDimtxsty (AcDbObjectId v)
 virtual Acad::ErrorStatus  | setDimtxt (double v)
 virtual Acad::ErrorStatus  | setDimtxtdirection (bool v)
 virtual Acad::ErrorStatus  | setDimtzin (int v)
 virtual Acad::ErrorStatus  | setDimupt (bool v)
 virtual Acad::ErrorStatus  | setDimzin (int v)
ACDBCORE2D_PORT void  | stringDefaultArgumentTest (AcString &str=dummyString())
 Acad::ErrorStatus  | toAcDbTextStyle (AcGiTextStyle &)
 Acad::ErrorStatus  | toAcDbTextStyle (AcGiTextStyle &, AcDbObjectId &AcDbStyleId)
 Acad::ErrorStatus  | toAcDbTextStyle (const AcDbObjectId AcDbStyleId, AcGiTextStyle &)
 Acad::ErrorStatus  | toAcDbTextStyle (AcGiTextStyle &, const ACHAR *AcDbStyleName)
 Acad::ErrorStatus  | toAcDbTextStyle (AcGiTextStyle &, const ACHAR *AcDbStyleName, AcDbObjectId &AcDbStyleId)
 void  | ucsNormalVector (AcGeVector3d &ucsNormalVec)
 AcGeVector3d  | ucsXDir ()
 AcGeVector3d  | ucsYDir ()
Acad::ErrorStatus  | AcDbIndexFilterManager::updateIndexes (AcDbDatabase *pDb)
 Acad::ErrorStatus  | updString (const ACHAR *pInput, ACHAR *&pOutput)
bool  | WasAbsoluteHelper (path_category pc)
Detailed Description
Function Documentation
 void acad__assert  |  ( |  const ACHAR *  |  ,
|  const ACHAR *  |  ,
|  int
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxEnableShadowDisplay  |  ( |  AcDbObjectId &  |  objId,
|  bool *  |  pEnabled
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxEnableShadowDisplay  |  ( |  AcAxObjectRef &  |  objRef,
|  bool *  |  pEnabled
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGet_UIsolineDensity  |  ( |  AcDbObjectId &  |  objId,
|  long *  |  density
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGet_VIsolineDensity  |  ( |  AcDbObjectId &  |  objId,
|  long *  |  density
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGet_WireframeType  |  ( |  AcDbObjectId &  |  objId,
|  AcWireframeType *  |  type
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGetEdgeExtensionDistances  |  ( |  AcDbObjectId &  |  objId,
|  VARIANT *  |  extDistances
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGetMaintainAssociativity  |  ( |  AcDbObjectId &  |  objId,
|  int *  |  maintainAssoc
)
Warning
Not implemented!
 Adesk::Int32 AXAUTOEXP AcAxGetObjectId32  |  ( |  const Adesk::IntDbId &  |  objId | )
Warning
Not implemented!
 Adesk::IntDbId AXAUTOEXP AcAxGetObjectId64  |  ( |  const Adesk::Int32 &  |  objId | )
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGetShadowDisplay  |  ( |  AcDbObjectId &  |  objId,
|  AcShadowDisplayType *  |  pShadowDisplay
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGetShadowDisplay  |  ( |  AcAxObjectRef &  |  objRef,
|  AcShadowDisplayType *  |  pShadowDisplay
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGetShowAssociativity  |  ( |  AcDbObjectId &  |  objId,
|  VARIANT_BOOL *  |  bEnabled
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGetSurfTrimAssociativity  |  ( |  AcDbObjectId &  |  objId,
|  VARIANT *  |  associative
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPut_UIsolineDensity  |  ( |  AcDbObjectId &  |  objId,
|  long  |  density
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPut_VIsolineDensity  |  ( |  AcDbObjectId &  |  objId,
|  long  |  density
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPut_WireframeType  |  ( |  AcDbObjectId &  |  objId,
|  AcWireframeType  |  type
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPutEdgeExtensionDistances  |  ( |  AcDbObjectId &  |  objId,
|  VARIANT  |  extDistances
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPutMaintainAssociativity  |  ( |  AcDbObjectId &  |  objId,
|  int  |  maintainAssoc
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPutShadowDisplay  |  ( |  AcDbObjectId &  |  objId,
|  AcShadowDisplayType  |  shadowDisplay
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPutShadowDisplay  |  ( |  AcAxObjectRef &  |  objRef,
|  AcShadowDisplayType  |  shadowDisplay
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPutShowAssociativity  |  ( |  AcDbObjectId &  |  objId,
|  VARIANT_BOOL  |  bEnabled
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPutSurfTrimAssociativity  |  ( |  AcDbObjectId &  |  objId,
|  VARIANT  |  associative
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus accessAcDbObjectForRead  |  ( |  AcDbObject *&  |  pObj,
|  AcDbObjectId  |  id,
|  AcRxClass *(*)()  |  pfDesc,
|  bool &  |  bWasOpened,
|  bool  |  bOpenErased
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus accessAcDbObjectForWrite  |  ( |  AcDbObject *  |  pObj,
|  bool &  |  bWasNotifyEnabled,
|  bool &  |  bWasWriteEnabled,
|  int &  |  readCountClosed,
|  bool  |  openOnLockedLayer
)
Warning
Not implemented!
 Acad::ErrorStatus ACDBCORE2D_PORT accmGetFromHSBName  |  ( |  AcCmHSB &  |  hsb,
|  const ACHAR *  |  pInput
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbAddConstrainedGeometryDraggingInfo  |  ( |  const AcConstrainedGeometryDraggingInfo *  |  pDraggingInfo | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbAddFieldReactor  |  ( |  AcFdFieldReactor *  |  pReactor | )
Warning
Not implemented!
 Acad::ErrorStatus acdbAssignGelibCurveToAcDbCurve  |  ( |  const AcGeCurve3d &  |  geCurve,
|  AcDbCurve *  |  pDbCurve,
|  AcGeVector3d *  |  normal = NULL,
|  const AcGeTol &  |  tol = AcGeContext::gTol
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbAttachPointCloudEntity  |  ( |  AcDbObjectId &  |  newPointCloudId,
|  const AcString &  |  indexFile,
|  const AcString &  |  sourceFile,
|  AcGePoint3d &  |  location,
|  double  |  scale = 1.0,
|  double  |  rotation = 0.0,
|  AcDbDatabase *  |  pDb = NULL
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbAttachPointCloudExEntity  |  ( |  AcDbObjectId &  |  newPointCloudExId,
|  const AcString &  |  pointCloudFile,
|  AcGePoint3d &  |  location,
|  double  |  scale = 1.0,
|  double  |  rotation = 0.0,
|  AcDbDatabase *  |  pDb = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus acdbConvertAcDbCurveToGelibCurve  |  ( |  const AcDbCurve *  |  dbCurve,
|  AcGeCurve3d *&  |  pGeCurve,
|  const AcGeTol &  |  tol = AcGeContext::gTol
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbConvertFieldsToText  |  ( |  AcDbDatabase *  |  pDb,
|  const AcStringArray *  |  pEvalIds,
|  AcFd::ConvertFieldToText  |  nOption
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbConvertFieldsToText  |  ( |  const AcDbObjectIdArray &  |  objIds,
|  const AcStringArray *  |  pEvalIds,
|  AcFd::ConvertFieldToText  |  nOption
)
Warning
Not implemented!
 Acad::ErrorStatus acdbConvertGelibCurveToAcDbCurve  |  ( |  const AcGeCurve3d &  |  geCurve,
|  AcDbCurve *&  |  pDbCurve,
|  AcGeVector3d *  |  normal = NULL,
|  const AcGeTol &  |  tol = AcGeContext::gTol
)
Warning
Not implemented!
 ACDBCORE2D_PORT void acdbConvertHslToRgb  |  ( |  const AcGeVector3d &  |  hsl,
|  AcGeVector3d &  |  rgb
)
Warning
Not implemented!
 ACDBCORE2D_PORT void acdbConvertRgbToHsl  |  ( |  const AcGeVector3d &  |  rgb,
|  AcGeVector3d &  |  hsl
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbCreatePointCloudEntity  |  ( |  AcDbEntity *&  |  newPointCloud,
|  const AcString &  |  indexFile,
|  const AcString &  |  sourceFile,
|  AcGePoint3d &  |  location,
|  double  |  scale = 1.0,
|  double  |  rotation = 0.0
)
Warning
Not implemented!
 ACDBCORE2D_PORT bool acdbDisableAssociativityAlertIcon  |  ( |  AcDbEntity *  |  pEnt,
|  bool  |  disable
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbEvaluateFields  |  ( |  const AcDbObjectId &  |  objId,
|  int  |  nContext,
|  const AcDbObjectIdArray *  |  pFieldsToEvaluate,
|  const ACHAR *  |  pszEvaluatorId,
|  AcDbDatabase *  |  pDb,
|  AcFd::EvalFields  |  nEvalFlag,
|  int *  |  pNumFound,
|  int *  |  pNumEvaluated
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbEvaluateFields  |  ( |  const AcDbObjectIdArray &  |  objIds,
|  int  |  nContext,
|  const AcDbObjectIdArray *  |  pFieldsToEvaluate,
|  const ACHAR *  |  pszEvaluatorId,
|  AcDbDatabase *  |  pDb,
|  AcFd::EvalFields  |  nEvalFlag,
|  int *  |  pNumFound,
|  int *  |  pNumEvaluated
)
Warning
Not implemented!
 Acad::ErrorStatus acdbForceTextAdjust  |  ( |  const AcDbObjectIdArray &  |  objIds | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbGetAssocAnnotationActionBody  |  ( |  const AcDbObjectId &  |  idDim,
|  AcDbObjectId &  |  idActionBody
)
Warning
Not implemented!
 ACDBCORE2D_PORT bool acdbGetAssociativityOverride  |  ( |  AcDbEntity *  |  pEnt,
|  int &  |  nValue
)
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbUnderlayHost* acdbGetCurrentDgnDocHost  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbUnderlayHost* acdbGetCurrentDgnHost  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbUnderlayHost* acdbGetCurrentDwfHost  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbUnderlayHost* acdbGetCurrentPdfHost  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus acdbGetCurUserViewportId  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbObjectId &  |  vpId
)
Warning
Not implemented!
 Acad::ErrorStatus acdbGetDgnFileReferences  |  ( |  const ACHAR *  |  fileName,
|  const ACHAR *  |  pwd,
|  AcDbRefFileDataPtrArray &  |  files
)
Warning
Not implemented!
 bool acdbGetDimAngExtOn  |  ( |  AcDbObject *  |  pObj,
|  int &  |  dimExtFlag
)
Warning
Not implemented!
 bool acdbGetDimBreakSize  |  ( |  AcDbObject *  |  pObj,
|  double &  |  dimBreakSize
)
Warning
Not implemented!
 bool acdbGetDimJogSymbolPosition  |  ( |  AcDbObject *  |  pObj,
|  int &  |  dimJagFlag,
|  AcGePoint3d &  |  pos
)
Warning
Not implemented!
 bool acdbGetDimJogSymbolSize  |  ( |  AcDbObject *  |  pObj,
|  int &  |  dimJagFlag,
|  double &  |  dimJagSize
)
Warning
Not implemented!
 bool acdbGetDimTextDirection  |  ( |  AcDbObject *  |  pObj,
|  int &  |  nValue
)
Warning
Not implemented!
 bool acdbGetDimTolAlign  |  ( |  AcDbObject *  |  pObj,
|  int &  |  dimTolAlignFlag
)
Warning
Not implemented!
 bool acdbGetExemptCheckFlag  |  ( |  AcDbObject *  |  pObj,
|  int &  |  bitFlags
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbGetGeoDataObjId  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbObjectId &  |  objId
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbGetGeoDataTransform  |  ( |  AcDbDatabase *  |  pDbSource,
|  AcDbDatabase *  |  pDbTarget,
|  AcGePoint3d &  |  insertionPt,
|  double &  |  rotation,
|  double &  |  scale
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbGetHomeView  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbHomeView &  |  hmView
)
Warning
Not implemented!
 ACDBCORE2D_PORT const ACHAR* acdbGetMappedFontName  |  ( |  const ACHAR *  |  fontName | )
Warning
Not implemented!
 ACDB_PORT int acdbGetModelerDwgVer  |  ( |  AcDb::AcDbDwgVersion  |  dwgVer,
|  AcDbObject *  |  pObj = nullptr
)
Warning
Not implemented!
 Acad::ErrorStatus SCENEDLLIMPEXP acdbGetMotionPathDictionary  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode,
|  bool  |  createIfNonExist
)
Warning
Not implemented!
 Acad::ErrorStatus SCENEDLLIMPEXP acdbGetMotionPathDictionary  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode
)
Warning
Not implemented!
 Acad::ErrorStatus SCENEDLLIMPEXP acdbGetNamedPathDictionary  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode,
|  bool  |  createIfNonExist
)
Warning
Not implemented!
 Acad::ErrorStatus SCENEDLLIMPEXP acdbGetNamedPathDictionary  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbGetNonAssocAnnotations  |  ( |  AcDbDatabase *  |  pDb,
|  bool  |  isPaperSpace,
|  AcDbObjectId &  |  blockId,
|  AcDbObjectIdArray &  |  annoIds,
|  bool  |  ignoreOffOrFrozenLayers = false
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbGetObjectMesh  |  ( |  AcDbObject *  |  pObj,
|  const AcDbFaceterSettings *  |  faceter,
|  AcGePoint3dArray &  |  vertexArray,
|  AcArray< Adesk::Int32 > &  |  faceArray,
|  AcGiFaceData *&  |  faceData
)
Warning
Not implemented!
 bool acdbGetRadialExtensionAngles  |  ( |  AcDbObject *  |  pObj,
|  int &  |  dimExtFlag,
|  double &  |  dimExtAng1,
|  double &  |  dimExtAng2
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbGetShowCompass  |  ( |  AcDbDatabase *  |  pDb,
|  bool &  |  bShow
)
Warning
Not implemented!
 Acad::ErrorStatus acdbGetThumbnailBitmapFromDxfFile  |  ( |  const ACHAR *  |  filename,
|  void *&  |  pBitmap
)
Warning
Not implemented!
 AcDbObjectId acdbGetViewportVisualStyle  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbGetVisualStyleIdByIndex  |  ( |  AcDbObjectId &  |  visualStyleId,
|  int  |  visualStyleIndex
)
Warning
Not implemented!
 ACDBCORE2D_PORT int acdbGetVisualStyleIndexById  |  ( |  AcDbObjectId  |  visualStyleId | )
Warning
Not implemented!
 ACDBCORE2D_PORT int acdbGetVisualStyleIndexByName  |  ( |  const wchar_t *  |  visualStyleName | )
Warning
Not implemented!
 ACDB_PORT void acdbInitialize  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool acdbIsAnnoMonitorOn  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool acdbIsAssociativeAnnotation  |  ( |  AcDbObject *  |  pObj,
|  bool *  |  pIsPartialAssoc = NULL
)
Warning
Not implemented!
 ACDBCORE2D_PORT bool acdbIsAssociativityAlertIconDisabled  |  ( |  AcDbEntity *  |  pEnt | )
Warning
Not implemented!
 bool acdbIsDgnToDwgInProgress  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool acdbIsEntityInBlockOrXref  |  ( |  const AcDbEntity *  |  pEnt | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool acdbIsExpressionAConstant  |  ( |  const AcString &  |  expression,
|  AcDbEvalVariant &  |  val
)
Warning
Not implemented!
 ACDBCORE2D_PORT bool acdbIsExpressionANegativeConstant  |  ( |  const AcString &  |  expression | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool acdbIsIdentifier  |  ( |  const AcString &  |  name | )
Warning
Not implemented!
 bool acdbIsInLongTransaction  |  ( |  AcDbObjectId  |  id | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbModelerRestoreEntitiesFromDwgFiler  |  ( |  AcDbDwgFiler *  |  filer,
|  AcArray< ENTITY * > &  |  entities,
|  int *  |  pModelerVersion = nullptr,
|  unsigned  |  restoreOptions = kReadStrangerEntityDefault
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbModelerRestoreEntityFromDwgFiler  |  ( |  AcDbDwgFiler *  |  filer,
|  ENTITY *&  |  pEntity,
|  int *  |  pModelerVersion = nullptr,
|  unsigned  |  restoreOptions = kReadStrangerEntityDefault
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbModelerRestoreEntityFromDxfFiler  |  ( |  AcDbDxfFiler *  |  filer,
|  ENTITY *&  |  pEntity,
|  int *  |  pModelerVersion = nullptr,
|  unsigned  |  restoreOptions = kReadStrangerEntityDefault
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbModelerSaveEntitiesToDwgFiler  |  ( |  AcDbDwgFiler *  |  filer,
|  const AcArray< ENTITY * > &  |  entities,
|  AcDbDatabase *  |  pDb,
|  int  |  modelerVersion = -1
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbModelerSaveEntitiesToDxfFiler  |  ( |  AcDbDxfFiler *  |  filer,
|  const AcArray< ENTITY * > &  |  entities,
|  AcDbDatabase *  |  pDb,
|  int  |  modelerVersion = -1
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbModelerSaveEntityToDwgFiler  |  ( |  AcDbDwgFiler *  |  filer,
|  ENTITY *  |  entity,
|  AcDbDatabase *  |  pDb,
|  int  |  modelerVersion = -1
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbModelerSaveEntityToDxfFiler  |  ( |  AcDbDxfFiler *  |  filer,
|  ENTITY *  |  entity,
|  AcDbDatabase *  |  pDb,
|  int  |  modelerVersion = -1
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbModifyPointCloudDataView  |  ( |  AcDbEntity *  |  pEnt,
|  IAcPcPointFilter *  |  pFilter
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbProcessPointCloudData  |  ( |  AcDbEntity *  |  pEnt,
|  const AcDbExtents &  |  ext,
|  int  |  levelOfDetail,
|  IAcPcPointProcessor *  |  pCallback
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbProcessPointCloudData  |  ( |  AcDbEntity *  |  pEnt,
|  const AcViewFrustum &  |  frustum,
|  int  |  levelOfDetail,
|  IAcPcPointProcessor *  |  pCallback
)
Warning
Not implemented!
 bool acdbPSLayoutAnnoAllVisible  |  ( |  AcDbObjectId  |  viewportEntityId | )
Warning
Not implemented!
 bool acdbPSLayoutAnnoAllVisible  |  ( |  AcDbViewport *  |  pVport | )
Warning
Not implemented!
 Acad::ErrorStatus acdbQueueAnnotationEntitiesForRegen  |  ( |  AcDbDatabase *  |  pDb | )
Warning
Not implemented!
 int acdbRawAngToF  |  ( |  const ACHAR *  |  str,
|  int  |  unit,
|  ads_real *  |  v
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbRegisterGeoDataReactor  |  ( |  AcDbGeoDataReactor *  |  reactor | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbRemoveFieldReactor  |  ( |  AcFdFieldReactor *  |  pReactor | )
Warning
Not implemented!
 ACDBCORE2D_PORT void acdbRemoveGeoDataReactor  |  ( |  AcDbGeoDataReactor *  |  reactor | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbResetPointCloudDataView  |  ( |  AcDbEntity *  |  pEnt | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool acdbSetAssociativityOverride  |  ( |  AcDbEntity *  |  pEnt,
|  int  |  nValue
)
Warning
Not implemented!
 Acad::ErrorStatus acdbSetBreak3dQueueForRegen  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbUnderlayHost* acdbSetCurrentDgnDocHost  |  ( |  AcDbUnderlayHost *  |  pHost | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbUnderlayHost* acdbSetCurrentDgnHost  |  ( |  AcDbUnderlayHost *  |  pHost | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbUnderlayHost* acdbSetCurrentDwfHost  |  ( |  AcDbUnderlayHost *  |  pHost | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbUnderlayHost* acdbSetCurrentPdfHost  |  ( |  AcDbUnderlayHost *  |  pHost | )
Warning
Not implemented!
 bool acdbSetDimAngExtOn  |  ( |  AcDbObject *  |  pObj,
|  int  |  dimExtFlag
)
Warning
Not implemented!
 bool acdbSetDimBreakSize  |  ( |  AcDbObject *  |  pObj,
|  double  |  dimBreakSize,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetDimJogSymbolPosition  |  ( |  AcDbObject *  |  pObj,
|  int &  |  dimJagFlag,
|  const AcGePoint3d &  |  pos,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetDimJogSymbolSize  |  ( |  AcDbObject *  |  pObj,
|  int  |  dimJagFlag,
|  const double  |  dimJagSize,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetDimTextDirection  |  ( |  AcDbObject *  |  pObj,
|  int  |  nValue,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetDimTolAlign  |  ( |  AcDbObject *  |  pObj,
|  int  |  dimTolAlignFlag,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetExemptCheckFlag  |  ( |  AcDbObject *  |  pObj,
|  int  |  bitFlags
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbSetHomeView  |  ( |  AcDbDatabase *  |  pDb,
|  const AcDbHomeView &  |  hmView
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbSetPointCloudFilter  |  ( |  AcDbEntity *  |  pEnt,
|  IPointCloudFilter *  |  pFilter
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbSetShowCompass  |  ( |  AcDbDatabase *  |  pDb,
|  bool  |  bShow
)
Warning
Not implemented!
 Acad::ErrorStatus acdbSetViewportVisualStyle  |  ( |  AcDbObjectId  |  visualStyleId | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbSummaryInfoManager* acdbSummaryInfoManager  |  ( |   | )
Warning
Not implemented!
 ACDB_PORT void acdbTerminate  |  ( |   | )
Warning
Not implemented!
 bool acdbTextFind  |  ( |  AcDbDatabase *  |  pDatabase,
|  AcDbObjectIdArray &  |  resultSet,
|  const ACHAR *  |  findString,
|  const ACHAR *  |  replaceString = nullptr,
|  Adesk::UInt8  |  searchOptions = AC_SRCH_DEFAULT,
|  const AcDbObjectIdArray &  |  selSet = 0
)
Warning
Not implemented!
 void acdbTriggerAcadOctTreeReclassification  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus acdbUpdateAllDimensions  |  ( |  AcDbDatabase *  |  pDb | )
Warning
Not implemented!
 Acad::ErrorStatus acdbValidateDbConsistency  |  ( |  AcDbObject *  |  pHostObject,
|  AcDbObjectId  |  objId,
|  Acad::ErrorStatus  |  es = Acad::eOk
)
Warning
Not implemented!
 Acad::ErrorStatus acdbValidateDbConsistency  |  ( |  AcDbObject *  |  pHostObject,
|  AcDbDatabase *  |  pDatabase,
|  Acad::ErrorStatus  |  es = Acad::eOk
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbValidateSetup  |  ( |  const AcLocale &  |  loc | )
Warning
Not implemented!
 ACDBCORE2D_PORT ACHAR* acdbXStrSave  |  ( |  ACHAR *  |  pSource,
|  ACHAR **  |  pDest
)
Warning
Not implemented!
 AcApDocWindow* acedAddHTMLDocWindow  |  ( |  const ACHAR *  |  title,
|  const ACHAR *  |  uriOfHtmlPage
)
Warning
Not implemented!
 int acedAddHTMLPalette  |  ( |  CAdUiPaletteSet *  |  ps,
|  const ACHAR *  |  name,
|  const ACHAR *  |  uriOfHtmlPage
)
Warning
Not implemented!
 ACCORE_PORT bool acedAddSupplementalCursorImage  |  ( |  const AcGiImageBGRA32 *  |  pSuppCursorImage,
|  int  |  priorityOrder = 0
)
Warning
Not implemented!
 ACAD_PORT Acad::ErrorStatus acedAudit  |  ( |  AcDbDatabase *  |  pDb,
|  bool  |  bFixErrors,
|  bool  |  bCmdLnEcho = false
)
Warning
Not implemented!
 ACAD_PORT void acedCallBackOnCancel  |  ( |   | )
Warning
Not implemented!
 ACAD_PORT int acedCmdC  |  ( |  AcEdCoroutineCallback  |  pCallback,
|  void *  |  pReturnFcnParms,
|  const struct resbuf *  |  rb
)
Warning
Not implemented!
 ACAD_PORT bool acedCmdCWasCancelled  |  ( |   | )
Warning
Not implemented!
 ACAD_PORT int acedCommandC  |  ( |  AcEdCoroutineCallback  |  pCallback,
|  void *  |  pReturnFcnParms,
|  int  |  rtype,
|    |  ...
)
Warning
Not implemented!
 bool acedCompareToCurrentViewport  |  ( |  const AcDbViewTableRecord *  |  pVwRec | )
Warning
Not implemented!
 ACAD_PORT Acad::ErrorStatus acedCreateEnhancedViewportOnDrop  |  ( |  const ACHAR *  |  filename,
|  const ACHAR *  |  viewName,
|  const AcGePoint2d &  |  location,
|  double  |  scale,
|  AcDbObjectId  |  labelBlockId,
|  AcDbObjectId &  |  sheetViewId,
|  AcDbObjectId &  |  viewportId
)
Warning
Not implemented!
 ACAD_PORT Acad::ErrorStatus acedCreateEnhancedViewportOnDropDWG  |  ( |  const ACHAR *  |  filename,
|  AcDbExtents *  |  extents,
|  const AcGePoint2d &  |  location,
|  double  |  scale,
|  AcDbObjectId  |  labelBlockId,
|  AcDbObjectId &  |  sheetViewId,
|  AcDbObjectId &  |  viewportId
)
Warning
Not implemented!
 ACAD_PORT Adesk::Boolean acedCreateInternetShortcut  |  ( |  const ACHAR *  |  szURL,
|  const ACHAR *  |  szShortcutPath
)
Warning
Not implemented!
 ACAD_PORT Adesk::Boolean acedCreateShortcut  |  ( |  void *  |  pvHwndParent,
|  const ACHAR *  |  szLinkPath,
|  const ACHAR *  |  szObjectPath,
|  const ACHAR *  |  szDesc
)
Warning
Not implemented!
 AcEdViewCube* acedCreateViewCube  |  ( |  AcGsView *  |  pGsView | )
Warning
Not implemented!
 void acedDestroyViewCube  |  ( |  AcEdViewCube *  |  pCube | )
Warning
Not implemented!
 void acedDisableDefaultARXExceptionHandler  |  ( |  Adesk::Boolean  |  disable = Adesk::kTrue | )
Warning
Not implemented!
 Acad::ErrorStatus acedDowngradeDocOpen  |  ( |  bool  |  bPromptForSave | )
Warning
Not implemented!
 ACCORE_PORT bool acedDrawingStatusBarsVisible  |  ( |   | )
Warning
Not implemented!
 int acedEatCommandThroat  |  ( |  void  |   | )
Warning
Not implemented!
 int acedEditDimstyleInteractiveEx  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDimStyleTableRecord *  |  pRec,
|  int  |  familyType,
|  const ACHAR *  |  title = NULL,
|  int  |  tabCtrlFlags = 0
)
Warning
Not implemented!
 void acedEditToleranceInteractive  |  ( |  AcDbFcf *  |  pTol | )
Warning
Not implemented!
 ACCORE_PORT TaskId acedExecuteOnMainThread  |  ( |  const AcedRunLoopFn  |  pfn,
|  void *  |  pContext,
|  bool  |  bWaitUntilDone = false
)
Warning
Not implemented!
 ACCORE_PORT TaskId acedExecuteOnMainThread  |  ( |  IAcEdRunLoopTask *  |  pTask,
|  bool  |  bWaitUntilDone = false
)
Warning
Not implemented!
 int acedFindTrustedFile  |  ( |  const ACHAR *  |  fname,
|  ACHAR *  |  result,
|  size_t  |  nBufLen
)
Warning
Not implemented!
 int acedFNSplit  |  ( |  const ACHAR *  |  pathToSplit,
|  ACHAR *  |  prebuf,
|  size_t  |  nPreBufLen,
|  ACHAR *  |  namebuf,
|  size_t  |  nNameBufLen,
|  ACHAR *  |  extbuf,
|  size_t  |  nExtBufLen
)
Warning
Not implemented!
 HINSTANCE acedGetAcadBrandingResourceInstance  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT HINSTANCE acedGetAcadResourceInstance  |  ( |   | )
Warning
Not implemented!
 Adesk::UInt32 acedGetAnimationFrameId  |  ( |  void  |   | )
Warning
Not implemented!
 AdApplicationFrame* acedGetApplicationFrame  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT HBITMAP acedGetBitmapForCommand  |  ( |  const wchar_t *  |  cmdName,
|  const COLORREF &  |  backgroundColor
)
Warning
Not implemented!
 ACCORE_PORT HBITMAP acedGetCachedBitmapForCommand  |  ( |  const wchar_t *  |  cmdName,
|  const COLORREF &  |  backgroundColor
)
Warning
Not implemented!
 const wchar_t* acedGetCMBaseAlias  |  ( |  AcadContextMenuMode  |  mode | )
Warning
Not implemented!
 ACAD_PORT Acad::ErrorStatus acedGetCommandForDocument  |  ( |  const AcApDocument *  |  pDoc,
|  ACHAR *&  |  pGlobalCmdName
)
Warning
Not implemented!
 Adesk::UInt8 acedGetCommandVersion  |  ( |   | )
Warning
Not implemented!
 struct flagmat* acedGetComplexLineTypeTransformPtr  |  ( |   | )
Warning
Not implemented!
 ACCORE_PORT bool acedGetCurrentColorsEx  |  ( |  AcColorSettings *  |  pColorSettings,
|  AcColorSettingsEx *  |  pColorSettingsEx
)
Warning
Not implemented!
 ACCORE_PORT bool acedGetCurrentColorsEx2  |  ( |  AcColorSettings *  |  pColorSettings,
|  AcColorSettingsEx *  |  pColorSettingsEx,
|  AcColorSettingsEx2 *  |  pColorSettingsEx2
)
Warning
Not implemented!
 ACCORE_PORT bool acedGetCurrentColorsEx3  |  ( |  AcColorSettings *  |  pColorSettings,
|  AcColorSettingsEx *  |  pColorSettingsEx,
|  AcColorSettingsEx2 *  |  pColorSettingsEx2,
|  AcColorSettingsEx3 *  |  pColorSettingsEx3
)
Warning
Not implemented!
 short acedGetCurVportCircleSides  |  ( |   | )
Warning
Not implemented!
 void acedGetCurVportPixelToDisplay  |  ( |  double &  |  xFactor,
|  double &  |  yFactor
)
Warning
Not implemented!
 void acedGetCurVportScreenToDisplay  |  ( |  double &  |  xFactor,
|  double &  |  yFactor
)
Warning
Not implemented!
 ACCORE_PORT float acedGetDpiScalingValue  |  ( |   | )
Warning
Not implemented!
 int acedGetDrawComplexShape  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus acedGetFullSubentPathsForCurrentSelection  |  ( |  const AcDbObjectId &  |  selectedObject,
|  AcDbFullSubentPathArray &  |  selectedSubentities
)
Warning
Not implemented!
 BOOL acedGetIUnknownForCurrentCommand  |  ( |  LPUNKNOWN &  |  pUnk | )
Warning
Not implemented!
 HMENU acedGetMenu  |  ( |  const wchar_t *  |  pszAlias | )
Warning
Not implemented!
 int acedGetRecursingLinetypeVectorGeneration  |  ( |   | )
Warning
Not implemented!
 ACAD_PORT void acedGetSupplementalCursorOffset  |  ( |  int &  |  x,
|  int &  |  y
)
Warning
Not implemented!
 ACCORE_PORT bool acedGetSystemColorsEx  |  ( |  AcColorSettings *  |  pColorSettings,
|  AcColorSettingsEx *  |  pColorSettingsEx
)
Warning
Not implemented!
 ACCORE_PORT bool acedGetSystemColorsEx2  |  ( |  AcColorSettings *  |  pColorSettings,
|  AcColorSettingsEx *  |  pColorSettingsEx,
|  AcColorSettingsEx2 *  |  pColorSettingsEx2
)
Warning
Not implemented!
 ACCORE_PORT bool acedGetSystemColorsEx3  |  ( |  AcColorSettings *  |  pColorSettings,
|  AcColorSettingsEx *  |  pColorSettingsEx,
|  AcColorSettingsEx2 *  |  pColorSettingsEx2,
|  AcColorSettingsEx3 *  |  pColorSettingsEx3
)
Warning
Not implemented!
 ACCORE_PORT bool acedGetToolTipInfoForCommand  |  ( |  const ACHAR *  |  cmdName,
|  AcCommandToolTipInfo *  |  pInfo
)
Warning
Not implemented!
 bool acedGetUnitsConversion  |  ( |  AcDb::UnitsValue  |  blkInsunits,
|  double &  |  conversionFactor
)
Warning
Not implemented!
 ACAD_PORT Adesk::Boolean acedGetUserFavoritesDir  |  ( |  ACHAR *  |  szFavoritesDir | )
Warning
Not implemented!
 ACAD_PORT bool acedHasSupplementalCursorImage  |  ( |   | )
Warning
Not implemented!
 int acedHelpForExternal  |  ( |  const ACHAR *  |  pszFunctionName | )
Warning
Not implemented!
 ACAD_PORT bool acedHideConstraintBar  |  ( |  AcDbFullSubentPathArray &  |  subentPaths | )
Warning
Not implemented!
 Adesk::UInt8 acedInitCommandVersion  |  ( |  Adesk::UInt8  |  nVersion = 0 | )
Warning
Not implemented!
 bool acedIsInBackgroundMode  |  ( |   | )
Warning
Not implemented!
 bool acedIsOsnapOverride  |  ( |   | )
Warning
Not implemented!
 void acedLoadJSScript  |  ( |  const ACHAR *  |  pUriOfJSFile | )
Warning
Not implemented!
 Acad::ErrorStatus acedManageHatchEditorReactor  |  ( |  AcDbObjectId  |  hatchId,
|  AcHatchEdReact  |  action,
|  AcDbObjectId  |  boundaryId = AcDbObjectId::kNull,
|  AcHatchNotifier  |  notifyType = kNobody,
|  bool  |  transformed = false
)
Warning
Not implemented!
 void acedMarkForDelayXRefRelativePathResolve  |  ( |  const AcDbObjectId &  |  xrefDefId | )
Warning
Not implemented!
 int acedNumberOfViewports  |  ( |   | )
Warning
Not implemented!
 void acedOpenDocWindowsMinimized  |  ( |  bool  |  bMinimized | )
Warning
Not implemented!
 ACAD_PORT bool acedPendingCmdCTokens  |  ( |   | )
Warning
Not implemented!
 ACAD_PORT bool acedPendingFiberlessDocSwitch  |  ( |  AcApDocument **  |  pNextActiveDocument = NULL | )
Warning
Not implemented!
 ACCORE_PORT bool acedRegisterCommandBitmapQuery  |  ( |  const AcedCommandBitmapQueryFn  |  pfn | )
Warning
Not implemented!
 BOOL acedRegisterMainFramePreTranslateObserver  |  ( |  const AcedPreTranslateMsgFn  |  pfn | )
Warning
Not implemented!
 ACAD_PORT void acedRegisterNavDialogCallbackFunction  |  ( |  FileDiaCallbackFuncPtr  |  funcPtr | )
Warning
Not implemented!
 void acedReloadMenus  |  ( |  bool  |  bIncrementalReloading | )
Warning
Not implemented!
 ACCORE_PORT bool acedRemoveCommandBitmapQuery  |  ( |  const AcedCommandBitmapQueryFn  |  pfn | )
Warning
Not implemented!
 BOOL acedRemoveMainFramePreTranslateObserver  |  ( |  const AcedPreTranslateMsgFn  |  pfn | )
Warning
Not implemented!
 ACCORE_PORT void acedRemoveRunLoopTask  |  ( |  TaskId  |  taskId | )
Warning
Not implemented!
 ACCORE_PORT bool acedRemoveSupplementalCursorImage  |  ( |  const AcGiImageBGRA32 *  |  pSuppCursorImage | )
Warning
Not implemented!
 ACAD_PORT Adesk::Boolean acedResolveInternetShortcut  |  ( |  const ACHAR *  |  szLinkFile,
|  ACHAR *  |  szUrl
)
Warning
Not implemented!
 ACAD_PORT Adesk::Boolean acedResolveShortcut  |  ( |  void *  |  pvHwndParent,
|  const ACHAR *  |  szLinkPath,
|  ACHAR *  |  szObjectPath
)
Warning
Not implemented!
 Acad::ErrorStatus acedRestoreCurrentView  |  ( |  const AcDbObjectId &  |  namedViewId | )
Warning
Not implemented!
 ACAD_PORT bool acedResumingInvocation  |  ( |   | )
Warning
Not implemented!
 ACAD_PORT bool acedScaleImageWithGDIPlus  |  ( |  const AcGiImageBGRA32 *  |  pSrcImg,
|  const AcGiImageBGRA32 *  |  pDstImg
)
Warning
Not implemented!
 Acad::ErrorStatus acedSelectTransients  |  ( |  const AcGsDCRect &  |  rect,
|  int  |  viewportNumber,
|  AcArray< AcEdSelectedTransient > &  |  result
)
Warning
Not implemented!
 bool acedSetCMBaseAlias  |  ( |  const wchar_t *  |  strAlias,
|  AcadContextMenuMode  |  mode
)
Warning
Not implemented!
 ACAD_PORT Adesk::Boolean acedSetColorDialogTrueColorWithCallback  |  ( |  AcCmColor &  |  color,
|  Adesk::Boolean  |  bAllowMetaColor,
|  const AcCmColor &  |  curLayerColor,
|  AcCm::DialogTabs  |  tabs = (AcCm::DialogTabs)(AcCm::kACITab|AcCm::kTrueColorTab|AcCm::kColorBookTab),
|  AcEdColorDialogCallbackFunction  |  callback = NULL,
|  void *  |  pCallbackData = NULL
)
Warning
Not implemented!
 ACCORE_PORT bool acedSetCurrentColorsEx  |  ( |  AcColorSettings *  |  pColorSettings,
|  AcColorSettingsEx *  |  pColorSettingsEx
)
Warning
Not implemented!
 ACCORE_PORT bool acedSetCurrentColorsEx2  |  ( |  AcColorSettings *  |  pColorSettings,
|  AcColorSettingsEx *  |  pColorSettingsEx,
|  AcColorSettingsEx2 *  |  pColorSettingsEx2
)
Warning
Not implemented!
 ACCORE_PORT bool acedSetCurrentColorsEx3  |  ( |  AcColorSettings *  |  pColorSettings,
|  AcColorSettingsEx *  |  pColorSettingsEx,
|  AcColorSettingsEx2 *  |  pColorSettingsEx2,
|  AcColorSettingsEx3 *  |  pColorSettingsEx3
)
Warning
Not implemented!
 Acad::ErrorStatus acedSetCurVportCircleSides  |  ( |  short  |  value | )
Warning
Not implemented!
 void acedSetDrawComplexShape  |  ( |  int  |  val | )
Warning
Not implemented!
 BOOL acedSetIUnknownForCurrentCommand  |  ( |  const LPUNKNOWN  |   | )
Warning
Not implemented!
 void acedSetRecursingLinetypeVectorGeneration  |  ( |  int  |  val | )
Warning
Not implemented!
 Acad::ErrorStatus ACDB_PORT acedSetXrefResolvedWithUpdateStatus  |  ( |  AcDbBlockTableRecord *  |  pBTR | )
Warning
Not implemented!
 ACAD_PORT bool acedShowConstraintBar  |  ( |  AcDbFullSubentPathArray &  |  subentPaths | )
Warning
Not implemented!
 ACAD_PORT bool acedShowConstraintBarForAll  |  ( |  bool  |  bToShow | )
Warning
Not implemented!
 BOOL acedShowDrawingStatusBars  |  ( |  BOOL  |  bShow = TRUE | )
Warning
Not implemented!
 bool acedShowHTMLModalWindow  |  ( |  HWND  |  owner,
|  const ACHAR *  |  uriOfHtmlPage,
|  bool  |  persistSizeAndPosition = true
)
Warning
Not implemented!
 bool acedShowHTMLModalWindow  |  ( |  HWND  |  owner,
|  const ACHAR *  |  uriOfHtmlPage,
|  HtmlWindowOptions  |  opts
)
Warning
Not implemented!
 HWND acedShowHTMLModelessWindow  |  ( |  HWND  |  owner,
|  const ACHAR *  |  uriOfHtmlPage,
|  bool  |  persistSizeAndPosition = true
)
Warning
Not implemented!
 Acad::ErrorStatus acedSkipXrefNotification  |  ( |  AcDbDatabase *  |  pHostDb,
|  const ACHAR *  |  xrefName
)
Warning
Not implemented!
 ACCORE_PORT int acedSSGet  |  ( |  const ACHAR *  |  str,
|  const void *  |  pt1,
|  const void *  |  pt2,
|  const struct resbuf *  |  filter,
|  ads_name  |  ss,
|  AcSelectionPreview *  |  pSelectionPreview
)
Warning
Not implemented!
 int acedSSSetSubentTypes  |  ( |  const AcArray< AcDb::SubentType > &  |  types | )
Warning
Not implemented!
 void acedSuppressFileMRU  |  ( |  bool  |  bSuppress | )
Warning
Not implemented!
 int acedTablet  |  ( |  const struct resbuf *  |  args,
|  struct resbuf **  |  result
)
Warning
Not implemented!
 int acedTextPage  |  ( |  void  |   | )
Warning
Not implemented!
 void acedUnmarkForDelayXRefRelativePathResolve  |  ( |  const AcDbObjectId &  |  xrefDefId | )
Warning
Not implemented!
 ACAD_PORT void acedUnregisterNavDialogCallbackFunction  |  ( |  FileDiaCallbackFuncPtr  |  funcPtr | )
Warning
Not implemented!
 int acedUpdate  |  ( |  int  |  vport,
|  ads_point  |  p1,
|  ads_point  |  p2
)
Warning
Not implemented!
 Acad::ErrorStatus acedUpgradeDocOpen  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus acedVPLayer  |  ( |  const AcDbObjectId &  |  vpId,
|  const AcDbObjectIdArray &  |  layerIds,
|  AcDb::VpFreezeOps  |  operation
)
Warning
Not implemented!
 Acad::ErrorStatus acedXrefNotifyCheckFileChanged  |  ( |  AcDbObjectId  |  btrId,
|  bool &  |  hasChanged
)
Warning
Not implemented!
 ACFD_PORT bool AcFdExtractData  |  ( |  AcDbField *  |  pField,
|  AcString &  |  sSheetSetFile,
|  AcString &  |  sSheetSetId,
|  AcString &  |  sCompName,
|  AcString &  |  sCompId,
|  AcString &  |  sPropName
)
Warning
Not implemented!
 ACFD_PORT bool AcFdExtractData  |  ( |  AcDbField *  |  pField,
|  AcDbObjectId &  |  objId,
|  AcString &  |  sPropName
)
Warning
Not implemented!
 ACFD_PORT bool AcFdMakeFieldCode  |  ( |  const AcDbObjectId &  |  objId,
|  AcDbEvalNodeId  |  blockParamId,
|  const ACHAR *  |  pszPropOrConnectionName,
|  AcFdEval::ObjectFieldOption  |  nOption,
|  const ACHAR *  |  pszFormat,
|  AcHyperlink *  |  pHyperlink,
|  AcString &  |  pszFieldCode
)
Warning
Not implemented!
 ACFD_PORT bool AcFdMakeFieldCode  |  ( |  IAcSmDatabase *  |  pSmDb,
|  IAcSmSheetSet *  |  pSmSheetSet,
|  IAcSmComponent *  |  pSmComp,
|  const ACHAR *  |  pszCompName,
|  const ACHAR *  |  pszPropName,
|  AcFdEval::SheetSetFieldOption  |  nOption,
|  const ACHAR *  |  pszFormat,
|  AcString &  |  pszFieldCode
)
Warning
Not implemented!
 ACFD_PORT bool AcFdMakeFieldCode  |  ( |  const AcDbObjectId &  |  tableId,
|  const AcDbObjectId &  |  targetTableId,
|  AcFdEval::ExpressionFieldOption  |  nOption,
|  const AcCellRangeArray &  |  cellRanges,
|  const ACHAR *  |  pszFormat,
|  AcHyperlink *  |  pHyperlink,
|  AcString &  |  sFieldCode
)
Warning
Not implemented!
 Acad::ErrorStatus acgiGetRegenBlockRefStack  |  ( |  AcDbObjectIdArray &  |  blkRefs | )
Warning
Not implemented!
 void AcGlobAddDMMReactor  |  ( |  AcDMMReactor *  |  pReactor | )
Warning
Not implemented!
 void AcGlobAddPublishReactor  |  ( |  AcPublishReactor *  |  pReactor | )
Warning
Not implemented!
 void AcGlobRemoveDMMReactor  |  ( |  AcDMMReactor *  |  pReactor | )
Warning
Not implemented!
 void AcGlobRemovePublishReactor  |  ( |  AcPublishReactor *  |  pReactor | )
Warning
Not implemented!
 AcGs2DViewLimitManager* acgsCreate2DViewLimitManager  |  ( |  int  |  viewportNumber | )
Warning
Not implemented!
 Adesk::Boolean acgsDisplayImage  |  ( |  int  |  viewportNumber,
|  Adesk::Int32  |  originLeft,
|  Adesk::Int32  |  originTop,
|  int  |  imageWidth,
|  int  |  imageHeight,
|  void const *  |  imageData,
|  int  |  hasTransparency
)
Warning
Not implemented!
 ACCORE_PORT Adesk::Boolean acgsDrawableCached  |  ( |  AcGiDrawable *  |  pDrawable | )
Warning
Not implemented!
 Adesk::Boolean acgsDrawableErased  |  ( |  AcGiDrawable *  |  pDrawable,
|  AcGiDrawable *  |  pParentDrawable
)
Warning
Not implemented!
 Adesk::Boolean acgsDrawableModified  |  ( |  AcGiDrawable *  |  pDrawable,
|  AcGiDrawable *  |  pParentDrawable
)
Warning
Not implemented!
 ACCORE_PORT AcGsManager* acgsGetCurrentGsManager  |  ( |   | )
Warning
Not implemented!
 Adesk::Boolean acgsGetDisplayInfo  |  ( |  int &  |  drawingWidth,
|  int &  |  drawingHeight,
|  int &  |  aspectWidth,
|  int &  |  aspectHeight
)
Warning
Not implemented!
 ACCORE_PORT AcGsModel* acgsGetGsHighlightModel  |  ( |  const AcDbDatabase *  |  pDb | )
Warning
Not implemented!
 AcGsModel* acgsGetGsModel  |  ( |  AcGiTransientDrawingMode  |  mode,
|  int  |  subDrawingMode,
|  int  |  viewportNumber
)
Warning
Not implemented!
 ACCORE_PORT AcGsModel* acgsGetGsModel  |  ( |  const AcDbDatabase *  |  pDb | )
Warning
Not implemented!
 ACCORE_PORT AcGiHighlightStyle acgsGetHighlightStyle  |  ( |  void  |   | )
Warning
Not implemented!
 Adesk::Boolean acgsGetOrthoViewParameters  |  ( |  int  |  viewportNumber,
|  AcDb::OrthographicView  |  view,
|  AcGeVector3d *  |  pViewDir,
|  AcGeVector3d *  |  pUpVector
)
Warning
Not implemented!
 ACCORE_PORT AcGsView* acgsObtainAcGsView  |  ( |  int  |  vpNum,
|  const class AcGsKernelDescriptor &
)
Warning
Not implemented!
 ACCORE_PORT void acgsRedrawShortTermGraphics  |  ( |  int  |  minx,
|  int  |  miny,
|  int  |  maxx,
|  int  |  maxy
)
Warning
Not implemented!
 ACCORE_PORT void acgsSetGsHighlightModel  |  ( |  const AcDbDatabase *  |  pDb,
|  AcGsModel *  |  pModel
)
Warning
Not implemented!
 ACCORE_PORT void acgsSetGsModel  |  ( |  const AcDbDatabase *  |  pDb,
|  AcGsModel *  |  pModel
)
Warning
Not implemented!
 ACCORE_PORT void acgsSetHighlightStyle  |  ( |  AcGiHighlightStyle  |  style | )
Warning
Not implemented!
 Adesk::Boolean acgsSetView2D  |  ( |  int  |  viewportNumber | )
Warning
Not implemented!
 void acgsSetViewportRenderFlag  |  ( |  int  |  viewportNumber | )
Warning
Not implemented!
 ACJSCORESTUB_PORT Acad::ErrorStatus acjsDefun  |  ( |  const TCHAR *  |  name,
|  AcJsFunctionPtr  |  funcAddr,
|  Adesk::Int32  |  funcFlags = 0
)
Warning
Not implemented!
 ACJSCORESTUB_PORT Acad::ErrorStatus acjsInvokeAsync  |  ( |  const TCHAR *  |  name,
|  const TCHAR *  |  jsonArgs
)
Warning
Not implemented!
 ACJSCORESTUB_PORT Acad::ErrorStatus acjsInvokeAsyncA  |  ( |  const char *  |  name,
|  const char *  |  jsonArgs
)
Warning
Not implemented!
 ACPL_PORT AcPlHostAppServices* AcPlGetHostAppServices  |  ( |   | )
Warning
Not implemented!
 ACPL_PORT Acad::ErrorStatus AcPlSetHostAppServices  |  ( |  AcPlHostAppServices *  |  pHostServices | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool acrxLoadAutoloadApps  |  ( |  const ACHAR *  |  appname | )
Warning
Not implemented!
 const ACHAR* acrxObjectDBXRegistryKey  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT AcLocale acrxProductLocale  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT bool acrxUnloadAutoloadApps  |  ( |  const ACHAR *  |  appname | )
Warning
Not implemented!
 ACBASE_PORT void* acStackHeapAlloc  |  ( |  size_t  |  size,
|  const void *  |  pParent
)
Warning
Not implemented!
 ACBASE_PORT void acStackHeapFree  |  ( |  void *  |  p | )
Warning
Not implemented!
 ACBASE_PORT void* acStackHeapRealloc  |  ( |  void *  |  p,
|  size_t  |  size
)
Warning
Not implemented!
 ACTC_PORT BOOL AcTcSetHostInfo  |  ( |  long  |  lCurrentMajorVersion,
|  long  |  lCurrentMinorVersion,
|  bool  |  bBldEnv
)
Warning
Not implemented!
 ACUI_PORT HINSTANCE AcUiAppBrandingResourceInstance  |  ( |   | )
Warning
Not implemented!
 ACPAL_PORT void acutAssertMessage  |  ( |  const ACHAR *  |  condition,
|  const ACHAR *  |  filename,
|  int  |  lineNumber,
|  const ACHAR *  |  status
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acutCopyStringToBuffer  |  ( |  const ACHAR *  |  pInput,
|  ACHAR *  |  pOutput,
|  size_t  |  nOutputSize
)
Warning
Not implemented!
 int acutIsGraph  |  ( |  int  |  c | )
Warning
Not implemented!
 int acutIsXDigit  |  ( |  int  |  c | )
Warning
Not implemented!
 Acad::ErrorStatus acutNewString  |  ( |  const ACHAR *  |  pInput,
|  ACHAR *&  |  pOutput
)
Warning
Not implemented!
 void acutTrimWhiteSpace  |  ( |  ACHAR *  |  pStr | )
Warning
Not implemented!
 size_t acutXStrLength  |  ( |  const ACHAR *  |  str | )
Warning
Not implemented!
 Acad::ErrorStatus addSSgetFilterInputContextReactor  |  ( |  AcApDocument *  |  pDoc,
|  AcEdSSGetFilter4 *  |  pFilter
)
Warning
Not implemented!
 int ADUI_PORT AdUiAlertDialog  |  ( |  LPCTSTR  |  captionText,
|  LPCTSTR  |  msg0Text,
|  LPCTSTR  |  button0Text,
|  LPCTSTR  |  button1Text,
|  UINT  |  defButton = 0
)
Warning
Not implemented!
 void ADUI_PORT AdUiEnableDockControlBars  |  ( |  BOOL  |  bEnable,
|  CStringArray *  |  pToolIds = NULL
)
Warning
Not implemented!
 HWND ADUI_PORT AdUiGetSafeParentHwnd  |  ( |   | )
Warning
Not implemented!
 ADUI_PORT CWnd* AdUiGetSafeParentWnd  |  ( |   | )
Warning
Not implemented!
 bool ADUI_PORT AdUiRegisterDockingTool  |  ( |  LPCTSTR  |  lpszToolName,
|  LPCTSTR  |  lpszCommand,
|  UINT  |  nToolbarID
)
Warning
Not implemented!
 bool ADUI_PORT AdUiRegisterTool  |  ( |  LPCTSTR  |  lpszToolName,
|  LPCTSTR  |  lpszCommand,
|  CLSID *  |  pID
)
Warning
Not implemented!
 void ADUI_PORT AdUiSaveDockingToolPositions  |  ( |   | )
Warning
Not implemented!
 void ADUI_PORT AdUiShowDockControlBars  |  ( |  bool  |  bShow | )
Warning
Not implemented!
 bool ADUI_PORT CanStealFocusFromDockedWindow  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus checkTopLevelNetworkIntegrity  |  ( |  const AcDbDatabase *  |   | )
Warning
Not implemented!
 ACCORE_PORT CAcGradientThumbnailEngine* createGradientThumbnailEngine  |  ( |   | )
Warning
Not implemented!
 virtual int dimarcsym  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual int dimfrac  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual double dimfxlen  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool dimfxlenOn  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual double dimjogang  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcDbObjectId dimltex1  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcDbObjectId dimltex2  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcDbObjectId dimltype  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual int dimlunit  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual int dimtfill  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcCmColor dimtfillclr  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual int dimtmove  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 ACDBCORE2D_PORT AcString& dummyString  |  ( |   | )
Warning
Not implemented!
 bool duplicateSelectionsAllowed  |  ( |  AcApDocument *  |  pDoc | )
Warning
Not implemented!
 Acad::ErrorStatus SCENEDLLIMPEXP getBackgroundDictionary  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode,
|  bool  |  createIfNonExist
)
Warning
Not implemented!
 Acad::ErrorStatus SCENEDLLIMPEXP getBackgroundDictionary  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode
)
Warning
Not implemented!
 AcDbGlobals* getDefaultGlobals  |  ( |   | )
Warning
Not implemented!
 AcString GetDriveForRoottypePath  |  ( |  const CAdUiVolumeDescriptor *  |  const | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus getTableStyleNameFromDbById  |  ( |  const AcDbObjectId &  |  objId,
|  AcString &  |  sName
)
Warning
Not implemented!
 Acad::ErrorStatus getTableStyleNameFromDbById  |  ( |  const AcDbObjectId &  |  objId,
|  ACHAR *&  |  pName
)
inline
Warning
Not implemented!
 ACDBCORE2D_PORT bool isMSpaceActive  |  ( |  AcDbDatabase *  |  pDb | )
Warning
Not implemented!
 bool IsValidOnColon  |  ( |  const AcString *  |  work | )
Warning
Not implemented!
 int AcDbIndexFilterManager::numIndexes  |  ( |  const AcDbBlockTableRecord *  |  pBtr | )
Warning
Not implemented!
 Acad::ErrorStatus removeSSgetFilterInputContextReactor  |  ( |  AcApDocument *  |  pDoc,
|  AcEdSSGetFilter4 *  |  pFilter
)
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus revertAcDbObjectFromWrite  |  ( |  AcDbObject *  |  pObj,
|  Acad::ErrorStatus  |  accessStatus,
|  bool  |  bWasNotifyEnabled,
|  bool  |  bWasWriteEnabled,
|  int  |  readCountClosed
)
Warning
Not implemented!
 Acad::ErrorStatus setAllowDuplicateSelection  |  ( |  AcApDocument *  |  pDoc,
|  unsigned char  |  flag
)
Warning
Not implemented!
 virtual Acad::ErrorStatus setDimarcsym  |  ( |  int  |  v | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus setDimfxlen  |  ( |  double  |  v | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus setDimfxlenOn  |  ( |  bool  |  v | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus setDimjogang  |  ( |  double  |  v | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus setDimltex1  |  ( |  AcDbObjectId  |  v | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus setDimltex2  |  ( |  AcDbObjectId  |  v | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus setDimltype  |  ( |  AcDbObjectId  |  v | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus setDimtfill  |  ( |  int  |  v | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus setDimtfillclr  |  ( |  const AcCmColor &  |  v | )
virtual
Warning
Not implemented!
 ACDBCORE2D_PORT void stringDefaultArgumentTest  |  ( |  AcString &  |  str = dummyString() | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbIndexFilterManager::updateIndexes  |  ( |  AcDbDatabase *  |  pDb | )
Warning
Not implemented!
 bool WasAbsoluteHelper  |  ( |  path_category  |  pc | )
Warning
Not implemented!