Classes | Macros | Typedefs | Enumerations | Functions | Variables
AcDb Classes
 Classes
class  | Ac3PointAngleConstraint
class  | AcAngleConstraint
class  | AcAutoConstrainEvaluationCallback
class  | AcCenterPointConstraint
class  | AcColinearConstraint
class  | AcCompositeConstraint
class  | AcConcentricConstraint
class  | AcConstrained2PointsConstructionLine
class  | AcConstrainedArc
class  | AcConstrainedBoundedEllipse
class  | AcConstrainedBoundedLine
class  | AcConstrainedCircle
class  | AcConstrainedConstructionLine
class  | AcConstrainedCurve
class  | AcConstrainedDatumLine
class  | AcConstrainedEllipse
class  | AcConstrainedGeometry
struct  | AcConstrainedGeometryDraggingInfo
class  | AcConstrainedImplicitPoint
class  | AcConstrainedLine
class  | AcConstrainedPoint
class  | AcConstrainedRigidSet
class  | AcConstrainedSpline
class  | AcConstraintGroupNode
class  | AcDb2dPolyline
class  | AcDb2dVertex
class  | AcDb2LineAngularDimension
class  | AcDb3dPolyline
class  | AcDb3dPolylineVertex
class  | AcDb3dProfile
class  | AcDb3dSolid
class  | AcDb3PointAngularDimension
class  | AcDbAbstractViewTable
class  | AcDbAbstractViewTableIterator
class  | AcDbAbstractViewTableRecord
class  | AcDbActionsToEvaluateCallback
class  | AcDbAlignedDimension
class  | AcDbAlignment
class  | AcDbAnnoAlertDisabler
class  | AcDbAnnotationScale
class  | AcDbAnnotationScaleReactor
class  | AcDbAnnotativeObjectPE
class  | AcDbAppEntityGrips
class  | AcDbAppSystemVariables
class  | AcDbArc
class  | AcDbArcDimension
class  | AcDbArrayGripAppData
class  | AcDbAssoc2dConstraintCallback
class  | AcDbAssoc2dConstraintGroup
class  | AcDbAssocAction
class  | AcDbAssocActionBody
class  | AcDbAssocActionParam
class  | AcDbAssocArrayActionBody
class  | AcDbAssocArrayCommonParameters
class  | AcDbAssocArrayItem
class  | AcDbAssocArrayModifyActionBody
class  | AcDbAssocArrayParameters
class  | AcDbAssocArrayPathParameters
class  | AcDbAssocArrayPolarParameters
class  | AcDbAssocArrayRectangularParameters
class  | AcDbAssocAsmBodyActionParam
class  | AcDbAssocBlendSurfaceActionBody
class  | AcDbAssocCompoundActionParam
class  | AcDbAssocDependency
class  | AcDbAssocDependencyBody
class  | AcDbAssocDependencyNotificationDisabler
class  | AcDbAssocDependencyPE
class  | AcDbAssocDimDependencyBody
class  | AcDbAssocDimDependencyBodyBase
class  | AcDbAssocEdgeActionParam
class  | AcDbAssocEdgeChamferActionBody
class  | AcDbAssocEdgeFilletActionBody
class  | AcDbAssocEdgePersSubentId
class  | AcDbAssocEvaluationCallback
class  | AcDbAssocExtendSurfaceActionBody
class  | AcDbAssocExternalIndexPersSubentId
class  | AcDbAssocExtrudedSurfaceActionBody
class  | AcDbAssocFaceActionParam
class  | AcDbAssocFilletSurfaceActionBody
class  | AcDbAssocGeomDependency
class  | AcDbAssocIndexPersSubentId
class  | AcDbAssocLoftedSurfaceActionBody
class  | AcDbAssocManager
class  | AcDbAssocNetwork
class  | AcDbAssocNetworkEvaluationDisabler
class  | AcDbAssocNetworkIterator
class  | AcDbAssocNetworkSurfaceActionBody
class  | AcDbAssocObjectActionParam
class  | AcDbAssocObjectAndIndexPersSubentId
class  | AcDbAssocObjectPointer< ACDB_CLASS >
class  | AcDbAssocOffsetSurfaceActionBody
class  | AcDbAssocParamBasedActionBody
class  | AcDbAssocPatchSurfaceActionBody
class  | AcDbAssocPathActionParam
class  | AcDbAssocPathBasedSurfaceActionBody
class  | AcDbAssocPersSubentId
class  | AcDbAssocPersSubentIdPE
class  | AcDbAssocPlaneSurfaceActionBody
class  | AcDbAssocRevolvedSurfaceActionBody
class  | AcDbAssocSimplePersSubentId
class  | AcDbAssocSingleEdgePersSubentId
class  | AcDbAssocSurfaceActionBody
class  | AcDbAssocSweptSurfaceActionBody
struct  | AcDbAssocTransInfo
class  | AcDbAssocTrimSurfaceActionBody
class  | AcDbAssocValueDependency
class  | AcDbAssocValueProviderPE
class  | AcDbAssocVariable
class  | AcDbAssocVariableCallback
class  | AcDbAssocVertexActionParam
class  | AcDbAttribute
class  | AcDbAttributeDefinition
class  | AcDbAuditInfo
class  | AcDbAuditRecreatePE
class  | AcDbBackground
class  | AcDbBlendOptions
class  | AcDbBlockBegin
class  | AcDbBlockChangeIterator
class  | AcDbBlockEnd
class  | AcDbBlockInsertionPoints
class  | AcDbBlockReference
class  | AcDbBlockReferenceIdIterator
class  | AcDbBlockTable
class  | AcDbBlockTableIterator
class  | AcDbBlockTableRecord
class  | AcDbBlockTableRecordIterator
class  | AcDbBody
class  | AcDbBreakData
class  | AcDbBreakPointRef
class  | AcDbCamera
class  | AcDbCircle
class  | AcDbClassIterator
class  | AcDbColor
class  | AcDbCompositeFilteredBlockIterator
class  | AcDbCompoundObjectId
class  | AcDbCoordSystemRef
class  | AcDbCurve
class  | AcDbCurvePath
class  | AcDbCustomOsnapInfo
class  | AcDbCustomOsnapManager
class  | AcDbCustomOsnapMode
class  | AcDbCustomOsnapMode2
class  | AcDbDatabase
class  | AcDbDatabaseReactor
class  | AcDbDatabaseSummaryInfo
class  | AcDbDataCell
class  | AcDbDataColumn
class  | AcDbDataLink
class  | AcDbDataLinkManager
class  | AcDbDataTable
class  | AcDbDate
class  | AcDbDeepCloneFiler
class  | AcDbDetailSymbol
class  | AcDbDetailViewStyle
class  | AcDbDgnDefinition
class  | AcDbDgnReference
class  | AcDbDgnRefFileRepath
class  | AcDbDgnUnderlayItem
class  | AcDbDiametricDimension
class  | AcDbDictionary
class  | AcDbDictionaryIterator
class  | AcDbDictionaryWithDefault
class  | AcDbDimAssoc
class  | AcDbDimData
class  | AcDbDimension
class  | AcDbDimensionStyleOverrule
class  | AcDbDimStyleTable
class  | AcDbDimStyleTableIterator
class  | AcDbDimStyleTableRecord
class  | AcDbDisableAnnoAutoScale
class  | AcDbDwfDefinition
class  | AcDbDwfReference
class  | AcDbDwgFiler
class  | AcDbDxfFiler
class  | AcDbDynamicUCSPE
class  | AcDbDynBlockReference
class  | AcDbDynBlockReferenceProperty
class  | AcDbDynBlockTableRecord
class  | AcDbEdgeRef
class  | AcDbEllipse
class  | AcDbEmbeddedASMEntPropsPE
class  | AcDbEntity
class  | AcDbEntityHyperlinkPE
class  | AcDbEntityReactor
class  | AcDbEvalConnectable
class  | AcDbEvalContext
class  | AcDbEvalContextIterator
class  | AcDbEvalContextPair
class  | AcDbEvalEdgeInfo
class  | AcDbEvalExpr
class  | AcDbEvalGraph
class  | AcDbEvalIdMap
class  | AcDbEvalVariant
class  | AcDbExtents
class  | AcDbExtents2d
class  | AcDbExtrudedSurface
class  | AcDbFace
class  | AcDbFaceRecord
class  | AcDbFaceRef
class  | AcDbFcf
class  | AcDbField
class  | AcDbFilter
class  | AcDbFilteredBlockIterator
class  | AcDbFormattedTableData
class  | AcDbFrame
class  | AcDbFullSubentPath
class  | AcDbGeoCoordinateSystem
class  | AcDbGeoCoordinateSystemCategory
class  | AcDbGeoCoordinateSystemTransformer
class  | AcDbGeoData
class  | AcDbGeoDataReactor
class  | AcDbGeoMap
class  | AcDbGeometryOverrule
class  | AcDbGeomRef
class  | AcDbGeoPositionMarker
class  | AcDbGradientBackground
class  | AcDbGraph
class  | AcDbGraphNode
class  | AcDbGraphStack
class  | AcDbGripData
class  | AcDbGripOverrule
class  | AcDbGroundPlaneBackground
class  | AcDbGroup
class  | AcDbGroupIterator
class  | AcDbHandle
class  | AcDbHardOwnershipId
class  | AcDbHardPointerId
class  | AcDbHatch
class  | AcDbHelix
class  | AcDbHighlightOverrule
class  | AcDbHighlightStateOverrule
class  | AcDbHomeView
class  | AcDbHostApplicationProgressMeter
class  | AcDbHostApplicationServices
class  | AcDbHyperlink
class  | AcDbHyperlinkCollection
class  | AcDbIBLBackground
class  | AcDbIdMapping
class  | AcDbIdMappingIter
class  | AcDbIdPair
class  | AcDbImage
class  | AcDbImageBackground
class  | AcDbIndex
class  | AcDbIndexUpdateData
class  | AcDbIndexUpdateDataIterator
class  | AcDbInterferencePE
class  | AcDbItemLocator
class  | AcDbLayerFilter
class  | AcDbLayerIndex
class  | AcDbLayerIndexIterator
class  | AcDbLayerStateManager
class  | AcDbLayerStateManagerReactor
class  | AcDbLayerTable
class  | AcDbLayerTableIterator
class  | AcDbLayerTableRecord
class  | AcDbLayout
class  | AcDbLayoutManager
class  | AcDbLayoutManagerReactor
class  | AcDbLeader
class  | AcDbLight
class  | AcDbLine
class  | AcDbLinetypeTable
class  | AcDbLinetypeTableIterator
class  | AcDbLinetypeTableRecord
class  | AcDbLinkedData
class  | AcDbLinkedTableData
class  | AcDbLoftedSurface
class  | AcDbLoftOptions
class  | AcDbLoftProfile
class  | AcDbLongTransaction
class  | AcDbLongTransWorkSetIterator
class  | AcDbManagedHost
class  | AcDbMatchProperties
class  | AcDbMaterial
class  | AcDbMentalRayRenderSettings
class  | AcDbMInsertBlock
class  | AcDbMLeader
class  | AcDbMLeaderStyle
class  | AcDbMline
class  | AcDbMlineStyle
class  | AcDbModelDocViewStyle
class  | AcDbMotionPath
class  | AcDbMPolygon
class  | AcDbMPolygonCrossing
class  | AcDbMPolygonCrossingArray
class  | AcDbMpolygonLoops
class  | AcDbMPolygonNode
class  | AcDbMText
class  | AcDbMultiModesGripPE
class  | AcDbNamedPath
class  | AcDbNonSubEntDynamicUCSPE
class  | AcDbNurbSurface
class  | AcDbObject
class  | AcDbObjectContext
class  | AcDbObjectContextCollection
class  | AcDbObjectContextCollectionIterator
class  | AcDbObjectContextInterface
class  | AcDbObjectContextManager
class  | AcDbObjectId
class  | AcDbObjectIdGraph
class  | AcDbObjectIdGraphNode
class  | AcDbObjectIterator
class  | AcDbObjectOverrule
class  | AcDbObjectPointer< T_OBJECT >
class  | AcDbObjectPointerBase< T_OBJECT >
class  | AcDbObjectReactor
class  | AcDbOle2Frame
class  | AcDbOleFrame
class  | AcDbOrdinateDimension
class  | AcDbOsnapOverrule
class  | AcDbOsnapPointRef
class  | AcDbPaperOrientationPE
class  | AcDbParentTransformOfChildPE
class  | AcDbPasswordedFile
class  | AcDbPathRef
class  | AcDbPdfDefinition
class  | AcDbPdfReference
class  | AcDbPlaceHolder
class  | AcDbPlaneSurface
class  | AcDbPlotSettings
class  | AcDbPlotSettingsValidator
class  | AcDbPoint
class  | AcDbPointCloudClassificationColorRamp
class  | AcDbPointCloudColorMap
class  | AcDbPointCloudColorRamp
class  | AcDbPointCloudCrop
class  | AcDbPointCloudCropStateManager
class  | AcDbPointCloudDefEx
class  | AcDbPointCloudDefReactorEx
class  | AcDbPointCloudEx
class  | AcDbPointPath
class  | AcDbPointRef
class  | AcDbPolyFaceMesh
class  | AcDbPolyFaceMeshVertex
class  | AcDbPolygonMesh
class  | AcDbPolygonMeshVertex
class  | AcDbPolyline
class  | AcDbPropertiesOverrule
class  | AcDbPropertyFilterCustomizationPE
class  | AcDbProxyEntity
class  | AcDbProxyObject
class  | AcDbRadialDimension
class  | AcDbRadialDimensionLarge
class  | AcDbRapidRTRenderSettings
class  | AcDbRasterImage
class  | AcDbRasterImageDef
class  | AcDbRasterImageDefFileAccessReactor
class  | AcDbRasterImageDefReactor
class  | AcDbRasterImageDefTransReactor
class  | AcDbRasterVariables
class  | AcDbRay
class  | AcDbRecover
class  | AcDbRecoverCallBack
class  | AcDbRegAppTable
class  | AcDbRegAppTableIterator
class  | AcDbRegAppTableRecord
class  | AcDbRegion
class  | AcDbRenderEnvironment
class  | AcDbRenderGlobal
class  | AcDbRenderSettings
class  | AcDbRevolvedSurface
class  | AcDbRevolveOptions
class  | AcDbRotatedDimension
class  | AcDbSection
class  | AcDbSectionablePE
class  | AcDbSectionManager
class  | AcDbSectionManagerIterator
class  | AcDbSectionSettings
class  | AcDbSectionSymbol
class  | AcDbSectionViewStyle
class  | AcDbSelectGrip
class  | AcDbSequenceEnd
class  | AcDbShape
class  | AcDbSkyBackground
class  | AcDbSmartObjectPointer< ACDB_CLASS >
class  | AcDbSoftOwnershipId
class  | AcDbSoftPointerId
class  | AcDbSolid
class  | AcDbSolidBackground
class  | AcDbSortentsTable
class  | AcDbSpatialFilter
class  | AcDbSpatialIndex
class  | AcDbSpatialIndexIterator
class  | AcDbSpline
class  | AcDbSubDMesh
class  | AcDbSubentGeometry
class  | AcDbSubentId
class  | AcDbSubentityOverrule
class  | AcDbSubentRef
class  | AcDbSummaryInfoManager
class  | AcDbSummaryInfoReactor
class  | AcDbSun
class  | AcDbSurface
class  | AcDbSurfaceTrimInfo
class  | AcDbSweepOptions
class  | AcDbSweptSurface
class  | AcDbSymbolTable
class  | AcDbSymbolTableIterator
class  | AcDbSymbolTablePointer< T_OBJECT >
class  | AcDbSymbolTableRecord
class  | AcDbSymbolTableRecordPointer< T_OBJECT >
class  | AcDbTable
class  | AcDbTableContent
class  | AcDbTableIterator
class  | AcDbTableStyle
class  | AcDbTableTemplate
class  | AcDbText
class  | AcDbTextEditor
class  | AcDbTextEditorColumn
class  | AcDbTextEditorColumns
class  | AcDbTextEditorCursor
class  | AcDbTextEditorLocation
class  | AcDbTextEditorParagraph
class  | AcDbTextEditorParagraphIterator
class  | AcDbTextEditorParagraphTab
class  | AcDbTextEditorSelectable
class  | AcDbTextEditorSelection
class  | AcDbTextEditorSelectionBase
class  | AcDbTextEditorStack
class  | AcDbTextEditorWipeout
class  | AcDbTextStyleTable
class  | AcDbTextStyleTableIterator
class  | AcDbTextStyleTableRecord
class  | AcDbTrace
class  | AcDbTransactionManager
class  | AcDbTransformOverrule
class  | AcDbUCSTable
class  | AcDbUCSTableIterator
class  | AcDbUCSTableRecord
class  | AcDbUnderlayDefinition
class  | AcDbUnderlayFile
class  | AcDbUnderlayHost
class  | AcDbUnderlayItem
class  | AcDbUnderlayReference
class  | AcDbVectorRef
class  | AcDbVertex
class  | AcDbVertexRef
class  | AcDbViewBorder
class  | AcDbViewport
class  | AcDbViewportTable
class  | AcDbViewportTableIterator
class  | AcDbViewportTableRecord
class  | AcDbViewRepBlockReference
class  | AcDbViewSymbol
class  | AcDbViewTable
class  | AcDbViewTableIterator
class  | AcDbViewTableRecord
class  | AcDbVisibilityOverrule
class  | AcDbVisualStyle
class  | AcDbWblockCloneFiler
class  | AcDbWipeout
class  | AcDbXline
class  | AcDbXObject
class  | AcDbXrecord
class  | AcDbXrecordIterator
class  | AcDbXrefFileLocker
class  | AcDbXrefGraph
class  | AcDbXrefGraphNode
class  | AcDbXrefObjectId
class  | AcDistanceConstraint
class  | AcEqualCurvatureConstraint
class  | AcEqualDistanceConstraint
class  | AcEqualHelpParameterConstraint
class  | AcEqualLengthConstraint
class  | AcEqualRadiusConstraint
class  | AcExplicitConstraint
class  | AcFixedConstraint
class  | AcG2SmoothConstraint
class  | AcGeomConstraint
class  | AcGraph
class  | AcGraphNode
class  | AcHelpParameter
class  | AcHorizontalConstraint
class  | AcMidPointConstraint
class  | AcNormalConstraint
class  | AcParallelConstraint
class  | AcPerpendicularConstraint
class  | AcPointCloudColorSchemeCollectionReactor
class  | AcPointCoincidenceConstraint
class  | AcPointCurveConstraint
class  | AcRadiusDiameterConstraint
class  | AcSymmetricConstraint
class  | AcTangentConstraint
class  | AcTransaction
class  | AcTransactionReactor
class  | AcVerticalConstraint
struct  | AcDbMultiModesGripPE::GripMode
struct  | MeshFaceterSettings
class  | AcDbAssocDimDependencyBodyBase::NotificationIgnorer
class  | AcDbSymbolUtilities::Services
 Macros
 #define  | ACDB_SUMMINFO_INVALID_CHARACTERS L"<>/\\\":;?*|,=`"
 Typedefs
 typedef AcDbSymbolTablePointer< AcDbBlockTable >  | AcDbBlockTablePointer
 typedef AcDbSymbolTableRecordPointer< AcDbBlockTableRecord >  | AcDbBlockTableRecordPointer
 typedef AcArray< AcDbDataCell, AcArrayObjectCopyReallocator< AcDbDataCell > >  | AcDbDataCellArray
 typedef AcArray< AcDbDataLink * >  | AcDbDataLinkArray
 typedef AcDbObjectPointer< AcDbDictionary >  | AcDbDictionaryPointer
 typedef AcArray< AcDbDimData >  | AcDbDimDataArray
 typedef AcDbSymbolTablePointer< AcDbDimStyleTable >  | AcDbDimStyleTablePointer
 typedef AcDbSymbolTableRecordPointer< AcDbDimStyleTableRecord >  | AcDbDimStyleTableRecordPointer
 typedef AcArray< AcDbDynBlockReferenceProperty, AcArrayObjectCopyReallocator< AcDbDynBlockReferenceProperty > >  | AcDbDynBlockReferencePropertyArray
 typedef AcDbObjectPointer< AcDbEntity >  | AcDbEntityPointer
 typedef struct MeshFaceterSettings  | AcDbFaceterSettings
 typedef AcArray< AcDbGripData, AcArrayObjectCopyReallocator< AcDbGripData > >  | AcDbGripDataArray
 typedef AcArray< AcDbGripData *, AcArrayMemCopyReallocator< AcDbGripData * > >  | AcDbGripDataPtrArray
 typedef AcDbSymbolTablePointer< AcDbLayerTable >  | AcDbLayerTablePointer
 typedef AcDbSymbolTableRecordPointer< AcDbLayerTableRecord >  | AcDbLayerTableRecordPointer
 typedef AcDbSymbolTablePointer< AcDbLinetypeTable >  | AcDbLinetypeTablePointer
 typedef AcDbSymbolTableRecordPointer< AcDbLinetypeTableRecord >  | AcDbLinetypeTableRecordPointer
 typedef AcDbSymbolTablePointer< AcDbRegAppTable >  | AcDbRegAppTablePointer
 typedef AcDbSymbolTableRecordPointer< AcDbRegAppTableRecord >  | AcDbRegAppTableRecordPointer
 typedef AcDbSymbolTablePointer< AcDbTextStyleTable >  | AcDbTextStyleTablePointer
 typedef AcDbSymbolTableRecordPointer< AcDbTextStyleTableRecord >  | AcDbTextStyleTableRecordPointer
 typedef AcDbSymbolTablePointer< AcDbUCSTable >  | AcDbUCSTablePointer
 typedef AcDbSymbolTableRecordPointer< AcDbUCSTableRecord >  | AcDbUCSTableRecordPointer
 typedef AcDbSymbolTablePointer< AcDbViewportTable >  | AcDbViewportTablePointer
 typedef AcDbSymbolTableRecordPointer< AcDbViewportTableRecord >  | AcDbViewportTableRecordPointer
 typedef AcDbSymbolTablePointer< AcDbViewTable >  | AcDbViewTablePointer
 typedef AcDbSymbolTableRecordPointer< AcDbViewTableRecord >  | AcDbViewTableRecordPointer
 typedef struct tagBITMAPINFO  | BITMAPINFO
 typedef void(*  | ContextMenuItemIndexPtr) (unsigned int itemIndex)
 typedef const ACHAR *(*  | GripCLIDisplayStringPtr) (AcDbGripData *pThis)
 typedef const ACHAR *(*  | GripCLIPromptPtr) (AcDbGripData *pThis)
 typedef void(*  | GripDimensionPtr) (AcDbGripData *pThis, const AcDbObjectId &entId, double dimScale, AcDbDimDataPtrArray &dimData)
 typedef AcDbGripOperations::ReturnValue(*  | GripInputPointPtr) (AcDbGripData *pThis, const AcDbObjectId &entId, bool &changedPoint, AcGePoint3d &newPoint, const AcGiViewport &viewContext, const AcDbObjectId &viewportId, bool pointComputed, int history, const AcGePoint3d &lastPoint, const AcGePoint3d &rawPoint, const AcGePoint3d &grippedPoint, const AcGePoint3d &cartesianSnappedPoint, const AcGePoint3d &osnappedPoint, AcDb::OsnapMask osnapMask, const AcArray< AcDbCustomOsnapMode * > &customOsnapModes, AcDb::OsnapMask osnapOverrides, const AcArray< AcDbCustomOsnapMode * > &customOsnapOverrides, const AcArray< AcDbObjectId > &pickedEntities, const AcArray< AcDbObjectIdArray, AcArrayObjectCopyReallocator< AcDbObjectIdArray > > &nestedPickedEntities, const AcArray< Adesk::GsMarker > &gsSelectionMark, const AcArray< AcDbObjectId > &keyPointEntities, const AcArray< AcDbObjectIdArray, AcArrayObjectCopyReallocator< AcDbObjectIdArray > > &nestedKeyPointEntities, const AcArray< Adesk::GsMarker > &keyPointGsSelectionMark, const AcArray< AcGeCurve3d * > &alignmentPaths, const AcGePoint3d &computedPoint)
 typedef AcDbGripOperations::ReturnValue(*  | GripOperationPtr) (AcDbGripData *pThis, const AcDbObjectId &entId, int contextFlags)
 typedef void(*  | GripOpStatusPtr) (AcDbGripData *pThis, const AcDbObjectId &entId, AcDbGripOperations::GripStatus stat)
 typedef AcDbGripOperations::ReturnValue(*  | GripRightClickHandler) (AcDbGripDataArray &hotGrips, const AcDbObjectIdArray &ents, AcRxObject *&handler)
 typedef AcDbGripOperations::ReturnValue(*  | GripRtClkHandler) (AcDbGripDataArray &hotGrips, const AcDbObjectIdArray &ents, ACHAR *&menuName, HMENU &menu, ContextMenuItemIndexPtr &cb)
 typedef const ACHAR *(*  | GripToolTipPtr) (AcDbGripData *pThis)
 typedef void(*  | GripViewportDrawPtr) (AcDbGripData *pThis, AcGiViewportDraw *pWd, const AcDbObjectId &entId, AcDbGripOperations::DrawType type, AcGePoint3d *imageGripPoint, int gripSize)
 typedef bool(*  | GripWorldDrawPtr) (AcDbGripData *pThis, AcGiWorldDraw *pWd, const AcDbObjectId &entId, AcDbGripOperations::DrawType type, AcGePoint3d *imageGripPoint, double dGripSize)
 typedef void(*  | MAPFILENOTIFYPROC) (const ACHAR *filename, const ACHAR *newName, int context, void *pReserved)
 typedef Acad::ErrorStatus(*  | REMAPPROC) (ACHAR *&newName, const ACHAR *filename, int context, void *pReserved)
 typedef Acad::ErrorStatus(*  | SELECTFILEPROC) (short *userCancel, CHAR *&chosenPath, void *h, const int nFlags, const ACHAR *prompt, const ACHAR *dir, const ACHAR *name, const ACHAR *type, int *pnChoice, bool *pbReadOnly, const ACHAR *pszWSTags, AcStringArray *pReserved)
 Enumerations
enum  | { kNullId = 0 }
enum  | { kMaxPointRefs = 4 }
enum  | { kDfltPrec = -1, kMaxPrec = 16 }
enum  | { kStrSiz = 17 }
enum  | { kAllClasses = 0x01, kCustomClasses = 0x02, kProxyClasses = 0x04 }
enum  | { kMaxValueBytes = 8 }
enum  | { kUndefDoNothing = 0, kUndefTurnOff = 1, kUndefFreeze = 2, kRestoreAsOverrides = 4 }
enum  | { kSameDb = 0, kXrefDb = 1, kUnrelatedDb = 2 }
enum  | {
 kNoOperation = 0, kEraseAllowed = 0x01, kCloningAllowed = 0x80, kAllButCloningAllowed = 0x01,
 kAllAllowedBits = 0x81, kMergeIgnore = 0, kMergeReplace = 0x100, kMergeMangleName = 0x200,
 kDisableProxyWarning = 0x400
 }
enum  | {
 kNoOperation = 0, kEraseAllowed = 0x1, kTransformAllowed = 0x2, kColorChangeAllowed = 0x4,
 kLayerChangeAllowed = 0x8, kLinetypeChangeAllowed = 0x10, kLinetypeScaleChangeAllowed = 0x20, kVisibilityChangeAllowed = 0x40,
 kCloningAllowed = 0x80, kLineWeightChangeAllowed = 0x100, kPlotStyleNameChangeAllowed = 0x200, kAllButCloningAllowed = 0x37F,
 kAllAllowedBits = 0xBFF, kDisableProxyWarning = 0x400, kMaterialChangeAllowed = 0x800
 }
enum  | { kDxfLayerPlotBit = AcDb::kDxfBool }
enum  | { kCurrentVersion = ACDBSYMUTIL_SERVICES_CURRENT_VERSION }
enum  | { kMaxSuggestNameSize = 2049 }
enum  | AcTextAlignment {
 kTextAlignmentLeft = 0, kTextAlignmentCenter = ( kTextAlignmentLeft + 1 ), kTextAlignmentRight = ( kTextAlignmentCenter + 1 ), kTextAlignmentAligned = ( kTextAlignmentRight + 1 ),
 kTextAlignmentMiddle = ( kTextAlignmentAligned + 1 ), kTextAlignmentFit = ( kTextAlignmentMiddle + 1 ), kTextAlignmentTopLeft = ( kTextAlignmentFit + 1 ), kTextAlignmentTopCenter = ( kTextAlignmentTopLeft + 1 ),
 kTextAlignmentTopRight = ( kTextAlignmentTopCenter + 1 ), kTextAlignmentMiddleLeft = ( kTextAlignmentTopRight + 1 ), kTextAlignmentMiddleCenter = ( kTextAlignmentMiddleLeft + 1 ), kTextAlignmentMiddleRight = ( kTextAlignmentMiddleCenter + 1 ),
 kTextAlignmentBottomLeft = ( kTextAlignmentMiddleRight + 1 ), kTextAlignmentBottomCenter = ( kTextAlignmentBottomLeft + 1 ), kTextAlignmentBottomRight = ( kTextAlignmentBottomCenter + 1 )
 }
enum  | AlignmentType {
 kAlignmentDefault, kAlignmentLeft, kAlignmentCenter, kAlignmentRight,
 kAlignmentJustify, kAlignmentDistribute
 }
enum  | AlignOption { kNoAlignment, kAlignSweepEntityToPath, kTranslateSweepEntityToPath, kTranslatePathToSweepEntity }
enum  | AnnoType { kMText = 0, kFcf, kBlockRef, kNoAnno }
enum  | ArrowDirection { kTowardsCuttingPlane = 0, kAwayFromCuttingPlane = 1 }
enum  | AssocFlags { kFirstPointRef = 1, kSecondPointRef = 2, kThirdPointRef = 4, kFourthPointRef = 8 }
enum  | AttachmentPoint { kAboveView = 0, kBelowView = 1 }
enum  | AttachmentPoint {
 kTopLeft = 1, kTopCenter = 2, kTopRight = 3, kMiddleLeft = 4,
 kMiddleCenter = 5, kMiddleRight = 6, kBottomLeft = 7, kBottomCenter = 8,
 kBottomRight = 9, kBaseLeft = 10, kBaseCenter = 11, kBaseRight = 12,
 kBaseAlign = 13, kBottomAlign = 14, kMiddleAlign = 15, kTopAlign = 16,
 kBaseFit = 17, kBottomFit = 18, kMiddleFit = 19, kTopFit = 20,
 kBaseMid = 21, kBottomMid = 22, kMiddleMid = 23, kTopMid = 24
 }
enum  | AuditPass { PASS1 = 1, PASS2 = 2 }
enum  | BlockConnectionType { kConnectExtents = 0, kConnectBase = 1 }
enum  | BlockScaling { kAny, kUniform }
enum  | BoundaryType { kCircularBoundary, kRectangularBoundary, kCustomBoundary }
enum  | BreakPointType { kDynamic = 0, kStatic = 1, kStatic2Point = 2 }
enum  | CellType {
 kUnknown = 0, kInteger, kDouble, kCharPtr,
 kPoint, kObjectId, kHardOwnerId, kSoftOwnerId,
 kHardPtrId, kSoftPtrId, kBool, kVector
 }
enum  | CenterMarkType { kMark = 0, kLine = 1, kNone = 2 }
enum  | ClipBoundaryType { kInvalid, kRect, kPoly }
enum  | ColumnType { kNoColumns, kStaticColumns, kDynamicColumns }
enum  | ConstrainType { kTurnHeight = 0, kTurns = 1, kHeight = 2 }
enum  | ContentType { kNoneContent = 0, kBlockContent = 1, kMTextContent = 2, kToleranceContent = 3 }
enum  | CropType { kInvalid = 0, kRectangular, kPolygonal, kCircular }
enum  | DeleteImageEvent { kUnload = 1, kErase = 2 }
enum  | Destination { krWindow = 0, krViewport }
enum  | DimDataFlags {
 kDimEditable = 0x1, kDimInvisible = 0x2, kDimFocal = 0x4, kDimHideIfValueIsZero = 0x8,
 kDimEmptyData = 0x10, kDimResultantLength = 0x20, kDimDeltaLength = 0x40, kDimResultantAngle = 0x80,
 kDimDeltaAngle = 0x100, kDimRadius = 0x200, kDimCustomValue = 0x400, kDimConstrained = 0x800,
 kDimCustomString = 0x1000
 }
enum  | DimInspect {
 kShapeRemove = 0, kShapeRound = 1, kShapeAngular = 2, kShapeNone = 4,
 kShapeLabel = 0x10, kShapeRate = 0x20
 }
enum  | Direction { kClockwise, kCounterClockwise }
enum  | DirectionType { kNotDirected = 0, kFixedDirection, kPerpendicularToLine, kParallelToLine }
enum  | DispOptionOutOfRange { kUseMinMaxColors = 0, kUseRGBScanColors, kHidePoints }
enum  | DrawLeaderOrderType { kDrawLeaderHeadFirst = 0, kDrawLeaderTailFirst = 1 }
enum  | DrawMLeaderOrderType { kDrawContentFirst = 0, kDrawLeaderFirst = 1 }
enum  | DriveModeType { kDriveModeFirst = 0, kDriveModeSecond = 1, kDriveModeBoth = 2 }
enum  | EdgeExtensionType { kExtendEdge = 0x000, kStretchEdge = 0x001 }
enum  | EraseMask { kZeroLengthCurve = 0x01, kEmptyText = 0x02, kAllEmptyObj = 0xFFFFFFFF }
enum  | EvalContext {
 kOpen = (0x1 << 0), kSave = (0x1 << 1), kPlot = (0x1 << 2), kEtransmit = (0x1 << 3),
 kRegen = (0x1 << 4), kDemand = (0x1 << 5), kPreview = (0x1 << 6), kPlotPreview = (0x1 << 7)
 }
enum  | EvalOption {
 kDisable = 0, kOnOpen = (0x1 << 0), kOnSave = (0x1 << 1), kOnPlot = (0x1 << 2),
 kOnEtransmit = (0x1 << 3), kOnRegen = (0x1 << 4), kOnDemand = (0x1 << 5), kAutomatic
 }
enum  | EvalStatus {
 kNotYetEvaluated = (0x1 << 0), kSuccess = (0x1 << 1), kEvaluatorNotFound = (0x1 << 2), kSyntaxError = (0x1 << 3),
 kInvalidCode = (0x1 << 4), kInvalidContext = (0x1 << 5), kOtherError = (0x1 << 6)
 }
enum  | ExitStatus { kExitQuit = 0, kExitSave }
enum  | FieldCodeFlag {
 kFieldCode = (0x1 << 0), kEvaluatedText = (0x1 << 1), kEvaluatedChildren = (0x1 << 2), kObjectReference = (0x1 << 3),
 kAddMarkers = (0x1 << 4), kEscapeBackslash = (0x1 << 5), kStripOptions = (0x1 << 6), kPreserveFields = (0x1 << 7),
 kTextField = (0x1 << 8), kPreserveOptions = (0x1 << 9), kDetachChildren = (0x1 << 10), kChildObjectReference = (0x1 << 11),
 kForExpression = (0x1 << 12)
 }
enum  | FilingOption { kSkipFilingResult = (0x1 << 0) }
enum  | FindFileHint {
 kDefault = 0, kFontFile, kCompiledShapeFile, kTrueTypeFontFile,
 kEmbeddedImageFile, kXRefDrawing, kPatternFile, kARXApplication,
 kFontMapFile, kUnderlayFile, kDataLinkFile, kPhotometricWebFile,
 kMaterialMapFile, kCloudOrProjectFile
 }
enum  | Flags { kDefault = 0x00 }
enum  | Flags { kDefault = 0x00 }
enum  | Flags {
 kColorFlag = 0x1, kLayerFlag = 0x2, kLtypeFlag = 0x4, kThicknessFlag = 0x8,
 kLtscaleFlag = 0x10, kTextFlag = 0x20, kDimensionFlag = 0x40, kHatchFlag = 0x80,
 kLweightFlag = 0x100, kPlotstylenameFlag = 0x200, kPolylineFlag = 0x400, kViewportFlag = 0x800,
 kTableFlag = 0x1000, kMaterialFlag = 0x2000, kShadowDisplayFlag = 0x4000, kMultileaderFlag = 0x8000,
 kTransparencyFlag = 0x10000, kCenterObjectFlag = 0x20000, kSetAllFlagsOn = 0x3FFFF
 }
enum  | Flags {
 kNone = 0x00, kVisited = 0x01, kOutsideRefed = 0x02, kSelected = 0x04,
 kInList = 0x08, kListAll = 0x0E, kFirstLevel = 0x10, kUnresTree = 0x20,
 kAll = 0x2F
 }
enum  | FlowAlign { kFlowBase, kFlowCenter, kFlowTop }
enum  | FlowDirection {
 kLtoR = 1, kRtoL = 2, kTtoB = 3, kBtoT = 4,
 kByStyle = 5
 }
enum  | FrameSettings {
 kImageFrameInvalid = -1, kImageFrameOff = 0, kImageFrameAbove = 1, kImageFrameBelow = 2,
 kImageFrameOnNoPlot = 3
 }
enum  | Generation {
 kSourceAllObjects = (0x1 << 0), kSourceSelectedObjects = (0x1 << 1), kDestinationNewBlock = (0x1 << 4), kDestinationReplaceBlock = (0x1 << 5),
 kDestinationFile = (0x1 << 6)
 }
enum  | GeomConstraintType {
 kHorizontal = 0, kVertical, kParallel, kPerpendicular,
 kNormal, kColinear, kCoincident, kConcentric,
 kTangent, kEqualRadius, kEqualLength, kSymmetric,
 kG2Smooth, kFix
 }
enum  | Geometry {
 kIntersectionBoundary = (0x1 << 0), kIntersectionFill = (0x1 << 1), kBackgroundGeometry = (0x1 << 2), kForegroundGeometry = (0x1 << 3),
 kCurveTangencyLines = (0x1 << 4)
 }
enum  | GlyphDisplayType { kGlyphDisplayAuto = 0, kGlyphDisplayOn, kGlyphDisplayOff }
enum  | GradientPatternType { kPreDefinedGradient = 0, kUserDefinedGradient = 1 }
enum  | GraphicsMetafileType { kNoMetafile = 0, kBoundingBox = 1, kFullGraphics = 2 }
enum  | GripActionType { kDragOn = 0, kImmediate, kCommand }
enum  | GripCursorType {
 kcNone = 0, kcCrosshairPlus, kcCrosshairMinus, kcCrosshairCurve,
 kcCrosshairLine, kcCrosshairAngle
 }
enum  | GripModeIdentifier { kNone = 0, kMove, kCustomStart = 100 }
enum  | GripModes {
 kStretchGrip = 1 << 0, kRowCountGrip = 1 << 1, kRowSpacingGrip = 1 << 2, kUniformRowSpacingGrip = 1 << 3,
 kColumnCountGrip = 1 << 4, kColumnSpacingGrip = 1 << 5, kUniformColSpacingGrip = 1 << 6, kRowColumnCountGrip = 1 << 7,
 kRowColumnSpacingGrip = 1 << 8, kColumnDirectionGrip = 1 << 9, kRowDirectionGrip = 1 << 10, kLevelCountGrip = 1 << 11,
 kLevelSpacingGrip = 1 << 12, kUniformLevelSpacingGrip = 1 << 13, kRowAxisAngleGrip = 1 << 14
 }
enum  | GripModes {
 kStretchGrip = 1 << 0, kRowCountGrip = 1 << 1, kRowSpacingGrip = 1 << 2, kUniformRowSpacingGrip = 1 << 3,
 kLevelCountGrip = 1 << 4, kLevelSpacingGrip = 1 << 5, kUniformLevelSpacingGrip = 1 << 6, kItemCountGrip = 1 << 7,
 kItemSpacingGrip = 1 << 8, kUniformItemSpacingGrip = 1 << 9
 }
enum  | GripModes {
 kCenterPointGrip = 1 << 0, kStretchRadiusGrip = 1 << 1, kRowCountGrip = 1 << 2, kRowSpacingGrip = 1 << 3,
 kUniformRowSpacingGrip = 1 << 4, kLevelCountGrip = 1 << 5, kLevelSpacingGrip = 1 << 6, kUniformLevelSpacingGrip = 1 << 7,
 kItemCountGrip = 1 << 8, kAngleBetweenItemsGrip = 1 << 9, kFillAngleGrip = 1 << 10
 }
enum  | GripType { kPrimary, kSecondary }
enum  | gsMarkType {
 kNone = 0, kArrowMark = 1, kLeaderLineMark = kArrowMark + MAX_LEADERLINE_NUMBER, kDoglegMark = kLeaderLineMark + MAX_LEADERLINE_NUMBER,
 kMTextMark = kDoglegMark + MAX_LEADER_NUMBER, kMTextUnderLineMark = kMTextMark + 1, kToleranceMark = kMTextUnderLineMark + 1, kBlockMark = kToleranceMark + 1,
 kBlockAttribute = kBlockMark + 1
 }
enum  | HatchEdgeType { kLine = 1, kCirArc = 2, kEllArc = 3, kSpline = 4 }
enum  | HatchLoopType {
 kDefault = 0, kExternal = 1, kPolyline = 2, kDerived = 4,
 kTextbox = 8, kOutermost = 0x10, kNotClosed = 0x20, kSelfIntersecting = 0x40,
 kTextIsland = 0x80, kDuplicate = 0x100, kIsAnnotative = 0x200, kDoesNotSupportScale = 0x400,
 kForceAnnoAllVisible = 0x800, kOrientToPaper = 0x1000, kIsAnnotativeBlock = 0x2000
 }
enum  | HatchObjectType { kHatchObject = 0, kGradientObject = 1 }
enum  | HatchPatternType { kUserDefined = 0, kPreDefined = 1, kCustomDefined = 2 }
enum  | HatchStyle { kNormal = 0, kOuter = 1, kIgnore = 2 }
enum  | Height { kHeightAboveSectionLine = 0x1, kHeightBelowSectionLine = 0x2 }
enum  | HLinkFlags { kUndefined = 0, kConvertDwgToDwf = 0x1 }
enum  | IdentifierPlacement { kOutsideBoundary =0, kOutsideBoundaryWithLeader, kOnBoundary, kOnBoundaryWithLeader }
enum  | IdentifierPosition {
 kEndCuttingPlane = 0, kAboveDirectionArrowLine = 1, kAboveDirectionArrowSymbol = 2, kStartDirectionArrow = 3,
 kEndDirectionArrow = 4
 }
enum  | ImageDisplayOpt { kShow = 1, kShowUnAligned = 2, kClip = 4, kTransparent = 8 }
enum  | ImageQuality { kImageQualityInvalid = -1, kImageQualityDraft = 0, kImageQualityHigh = 1 }
enum  | ImpliedType {
 kExplicitVertex, kUnknownType, kEdgeStart, kEdgeEnd,
 kEdgeMid, kEdgeCenter, kEdgeSplineControlPoint, kEdgeSplineFitPoint
 }
enum  | IndexType { kItemIndex, kRowIndex, kLevelIndex }
enum  | InitialValue { kInitZero = 1, kInitLocalTime = 2, kInitUniversalTime = 3 }
enum  | InsertTextType {
 kUnicodeMTextFormat, kMTextFormat, kRichTextFormat, kUnicodeDTextFormat,
 kDTextFormat, kUnicodeTextFormat, kMultibyteTextFormat
 }
enum  | LampColorPreset {
 kD65White = 0, kFluorescent, kCoolWhite, kWhiteFluorescent,
 kDaylightFluorescent, kIncandescent, kXenon, kHalogen,
 kQuartz, kMetalHalide, kMercury, kPhosphorMercury,
 kHighPressureSodium, kLowPressureSodium, kCustom
 }
enum  | LampColorType { kKelvin = 0, kPreset }
enum  | LayerStateMask {
 kNone = 0x0000, kOn = 0x0001, kFrozen = 0x0002, kLocked = 0x0004,
 kPlot = 0x0008, kNewViewport = 0x0010, kColor = 0x0020, kLineType = 0x0040,
 kLineWeight = 0x0080, kPlotStyle = 0x0100, kCurrentViewport = 0x0200, kTransparency = 0x0400,
 kAll, kStateIsHidden = 0x8000, kLastRestored = 0x10000, kDecomposition = kAll | 0x20000
 }
enum  | LeaderDirectionType {
 kUnknownLeader = 0, kLeftLeader = 1, kRightLeader = 2, kTopLeader = 3,
 kBottomLeader = 4
 }
enum  | LeaderType { kInVisibleLeader = 0, kStraightLeader = 1, kSplineLeader = 2 }
enum  | LineSpacingStyle { kLineSpacingDefault, kLineSpacingExactly, kLineSpacingAtLeast, kLineSpacingMultiple }
enum  | LoftSurfaceType { kLoftSurf, kLoftBlendSurf, kLoftNetworkSurf }
enum  | loopDir { kExterior = 0, kInterior, kAnnotation }
enum  | MaterialFlags {
 kNone = 0, kIsLegacy = 0x1, kIsModifiedIsValid = 0x2, kIsModified = 0x4,
 kIsModifiedAndValid = 0x6
 }
enum  | Method { kDivide, kMeasure }
enum  | MiterOption {
 kDefaultMiter, kOldMiter, kNewMiter, kCrimpMiter,
 kBendMiter
 }
enum  | ModelEdge { kSmooth = 0, kSmoothWithBorder, kSmoothWithConnectionLine, kJagged }
enum  | ModelerFlavor { kModelerFull =0, kModelerRegionsOnly =1, kModelerObjectsOnly =2 }
enum  | MoveType { kMoveAllPoints = 0, kMoveAllExceptArrowHeaderPoints = 1, kMoveContentAndDoglegPoints = 2 }
enum  | NodeId { kNullNodeId = 0 }
enum  | NormalOption {
 kNoNormal, kFirstNormal, kLastNormal, kEndsNormal,
 kAllNormal, kUseDraftAngles
 }
enum  | NumberingType {
 kOff = 0, kBullet, kNumber, kLetterLower,
 kLetterUpper, kNumberWide, kLetterLowerWide, kLetterUpperWide
 }
enum  | OpenMode { kForReadAndReadShare = 1, kForReadAndWriteNoShare = 2, kForReadAndAllShare = 3, kTryForReadShare = 4 }
enum  | OsnapType {
 kOsnapNone = 0, kOsnapEnd = 1, kOsnapMid = 2, kOsnapCen = 3,
 kOsnapNode = 4, kOsnapQuad = 5, kOsnapInt = 6, kOsnapIns = 7,
 kOsnapPerp = 8, kOsnapTan = 9, kOsnapNear = 10, kOsnapApint = 11,
 kOsnapStart = 13
 }
enum  | OverriddenProperty { kModelEdge = 0x00000001, kIdentifierPosition = 0x00000001 << 1 }
enum  | ParagraphTabType { kLeftTab, kCenterTab, kRightTab, kDecimalTab }
enum  | PartialUndoCode { kAddNodePartialUndoCode = 0, kRemoveNodePartialUndoCode, kModifyNodePartialUndoCode, kModifyNextNewNodeIdPartialUndoCode }
enum  | PasswordOptions { kPasswordOptionDefault = 0, kPasswordOptionUpperCase =1, kPasswordOptionIsExternalReference = 2 }
enum  | PhysicalIntensityMethod { kPeakIntensity = 0, kFlux, kIlluminance }
enum  | PlotPaperUnits { kInches, kMillimeters, kPixels }
enum  | PlotRotation { k0degrees, k90degrees, k180degrees, k270degrees }
enum  | PlotType {
 kDisplay, kExtents, kLimits, kView,
 kWindow, kLayout
 }
enum  | PointCloudOSnapMode {
 kOsModePNod = 0, kOsModePNea = 1, kOsModePPer = 2, kOsModePEdgeNea = 3,
 kOsModePEdgePer = 4, kOsModePInt = 5, kOsModePCL = 6, kOsModePCorner = 7
 }
enum  | PointType {
 kXline1Point = 0, kXline2Point = 1, kOriginPoint = 0, kDefiningPoint = 1,
 kXline1Start = 0, kXline1End = 1, kXline2Start = 2, kXline2End = 3,
 kVertexPoint = 2, kChordPoint = 0, kCenterPoint = 1, kFarChordPoint = 1,
 kOverrideCenterPoint = 2, kAngLineStart = 2, kJogPoint = 3, kAngLineEnd = 3,
 kLeaderPoint = 0
 }
enum  | Procedure { krView = 0, krCrop, krSelected }
enum  | ProfileType { kStartCrossSection = 0x01, kEndCrossSection = 0x02, kStartGuide = 0x04, kEndGuide = 0x08 }
enum  | ProjectionCode {
 kProjectionCodeUnknown = 0, kProjectionCodeAlber = 4, kProjectionCodeAzede = 59, kProjectionCodeAzmea = 11,
 kProjectionCodeAzmed = 7, kProjectionCodeBipolar = 31, kProjectionCodeBonne = 24, kProjectionCodeCassini = 22,
 kProjectionCodeEckert4 = 25, kProjectionCodeEckert6 = 26, kProjectionCodeEdcnc = 12, kProjectionCodeEdcyl = 20,
 kProjectionCodeGaussK = 46, kProjectionCodeGnomonic = 19, kProjectionCodeGoode = 28, kProjectionCodeHom1uv = 1281,
 kProjectionCodeHom1xy = 1282, kProjectionCodeHom2uv = 1283, kProjectionCodeHom2xy = 1284, kProjectionCodeKrovak = 47,
 kProjectionCodeKrvk95 = 51, kProjectionCodeLL = 1, kProjectionCodeLm1sp = 36, kProjectionCodeLm2sp = 37,
 kProjectionCodeLmblg = 38, kProjectionCodeLmtan = 8, kProjectionCodeMiller = 13, kProjectionCodeMndotl = 41,
 kProjectionCodeMndott = 42, kProjectionCodeModpc = 10, kProjectionCodeMollweid = 27, kProjectionCodeMrcat = 6,
 kProjectionCodeMrcatK = 49, kProjectionCodeMstero = 15, kProjectionCodeNeacyl = 29, kProjectionCodeNerth = 55,
 kProjectionCodeNzealand = 16, kProjectionCodeOblqM = 5, kProjectionCodeObqcyl = 56, kProjectionCodeOrtho = 18,
 kProjectionCodeOstn02 = 60, kProjectionCodeOstn97 = 58, kProjectionCodeOstro = 34, kProjectionCodePlycn = 9,
 kProjectionCodePstro = 33, kProjectionCodePstrosl = 53, kProjectionCodeRskew = 1285, kProjectionCodeRskewc = 1286,
 kProjectionCodeRskewo = 1287, kProjectionCodeRobinson = 23, kProjectionCodeSinus = 17, kProjectionCodeSotrm = 43,
 kProjectionCodeSstro = 35, kProjectionCodeSwiss = 32, kProjectionCodeSys34 = 57, kProjectionCodeSys34_99 = 61,
 kProjectionCodeTeacyl = 30, kProjectionCodeTm = 3, kProjectionCodeTrmeraf = 54, kProjectionCodeTrmrkrg = 62,
 kProjectionCodeTrmrs = 45, kProjectionCodeVdgrntn = 21, kProjectionCodeWccsl = 39, kProjectionCodeWccst = 40,
 kProjectionCodeUtm = 44, kProjectionCodeWinkl = 63, kProjectionCodeNrthsrt = 64, kProjectionCodeLmbrtaf = 65,
 kProjectionCodeSys34_01 = 66, kProjectionCodeEdcylE = 67, kProjectionCodePlateCarree = 68, kProjectionCodePvMercator = 69
 }
enum  | Property {
 kColor = 1, kIntensity = 2, kClassification = 3, kNormal = 4,
 kSegmentation = 5, kGeoGraphic = 6
 }
enum  | PropertyOverrideType {
 kLeaderLineType = 0, kLeaderLineColor = 1, kLeaderLineTypeId = 2, kLeaderLineWeight = 3,
 kEnableLanding = 4, kLandingGap = 5, kEnableDogleg = 6, kDoglegLength = 7,
 kArrowSymbolId = 8, kArrowSize = 9, kContentType = 10, kTextStyleId = 11,
 kTextLeftAttachmentType = 12, kTextAngleType = 13, kTextAlignmentType = 14, kTextColor = 15,
 kTextHeight = 16, kEnableFrameText = 17, kDefaultMText = 18, kBlockId = 19,
 kBlockColor = 20, kBlockScale = 21, kBlockRotation = 22, kBlockConnectionType = 23,
 kScale = 24, kTextRightAttachmentType = 25, kTextSwitchAlignmentType = 26, kTextAttachmentDirection = 27,
 kTextTopAttachmentType = 28, kTextBottomAttachmentType = 29, kExtendLeaderToText = 30, kSize = kExtendLeaderToText + 1
 }
enum  | PropState { kNone = -1, kSome = 0, kAll = 1 }
enum  | RadiusDiameterConstrType { kCircleRadius = 0, kCircleDiameter, kMinorRadius, kMajorRadius }
enum  | RemapFileContext { kDrawingOpen, kXrefResolution, kRasterResolution, kAfterXrefResolution }
enum  | RenderTarget { krLevel = 0, krTime = 1, krInfinite = 2 }
enum  | RequiredVersionFlags { kNoOpen = 0, kReadOnly = 1, kWriteAllowed = 2 }
enum  | RotatedDimType { kUnknown = 0, kParallel = 1, kPerpendicular = 2 }
enum  | ScaleEstimationMethod { kScaleEstMethodUnity = 1, kScaleEstMethodUserDefined, kScaleEstMethodReferencePoint, kScaleEstMethodPrismoidal }
enum  | SectionType { kLiveSection = (0x1 << 0), k2dSection = (0x1 << 1), k3dSection = (0x1 << 2) }
enum  | SectorType { kParallelAntiClockwise = 0, kAntiParallelClockwise = 1, kParallelClockwise = 2, kAntiParallelAntiClockwise = 3 }
enum  | SegmentAngleType {
 kAny = 0, k15 = 1, k30 = 2, k45 = 3,
 k60 = 4, k90 = 6, kHorz = 12
 }
enum  | SegType {
 kLine, kArc, kCoincident, kPoint,
 kEmpty
 }
enum  | ShadePlotResLevel {
 kDraft, kPreview, kNormal, kPresentation,
 kMaximum, kCustom
 }
enum  | ShadePlotType {
 kAsDisplayed = 0, kWireframe = 1, kHidden = 2, kRendered = 3,
 kVisualStyle = 4, kRenderPreset = 5
 }
enum  | ShadePlotType {
 kAsDisplayed = 0, kWireframe = 1, kHidden = 2, kRendered = 3,
 kVisualStyle = 4, kRenderPreset = 5
 }
enum  | ShadowSamplingMultiplier {
 kSamplingMultiplierZero = 0, kSamplingMultiplierOneEighth, kSamplingMultiplierOneFourth, kSamplingMultiplierOneHalf,
 kSamplingMultiplierOne, kSamplingMultiplierTwo
 }
enum  | SolutionStatus {
 kWellDefined = 0, kUnderConstrained, kOverConstrained, kInconsistent,
 kNotEvaluated, kNotAvailable, kRejectedByClient
 }
enum  | SourceType { kSourceNotDefined = 0, kInventorSource = 1, kFusionSource = 2, kModelSpaceSource = 3 }
enum  | StackType { kHorizontalStack, kDiagonalStack, kToleranceStack, kDecimalStack }
enum  | StandardScaleType {
 kScaleToFit, kCustomScale, k1_1, k1_2,
 k1_4, k1_5, k1_8, k1_10,
 k1_16, k1_20, k1_30, k1_40,
 k1_50, k1_100, k2_1, k4_1,
 k8_1, k10_1, k100_1, k1_128in_1ft,
 k1_64in_1ft, k1_32in_1ft, k1_16in_1ft, k3_32in_1ft,
 k1_8in_1ft, k3_16in_1ft, k1_4in_1ft, k3_8in_1ft,
 k1_2in_1ft, k3_4in_1ft, k1in_1ft, k1and1_2in_1ft,
 k3in_1ft, k6in_1ft, k1ft_1ft
 }
enum  | State { kPlane = (0x1 << 0), kBoundary = (0x1 << 1), kVolume = (0x1 << 2) }
enum  | State {
 kInitialized = (0x1 << 0), kCompiled = (0x1 << 1), kModified = (0x1 << 2), kEvaluated = (0x1 << 3),
 kHasCache = (0x1 << 4), kHasFormattedString = (0x1 << 5)
 }
enum  | Status {
 kValid = 0, kWasLoadedNowUnloaded = 1, kCouldNotResolveNonTerminal = 2, kCouldNotResolveTerminal = 3,
 kCouldNotResolveTooEarly = 4, kIncompatibleIdType = 1000
 }
enum  | StdScaleType {
 kScaleToFit, k1_128in_1ft, k1_64in_1ft, k1_32in_1ft,
 k1_16in_1ft, k3_32in_1ft, k1_8in_1ft, k3_16in_1ft,
 k1_4in_1ft, k3_8in_1ft, k1_2in_1ft, k3_4in_1ft,
 k1in_1ft, k3in_1ft, k6in_1ft, k1ft_1ft,
 k1_1, k1_2, k1_4, k1_5,
 k1_8, k1_10, k1_16, k1_20,
 k1_30, k1_40, k1_50, k1_100,
 k2_1, k4_1, k8_1, k10_1,
 k100_1, k1000_1, k1and1_2in_1ft
 }
enum  | StylizationType {
 kTrueColor = 1, kSingleColor, kNormalRamp, kHeightRamp,
 kIntensityRamp, kClassificationRamp
 }
enum  | SubItem {
 kNone = 0, kSectionLine = (0x1 << 0), kSectionLineTop = (0x1 << 1), kSectionLineBottom = (0x1 << 2),
 kBackLine = (0x1 << 3), kBackLineTop = (0x1 << 4), kBackLineBottom = (0x1 << 5), kVerticalLineTop = (0x1 << 6),
 kVerticalLineBottom = (0x1 << 7)
 }
enum  | TableStyleOverrides {
 kTitleSuppressed = 1, kHeaderSuppressed = 2, kFlowDirection = 3, kHorzCellMargin = 4,
 kVertCellMargin = 5, kTitleRowColor = 6, kHeaderRowColor = 7, kDataRowColor = 8,
 kTitleRowFillNone = 9, kHeaderRowFillNone = 10, kDataRowFillNone = 11, kTitleRowFillColor = 12,
 kHeaderRowFillColor = 13, kDataRowFillColor = 14, kTitleRowAlignment = 15, kHeaderRowAlignment = 16,
 kDataRowAlignment = 17, kTitleRowTextStyle = 18, kHeaderRowTextStyle = 19, kDataRowTextStyle = 20,
 kTitleRowTextHeight = 21, kHeaderRowTextHeight = 22, kDataRowTextHeight = 23, kTitleRowDataType = 24,
 kHeaderRowDataType = 25, kDataRowDataType = 26, kTitleHorzTopColor = 40, kTitleHorzInsideColor = 41,
 kTitleHorzBottomColor = 42, kTitleVertLeftColor = 43, kTitleVertInsideColor = 44, kTitleVertRightColor = 45,
 kHeaderHorzTopColor = 46, kHeaderHorzInsideColor = 47, kHeaderHorzBottomColor = 48, kHeaderVertLeftColor = 49,
 kHeaderVertInsideColor = 50, kHeaderVertRightColor = 51, kDataHorzTopColor = 52, kDataHorzInsideColor = 53,
 kDataHorzBottomColor = 54, kDataVertLeftColor = 55, kDataVertInsideColor = 56, kDataVertRightColor = 57,
 kTitleHorzTopLineWeight = 70, kTitleHorzInsideLineWeight = 71, kTitleHorzBottomLineWeight = 72, kTitleVertLeftLineWeight = 73,
 kTitleVertInsideLineWeight = 74, kTitleVertRightLineWeight = 75, kHeaderHorzTopLineWeight = 76, kHeaderHorzInsideLineWeight = 77,
 kHeaderHorzBottomLineWeight = 78, kHeaderVertLeftLineWeight = 79, kHeaderVertInsideLineWeight = 80, kHeaderVertRightLineWeight = 81,
 kDataHorzTopLineWeight = 82, kDataHorzInsideLineWeight = 83, kDataHorzBottomLineWeight = 84, kDataVertLeftLineWeight = 85,
 kDataVertInsideLineWeight = 86, kDataVertRightLineWeight = 87, kTitleHorzTopVisibility = 100, kTitleHorzInsideVisibility = 101,
 kTitleHorzBottomVisibility = 102, kTitleVertLeftVisibility = 103, kTitleVertInsideVisibility = 104, kTitleVertRightVisibility = 105,
 kHeaderHorzTopVisibility = 106, kHeaderHorzInsideVisibility = 107, kHeaderHorzBottomVisibility = 108, kHeaderVertLeftVisibility = 109,
 kHeaderVertInsideVisibility = 110, kHeaderVertRightVisibility = 111, kDataHorzTopVisibility = 112, kDataHorzInsideVisibility = 113,
 kDataHorzBottomVisibility = 114, kDataVertLeftVisibility = 115, kDataVertInsideVisibility = 116, kDataVertRightVisibility = 117,
 kCellAlignment = 130, kCellBackgroundFillNone = 131, kCellBackgroundColor = 132, kCellContentColor = 133,
 kCellTextStyle = 134, kCellTextHeight = 135, kCellTopGridColor = 136, kCellRightGridColor = 137,
 kCellBottomGridColor = 138, kCellLeftGridColor = 139, kCellTopGridLineWeight = 140, kCellRightGridLineWeight = 141,
 kCellBottomGridLineWeight = 142, kCellLeftGridLineWeight = 143, kCellTopVisibility = 144, kCellRightVisibility = 145,
 kCellBottomVisibility = 146, kCellLeftVisibility = 147, kCellDataType = 148
 }
enum  | TextAlignment { kTextAlignmentLeft = 0, kTextAlignmentCenter = 1, kTextAlignmentRight = 2 }
enum  | TextAlignmentType { kLeftAlignment = 0, kCenterAlignment = 1, kRightAlignment = 2 }
enum  | TextAlignmentType { kLeftAlignment = 0, kCenterAlignment = 1, kRightAlignment = 2 }
enum  | TextAngleType { kInsertAngle = 0, kHorizontalAngle = 1, kAlwaysRightReadingAngle = 2 }
enum  | TextAttachmentDirection { kAttachmentHorizontal = 0, kAttachmentVertical = 1 }
enum  | TextAttachmentType {
 kAttachmentTopOfTop = 0, kAttachmentMiddleOfTop = 1, kAttachmentMiddle = 2, kAttachmentMiddleOfBottom = 3,
 kAttachmentBottomOfBottom = 4, kAttachmentBottomLine = 5, kAttachmentBottomOfTopLine = 6, kAttachmentBottomOfTop = 7,
 kAttachmentAllLine = 8, kAttachmentCenter = 9, kAttachmentLinedCenter = 10
 }
enum  | TextFindFlags {
 kFindMatchCase = 1 << 0, kFindWholeWord = 1 << 1, kFindHalfFullForm = 1 << 2, kFindIgnoreAccent = 1 << 3,
 kFindUseWildcards = 1 << 4
 }
enum  | TransType {
 kGeneral = 0, kScaling, kRadius, kMajorRadius,
 kMinorRadius, kFixedRadius, kFixed, kFixWhenPossible,
 kNone
 }
enum  | TrimRelation { outside_tool, inside_tool }
enum  | Type { kTypeUnknown = 0, kTypeArbitrary = 1, kTypeGeographic = 2, kTypeProjected = 3 }
enum  | TypeOfCoordinates { kCoordTypUnknown = 0, kCoordTypLocal, kCoordTypGrid, kCoordTypGeographic }
enum  | Unit {
 kUnitUnknown = 0, kUnitMeter = 1, kUnitFoot = 2, kUnitInch = 3,
 kUnitIFoot = 4, kUnitClarkeFoot = 5, kUnitIInch = 6, kUnitCentimeter = 7,
 kUnitKilometer = 8, kUnitYard = 9, kUnitSearsYard = 10, kUnitMile = 11,
 kUnitIYard = 12, kUnitIMile = 13, kUnitKnot = 14, kUnitNautM = 15,
 kUnitLat66 = 16, kUnitLat83 = 17, kUnitDecimeter = 18, kUnitMillimeter = 19,
 kUnitDekameter = 20, kUnitHectometer = 21, kUnitGermanMeter = 22, kUnitCaGrid = 23,
 kUnitClarkeChain = 24, kUnitGunterChain = 25, kUnitBenoitChain = 26, kUnitSearsChain = 27,
 kUnitClarkeLink = 28, kUnitGunterLink = 29, kUnitBenoitLink = 30, kUnitSearsLink = 31,
 kUnitRod = 32, kUnitPerch = 33, kUnitPole = 34, kUnitFurlong = 35,
 kUnitRood = 36, kUnitCapeFoot = 37, kUnitBrealey = 38, kUnitSearsFoot = 39,
 kUnitGoldCoastFoot = 40, kUnitMicroInch = 41, kUnitIndianYard = 42, kUnitIndianFoot = 43,
 kUnitIndianFt37 = 44, kUnitIndianFt62 = 45, kUnitIndianFt75 = 46, kUnitIndianYd37 = 47,
 kUnitDecameter = 48, kUnitInternationalChain = 49, kUnitInternationalLink = 50, kUnitDegree = 1001,
 kUnitGrad = 1002, kUnitGrade = 1003, kUnitMapInfo = 1004, kUnitMil = 1005,
 kUnitMinute = 1006, kUnitRadian = 1007, kUnitSecond = 1008, kUnitDecisec = 1009,
 kUnitCentisec = 1010, kUnitMillisec = 1011
 }
enum  | Units {
 kNone = 0, kMillimeter = 1, kCentimeter = 2, kMeter = 3,
 kKilometer = 4, kInch = 5, kFoot = 6, kYard = 7,
 kMile = 8, kMicroinches = 9, kMils = 10, kAngstroms = 11,
 kNanometers = 12, kMicrons = 13, kDecimeters = 14, kDekameters = 15,
 kHectometers = 16, kGigameters = 17, kAstronomical = 18, kLightYears = 19,
 kParsecs = 20
 }
enum  | UnitsType { kNoUnits = 0, kAngular, kDistance, kArea }
enum  | UpdateFlags { kModified = 1, kDeleted = 2, kProcessed = 4, kUnknownKey = 8 }
enum  | ViewStyleType {
 kFromBase = 0, kWireframeVisibleEdges = 1, kWireframeHiddenEdges = 2, kShadedVisibleEdges = 3,
 kShadedHiddenEdges = 4
 }
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
enum  | whichLine { kAll = -1 }
enum  | WireframeType { kIsolines = 0, kIsoparms = 1 }
 Functions
Acad::ErrorStatus  | acdbGetBreakSubentIndex (AcDbEntity *pEnt, const AcGePoint3d &pickPt, const AcGeVector3d &viewDir, int &subentIndex, AcGePoint3d &ptOnEnt, const AcGeTol &tol=AcGeContext::gTol)
ACDBCORE2D_PORT AcDbManagedHost *ADESK_STDCALL  | acdbGetManagedHost ()
 ACDBCORE2D_PORT Acad::ErrorStatus  | acdbGetSummaryInfo (AcDbDatabase *pDb, AcDbDatabaseSummaryInfo *&pInfo)
 ACDB_PORT HRESULT ADESK_STDCALL  | acdbInitializeManagedLayer ()
 ACDBCORE2D_PORT Acad::ErrorStatus  | acdbPutSummaryInfo (const AcDbDatabaseSummaryInfo *pInfo, AcDbDatabase *pDb)
 Acad::ErrorStatus  | acdbPutSummaryInfo (const AcDbDatabaseSummaryInfo *pInfo)
ACDBCORE2D_PORT Acad::ErrorStatus ADESK_STDCALL  | acdbSetManagedHost (AcDbManagedHost *pHost)
 ACDB_PORT HRESULT ADESK_STDCALL  | acdbTerminateManagedLayer ()
ACDBCORE2D_PORT Acad::ErrorStatus  | acdbValidateCustomSummaryInfoKey (const wchar_t *key, const AcDbDatabaseSummaryInfo *pInfo=NULL)
 Acad::ErrorStatus  | acedGetCurDwgXrefGraph (AcDbXrefGraph &, Adesk::Boolean includeGhosts=Adesk::kFalse)
 Acad::ErrorStatus  | acutNewString (const ACHAR *pInput, ACHAR *&pOutput)
 Acad::ErrorStatus  | applyCurDwgLayerTableChanges ()
 Acad::ErrorStatus  | AcDbSymbolUtilities::getSymbolName (AcString &sName, AcDbObjectId objId)
 Acad::ErrorStatus  | AcDbSymbolUtilities::getSymbolName (ACHAR *&pName, AcDbObjectId objId)
 void  | modelToPixel (const AcGeMatrix3d &modToPix, const AcGePoint3d &modPt, AcGePoint2d &pixPt)
 void  | modelToPixel (const AcGeVector3d &viewDir, const AcGeMatrix3d &modToPix, const AcGePlane &plane, const AcGePoint3d &modPt, AcGePoint2d &pixPt)
 void  | pixelToModel (const AcGeMatrix3d &pixToMod, const AcGePoint2d &pixPt, AcGePoint3d &modPt)
 Variables
 const Adesk::GsMarker  | kNullSubentIndex = 0
Detailed Description
Function Documentation
 Acad::ErrorStatus acdbGetBreakSubentIndex  |  ( |  AcDbEntity *  |  pEnt,
|  const AcGePoint3d &  |  pickPt,
|  const AcGeVector3d &  |  viewDir,
|  int &  |  subentIndex,
|  AcGePoint3d &  |  ptOnEnt,
|  const AcGeTol &  |  tol = AcGeContext::gTol
)
Warning
Not implemented!
 ACDBCORE2D_PORT AcDbManagedHost* ADESK_STDCALL acdbGetManagedHost  |  ( |   | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus ADESK_STDCALL acdbSetManagedHost  |  ( |  AcDbManagedHost *  |  pHost | )
Warning
Not implemented!
 ACDBCORE2D_PORT Acad::ErrorStatus acdbValidateCustomSummaryInfoKey  |  ( |  const wchar_t *  |  key,
|  const AcDbDatabaseSummaryInfo *  |  pInfo = NULL
)
Warning
Not implemented!