Classes | Macros | Typedefs | Enumerations | Functions
AcRx Classes
 Classes
class  | AcRxAffinityAttribute
class  | AcRxAlternateLocalizedNameAttribute
class  | AcRxArxApp
class  | AcRxAttribute
class  | AcRxAttributeCollection
class  | AcRxBoxedValue
class  | AcRxBoxedValueOnStack
class  | AcRxCategory
class  | AcRxClass
class  | AcRxCollectionProperty
class  | AcRxCollectionPropertyOverrule
class  | AcRxCOMAttribute
class  | AcRxCopyOnWriteObject
class  | AcRxCumulativeAttribute
class  | AcRxDbxApp
class  | AcRxDefaultValueAttribute
class  | AcRxDescriptionAttribute
class  | AcRxDictionary
class  | AcRxDictionaryIterator
class  | AcRxDictionaryProperty
class  | AcRxDisplayAsAttribute
class  | AcRxDLinkerReactor
class  | AcRxDynamicLinker
class  | AcRxDynPropManager
class  | AcRxEnumTag
class  | AcRxEnumType< ValueType >
class  | AcRxEvent
class  | AcRxEventReactor
class  | AcRxFacetProvider
class  | AcRxFilePathAttribute
class  | AcRxFlagsAttribute
class  | AcRxGenerateDynamicPropertiesAttribute
class  | AcRxIndexedProperty
class  | AcRxIterator
class  | AcRxKernel
class  | AcRxLMVAttribute
class  | AcRxLocalizedNameAttribute
class  | AcRxMember
class  | AcRxMemberCollection
class  | AcRxMemberCollectionBuilder
class  | AcRxMemberIterator
class  | AcRxMemberOverrule
class  | AcRxMemberQueryContext
class  | AcRxMemberQueryEngine
class  | AcRxMemberReactor
class  | AcRxMethod
class  | AcRxNonBlittableType< T >
class  | AcRxObject
class  | AcRxOverrule
class  | AcRxOverruleBase
class  | AcRxPromotingQueryContext
class  | AcRxProperty
class  | AcRxPropertyBase
class  | AcRxPropertyOverrule
class  | AcRxProtocolReactor
class  | AcRxProtocolReactorIterator
class  | AcRxProtocolReactorList
class  | AcRxProtocolReactorListIterator
class  | AcRxProtocolReactorManager
class  | AcRxProtocolReactorManagerFactory
class  | AcRxQueryXOverrule
class  | AcRxRefersToAttribute
class  | AcRxResourceInstance
class  | AcRxResourceLoader
class  | AcRxService
class  | AcRxSharedObject
class  | AcRxTypePromotionAttribute
class  | AcRxUiCascadingContextMenuAttribute
class  | AcRxUiPlacementAttribute
class  | AcRxUnitTypeAttribute
class  | AcRxUseDialogForReferredCollectionAttribute
class  | AcRxValue
class  | AcRxValueIterator
class  | AcRxValueType
class  | AcRxValueTypePOD< ValueType >
class  | AcRxVariable
class  | AcRxVariableCache
class  | AcRxVariableChangedEventArgs
class  | AcRxVariableChangingEventArgs
class  | AcRxVariableReactor
class  | AcRxVariablesDictionary
class  | IAcRxEnumeration
class  | IAcRxNonBlittableType
class  | IAcRxObjectValue
class  | IAcRxReferenceType
struct  | AcRxVariable::Range
struct  | AcRxMemberOverrule::Record
 Macros
 #define  | acrxDynamicLinker AcRxDynamicLinker::cast(acrxSysRegistry()->at(ACRX_DYNAMIC_LINKER))
 #define  | acrxEvent AcRxEvent::cast(acrxSysRegistry()->at(ACRX_EVENT_OBJ))
 Typedefs
 typedef bool(*  | ConvertValueCallback) (const AcRxPropertyBase *pProperty, AcRxValue &value)
 typedef const AcRxPropertyBase *(*  | FindPropertyCallback) (const AcRxObject *pObject, const ACHAR *pszPropName)
 typedef void(*  | RxInitFuncPtr) ()
 Enumerations
enum  | OpenMode { kForRead = 0, kForWrite = 1, kForNotify = 2 }
enum  | SecondaryType {
 kSecondaryTypeNone = 0, kSecondaryTypeBoolean = 1, kSecondaryTypeSymbolName = 2, kSecondaryTypeArea = 3,
 kSecondaryTypeDistance = 4, kSecondaryTypeAngle = 5, kSecondaryTypeUnitlessReal = 6, kSecondaryTypeLast = 6
 }
enum  | StorageType {
 kStoragePerSession = 0, kStoragePerUser = 1, kStoragePerProfile = 2, kStoragePerDatabase = 3,
 kStoragePerViewport = 4
 }
enum  | StringFormat { kStringFormatGlobal = 0, kStringFormatCurrent = 1 }
enum  | TypeFlags {
 kTypeFlagsNone = 0, kTypeFlagSpacesAllowed = 1, kTypeFlagDotMeansEmpty = 2, kTypeFlagNoUndo = 4,
 kTypeFlagsChatty = 8, kTypeDeprecated = 16
 }
enum  | UnitType {
 kUnitless = 0, kDistance = (0x1 << 0), kAngle = (0x1 << 1), kArea = (0x1 << 2),
 kVolume = (0x1 << 3), kCurrency = (0x1 << 4), kPercentage = (0x1 << 5), kAngleNotTransformed = (0x1 << 16)
 }
 Functions
ACBASE_PORT Acad::ErrorStatus  | acdbGetLegacyCategoryId (const AcRxCategory *pCategory, int &legacyId)
ACBASE_PORT Acad::ErrorStatus  | acdbSetLegacyCategoryId (AcRxCategory *pCategory, int legacyId)
 ACBASE_PORT void  | acrxBuildClassHierarchy ()
 AcRxDbxApp *  | acrxGetApp ()
AcRxClass *  | acrxQueueClassForInitialization (AcRxClass **pgpDesc, RxInitFuncPtr rxInit)
 ACBASE_PORT void  | deleteAcRxClass (AcRxClass *pClassObj)
 ACBASE_PORT AcRxClass *  | newAcRxClass (const ACHAR *className, const ACHAR *parentClassName, int proxyFlags=0, AcRxObject *(*pseudoConstructor)()=NULL, const ACHAR *dxfName=NULL, const ACHAR *appName=NULL)
 ACBASE_PORT AcRxClass *  | newAcRxClass (const ACHAR *className, const ACHAR *parentClassName, int dwgVer, int maintVer, int proxyFlags=0, AcRxObject *(*pseudoConstructor)()=NULL, const ACHAR *dxfName=NULL, const ACHAR *appName=NULL, AppNameChangeFuncPtr func=NULL)
 ACBASE_PORT AcRxClass *  | newAcRxClass (const ACHAR *className, const ACHAR *parentClassName, int dwgVer, int maintVer, int proxyFlags, AcRxObject *(*pseudoConstructor)(), const ACHAR *dxfName, const ACHAR *appName, AppNameChangeFuncPtr func, AcRxMemberCollectionConstructorPtr makeMembers, void *userData=NULL)
Detailed Description
Function Documentation
 ACBASE_PORT Acad::ErrorStatus acdbGetLegacyCategoryId  |  ( |  const AcRxCategory *  |  pCategory,
|  int &  |  legacyId
)
Warning
Not implemented!
 ACBASE_PORT Acad::ErrorStatus acdbSetLegacyCategoryId  |  ( |  AcRxCategory *  |  pCategory,
|  int  |  legacyId
)
Warning
Not implemented!
 AcRxClass* acrxQueueClassForInitialization  |  ( |  AcRxClass **  |  pgpDesc,
|  RxInitFuncPtr  |  rxInit
)
Warning
Not implemented!