Public Member Functions | Public Attributes | List of all members
AcGsClientViewInfo Struct Reference
AcGs Classes
 Public Member Functions
 AcDbObjectId  | viewportObjectAsObjectId () const
 Public Attributes
 Adesk::LongPtr  | acadWindowId
 AcGiContextualColors *  | contextColors
 AcGiContextualAttributes *  | contextualAttributes
 Adesk::LongPtr  | viewportId
 Adesk::IntDbId  | viewportObjectId
 The documentation for this struct was generated from the following file:
gs.h