Public Attributes | List of all members
AcGridProperty Struct Reference
Structs
 Public Attributes
 AcCmColor  | mColor
 double  | mfDoubleLineSpacing
 AcDbHardPointerId  | mLinetype
 AcDb::GridLineStyle  | mnLineStyle
 AcDb::LineWeight  | mnLineWeight
 AcDb::GridProperty  | mnPropMask
 AcDb::Visibility  | mnVisibility
 The documentation for this struct was generated from the following file:
DbFormattedTableData.h