Public Member Functions | Public Attributes | List of all members
AcRxVariable::Range Struct Reference
AcRx Classes
 Public Member Functions
Range (int lb, int ub)
 Public Attributes
 int  | lowerBound
 int  | upperBound
 The documentation for this struct was generated from the following file:
rxvar.h