Public Types | Public Attributes | List of all members
AcGiRequestScanLines Struct Reference
Structs
 Public Types
enum  | IEColorSystem { kBitonal, kCMY, kCMYK, kRGB }
enum  | IEDitherMethod { kIEAnyPalette, kCustomDithering, kCustomDitheringMethod }
enum  | ImagePaletteType { kFromDevice, kFromIeWholeImage }
 Public Attributes
 union {
 Adesk::Int16 mBackgroundIndex
 Adesk::Int8 mBackgroundRGB [3]
}  | mBackgroundColor
 Adesk::Int16  | mColorDepth = 8
 union {
 Adesk::Int16 mEntityIndex
 Adesk::Int8 mEntityRGB [3]
}  | mEntityColor
 AcGiImageOrg  | mImageOrg
 AcGiImageOrient  | mImageOrient
 Adesk::Int16  | mIsDisplay = 0
 AcGePoint2d  | mLowerLeft
 Adesk::UInt32  | mnContours = 0
 short  | mnThisChunk = 0
 short  | mnTotalChunks = 0
 Adesk::Int32  | mNumRows
 Adesk::Int32  | mPaletteIncarnation = 0
 ImagePaletteType  | mPaletteType
 Adesk::Int32 const *  | mpBoundaryPoints = nullptr
 Adesk::Int32 const *  | mpCounts = nullptr
 void *  | mpDataBuffer = nullptr
 void *  | mpImageId = nullptr
 Adesk::UInt32  | mPixelMaxX = 0
 Adesk::UInt32  | mPixelMaxY = 0
 Adesk::UInt32  | mPixelMinX = 0
 Adesk::UInt32  | mPixelMinY = 0
 AcGeMatrix2d  | mPixelToDc
 Adesk::Int8 *  | mpPalette = nullptr
 double  | mRasterRatio = 1.0
 AcGiRotationFilterType  | mRotationFilterType
 Adesk::Int32  | mRowWidth = 0
 AcGiScaleFilterType  | mScaleFilterType
 AcGiScaleType  | mScalingType
 union {
 Adesk::Int16 mTransparentIndex
 Adesk::Int8 mTransparentRGB [3]
}  | mTransparentColor
 AcGePoint2d  | mUpperRight
 Adesk::Int16  | mWindowId = 0
 The documentation for this struct was generated from the following file:
acgi.h