Public Attributes | List of all members
_OPM_DYNPROP_ENTRY Struct Reference
Structs
 Public Attributes
 AcRxClass *  | pClass
 const CLSID *  | pclsid
 _ATL_CREATORFUNC *  | pfnCreateInstance
 IDynamicProperty *  | pProp
 IPropertySource *  | pPropSrc
 const ACHAR *  | strCmd
 The documentation for this struct was generated from the following file:
dynpropmgr.h