Public Member Functions | Public Attributes | List of all members
AcRxMemberOverrule::Record Struct Reference
AcRx Classes
 Public Member Functions
Record (AcRxMember *pMember, AcRxMemberOverrule *pOverrule)
 Public Attributes
 AcRxMember *  | m_pMember
 AcRxMemberOverrule *  | m_pOverrule
 The documentation for this struct was generated from the following file:
rxmember.h