Public Attributes | List of all members
AcGsDrawableLink Struct Reference
AcGs Classes
 Public Attributes
 Adesk::IntDbId  | id
 AcGiDrawable *  | pDrawable
 AcGsNode *  | pNode
 The documentation for this struct was generated from the following file:
gs.h