Public Attributes | List of all members
_DBX_REGISTER_OBJECT_ENTRY Struct Reference
 Public Attributes
 bool  | bRegistered
 AcRxClass *(*  | desc )()
 void(*  | rxInit )()
 The documentation for this struct was generated from the following file:
dbxEntryPoint.h