Public Attributes | List of all members
AcDbMTextFragment Struct Reference
Structs
 Public Attributes
 const ACHAR *  | bigfont = nullptr
 bool  | bold = false
 double  | capsHeight = 0.0
 AcCmEntityColor  | color
 AcGeVector3d  | direction
 AcGePoint2d  | extents
 const ACHAR *  | font = nullptr
 const ACHAR *  | fontname = nullptr
 bool  | italic = false
 AcGePoint3d  | location
 AcString  | msBigFont
 AcString  | msFont
 AcString  | msFontName
 AcString  | msText
 AcGeVector3d  | normal
 double  | obliqueAngle = 0.0
 unsigned  | overlined:1
 AcGePoint3d  | overPoints [2] = {}
 unsigned  | stackBottom:1
 unsigned  | stackTop:1
 AcGePoint3d  | strikePoints [2] = {}
 unsigned  | strikethrough:1
 const ACHAR *  | text = nullptr
 double  | trackingFactor = 0.0
 unsigned  | underlined:1
 AcGePoint3d  | underPoints [2] = {}
 double  | widthFactor = 0.0
 The documentation for this struct was generated from the following file:
dbmtext.h