Public Types | Public Attributes | List of all members
AcGiSentScanLines Struct Reference
Structs
 Public Types
enum  | IsmRequestStatus {
 eOk, eInvalidInput, eInvalidColorDepth, eInvalidPixelRequest,
 eInvalidDeliveryMethod, eNoValidCompressors, eInsufficientMemory
 }
 Public Attributes
 Adesk::UInt32  | mBytes
 Adesk::Int16  | mHasFailed
 Adesk::Int16  | mIsCancelled
 void *  | mpImageId
 Adesk::Int8 *  | mpPixelBuffer
 IsmRequestStatus  | mRequestStatus
 Adesk::UInt32  | mRowBytes
 The documentation for this struct was generated from the following file:
acgi.h