Public Member Functions | Public Attributes | List of all members
AcCmEntityColor::RGBM Union Reference
AcCm Classes
 Public Member Functions
 Adesk::Int32  | indirect24 () const
 Public Attributes
 Adesk::Int16  | indirect
 struct {
 Adesk::UInt8 blue
 Adesk::UInt8 colorMethod
 Adesk::UInt8 green
 Adesk::UInt8 red
}  | mdata
 Adesk::Int32  | mnIndirect32
 Adesk::UInt32  | whole
 The documentation for this union was generated from the following file:
dbcolor.h