Protocol Extension
Advanced Topics
The following example demonstrates to create a protocol extension .
 The implementation of the setcolor() function for the SETCOLOR command, which allows the user to select an entity and then set different color for that entity.
 circle:set green
 default:set blue
 line:set red
#include <stdlib.h>
#include "rxobject.h"
#include "rxregsvc.h"
#include "rxdlinkr.h"
#include "rxditer.h"
#include "aced.h"
#include "adslib.h"
#include "dbents.h"
#include "dbregion.h"
#include "dbdict.h"
#include "dbsymtb.h"
#include "tchar.h"
void initApp();
void unloadApp();
extern "C"
 AcRx::AppRetCode acrxEntryPoint(AcRx::AppMsgCode, void*);
class ZsdkEntSetColor : public AcRxObject
{
public:
 ACRX_DECLARE_MEMBERS(ZsdkEntSetColor);
 virtual Acad::ErrorStatus setColor(AcDbEntity*) const = 0;
};
ACRX_NO_CONS_DEFINE_MEMBERS(ZsdkEntSetColor, AcRxObject);
class ZsdkDefaultSetColor : public ZsdkEntSetColor
{
public:
 virtual Acad::ErrorStatus setColor(AcDbEntity* pEnt) const;
};
Acad::ErrorStatus
 ZsdkDefaultSetColor::setColor(
 AcDbEntity* pEnt) const
{
 acutPrintf(_T("\nDefault:set blue \n"));
 return pEnt->setColorIndex(5);
}
class ZsdkLineSetColor : public ZsdkEntSetColor
 //
 // ZsdkEntSetColor implementation for Lines.
 //
{
public:
 virtual Acad::ErrorStatus setColor(AcDbEntity* pEnt) const;
};
Acad::ErrorStatus
 ZsdkLineSetColor::setColor(
 AcDbEntity* pEnt) const
{
 AcDbLine *pLine = AcDbLine::cast(pEnt);
 acutPrintf(_T("\nline:set red \n"));
 return pLine->setColorIndex(1);
}
class ZsdkCircleSetColor : public ZsdkEntSetColor
 //
 // ZsdkEntSetColor implementation for circles.
{
public:
 virtual Acad::ErrorStatus setColor(AcDbEntity* pEnt) const;
};
Acad::ErrorStatus
 ZsdkCircleSetColor::setColor(
 AcDbEntity* pEnt) const
{
 AcDbCircle *pCircle = AcDbCircle::cast(pEnt);
 acutPrintf(_T("\ncircle:set green \n"));
 return pCircle->setColorIndex(3);
}
// This function has the user select an entity and then
// calls the setColor() function in the protocol
// extension class attached to that entity's class.
//
void
 setcolor()
{
 AcDbEntity *pEnt;
 AcDbObjectId pEntId;
 ads_name en;
 ads_point pt;
 if (acedEntSel(_T("\nSelect an Entity: "), en, pt)
 != RTNORM)
 {
 acutPrintf(_T("Nothing Selected\n"));
 return;
 }
 acdbGetObjectId(pEntId, en);
 acdbOpenObject(pEnt, pEntId, AcDb::kForWrite);
 // call the protocol extension class's method
 //
 double eTemp = ACRX_X_CALL(pEnt,
 ZsdkEntSetColor)->setColor(pEnt);
 pEnt->close();
}
// Pointers for Protocol Extension Objects. These pointers
// are global so that they can be accessed during
// initialization *and* cleanup
//
ZsdkDefaultSetColor *pDefaultTemp;
ZsdkLineSetColor *pLineTemp;
ZsdkCircleSetColor *pCircleTemp;
void
 initApp()
{
 acrxRegisterService(_T("ZsdkSetColor"));
 ZsdkEntSetColor::rxInit();
 acrxBuildClassHierarchy();
 pDefaultTemp = new ZsdkDefaultSetColor();
 pLineTemp = new ZsdkLineSetColor();
 pCircleTemp = new ZsdkCircleSetColor();
 // Add the protocol extension objects to the appropriate
 // AcRxClass objects
 //
 AcDbEntity::desc()->addX(ZsdkEntSetColor::desc(),
 pDefaultTemp);
 AcDbLine::desc()->addX(ZsdkEntSetColor::desc(),
 pLineTemp);
 AcDbCircle::desc()->addX(ZsdkEntSetColor::desc(),
 pCircleTemp);
 acedRegCmds->addCommand(_T("Zsdk_SetColor_APP"),
 _T("Zsdk_SETCOLOR"), _T("setcolor"), ACRX_CMD_TRANSPARENT,
 setcolor);
}
void
 unloadApp()
{
 delete acrxServiceDictionary->remove(_T("ZsdkSetColor"));
 acedRegCmds->removeGroup(_T("Zsdk_SetColor_APP"));
 AcDbEntity::desc()->delX(ZsdkEntSetColor::desc());
 delete pDefaultTemp;
 AcDbLine::desc()->delX(ZsdkEntSetColor::desc());
 delete pLineTemp;
 AcDbCircle::desc()->delX(ZsdkEntSetColor::desc());
 delete pCircleTemp;
 // Remove the ZsdkEntSetColor class from the ZRX
 // runtime class hierarchy.
 //
 deleteAcRxClass(ZsdkEntSetColor::desc());
}
AcRx::AppRetCode
 acrxEntryPoint(AcRx::AppMsgCode msg, void* appId)
{
 switch (msg) {
 case AcRx::kInitAppMsg:
 acrxDynamicLinker->unlockApplication(appId);
 acrxDynamicLinker->registerAppMDIAware(appId);
 initApp();
 break;
 case AcRx::kUnloadAppMsg:
 unloadApp();
 }
 return AcRx::kRetOK;
}