Modules
Here is a list of all modules:
[detail level 12345]
 ▼ZRX Introductory Concepts
 ▼Overview of ZRX
 System Requirement
 ZRX Directory Tree
 ▶Setting up a ZRX Project Using Microsoft Visual Studio
 Create a ZRX Project by Using Wizard
 Create a ZRX Project Manually
 Migrate an ARX Application to ZRX of ZWCAD
 ▼Database Primer
 Database Overview
 ▶Creating Objects in ZRX
 Creating Entities
 Creating a New Layer
 Adding a Group to the Group Dictionary
 Adding a Dimesion Style to the Symbol Table
 Opening and Closing ZRX Objects
 ▼ZRX Application Basic
 ▶Creating an ZRX Application
 Create a ZRX Project
 Responding to ZWCAD Messages
 Registering new commands
 Loading a ZRX application
 Unloading a ZRX application
 ▶ZRX Commands
 ? --List
 Load
 UnLoad
 Commands
 ▼Database Operations
 Getting Current Database
 Saving a Database
 ReadIn and Populating a Database
 Creating a New Database By Wblock
 Inserting a Database
 Long Transactions
 ▼Database Objects
 Opening and Closing Database Objects
 Deleting Objects
 Database Ownership of Objects
 ▶Adding Object-Specific Data
 Extended Data
 Extension Dictionary
 Erasing Objects
 Object Filing
 Embedded and Encapsulating Objects
 ▼Entities
 ▶Simple Entity
 Draw a Line
 Draw a Polyline
 Create a Text
 ▶Complex Entity
 Create Regions
 Create a Hatch
 ▶Create a Simple Block
 Create a Simple Block Table Record
 Create a Simple Block Table Record with Attribute Definitions
 Creating a Block Reference with Attributes
 ▶Modifiy Entity
 Entity Visibility
 Entity Highlight
 Entity Layer
 Entity Color
 Entity Transform
 ▼Container Objects
 ▶Symbol Tables
 Modifying a Layer Table Record
 Iterating over Tables
 ▶Dictionaries
 Creating a Dictionary
 Groups and the Group Dictionary
 Iterating over Dictionary Entries
 ▶Xrecords
 Xrecord Examples
 ▼Basic Interaction with ZWCAD
 ▼MFC Support in ZRX
 MFC model dialog
 Resource Solution
 Using CAD UI Class
 ▼Selection Set, Entity, and Symbol Table Functions
 ▶Selection Set
 Getting Selection Set
 Filter with Wild Card
 Filter with Compare condition
 Entities information
 Symbol Table
 ▼Plot API
 Plot to a File
 ▼Global Functions for Interacting with ZWCAD
 ▶General Access
 Using acedCmd()
 Pausing for User Input
 Passing Pick Points to ZWCAD Commands
 System Variables
 AutoLISP Symbols
 File Search
 Object Snap
 Viewport Descriptors
 Geometric Utilities
 The Text Box Utility Function
 ▶Getting User Input
 User-Input Functions
 ▶Control of User-Input Function Conditions
 Input Options for User-Input Functions
 Keyword Specifications
 Graphically Dragging Selection Sets.
 User Breaks.
 Returning Values to AutoLISP Functions.
 ▶Conversions
 String Conversions
 Real-World Units
 Character Type Handling
 Coordinate System Transformations
 ▶Display Control
 Interactive Output
 Control of Graphics and Text Screens
 Control of Low-Level Graphics and User Input
 Tablet Calibration
 Wild-Card Matching
 ▼ZRX Global Utility Functions
 ▶Common Characteristics of ZRX Library Functions
 ▶ZRX Global Function Calls Compared to AutoLISP Calls
 Argument Lists in AutoLISP and C
 Memory Management
 Function Return Values versus Function Results
 ▶External Functions
 Defining External Functions
 Evaluating External Functions
 Error Handling Functions
 ▶Communication Between Applications
 Handling Errors from Invoked Functions
 Handling External Applications
 ▶Variables, Types, and Values Defined in ObjectARX
 ▶General Types and Definitions
 Real Numbers And Points
 Transformation Matrices
 Entity and Selection Set Names
 Useful Values
 ▶Result Buffers and Type Codes
 Result Buffers
 Result Type Codes Defined by ObjectARX
 DXF Group Codes
 ZARX Function Result Type Codes
 User-Input Control Bit Codes
 ▶Lists and Other Dynamically Allocated Data
 ▶Result-Buffer Memory Management
 List Creation and Deletion
 AutoLISP Lists
 Entity Lists with DXF Codes in ObjectARX
 Command and Function Invocation Lists
 ▼ZWCAD Command Prompt Standard
 ▶CommandLine Interface
 General Format
 Format for the Current Value Line
 ▶Format for the Command Line Prompt
 Current Instruction
 Descriptive Information
 List of Options
 Default Option
 Context Menu Population
 ▼Custom Objects
 ▼Deriving from AcDbobject
 Header File
 Source File
 ▼Deriving from AcDbEntity
 ▶Custom Entity Data Base
 Header File
 ▶Source File
 ZsdkSign
 ZsdkDB
 Custom Entity UI
 ▼Using AcEdJig
 Header File
 Source File
 ▼Advanced Topics
 ▼Table Linking
 Data Links
 Table Content
 ▼Notification
 Creating an Editor Reactor
 Creating a Database Reactor
 Creating an Object Reactor
 Using a Reactor
 The Multiple Document Interface
 Transaction Management
 Deep Cloning
 Protocol Extension
 ▼Input Point Processing
 ▶Custom Object Snap Modes
 Header File
 Source File
 ▶Input Point Filters and Monitors
 Point Filters
 Input Point Monitors
 Input Context Events
 Application Configuration