Reference Library
BeginDocumentEventArgs Constructor (plotInfo, documentName, copies, plotToFile, fileName)
Namespaces »ZwSoft.ZwCAD.PlottingServices »BeginDocumentEventArgs »BeginDocumentEventArgs(PlotInfo, String, Int32, Boolean, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public BeginDocumentEventArgs(
	PlotInfo plotInfo,
	string documentName,
	int copies,
	bool plotToFile,
	string fileName
)
Public Sub New ( _
	plotInfo As PlotInfo, _
	documentName As String, _
	copies As Integer, _
	plotToFile As Boolean, _
	fileName As String _
)
public:
BeginDocumentEventArgs(
	PlotInfo^ plotInfo,
	String^ documentName,
	int copies,
	bool plotToFile,
	String^ fileName
)
 Parameters
plotInfo(PlotInfo)
documentName(String)
copies(Int32)
plotToFile(Boolean)
fileName(String)
Assembly: ZwManaged (Module: ZwManaged)