Reference Library
Copy Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »Copy()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual DBDictionary Copy()
Protected Overridable Function Copy As DBDictionary
protected:
virtual DBDictionary^ Copy()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)