Reference Library
AddToPlotSettingsDictionary Method (toWhichDatabase)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettings »AddToPlotSettingsDictionary(Database)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AddToPlotSettingsDictionary(
	Database toWhichDatabase
)
Public Sub AddToPlotSettingsDictionary ( _
	toWhichDatabase As Database _
)
public:
void AddToPlotSettingsDictionary(
	Database^ toWhichDatabase
)
 Parameters
toWhichDatabase(Database)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)