Reference Library
Point Property
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve3d »Point
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d Point { get; }
Public ReadOnly Property Point As Point3d
	Get
public:
property Point3d Point {
	Point3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)