Reference Library
Magnitude Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »StereoParameters »Magnitude
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Magnitude { get; }
Public ReadOnly Property Magnitude As Double
	Get
public:
property double Magnitude {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)