Reference Library
Utils Constructor
Namespaces »ZwSoft.ZwCAD.Internal »Utils »Utils()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Utils()
Public Sub New
public:
Utils()
Assembly: ZwManaged (Module: ZwManaged)