Reference Library
IntersectWith Method
Namespaces »ZwSoft.ZwCAD.Geometry »LineSegment3d »IntersectWith()
 Members
Icon | Member | Description
IntersectWith(PlanarEntity, Tolerance)
IntersectWith(LinearEntity3d, Tolerance)
IntersectWith(PlanarEntity)
IntersectWith(LinearEntity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)