Reference Library
GridSubdivisionRestricted Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewportTableRecord »GridSubdivisionRestricted
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool GridSubdivisionRestricted { get; set; }
Public Property GridSubdivisionRestricted As Boolean
	Get
	Set
public:
property bool GridSubdivisionRestricted {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)