Reference Library
BackClipZ Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ClipBoundary »BackClipZ
 Declaration Syntax
C# | Visual Basic | Visual C++
public double BackClipZ { get; set; }
Public Property BackClipZ As Double
	Get
	Set
public:
property double BackClipZ {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)