Reference Library
MLeader Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbMLeader")]
public class MLeader : Entity
<WrapperAttribute("AcDbMLeader")> _
Public Class MLeader _
	Inherits Entity
[WrapperAttribute(L"AcDbMLeader")]
public ref class MLeader : public Entity
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
MLeader()
MLeader(IntPtr, Boolean)
AddFirstVertex(Int32, Point3d)
AddLastVertex(Int32, Point3d)
AddLeader()
AddLeaderLine(Int32)
AddLeaderLine(Point3d)
ArrowSize
ArrowSymbolId
BlockColor
BlockConnectionType
BlockContentId
BlockPosition
BlockRotation
BlockScale
ConnectionPoint(Vector3d, TextAttachmentDirection)
ConnectionPoint(Vector3d)
ContentType
DoglegLength
EnableAnnotationScale
EnableDogleg
EnableFrameText
EnableLanding
GetArrowSize(Int32)
GetArrowSymbolId(Int32)
GetBlockAttribute(ObjectId)
GetContentGeomExtents()
getContextDataManager()
GetDogleg(Int32)
GetDoglegLength(Int32)
GetFirstVertex(Int32)
GetLastVertex(Int32)
GetLeaderIndex(Int32)
GetLeaderIndexes()
GetLeaderLineColor(Int32)
GetLeaderLineIndexes(Int32)
GetLeaderLineType(Int32)
GetLeaderLineTypeId(Int32)
GetLeaderLineWeight(Int32)
getOverridedMLeaderStyle(MLeaderStyle)
GetPlane() |  (Overrides Entity.GetPlane().)
GetTextAttachmentType(LeaderDirectionType)
GetVertex(Int32, Int32)
HasContent()
LandingGap
LeaderCount |  Obsolete.
LeaderLineColor
LeaderLineCount |  Obsolete.
LeaderLineType
LeaderLineTypeId
LeaderLineWeight
MLeaderStyle
MLeaderText
MoveMLeader(Vector3d, MoveType)
MText
Normal
PostMLeaderToDb(Database)
recomputeBreakPoints()
RemoveFirstVertex(Int32)
RemoveLastVertex(Int32)
RemoveLeader(Int32)
RemoveLeaderLine(Int32)
SetArrowSize(Int32, Double)
SetArrowSymbolId(Int32, ObjectId)
SetBlockAttribute(ObjectId, AttributeReference)
SetContextDataManager(IntPtr)
SetDogleg(Int32, Vector3d)
SetDoglegLength(Int32, Double)
SetFirstVertex(Int32, Point3d)
SetLastVertex(Int32, Point3d)
SetLeaderLineColor(Int32, Color)
SetLeaderLineType(Int32, LeaderType)
SetLeaderLineTypeId(Int32, ObjectId)
SetLeaderLineWeight(Int32, LineWeight)
SetPlane(Plane)
SetTextAttachmentType(TextAttachmentType, LeaderDirectionType)
SetVertex(Int32, Int32, Point3d)
TextAlignmentType
TextAngleType
TextAttachmentDirection
TextAttachmentType
TextColor
TextHeight
TextLocation
TextStyleId
ToleranceLocation
VerticesCount(Int32)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | MLeader
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)