Reference Library
StartUndoRecord Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »StartUndoRecord()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void StartUndoRecord()
Public Sub StartUndoRecord
public:
void StartUndoRecord()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)