Reference Library
XLine1Start Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LineAngularDimension2 »XLine1Start
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d XLine1Start { get; set; }
Public Property XLine1Start As Point3d
	Get
	Set
public:
property Point3d XLine1Start {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)