Reference Library
Alignment Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »Alignment
 Declaration Syntax
C# | Visual Basic | Visual C++
public Nullable<CellAlignment> Alignment { get; set; }
Public Property Alignment As Nullable(Of CellAlignment)
	Get
	Set
public:
property Nullable<CellAlignment> Alignment {
	Nullable<CellAlignment> get ();
	void set (Nullable<CellAlignment> value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)