Reference Library
CopyTo Method (array, size)
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdEntryCollection »CopyTo(Array, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void CopyTo(
	Array array,
	int size
)
Public Overridable Sub CopyTo ( _
	array As Array, _
	size As Integer _
)
public:
virtual void CopyTo(
	Array^ array,
	int size
)
 Parameters
array(Array)
size(Int32)
Assembly: ZwManaged (Module: ZwManaged)