Reference Library
ReadOnly Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicBlockReferenceProperty »ReadOnly
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool ReadOnly { get; }
Public ReadOnly Property ReadOnly As Boolean
	Get
public:
property bool ReadOnly {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)