Reference Library
ColorNameForDisplay Property
Namespaces »ZwSoft.ZwCAD.Colors »Color »ColorNameForDisplay
 Declaration Syntax
C# | Visual Basic | Visual C++
public string ColorNameForDisplay { get; }
Public ReadOnly Property ColorNameForDisplay As String
	Get
public:
property String^ ColorNameForDisplay {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)