Reference Library
ArrowSymbolId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »ArrowSymbolId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId ArrowSymbolId { get; set; }
Public Property ArrowSymbolId As ObjectId
	Get
	Set
public:
property ObjectId ArrowSymbolId {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)