Reference Library
ExternalSurface Constructor (surfaceDefinition, surfaceKind)
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalSurface »ExternalSurface(IntPtr, ExternalEntityKind)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ExternalSurface(
	IntPtr surfaceDefinition,
	ExternalEntityKind surfaceKind
)
Public Sub New ( _
	surfaceDefinition As IntPtr, _
	surfaceKind As ExternalEntityKind _
)
public:
ExternalSurface(
	IntPtr surfaceDefinition,
	ExternalEntityKind surfaceKind
)
 Parameters
surfaceDefinition(IntPtr)
surfaceKind(ExternalEntityKind)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)