Reference Library
GetOrthoProjectEntity Method
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity3d »GetOrthoProjectEntity()
 Members
Icon | Member | Description
GetOrthoProjectEntity(Plane, Tolerance)
GetOrthoProjectEntity(Plane)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)