Reference Library
DimensionCenterMarkType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimensionCenterMarkType
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum DimensionCenterMarkType
Public Enumeration DimensionCenterMarkType
public enum class DimensionCenterMarkType
 Members
Member | Description
Mark
Line
None
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)