Reference Library
SelectedObject Constructor (id, subSelections)
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectedObject »SelectedObject(ObjectId, SelectedSubObject[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public SelectedObject(
	ObjectId id,
	SelectedSubObject[] subSelections
)
Public Sub New ( _
	id As ObjectId, _
	subSelections As SelectedSubObject() _
)
public:
SelectedObject(
	ObjectId id,
	array<SelectedSubObject^>^ subSelections
)
 Parameters
id(ObjectId)
subSelections(SelectedSubObject[])
Assembly: ZwManaged (Module: ZwManaged)