Reference Library
CreateSectionObjects Method (sectionPlane)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Surface »CreateSectionObjects(Plane)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Entity[] CreateSectionObjects(
	Plane sectionPlane
)
Public Overridable Function CreateSectionObjects ( _
	sectionPlane As Plane _
) As Entity()
public:
virtual array<Entity^>^ CreateSectionObjects(
	Plane^ sectionPlane
)
 Parameters
sectionPlane(Plane)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)