Reference Library
CustomProperties Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DatabaseSummaryInfoBuilder »CustomProperties
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use CustomPropertyTable instead")]
public StringDictionary CustomProperties { get; }
<ObsoleteAttribute("Use CustomPropertyTable instead")> _
Public ReadOnly Property CustomProperties As StringDictionary
	Get
[ObsoleteAttribute(L"Use CustomPropertyTable instead")]
public:
property StringDictionary^ CustomProperties {
	StringDictionary^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)