Reference Library
RowSpacing Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MInsertBlock »RowSpacing
 Declaration Syntax
C# | Visual Basic | Visual C++
public double RowSpacing { get; set; }
Public Property RowSpacing As Double
	Get
	Set
public:
property double RowSpacing {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)