Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdEntryCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Object this[
	int index
] { get; set; }
Public Overridable Default Property Item ( _
	index As Integer _
) As Object
	Get
	Set
public:
virtual property Object^ default[int index] {
	Object^ get (int index);
	void set (int index, Object^ value);
}
 Parameters
index(Int32)
Assembly: ZwManaged (Module: ZwManaged)