Reference Library
FirstSegmentAngleConstraint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeaderStyle »FirstSegmentAngleConstraint
 Declaration Syntax
C# | Visual Basic | Visual C++
public AngleConstraint FirstSegmentAngleConstraint { get; set; }
Public Property FirstSegmentAngleConstraint As AngleConstraint
	Get
	Set
public:
property AngleConstraint FirstSegmentAngleConstraint {
	AngleConstraint get ();
	void set (AngleConstraint value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)