Reference Library
LightingQuality Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »LightingQuality
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum LightingQuality
Public Enumeration LightingQuality
public enum class LightingQuality
 Members
Member | Description
PerVertexLighting
PerFaceLighting
NoLighting
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)