Reference Library
ObjectClosed Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »ObjectClosed
 Declaration Syntax
C# | Visual Basic | Visual C++
public event ObjectClosedEventHandler ObjectClosed
Public Event ObjectClosed As ObjectClosedEventHandler
public:
 event ObjectClosedEventHandler^ ObjectClosed {
	void add (ObjectClosedEventHandler^ value);
	void remove (ObjectClosedEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)