Reference Library
RevolveAngle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolvedSurface »RevolveAngle
 Declaration Syntax
C# | Visual Basic | Visual C++
public double RevolveAngle { get; set; }
Public Property RevolveAngle As Double
	Get
	Set
public:
property double RevolveAngle {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)