Reference Library
Dimclrd Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimclrd
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Color Dimclrd { get; set; }
Public Overridable Property Dimclrd As Color
	Get
	Set
public:
virtual property Color^ Dimclrd {
	Color^ get ();
	void set (Color^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)