Reference Library
IsAnonymous Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockTableRecord »IsAnonymous
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsAnonymous { get; }
Public ReadOnly Property IsAnonymous As Boolean
	Get
public:
property bool IsAnonymous {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)