Reference Library
Create Method (unmanagedPointer, autoDelete, autoCADView)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »Create(IntPtr, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static View Create(
	IntPtr unmanagedPointer,
	bool autoDelete,
	bool autoCADView
)
Public Shared Function Create ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean, _
	autoCADView As Boolean _
) As View
public:
static View^ Create(
	IntPtr unmanagedPointer,
	bool autoDelete,
	bool autoCADView
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
autoCADView(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)