Reference Library
Rotation Method (angle, center)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2d »Rotation(Double, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Matrix2d Rotation(
	double angle,
	Point2d center
)
Public Shared Function Rotation ( _
	angle As Double, _
	center As Point2d _
) As Matrix2d
public:
static Matrix2d Rotation(
	double angle,
	Point2d center
)
 Parameters
angle(Double)
center(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)