Reference Library
Cone Class
Namespaces »ZwSoft.ZwCAD.Geometry »Cone
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeCone")]
public sealed class Cone : Surface
<WrapperAttribute("ZcGeCone")> _
Public NotInheritable Class Cone _
	Inherits Surface
[WrapperAttribute(L"ZcGeCone")]
public ref class Cone sealed : public Surface
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Cone(Double, Double, Point3d, Double, Vector3d, Vector3d, Interval, Double, Double)
Cone(Double, Double, Point3d, Double, Vector3d)
Cone()
Apex
AxisOfSymmetry
BaseCenter
BaseRadius
Create(IntPtr, Boolean)
GetAngles()
GetHalfAngles()
GetHeightAt(Double)
HalfAngle
Height
IntersectWith(LinearEntity3d, Tolerance)
IntersectWith(LinearEntity3d)
IsClosed(Tolerance)
IsClosed()
IsOuterNormal
ReferenceAxis
Set(Double, Double, Point3d, Double, Vector3d, Vector3d, Interval, Double, Double)
Set(Double, Double, Point3d, Double, Vector3d)
SetAngles(Double, Double)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity3d
|  |  | Surface
|  |  |  | Cone
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)