Reference Library
Erased Method (pObj, erasing)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimAssoc »Erased(DBObject, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Erased(
	DBObject pObj,
	bool erasing
)
Public Sub Erased ( _
	pObj As DBObject, _
	erasing As Boolean _
)
public:
void Erased(
	DBObject^ pObj,
	bool erasing
)
 Parameters
pObj(DBObject)
erasing(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)