Reference Library
IsPerpendicularTo Method (line, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity3d »IsPerpendicularTo(LinearEntity3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPerpendicularTo(
	LinearEntity3d line,
	Tolerance tolerance
)
Public Function IsPerpendicularTo ( _
	line As LinearEntity3d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsPerpendicularTo(
	LinearEntity3d^ line,
	Tolerance tolerance
)
 Parameters
line(LinearEntity3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)