Reference Library
AlternateFontName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HostApplicationServices »AlternateFontName
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string AlternateFontName { get; }
Public Overridable ReadOnly Property AlternateFontName As String
	Get
public:
virtual property String^ AlternateFontName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)