Reference Library
FilerStatus Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DxfFiler »FilerStatus
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract ErrorStatus FilerStatus { get; set; }
Public MustOverride Property FilerStatus As ErrorStatus
	Get
	Set
public:
virtual property ErrorStatus FilerStatus {
	ErrorStatus get () abstract;
	void set (ErrorStatus value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)