Reference Library
On Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »LightTraits »On
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool On { get; set; }
Public MustOverride Property On As Boolean
	Get
	Set
public:
virtual property bool On {
	bool get () abstract;
	void set (bool value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)