Reference Library
Delete Method (name)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »IConfigurationSection »Delete(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
void Delete(
	string name
)
Sub Delete ( _
	name As String _
)
void Delete(
	String^ name
)
 Parameters
name(String)
Assembly: ZwManaged (Module: ZwManaged)