Reference Library
ModuleLoadAborted Event
Namespaces »ZwSoft.ZwCAD.Runtime »DynamicLinker »ModuleLoadAborted
 Declaration Syntax
C# | Visual Basic | Visual C++
public event ModuleLoadAbortedEventHandler ModuleLoadAborted
Public Event ModuleLoadAborted As ModuleLoadAbortedEventHandler
public:
 event ModuleLoadAbortedEventHandler^ ModuleLoadAborted {
	void add (ModuleLoadAbortedEventHandler^ value);
	void remove (ModuleLoadAbortedEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)