Reference Library
Contains Method (value)
Namespaces »ZwSoft.ZwCAD.Colors »TransparencyCollection »Contains(Transparency)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Contains(
	Transparency value
)
Public Function Contains ( _
	value As Transparency _
) As Boolean
public:
virtual bool Contains(
	Transparency value
) sealed
 Parameters
value(Transparency)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)