Reference Library
Shadedif Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Shadedif
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Shadedif { get; set; }
Public Property Shadedif As Integer
	Get
	Set
public:
property int Shadedif {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)