Reference Library
EnableBackClip Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »EnableBackClip
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool EnableBackClip { get; set; }
Public Property EnableBackClip As Boolean
	Get
	Set
public:
property bool EnableBackClip {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)