Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RowsCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public Row this[
	int index
] { get; }
Public ReadOnly Default Property Item ( _
	index As Integer _
) As Row
	Get
public:
property Row^ default[int index] {
	Row^ get (int index);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)