Reference Library
Name Property
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionSetDelayMarshalled »Name
 Declaration Syntax
C# | Visual Basic | Visual C++
public ZdsName Name { get; }
Public ReadOnly Property Name As ZdsName
	Get
public:
property ZdsName Name {
	ZdsName get ();
}
Assembly: ZwManaged (Module: ZwManaged)