Reference Library
Green Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PixelBGRA32 »Green
 Declaration Syntax
C# | Visual Basic | Visual C++
public byte Green { get; set; }
Public Property Green As Byte
	Get
	Set
public:
property unsigned char Green {
	unsigned char get ();
	void set (unsigned char value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)