Reference Library
DwfFileName Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishEventArgs »DwfFileName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string DwfFileName { get; }
Public ReadOnly Property DwfFileName As String
	Get
public:
property String^ DwfFileName {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)