Reference Library
Value Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCell »Value
 Declaration Syntax
C# | Visual Basic | Visual C++
public Object Value { get; }
Public ReadOnly Property Value As Object
	Get
public:
property Object^ Value {
	Object^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)