Reference Library
Units Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Units
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiRasterImage::Units")]
public enum Units
<WrapperAttribute("ZcGiRasterImage::Units")> _
Public Enumeration Units
[WrapperAttribute(L"ZcGiRasterImage::Units")]
public enum class Units
 Members
Member | Description
Parsecs
LightYears
Astronomical
Gigameters
Hectometers
Dekameters
Decimeters
Microns
Nanometers
Angstroms
Mils
Microinches
Mile
Yard
Foot
Inch
Kilometer
Meter
Centimeter
Millimeter
None
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)