Reference Library
ColorDialog Constructor
Namespaces »ZwSoft.ZwCAD.Windows »ColorDialog »ColorDialog()
 Declaration Syntax
C# | Visual Basic | Visual C++
public ColorDialog()
Public Sub New
public:
ColorDialog()
Assembly: ZwManaged (Module: ZwManaged)