Reference Library
LayerStateRestored Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »LayerStateRestored
 Declaration Syntax
C# | Visual Basic | Visual C++
public event LayerStateEventHandler LayerStateRestored
Public Event LayerStateRestored As LayerStateEventHandler
public:
 event LayerStateEventHandler^ LayerStateRestored {
	void add (LayerStateEventHandler^ value);
	void remove (LayerStateEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)