Reference Library
Jig Class
Namespaces »ZwSoft.ZwCAD.EditorInput »Jig
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract class Jig
Public MustInherit Class Jig
public ref class Jig abstract
 Members
All Members | Methods
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
GetDynamicDimensionData(Double)
OnDimensionValueChanged(DynamicDimensionChangedEventArgs)
Sampler(JigPrompts)
 Inheritance Hierarchy
Object
Jig
| DrawJig
| EntityJig
Assembly: ZwManaged (Module: ZwManaged)