Reference Library
SubWorldDraw Method (wd)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Drawable »SubWorldDraw(WorldDraw)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal abstract bool SubWorldDraw(
	WorldDraw wd
)
Protected Friend MustOverride Function SubWorldDraw ( _
	wd As WorldDraw _
) As Boolean
protected public:
virtual bool SubWorldDraw(
	WorldDraw^ wd
) abstract
 Parameters
wd(WorldDraw)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)