Reference Library
Pan Method (x, y)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »Pan(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Pan(
	double x,
	double y
)
Public Sub Pan ( _
	x As Double, _
	y As Double _
)
public:
void Pan(
	double x,
	double y
)
 Parameters
x(Double)
y(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)