Reference Library
FullDwgVersion Constructor (majorVersion, minorVersion)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FullDwgVersion »FullDwgVersion(DwgVersion, MaintenanceReleaseVersion)
 Declaration Syntax
C# | Visual Basic | Visual C++
public FullDwgVersion(
	DwgVersion majorVersion,
	MaintenanceReleaseVersion minorVersion
)
Public Sub New ( _
	majorVersion As DwgVersion, _
	minorVersion As MaintenanceReleaseVersion _
)
public:
FullDwgVersion(
	DwgVersion majorVersion,
	MaintenanceReleaseVersion minorVersion
)
 Parameters
majorVersion(DwgVersion)
minorVersion(MaintenanceReleaseVersion)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)