Reference Library
AddRange Method (range)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3dCollection »AddRange(Vector3d[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AddRange(
	Vector3d[] range
)
Public Sub AddRange ( _
	range As Vector3d() _
)
public:
virtual void AddRange(
	array<Vector3d>^ range
) sealed
 Parameters
range(Vector3d[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)