Reference Library
Set Method
Namespaces »ZwSoft.ZwCAD.Geometry »CurveCurveIntersector3d »Set()
 Members
Icon | Member | Description
Set(Curve3d, Curve3d, Interval, Interval, Vector3d, Tolerance)
Set(Curve3d, Curve3d, Interval, Interval, Vector3d)
Set(Curve3d, Curve3d, Vector3d, Tolerance)
Set(Curve3d, Curve3d, Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)