Reference Library
TotalAngle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Arc »TotalAngle
 Declaration Syntax
C# | Visual Basic | Visual C++
public double TotalAngle { get; }
Public ReadOnly Property TotalAngle As Double
	Get
public:
property double TotalAngle {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)