Reference Library
DefaultContrast Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayReference »DefaultContrast
 Declaration Syntax
C# | Visual Basic | Visual C++
public static int DefaultContrast { get; }
Public Shared ReadOnly Property DefaultContrast As Integer
	Get
public:
static property int DefaultContrast {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)