Reference Library
FrontClipDistance Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »FrontClipDistance
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public double FrontClipDistance { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Property FrontClipDistance As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
property double FrontClipDistance {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)