Reference Library
SelectCrossingWindow Method (pt1, pt2, filter, forceSubEntitySelection)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »SelectCrossingWindow(Point3d, Point3d, SelectionFilter, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptSelectionResult SelectCrossingWindow(
	Point3d pt1,
	Point3d pt2,
	SelectionFilter filter,
	bool forceSubEntitySelection
)
Public Function SelectCrossingWindow ( _
	pt1 As Point3d, _
	pt2 As Point3d, _
	filter As SelectionFilter, _
	forceSubEntitySelection As Boolean _
) As PromptSelectionResult
public:
PromptSelectionResult^ SelectCrossingWindow(
	Point3d pt1,
	Point3d pt2,
	SelectionFilter^ filter,
	bool forceSubEntitySelection
)
 Parameters
pt1(Point3d)
pt2(Point3d)
filter(SelectionFilter)
forceSubEntitySelection(Boolean)
Assembly: ZwManaged (Module: ZwManaged)