Reference Library
Dimasz Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Leader »Dimasz
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public virtual double Dimasz { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Overridable Property Dimasz As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
virtual property double Dimasz {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)