Reference Library
NurbCurve2d Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »NurbCurve2d()
 Declaration Syntax
C# | Visual Basic | Visual C++
public NurbCurve2d()
Public Sub New
public:
NurbCurve2d()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)