Reference Library
DimensionStyleName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »DimensionStyleName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string DimensionStyleName { get; set; }
Public Property DimensionStyleName As String
	Get
	Set
public:
property String^ DimensionStyleName {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)