Reference Library
DynamicLinker Property
Namespaces »ZwSoft.ZwCAD.Runtime »SystemObjects »DynamicLinker
 Declaration Syntax
C# | Visual Basic | Visual C++
public static DynamicLinker DynamicLinker { get; }
Public Shared ReadOnly Property DynamicLinker As DynamicLinker
	Get
public:
static property DynamicLinker^ DynamicLinker {
	DynamicLinker^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)