Reference Library
GIPhotonsPerLight Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraits »GIPhotonsPerLight
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract int GIPhotonsPerLight { get; set; }
Public MustOverride Property GIPhotonsPerLight As Integer
	Get
	Set
public:
virtual property int GIPhotonsPerLight {
	int get () abstract;
	void set (int value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)