Reference Library
GripDataCollection Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripDataCollection
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbGripDataPtrArray")]
public sealed class GripDataCollection : DisposableWrapper,
	ICollection<GripData>
<WrapperAttribute("ZcDbGripDataPtrArray")> _
Public NotInheritable Class GripDataCollection _
	Inherits DisposableWrapper _
	Implements ICollection(Of GripData)
[WrapperAttribute(L"ZcDbGripDataPtrArray")]
public ref class GripDataCollection sealed : public DisposableWrapper,
	ICollection<GripData^>
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
GripDataCollection()
Add(GripData)
Clear()
Contains(GripData)
CopyTo(GripData[], Int32)
Count
GetEnumerator()
IEnumerable.GetEnumerator()
IsReadOnly
Item[Int32]
Remove(GripData)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | GripDataCollection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)