Reference Library
GetKnotAt Method (index)
Namespaces »ZwSoft.ZwCAD.Geometry »SplineEntity2d »GetKnotAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetKnotAt(
	int index
)
Public Function GetKnotAt ( _
	index As Integer _
) As Double
public:
double GetKnotAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)