Reference Library
UserName Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »WhoHasInfo »UserName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string UserName { get; }
Public ReadOnly Property UserName As String
	Get
public:
property String^ UserName {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)