Reference Library
m_pLayoutToBeRemoved Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »m_pLayoutToBeRemoved
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayoutEventHandler m_pLayoutToBeRemoved
Public m_pLayoutToBeRemoved As LayoutEventHandler
public:
LayoutEventHandler^ m_pLayoutToBeRemoved
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)