Reference Library
Vertical Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »TextStyle »Vertical
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Vertical { get; set; }
Public Property Vertical As Boolean
	Get
	Set
public:
property bool Vertical {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)