Reference Library
SetOrientation Method (norm, dir)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FeatureControlFrame »SetOrientation(Vector3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetOrientation(
	Vector3d norm,
	Vector3d dir
)
Public Overridable Sub SetOrientation ( _
	norm As Vector3d, _
	dir As Vector3d _
)
public:
virtual void SetOrientation(
	Vector3d norm,
	Vector3d dir
)
 Parameters
norm(Vector3d)
dir(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)