Reference Library
IsOwnerOfSurface Property
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalSurface »IsOwnerOfSurface
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsOwnerOfSurface { get; }
Public ReadOnly Property IsOwnerOfSurface As Boolean
	Get
public:
property bool IsOwnerOfSurface {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)