Reference Library
TopRadius Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Helix »TopRadius
 Declaration Syntax
C# | Visual Basic | Visual C++
public double TopRadius { get; set; }
Public Property TopRadius As Double
	Get
	Set
public:
property double TopRadius {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)