Reference Library
AddPageResourceRange Method (resources)
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »AddPageResourceRange(EPlotResource[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AddPageResourceRange(
	EPlotResource[] resources
)
Public Sub AddPageResourceRange ( _
	resources As EPlotResource() _
)
public:
void AddPageResourceRange(
	array<EPlotResource^>^ resources
)
 Parameters
resources(EPlotResource[])
Assembly: ZwManaged (Module: ZwManaged)