Reference Library
ConvertToStaticBlock Method (newBlockName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockReference »ConvertToStaticBlock(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void ConvertToStaticBlock(
	string newBlockName
)
Public Overridable Sub ConvertToStaticBlock ( _
	newBlockName As String _
)
public:
virtual void ConvertToStaticBlock(
	String^ newBlockName
)
 Parameters
newBlockName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)