Reference Library
SamplingContrastColor Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraits »SamplingContrastColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract MentalRayRenderSettingsTraitsFloatParameter SamplingContrastColor { get; set; }
Public MustOverride Property SamplingContrastColor As MentalRayRenderSettingsTraitsFloatParameter
	Get
	Set
public:
virtual property MentalRayRenderSettingsTraitsFloatParameter SamplingContrastColor {
	MentalRayRenderSettingsTraitsFloatParameter get () abstract;
	void set (MentalRayRenderSettingsTraitsFloatParameter value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)