Reference Library
Dimsd1 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimsd1
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool Dimsd1 { get; set; }
Public Overridable Property Dimsd1 As Boolean
	Get
	Set
public:
virtual property bool Dimsd1 {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)