Reference Library
DataCell Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCell
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbDataCell")]
public sealed class DataCell : RXObject
<WrapperAttribute("ZcDbDataCell")> _
Public NotInheritable Class DataCell _
	Inherits RXObject
[WrapperAttribute(L"ZcDbDataCell")]
public ref class DataCell sealed : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DataCell()
CellType
Init()
SetBool(Boolean)
SetDouble(Double)
SetHardOwnershipId(ObjectId)
SetHardPointerId(ObjectId)
SetInteger(Int32)
SetObjectId(ObjectId)
SetPoint(Point3d)
SetSoftOwnershipId(ObjectId)
SetSoftPointerId(ObjectId)
SetString(String)
SetVector(Vector3d)
Value
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | DataCell
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)