Reference Library
ChamferEdges Method (subentityIds, baseSubentityId, baseDist, otherDist)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Surface »ChamferEdges(SubentityId[], SubentityId, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void ChamferEdges(
	SubentityId[] subentityIds,
	SubentityId baseSubentityId,
	double baseDist,
	double otherDist
)
Public Overridable Sub ChamferEdges ( _
	subentityIds As SubentityId(), _
	baseSubentityId As SubentityId, _
	baseDist As Double, _
	otherDist As Double _
)
public:
virtual void ChamferEdges(
	array<SubentityId>^ subentityIds,
	SubentityId baseSubentityId,
	double baseDist,
	double otherDist
)
 Parameters
subentityIds(SubentityId[])
baseSubentityId(SubentityId)
baseDist(Double)
otherDist(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)