Reference Library
DestPonints Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MeshPointMaps »DestPonints
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2dCollection DestPonints { get; set; }
Public Property DestPonints As Point2dCollection
	Get
	Set
public:
property Point2dCollection^ DestPonints {
	Point2dCollection^ get ();
	void set (Point2dCollection^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)