Reference Library
Face Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Face
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbFace")]
public class Face : Entity
<WrapperAttribute("AcDbFace")> _
Public Class Face _
	Inherits Entity
[WrapperAttribute(L"AcDbFace")]
public ref class Face : public Entity
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Face(Point3d, Point3d, Point3d, Point3d, Boolean, Boolean, Boolean, Boolean)
Face(Point3d, Point3d, Point3d, Boolean, Boolean, Boolean, Boolean)
Face()
Face(IntPtr, Boolean)
GetVertexAt(Int16)
IsEdgeVisibleAt(Int16)
MakeEdgeInvisibleAt(Int16)
MakeEdgeVisibleAt(Int16)
SetVertexAt(Int16, Point3d)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Face
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)