Reference Library
DataType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »DataType
 Declaration Syntax
C# | Visual Basic | Visual C++
public Nullable<DataTypeParameter> DataType { get; set; }
Public Property DataType As Nullable(Of DataTypeParameter)
	Get
	Set
public:
property Nullable<DataTypeParameter> DataType {
	Nullable<DataTypeParameter> get ();
	void set (Nullable<DataTypeParameter> value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)