Reference Library
Set Method (majorRadius, minorRadius, origin, axisOfSymmetry, refAxis, startAngleU, endAngleU, startAngleV, endAngleV)
Namespaces »ZwSoft.ZwCAD.Geometry »Torus »Set(Double, Double, Point3d, Vector3d, Vector3d, Double, Double, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	double majorRadius,
	double minorRadius,
	Point3d origin,
	Vector3d axisOfSymmetry,
	Vector3d refAxis,
	double startAngleU,
	double endAngleU,
	double startAngleV,
	double endAngleV
)
Public Sub Set ( _
	majorRadius As Double, _
	minorRadius As Double, _
	origin As Point3d, _
	axisOfSymmetry As Vector3d, _
	refAxis As Vector3d, _
	startAngleU As Double, _
	endAngleU As Double, _
	startAngleV As Double, _
	endAngleV As Double _
)
public:
void Set(
	double majorRadius,
	double minorRadius,
	Point3d origin,
	Vector3d axisOfSymmetry,
	Vector3d refAxis,
	double startAngleU,
	double endAngleU,
	double startAngleV,
	double endAngleV
)
 Parameters
majorRadius(Double)
minorRadius(Double)
origin(Point3d)
axisOfSymmetry(Vector3d)
refAxis(Vector3d)
startAngleU(Double)
endAngleU(Double)
startAngleV(Double)
endAngleV(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)