Reference Library
WorldDraw Method (wd)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Drawable »WorldDraw(WorldDraw)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool WorldDraw(
	WorldDraw wd
)
Public Function WorldDraw ( _
	wd As WorldDraw _
) As Boolean
public:
bool WorldDraw(
	WorldDraw^ wd
)
 Parameters
wd(WorldDraw)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)