Reference Library
Insert Method (index, value)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »LinetypeCollection »Insert(Int32, Linetype)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Insert(
	int index,
	Linetype value
)
Public Sub Insert ( _
	index As Integer, _
	value As Linetype _
)
public:
void Insert(
	int index,
	Linetype value
)
 Parameters
index(Int32)
value(Linetype)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)