Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.Geometry »Point2dCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d this[
	int index
] { get; set; }
Public Default Property Item ( _
	index As Integer _
) As Point2d
	Get
	Set
public:
property Point2d default[int index] {
	Point2d get (int index);
	void set (int index, Point2d value);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)