Reference Library
MoveToBottom Method (collection)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DrawOrderTable »MoveToBottom(ObjectIdCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void MoveToBottom(
	ObjectIdCollection collection
)
Public Sub MoveToBottom ( _
	collection As ObjectIdCollection _
)
public:
void MoveToBottom(
	ObjectIdCollection^ collection
)
 Parameters
collection(ObjectIdCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)