Reference Library
Max Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraitsDoubleRangeParameter »Max
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Max { get; }
Public ReadOnly Property Max As Double
	Get
public:
property double Max {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)