Reference Library
IsShapeFile Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TextStyleTableRecord »IsShapeFile
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsShapeFile { get; set; }
Public Property IsShapeFile As Boolean
	Get
	Set
public:
property bool IsShapeFile {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)