Reference Library
GetGeCurve Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »GetGeCurve()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Curve3d GetGeCurve()
Public Function GetGeCurve As Curve3d
public:
Curve3d^ GetGeCurve()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)