Reference Library
OsnapPointRef Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »OsnapPointRef
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbOsnapPointRef")]
public class OsnapPointRef : PointRef
<WrapperAttribute("AcDbOsnapPointRef")> _
Public Class OsnapPointRef _
	Inherits PointRef
[WrapperAttribute(L"AcDbOsnapPointRef")]
public ref class OsnapPointRef : public PointRef
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
OsnapPointRef()
OsnapPointRef(IntPtr, Boolean)
EvalPoint() |  (Overrides PointRef.EvalPoint().)
GetEntities(Boolean) |  (Overrides PointRef.GetEntities(Boolean).)
IdPath
IntIdPath
IsGeomErased() |  (Overrides PointRef.IsGeomErased().)
IsXrefObj(ObjectIdCollection, ObjectIdCollection, Boolean) |  (Overrides PointRef.IsXrefObj(ObjectIdCollection, ObjectIdCollection, Boolean).)
LastPointRef
NearPointParam
OsnapType
Point
UpdateDueToMirror(Boolean) |  (Overrides PointRef.UpdateDueToMirror(Boolean).)
UpdateSubentPath(IdMapping) |  (Overrides PointRef.UpdateSubentPath(IdMapping).)
UpdateXrefSubentPath() |  (Overrides PointRef.UpdateXrefSubentPath().)
XrefHandles
XrefIntHandles
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | PointRef
|  |  |  | OsnapPointRef
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)