Reference Library
Show Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicBlockReferenceProperty »Show
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Show { get; }
Public ReadOnly Property Show As Boolean
	Get
public:
property bool Show {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)