Reference Library
LayoutCreated Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »LayoutCreated
 Declaration Syntax
C# | Visual Basic | Visual C++
public event LayoutEventHandler LayoutCreated
Public Event LayoutCreated As LayoutEventHandler
public:
 event LayoutEventHandler^ LayoutCreated {
	void add (LayoutEventHandler^ value);
	void remove (LayoutEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)