Reference Library
IsReadOnly Property
Namespaces »ZwSoft.ZwCAD.EditorInput »Keyword »IsReadOnly
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsReadOnly { get; internal set; }
Public Property IsReadOnly As Boolean
	Get
	Friend Set
public:
property bool IsReadOnly {
	bool get ();
	internal: void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)