Reference Library
EcsRotation Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBPoint »EcsRotation
 Declaration Syntax
C# | Visual Basic | Visual C++
public double EcsRotation { get; set; }
Public Property EcsRotation As Double
	Get
	Set
public:
property double EcsRotation {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)