Reference Library
FitTolerance Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »FitTolerance
 Declaration Syntax
C# | Visual Basic | Visual C++
public Tolerance FitTolerance { get; set; }
Public Property FitTolerance As Tolerance
	Get
	Set
public:
property Tolerance FitTolerance {
	Tolerance get ();
	void set (Tolerance value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)