Reference Library
WriteUInt16 Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »WriteUInt16(UInt16)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void WriteUInt16(
	ushort value
)
Public MustOverride Sub WriteUInt16 ( _
	value As UShort _
)
public:
virtual void WriteUInt16(
	unsigned short value
) abstract
 Parameters
value(UInt16)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)