Reference Library
Open Method (fileName, forReadOnly, password)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentCollection »Open(String, Boolean, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Document Open(
	string fileName,
	bool forReadOnly,
	string password
)
Public Function Open ( _
	fileName As String, _
	forReadOnly As Boolean, _
	password As String _
) As Document
public:
Document^ Open(
	String^ fileName,
	bool forReadOnly,
	String^ password
)
 Parameters
fileName(String)
forReadOnly(Boolean)
password(String)
Assembly: ZwManaged (Module: ZwManaged)