Reference Library
ShapeStyleAt Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinetypeTableRecord »ShapeStyleAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId ShapeStyleAt(
	int index
)
Public Function ShapeStyleAt ( _
	index As Integer _
) As ObjectId
public:
ObjectId ShapeStyleAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)