Reference Library
IsScaleSpecified Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »IsScaleSpecified
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsScaleSpecified { get; }
Public ReadOnly Property IsScaleSpecified As Boolean
	Get
public:
property bool IsScaleSpecified {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)