Reference Library
NestedLevel Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HyperLink »NestedLevel
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NestedLevel { get; }
Public ReadOnly Property NestedLevel As Integer
	Get
public:
property int NestedLevel {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)