Reference Library
SweepEntity Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweptSurface »SweepEntity
 Declaration Syntax
C# | Visual Basic | Visual C++
public Entity SweepEntity { get; }
Public ReadOnly Property SweepEntity As Entity
	Get
public:
property Entity^ SweepEntity {
	Entity^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)