Reference Library
DiagnosticPhotonMode Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraits »DiagnosticPhotonMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract DiagnosticPhotonMode DiagnosticPhotonMode { get; set; }
Public MustOverride Property DiagnosticPhotonMode As DiagnosticPhotonMode
	Get
	Set
public:
virtual property DiagnosticPhotonMode DiagnosticPhotonMode {
	DiagnosticPhotonMode get () abstract;
	void set (DiagnosticPhotonMode value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)