Reference Library
BlockScale Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeaderStyle »BlockScale
 Declaration Syntax
C# | Visual Basic | Visual C++
public Scale3d BlockScale { get; set; }
Public Property BlockScale As Scale3d
	Get
	Set
public:
property Scale3d BlockScale {
	Scale3d get ();
	void set (Scale3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)