Reference Library
IsApple Property
Namespaces »ZwSoft.ZwCAD.Geometry »Torus »IsApple
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsApple { get; }
Public ReadOnly Property IsApple As Boolean
	Get
public:
property bool IsApple {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)