Reference Library
LockMode Method (bIncludeMyLocks)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »LockMode(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DocumentLockMode LockMode(
	bool bIncludeMyLocks
)
Public Function LockMode ( _
	bIncludeMyLocks As Boolean _
) As DocumentLockMode
public:
DocumentLockMode LockMode(
	bool bIncludeMyLocks
)
 Parameters
bIncludeMyLocks(Boolean)
Assembly: ZwManaged (Module: ZwManaged)