Reference Library
TypedValue Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TypedValue »TypedValue()
 Members
Icon | Member | Description
TypedValue(Int32)
TypedValue(Int32, Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)