Reference Library
NurbSurfaceDefinition Structure
Namespaces »ZwSoft.ZwCAD.Geometry »NurbSurfaceDefinition
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct NurbSurfaceDefinition
Public Structure NurbSurfaceDefinition
public value class NurbSurfaceDefinition
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
ControlPoints
DegreeInU
DegreeInV
Equality(NurbSurfaceDefinition, NurbSurfaceDefinition)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
Inequality(NurbSurfaceDefinition, NurbSurfaceDefinition)
IsEqualTo(NurbSurfaceDefinition)
NumberOfControlPointsInU
NumberOfControlPointsInV
PropertiesInU
PropertiesInV
UKnots
VKnots
Weights
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)