Reference Library
Contrast Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AbstractViewTableRecord »Contrast
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Contrast { get; set; }
Public Property Contrast As Double
	Get
	Set
public:
property double Contrast {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)