Reference Library
NurbCurve3d Constructor (fitPoints, fitTangents, periodic)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »NurbCurve3d(Point3dCollection, Vector3dCollection, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public NurbCurve3d(
	Point3dCollection fitPoints,
	Vector3dCollection fitTangents,
	bool periodic
)
Public Sub New ( _
	fitPoints As Point3dCollection, _
	fitTangents As Vector3dCollection, _
	periodic As Boolean _
)
public:
NurbCurve3d(
	Point3dCollection^ fitPoints,
	Vector3dCollection^ fitTangents,
	bool periodic
)
 Parameters
fitPoints(Point3dCollection)
fitTangents(Vector3dCollection)
periodic(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)