Reference Library
BackgroundScaleFactor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »BackgroundScaleFactor
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Unitless)]
public double BackgroundScaleFactor { get; set; }
<UnitTypeAttribute(UnitType.Unitless)> _
Public Property BackgroundScaleFactor As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Unitless)]
public:
property double BackgroundScaleFactor {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)