Reference Library
PaletteData Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »GIRasterImage »PaletteData()
 Declaration Syntax
C# | Visual Basic | Visual C++
public byte[] PaletteData()
Public Function PaletteData As Byte()
public:
array<unsigned char>^ PaletteData()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)