Reference Library
IntersectDisplay Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »IntersectDisplay
 Declaration Syntax
C# | Visual Basic | Visual C++
public int IntersectDisplay { get; set; }
Public Property IntersectDisplay As Integer
	Get
	Set
public:
property int IntersectDisplay {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)