Reference Library
ViewportObjectId Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ViewportDraw »ViewportObjectId
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract ObjectId ViewportObjectId { get; }
Public MustOverride ReadOnly Property ViewportObjectId As ObjectId
	Get
public:
virtual property ObjectId ViewportObjectId {
	ObjectId get () abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)