Reference Library
Subtract Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »Subtract(Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d Subtract(
	Vector3d value
)
Public Function Subtract ( _
	value As Vector3d _
) As Point3d
public:
Point3d Subtract(
	Vector3d value
)
 Parameters
value(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)