Reference Library
IsParallelTo Method (linearEntity, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »PlanarEntity »IsParallelTo(LinearEntity3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsParallelTo(
	LinearEntity3d linearEntity,
	Tolerance tolerance
)
Public Function IsParallelTo ( _
	linearEntity As LinearEntity3d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsParallelTo(
	LinearEntity3d^ linearEntity,
	Tolerance tolerance
)
 Parameters
linearEntity(LinearEntity3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)