Reference Library
ICollection_CopyTo Method (array, index)
Namespaces »ZwSoft.ZwCAD.Geometry »DoubleCollection »ICollection.CopyTo(Array, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
void ICollection.CopyTo(
	Array array,
	int index
)
Private Sub ICollection_CopyTo ( _
	array As Array, _
	index As Integer _
) Implements ICollection.CopyTo
private:
virtual void ICollection_CopyTo(
	Array^ array,
	int index
) sealed = ICollection::CopyTo
 Parameters
array(Array)
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)