Reference Library
DBObjectReference Structure
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObjectReference
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct DBObjectReference
Public Structure DBObjectReference
public value class DBObjectReference
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DBObjectReference(ObjectId, Int32)
Kind
ObjectId
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)