Reference Library
CopyTo Method (array, index)
Namespaces »ZwSoft.ZwCAD.Colors »TransparencyCollection »CopyTo(Transparency[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	Transparency[] array,
	int index
)
Public Sub CopyTo ( _
	array As Transparency(), _
	index As Integer _
)
public:
virtual void CopyTo(
	array<Transparency>^ array,
	int index
) sealed
 Parameters
array(Transparency[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)