Reference Library
Measurement Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Measurement
 Declaration Syntax
C# | Visual Basic | Visual C++
public MeasurementValue Measurement { get; set; }
Public Property Measurement As MeasurementValue
	Get
	Set
public:
property MeasurementValue Measurement {
	MeasurementValue get ();
	void set (MeasurementValue value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)