Reference Library
Addition Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »Addition(Vector3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Vector3d operator +(
	Vector3d a,
	Vector3d b
)
Public Shared Operator + ( _
	a As Vector3d, _
	b As Vector3d _
) As Vector3d
public:
static Vector3d operator +(
	Vector3d a,
	Vector3d b
)
 Parameters
a(Vector3d)
b(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)