Reference Library
FastZoomsEnabled Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewportTableRecord »FastZoomsEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool FastZoomsEnabled { get; set; }
Public Property FastZoomsEnabled As Boolean
	Get
	Set
public:
property bool FastZoomsEnabled {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)