Reference Library
TileOrder Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »TileOrder
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum TileOrder
Public Enumeration TileOrder
public enum class TileOrder
 Members
Member | Description
BottomToTop
TopToBottom
RightToLeft
LeftToRight
Spiral
Hilbert
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)