Reference Library
GetFirstDerivative Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »GetFirstDerivative(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Vector3d GetFirstDerivative(
	double value
)
Public Overridable Function GetFirstDerivative ( _
	value As Double _
) As Vector3d
public:
virtual Vector3d GetFirstDerivative(
	double value
)
 Parameters
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)