Reference Library
GetInternalArray Method (col)
Namespaces »ZwSoft.ZwCAD.Runtime »Marshaler »GetInternalArray(IntegerCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static int[] GetInternalArray(
	IntegerCollection col
)
Public Shared Function GetInternalArray ( _
	col As IntegerCollection _
) As Integer()
public:
static array<int>^ GetInternalArray(
	IntegerCollection^ col
)
 Parameters
col(IntegerCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)