Reference Library
GetColors Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FaceData »GetColors()
 Declaration Syntax
C# | Visual Basic | Visual C++
public short[] GetColors()
Public Function GetColors As Short()
public:
array<short>^ GetColors()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)