Reference Library
Post Method (dimId, dimAssocId)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimAssoc »Post(ObjectId, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Post(
	ObjectId dimId,
	ObjectId dimAssocId
)
Public Sub Post ( _
	dimId As ObjectId, _
	dimAssocId As ObjectId _
)
public:
void Post(
	ObjectId dimId,
	ObjectId dimAssocId
)
 Parameters
dimId(ObjectId)
dimAssocId(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)