Reference Library
SetStartWidthAt Method (index, startWidth)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline »SetStartWidthAt(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetStartWidthAt(
	int index,
	double startWidth
)
Public Sub SetStartWidthAt ( _
	index As Integer, _
	startWidth As Double _
)
public:
void SetStartWidthAt(
	int index,
	double startWidth
)
 Parameters
index(Int32)
startWidth(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)