Reference Library
Comments Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DatabaseSummaryInfoBuilder »Comments
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Comments { get; set; }
Public Property Comments As String
	Get
	Set
public:
property String^ Comments {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)