Reference Library
GetFileNameForSave Method
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »GetFileNameForSave()
 Members
Icon | Member | Description
GetFileNameForSave(PromptSaveFileOptions)
GetFileNameForSave(String)
Assembly: ZwManaged (Module: ZwManaged)