Reference Library
PlaneSurface Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlaneSurface
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbPlaneSurface")]
public class PlaneSurface : Surface
<WrapperAttribute("AcDbPlaneSurface")> _
Public Class PlaneSurface _
	Inherits Surface
[WrapperAttribute(L"AcDbPlaneSurface")]
public ref class PlaneSurface : public Surface
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PlaneSurface()
CreateFromRegion(Region)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Surface
|  |  |  |  |  |  | PlaneSurface
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)