Reference Library
IsEmpty Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Graph »IsEmpty
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEmpty { get; }
Public ReadOnly Property IsEmpty As Boolean
	Get
public:
property bool IsEmpty {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)