Reference Library
SweepOptionsBuilder Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweepOptionsBuilder »SweepOptionsBuilder()
 Declaration Syntax
C# | Visual Basic | Visual C++
public SweepOptionsBuilder()
Public Sub New
public:
SweepOptionsBuilder()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)