Reference Library
Nps Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdEntry »Nps
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Nps { get; set; }
Public Property Nps As String
	Get
	Set
public:
property String^ Nps {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwManaged (Module: ZwManaged)