Reference Library
IsObjectNonPersistent Method (id)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »IsObjectNonPersistent(ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool IsObjectNonPersistent(
	ObjectId id
)
Public Shared Function IsObjectNonPersistent ( _
	id As ObjectId _
) As Boolean
public:
static bool IsObjectNonPersistent(
	ObjectId id
)
 Parameters
id(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)