Reference Library
DataTable Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataTable
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbDataTable")]
public class DataTable : DBObject
<WrapperAttribute("AcDbDataTable")> _
Public Class DataTable _
	Inherits DBObject
[WrapperAttribute(L"AcDbDataTable")]
public ref class DataTable : public DBObject
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DataTable()
DataTable(IntPtr, Boolean)
AppendColumn(CellType, String)
AppendRow(DataCellCollection, Boolean)
Assign(DataTable)
GetCellAt(Int32, Int32)
GetColumnAt(Int32)
GetColumnIndexAtName(String)
GetColumnNameAt(Int32)
GetColumnTypeAt(Int32)
GetRowAt(Int32)
InsertColumnAt(Int32, CellType, String)
InsertRowAt(Int32, DataCellCollection, Boolean)
NumColsGrowSize
NumColsPhysicalSize
NumColumns
NumRows
NumRowsGrowSize
NumRowsPhysicalSize
RemoveColumnAt(Int32)
RemoveRowAt(Int32)
SetCellAt(Int32, Int32, DataCell)
SetRowAt(Int32, DataCellCollection, Boolean)
TableName
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | DataTable
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)