Reference Library
CreateFrom Method (fromEntity)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »CreateFrom(Entity)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void CreateFrom(
	Entity fromEntity
)
Public Overridable Sub CreateFrom ( _
	fromEntity As Entity _
)
public:
virtual void CreateFrom(
	Entity^ fromEntity
)
 Parameters
fromEntity(Entity)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)