Reference Library
CopyFromUnmanagedObject Method (unmanagedPointer)
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdData »CopyFromUnmanagedObject(IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static DsdData CopyFromUnmanagedObject(
	IntPtr unmanagedPointer
)
Public Shared Function CopyFromUnmanagedObject ( _
	unmanagedPointer As IntPtr _
) As DsdData
public:
static DsdData^ CopyFromUnmanagedObject(
	IntPtr unmanagedPointer
)
 Parameters
unmanagedPointer(IntPtr)
Assembly: ZwManaged (Module: ZwManaged)