Reference Library
Surface Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Surface »Surface()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Surface()
Public Sub New
public:
Surface()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)