Reference Library
CreateFromGeCurve Method (geCurve)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »CreateFromGeCurve(Curve3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Curve CreateFromGeCurve(
	Curve3d geCurve
)
Public Shared Function CreateFromGeCurve ( _
	geCurve As Curve3d _
) As Curve
public:
static Curve^ CreateFromGeCurve(
	Curve3d^ geCurve
)
 Parameters
geCurve(Curve3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)