Reference Library
SetScale Method (row, column, contentIndex, scale)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetScale(Int32, Int32, Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetScale(
	int row,
	int column,
	int contentIndex,
	double scale
)
Public Overridable Sub SetScale ( _
	row As Integer, _
	column As Integer, _
	contentIndex As Integer, _
	scale As Double _
)
public:
virtual void SetScale(
	int row,
	int column,
	int contentIndex,
	double scale
)
 Parameters
row(Int32)
column(Int32)
contentIndex(Int32)
scale(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)