Reference Library
MenuItem Class
Namespaces »ZwSoft.ZwCAD.Windows »MenuItem
 Declaration Syntax
C# | Visual Basic | Visual C++
public class MenuItem : Menu
Public Class MenuItem _
	Inherits Menu
public ref class MenuItem : public Menu
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
MenuItem(String, Icon)
MenuItem(String)
Checked
Click
Enabled
Icon
Text
Visible
 Inheritance Hierarchy
Object
Menu
| MenuItem
Assembly: ZwManaged (Module: ZwManaged)