Reference Library
SetZoomToPaperOnUpdate Method (plotSet, doZoom)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsValidator »SetZoomToPaperOnUpdate(PlotSettings, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetZoomToPaperOnUpdate(
	PlotSettings plotSet,
	bool doZoom
)
Public Sub SetZoomToPaperOnUpdate ( _
	plotSet As PlotSettings, _
	doZoom As Boolean _
)
public:
void SetZoomToPaperOnUpdate(
	PlotSettings^ plotSet,
	bool doZoom
)
 Parameters
plotSet(PlotSettings)
doZoom(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)