Reference Library
Mline Constructor (unmanagedObjPtr, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Mline »Mline(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal Mline(
	IntPtr unmanagedObjPtr,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedObjPtr As IntPtr, _
	autoDelete As Boolean _
)
protected public:
Mline(
	IntPtr unmanagedObjPtr,
	bool autoDelete
)
 Parameters
unmanagedObjPtr(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)