Reference Library
ResolveXrefs Method (useThreadEngine, doNewOnly)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »ResolveXrefs(Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void ResolveXrefs(
	bool useThreadEngine,
	bool doNewOnly
)
Public Sub ResolveXrefs ( _
	useThreadEngine As Boolean, _
	doNewOnly As Boolean _
)
public:
void ResolveXrefs(
	bool useThreadEngine,
	bool doNewOnly
)
 Parameters
useThreadEngine(Boolean)
doNewOnly(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)