Reference Library
ScaleBy Method (scaleFactor, origin)
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »ScaleBy(Double, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d ScaleBy(
	double scaleFactor,
	Point2d origin
)
Public Function ScaleBy ( _
	scaleFactor As Double, _
	origin As Point2d _
) As Point2d
public:
Point2d ScaleBy(
	double scaleFactor,
	Point2d origin
)
 Parameters
scaleFactor(Double)
origin(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)