Reference Library
Name Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectContextCollection »Name
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string Name { get; }
Public Overridable ReadOnly Property Name As String
	Get
public:
virtual property String^ Name {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)