Reference Library
Contains Method (point)
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock2d »Contains(Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Contains(
	Point2d point
)
Public Function Contains ( _
	point As Point2d _
) As Boolean
public:
bool Contains(
	Point2d point
)
 Parameters
point(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)