Reference Library
PushClipBoundary Method (boundary)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »PushClipBoundary(ClipBoundary)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool PushClipBoundary(
	ClipBoundary boundary
)
Public MustOverride Function PushClipBoundary ( _
	boundary As ClipBoundary _
) As Boolean
public:
virtual bool PushClipBoundary(
	ClipBoundary^ boundary
) abstract
 Parameters
boundary(ClipBoundary)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)