Reference Library
GetVertexAt Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Face »GetVertexAt(Int16)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d GetVertexAt(
	short value
)
Public Function GetVertexAt ( _
	value As Short _
) As Point3d
public:
Point3d GetVertexAt(
	short value
)
 Parameters
value(Int16)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)