Reference Library
GetDistance Method (options)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »GetDistance(PromptDistanceOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDoubleResult GetDistance(
	PromptDistanceOptions options
)
Public Function GetDistance ( _
	options As PromptDistanceOptions _
) As PromptDoubleResult
public:
PromptDoubleResult^ GetDistance(
	PromptDistanceOptions^ options
)
 Parameters
options(PromptDistanceOptions)
Assembly: ZwManaged (Module: ZwManaged)