Reference Library
TextAlignmentType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TextAlignmentType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbMLeaderStyle::TextAlignmentType")]
public enum TextAlignmentType
<WrapperAttribute("ZcDbMLeaderStyle::TextAlignmentType")> _
Public Enumeration TextAlignmentType
[WrapperAttribute(L"ZcDbMLeaderStyle::TextAlignmentType")]
public enum class TextAlignmentType
 Members
Member | Description
RightAlignment
CenterAlignment
LeftAlignment
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)