Reference Library
SelectedSubObject Constructor (path, method, gsMarker)
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectedSubObject »SelectedSubObject(FullSubentityPath, SelectionMethod, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use overload taking System::IntPtr instead.")]
public SelectedSubObject(
	FullSubentityPath path,
	SelectionMethod method,
	int gsMarker
)
<ObsoleteAttribute("Use overload taking System::IntPtr instead.")> _
Public Sub New ( _
	path As FullSubentityPath, _
	method As SelectionMethod, _
	gsMarker As Integer _
)
[ObsoleteAttribute(L"Use overload taking System::IntPtr instead.")]
public:
SelectedSubObject(
	FullSubentityPath path,
	SelectionMethod method,
	int gsMarker
)
 Parameters
path(FullSubentityPath)
method(SelectionMethod)
gsMarker(Int32)
Assembly: ZwManaged (Module: ZwManaged)