Reference Library
IsEqualTo Method (a, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Scale2d »IsEqualTo(Scale2d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	Scale2d a,
	Tolerance tolerance
)
Public Function IsEqualTo ( _
	a As Scale2d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsEqualTo(
	Scale2d a,
	Tolerance tolerance
)
 Parameters
a(Scale2d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)