Reference Library
DimensionStyle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FeatureControlFrame »DimensionStyle
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId DimensionStyle { get; set; }
Public Property DimensionStyle As ObjectId
	Get
	Set
public:
property ObjectId DimensionStyle {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)