Reference Library
PromptStringOptions Constructor (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptStringOptions »PromptStringOptions(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptStringOptions(
	string message
)
Public Sub New ( _
	message As String _
)
public:
PromptStringOptions(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)