Reference Library
DeleteRows Method (row, rows)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »DeleteRows(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void DeleteRows(
	int row,
	int rows
)
Public Overridable Sub DeleteRows ( _
	row As Integer, _
	rows As Integer _
)
public:
virtual void DeleteRows(
	int row,
	int rows
)
 Parameters
row(Int32)
rows(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)