Reference Library
TableTemplate Constructor (table, copyOption)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableTemplate »TableTemplate(Table, TableCopyOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public TableTemplate(
	Table table,
	TableCopyOptions copyOption
)
Public Sub New ( _
	table As Table, _
	copyOption As TableCopyOptions _
)
public:
TableTemplate(
	Table^ table,
	TableCopyOptions copyOption
)
 Parameters
table(Table)
copyOption(TableCopyOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)