Reference Library
Contains Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »IntegerCollection »Contains(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool Contains(
	int value
)
Public Overridable Function Contains ( _
	value As Integer _
) As Boolean
public:
virtual bool Contains(
	int value
)
 Parameters
value(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)