Reference Library
SupportsCollection Method (collectionName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »SupportsCollection(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool SupportsCollection(
	string collectionName
)
Public Function SupportsCollection ( _
	collectionName As String _
) As Boolean
public:
bool SupportsCollection(
	String^ collectionName
)
 Parameters
collectionName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)