Reference Library
TextStyleTable Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TextStyleTable
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbTextStyleTable")]
public sealed class TextStyleTable : SymbolTable
<WrapperAttribute("AcDbTextStyleTable")> _
Public NotInheritable Class TextStyleTable _
	Inherits SymbolTable
[WrapperAttribute(L"AcDbTextStyleTable")]
public ref class TextStyleTable sealed : public SymbolTable
 Members
All Members | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | SymbolTable
|  |  |  |  |  | TextStyleTable
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)