Reference Library
Status Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldEvaluationStatusResult »Status
 Declaration Syntax
C# | Visual Basic | Visual C++
public FieldEvaluationStatus Status { get; }
Public ReadOnly Property Status As FieldEvaluationStatus
	Get
public:
property FieldEvaluationStatus Status {
	FieldEvaluationStatus get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)