Reference Library
CloseBubbleWindows Method
Namespaces »ZwSoft.ZwCAD.Windows »TrayItem »CloseBubbleWindows()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CloseBubbleWindows()
Public Sub CloseBubbleWindows
public:
void CloseBubbleWindows()
Assembly: ZwManaged (Module: ZwManaged)