Reference Library
GsMarkType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GsMarkType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbMLeader::gsMarkType")]
public enum GsMarkType
<WrapperAttribute("ZcDbMLeader::gsMarkType")> _
Public Enumeration GsMarkType
[WrapperAttribute(L"ZcDbMLeader::gsMarkType")]
public enum class GsMarkType
 Members
Member | Description
None
ToleranceMark
MTextUnderLineMark
MTextMark
LeaderLineMark
DoglegMark
BlockMark
ArrowMark
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)