Reference Library
DataColumn Constructor (column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataColumn »DataColumn(DataColumn)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DataColumn(
	DataColumn column
)
Public Sub New ( _
	column As DataColumn _
)
public:
DataColumn(
	DataColumn^ column
)
 Parameters
column(DataColumn)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)