Reference Library
GetCoordinateSystem Method
Namespaces »ZwSoft.ZwCAD.Geometry »PlanarEntity »GetCoordinateSystem()
 Declaration Syntax
C# | Visual Basic | Visual C++
public CoordinateSystem3d GetCoordinateSystem()
Public Function GetCoordinateSystem As CoordinateSystem3d
public:
CoordinateSystem3d GetCoordinateSystem()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)