Reference Library
TextStyle Method (row, col)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »TextStyle(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId TextStyle(
	int row,
	int col
)
Public Overridable Function TextStyle ( _
	row As Integer, _
	col As Integer _
) As ObjectId
public:
virtual ObjectId TextStyle(
	int row,
	int col
)
 Parameters
row(Int32)
col(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)