Reference Library
WorldToPlane Method (normal)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »WorldToPlane(Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Matrix3d WorldToPlane(
	Vector3d normal
)
Public Shared Function WorldToPlane ( _
	normal As Vector3d _
) As Matrix3d
public:
static Matrix3d WorldToPlane(
	Vector3d normal
)
 Parameters
normal(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)