Reference Library
BreakEnabled Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »BreakEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool BreakEnabled { get; set; }
Public Overridable Property BreakEnabled As Boolean
	Get
	Set
public:
virtual property bool BreakEnabled {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)