Reference Library
EndPoint Property
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc3d »EndPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d EndPoint { get; }
Public ReadOnly Property EndPoint As Point3d
	Get
public:
property Point3d EndPoint {
	Point3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)