Reference Library
ShowModal Method
Namespaces »ZwSoft.ZwCAD.Windows »SaveFileDialog »ShowModal()
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool ShowModal()
Public Function ShowModal As Boolean
public:
bool ShowModal()
Assembly: ZwManaged (Module: ZwManaged)