Reference Library
Multiply Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Scale2d »Multiply(Double, Scale2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Scale2d operator *(
	double factor,
	Scale2d a
)
Public Shared Operator * ( _
	factor As Double, _
	a As Scale2d _
) As Scale2d
public:
static Scale2d operator *(
	double factor,
	Scale2d a
)
 Parameters
factor(Double)
a(Scale2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)