Reference Library
GetRXClass Method
Namespaces »ZwSoft.ZwCAD.Runtime »RXObject »GetRXClass()
 Declaration Syntax
C# | Visual Basic | Visual C++
public RXClass GetRXClass()
Public Function GetRXClass As RXClass
public:
RXClass^ GetRXClass()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)