Reference Library
Name Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AnnotationScale »Name
 Declaration Syntax
C# | Visual Basic | Visual C++
public override string Name { get; set; }
Public Overrides Property Name As String
	Get
	Set
public:
virtual property String^ Name {
	String^ get () override;
	void set (String^ value) override;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)