Reference Library
ShowModalDialog Method (owner, formToShow)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »ShowModalDialog(IWin32Window, Form)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static DialogResult ShowModalDialog(
	IWin32Window owner,
	Form formToShow
)
Public Shared Function ShowModalDialog ( _
	owner As IWin32Window, _
	formToShow As Form _
) As DialogResult
public:
static DialogResult ShowModalDialog(
	IWin32Window^ owner,
	Form^ formToShow
)
 Parameters
owner(IWin32Window)
formToShow(Form)
Assembly: ZwManaged (Module: ZwManaged)