Reference Library
IndexPtr Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SubentityId »IndexPtr
 Declaration Syntax
C# | Visual Basic | Visual C++
public IntPtr IndexPtr { get; }
Public ReadOnly Property IndexPtr As IntPtr
	Get
public:
property IntPtr IndexPtr {
	IntPtr get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)