Reference Library
SetDivisionLines Method (nSecType, nGeometry, bShow)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »SetDivisionLines(SectionType, SectionGeometry, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetDivisionLines(
	SectionType nSecType,
	SectionGeometry nGeometry,
	bool bShow
)
Public Sub SetDivisionLines ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry, _
	bShow As Boolean _
)
public:
void SetDivisionLines(
	SectionType nSecType,
	SectionGeometry nGeometry,
	bool bShow
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
bShow(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)