Reference Library
IsEqualTo Method (a, tolerance)
Namespaces »ZwSoft.ZwCAD.PlottingServices »MediaBounds »IsEqualTo(MediaBounds, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	MediaBounds a,
	Tolerance tolerance
)
Public Function IsEqualTo ( _
	a As MediaBounds, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsEqualTo(
	MediaBounds a,
	Tolerance tolerance
)
 Parameters
a(MediaBounds)
tolerance(Tolerance)
Assembly: ZwManaged (Module: ZwManaged)