Reference Library
IEnumerator_Current_get Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockTableRecordEnumerator »IEnumerator_Current_get()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected Object IEnumerator_Current_get()
Protected Function IEnumerator_Current_get As Object
protected:
virtual Object^ IEnumerator_Current_get() sealed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)