Reference Library
PaletteSetDestroy Event
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »PaletteSetDestroy
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PaletteSetDestroyEventHandler PaletteSetDestroy
Public Event PaletteSetDestroy As PaletteSetDestroyEventHandler
public:
 event PaletteSetDestroyEventHandler^ PaletteSetDestroy {
	void add (PaletteSetDestroyEventHandler^ value);
	void remove (PaletteSetDestroyEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)