Reference Library
PickPointKind Enumeration
Namespaces »ZwSoft.ZwCAD.EditorInput »PickPointKind
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum PickPointKind
Public Enumeration PickPointKind
public enum class PickPointKind
 Members
Member | Description
Ray
InfiniteLine
LineSegment
Assembly: ZwManaged (Module: ZwManaged)