Reference Library
OpenMode Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »OpenMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum OpenMode
Public Enumeration OpenMode
public enum class OpenMode
 Members
Member | Description
ForNotify
ForWrite
ForRead
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)