Reference Library
UcsIconVisible Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »UcsIconVisible
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool UcsIconVisible { get; set; }
Public Property UcsIconVisible As Boolean
	Get
	Set
public:
property bool UcsIconVisible {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)