Reference Library
PostMLeaderStyleToDb Method (db, styleName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeaderStyle »PostMLeaderStyleToDb(Database, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId PostMLeaderStyleToDb(
	Database db,
	string styleName
)
Public Function PostMLeaderStyleToDb ( _
	db As Database, _
	styleName As String _
) As ObjectId
public:
ObjectId PostMLeaderStyleToDb(
	Database^ db,
	String^ styleName
)
 Parameters
db(Database)
styleName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)