Reference Library
CloseAborted Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »CloseAborted
 Declaration Syntax
C# | Visual Basic | Visual C++
public event EventHandler CloseAborted
Public Event CloseAborted As EventHandler
public:
 event EventHandler^ CloseAborted {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)