Reference Library
IsOnlyLines Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline »IsOnlyLines
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsOnlyLines { get; }
Public ReadOnly Property IsOnlyLines As Boolean
	Get
public:
property bool IsOnlyLines {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)