Reference Library
SetLeaderLineType Method (leaderLineIndex, leaderLineType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »SetLeaderLineType(Int32, LeaderType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetLeaderLineType(
	int leaderLineIndex,
	LeaderType leaderLineType
)
Public Sub SetLeaderLineType ( _
	leaderLineIndex As Integer, _
	leaderLineType As LeaderType _
)
public:
void SetLeaderLineType(
	int leaderLineIndex,
	LeaderType leaderLineType
)
 Parameters
leaderLineIndex(Int32)
leaderLineType(LeaderType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)