Reference Library
EvaluatorId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Field »EvaluatorId
 Declaration Syntax
C# | Visual Basic | Visual C++
public string EvaluatorId { get; set; }
Public Property EvaluatorId As String
	Get
	Set
public:
property String^ EvaluatorId {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)