Reference Library
CallTooltip Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripData »CallTooltip()
 Declaration Syntax
C# | Visual Basic | Visual C++
public string CallTooltip()
Public Function CallTooltip As String
public:
String^ CallTooltip()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)