Reference Library
Document Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentCollectionEventArgs »Document
 Declaration Syntax
C# | Visual Basic | Visual C++
public Document Document { get; }
Public ReadOnly Property Document As Document
	Get
public:
property Document^ Document {
	Document^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)