Reference Library
ScaleBy Method (scaleFactor, point)
Namespaces »ZwSoft.ZwCAD.Geometry »Entity2d »ScaleBy(Double, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void ScaleBy(
	double scaleFactor,
	Point2d point
)
Public Sub ScaleBy ( _
	scaleFactor As Double, _
	point As Point2d _
)
public:
void ScaleBy(
	double scaleFactor,
	Point2d point
)
 Parameters
scaleFactor(Double)
point(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)