Reference Library
PolylineCollection Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PolylineCollection
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiPolylineArray")]
public class PolylineCollection
<WrapperAttribute("ZcGiPolylineArray")> _
Public Class PolylineCollection
[WrapperAttribute(L"ZcGiPolylineArray")]
public ref class PolylineCollection
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PolylineCollection(Int32)
PolylineCollection()
Add(Polyline)
Clear()
Count
Item[Int32]
RemoveAt(Int32)
 Inheritance Hierarchy
Object
PolylineCollection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)