Reference Library
ImageOrg Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ImageOrg
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum ImageOrg
Public Enumeration ImageOrg
public enum class ImageOrg
 Members
Member | Description
Gray
BGR
ABGR
ARGB
BGRA
RGBA
Palette
Bitonal
RGB
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)