Reference Library
Dimapost Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimapost
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string Dimapost { get; set; }
Public Overridable Property Dimapost As String
	Get
	Set
public:
virtual property String^ Dimapost {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)