Reference Library
BitsPerPixel Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PixelFormatInfo »BitsPerPixel
 Declaration Syntax
C# | Visual Basic | Visual C++
public short BitsPerPixel { get; set; }
Public Property BitsPerPixel As Short
	Get
	Set
public:
property short BitsPerPixel {
	short get ();
	void set (short value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)