Reference Library
MultiplyBy Method (factor)
Namespaces »ZwSoft.ZwCAD.Geometry »Scale2d »MultiplyBy(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Scale2d MultiplyBy(
	double factor
)
Public Function MultiplyBy ( _
	factor As Double _
) As Scale2d
public:
Scale2d MultiplyBy(
	double factor
)
 Parameters
factor(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)