Reference Library
ClipPolyline Method (rawVertices)
Namespaces »ZwSoft.ZwCAD.Geometry »ClipBoundary2d »ClipPolyline(Point2dCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ClipBoundary2dData ClipPolyline(
	Point2dCollection rawVertices
)
Public Function ClipPolyline ( _
	rawVertices As Point2dCollection _
) As ClipBoundary2dData
public:
ClipBoundary2dData ClipPolyline(
	Point2dCollection^ rawVertices
)
 Parameters
rawVertices(Point2dCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)