Reference Library
DwgFileOpened Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »DwgFileOpened
 Declaration Syntax
C# | Visual Basic | Visual C++
public event DatabaseIOEventHandler DwgFileOpened
Public Event DwgFileOpened As DatabaseIOEventHandler
public:
 event DatabaseIOEventHandler^ DwgFileOpened {
	void add (DatabaseIOEventHandler^ value);
	void remove (DatabaseIOEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)