Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdEntryCollection »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual IEnumerator GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator
public:
virtual IEnumerator^ GetEnumerator()
Assembly: ZwManaged (Module: ZwManaged)