Reference Library
paths Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefSubCommandEventArgs »paths
 Declaration Syntax
C# | Visual Basic | Visual C++
public string[] paths { get; }
Public ReadOnly Property paths As String()
	Get
public:
property array<String^>^ paths {
	array<String^>^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)