Reference Library
PlineEllipse Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »PlineEllipse
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool PlineEllipse { get; set; }
Public Property PlineEllipse As Boolean
	Get
	Set
public:
property bool PlineEllipse {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)