Reference Library
ShadowMapSoftness Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ShadowParameters »ShadowMapSoftness
 Declaration Syntax
C# | Visual Basic | Visual C++
public byte ShadowMapSoftness { get; set; }
Public Property ShadowMapSoftness As Byte
	Get
	Set
public:
property unsigned char ShadowMapSoftness {
	unsigned char get ();
	void set (unsigned char value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)