Reference Library
TextString Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBText »TextString
 Declaration Syntax
C# | Visual Basic | Visual C++
public string TextString { get; set; }
Public Property TextString As String
	Get
	Set
public:
property String^ TextString {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)