Reference Library
Dimaltu Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimaltu
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Dimaltu { get; set; }
Public Property Dimaltu As Integer
	Get
	Set
public:
property int Dimaltu {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)