Reference Library
Coefficients Property
Namespaces »ZwSoft.ZwCAD.Geometry »PlanarEntity »Coefficients
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlanarEquationCoefficients Coefficients { get; }
Public ReadOnly Property Coefficients As PlanarEquationCoefficients
	Get
public:
property PlanarEquationCoefficients Coefficients {
	PlanarEquationCoefficients get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)