Reference Library
EntityColor Constructor (value)
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor »EntityColor(ColorMethod)
 Declaration Syntax
C# | Visual Basic | Visual C++
public EntityColor(
	ColorMethod value
)
Public Sub New ( _
	value As ColorMethod _
)
public:
EntityColor(
	ColorMethod value
)
 Parameters
value(ColorMethod)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)