Reference Library
Flags Property
Namespaces »ZwSoft.ZwCAD.Runtime »ICommandLineCallable »Flags
 Declaration Syntax
C# | Visual Basic | Visual C++
CommandFlags Flags { get; }
ReadOnly Property Flags As CommandFlags
	Get
property CommandFlags Flags {
	CommandFlags get ();
}
Assembly: ZwManaged (Module: ZwManaged)