Reference Library
MoveNext Method
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2dCollectionEnumerator »MoveNext()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool MoveNext()
Public Overridable Function MoveNext As Boolean
public:
virtual bool MoveNext()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)