Reference Library
ReplacementId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DecomposeForSaveReplacementRecord »ReplacementId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId ReplacementId { get; }
Public ReadOnly Property ReplacementId As ObjectId
	Get
public:
property ObjectId ReplacementId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)