Reference Library
FillStyle Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FillStyle
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("OdPs::FillStyle")]
public enum FillStyle
<WrapperAttribute("OdPs::FillStyle")> _
Public Enumeration FillStyle
[WrapperAttribute(L"OdPs::FillStyle")]
public enum class FillStyle
 Members
Member | Description
FsLast
FsUseObject
FsVerticalBars
FsSquareDots
FsSlantRight
FsSlantLeft
FsHorizontalBars
FsDiamonds
FsCrosshatch
FsCheckerboard
FsSolid
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)