Reference Library
Position3d Class
Namespaces »ZwSoft.ZwCAD.Geometry »Position3d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGePosition3d")]
public sealed class Position3d : PointEntity3d
<WrapperAttribute("ZcGePosition3d")> _
Public NotInheritable Class Position3d _
	Inherits PointEntity3d
[WrapperAttribute(L"ZcGePosition3d")]
public ref class Position3d sealed : public PointEntity3d
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Position3d(Double, Double, Double)
Position3d(Point3d)
Position3d()
Create(IntPtr, Boolean)
Set(Double, Double, Double)
Set(Point3d)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity3d
|  |  | PointEntity3d
|  |  |  | Position3d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)