Reference Library
Dimtsz Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimtsz
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double Dimtsz { get; set; }
Public Overridable Property Dimtsz As Double
	Get
	Set
public:
virtual property double Dimtsz {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)