Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FullSubentityPath »Equality(FullSubentityPath, FullSubentityPath)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	FullSubentityPath a,
	FullSubentityPath b
)
Public Shared Operator = ( _
	a As FullSubentityPath, _
	b As FullSubentityPath _
) As Boolean
public:
static bool operator ==(
	FullSubentityPath a,
	FullSubentityPath b
)
 Parameters
a(FullSubentityPath)
b(FullSubentityPath)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)