Reference Library
ClipBoundaryType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ClipBoundaryType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbRasterImage::ClipBoundaryType")]
public enum ClipBoundaryType
<WrapperAttribute("ZcDbRasterImage::ClipBoundaryType")> _
Public Enumeration ClipBoundaryType
[WrapperAttribute(L"ZcDbRasterImage::ClipBoundaryType")]
public enum class ClipBoundaryType
 Members
Member | Description
Poly
Invalid
Rectangle
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)