Reference Library
ScaleBehavior Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ScaleBehavior
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ScaleTransformBehavior")]
public enum ScaleBehavior
<WrapperAttribute("ScaleTransformBehavior")> _
Public Enumeration ScaleBehavior
[WrapperAttribute(L"ScaleTransformBehavior")]
public enum class ScaleBehavior
 Members
Member | Description
Viewport
World
ViewportLocalOrigin
ScreenLocalOrigin
Screen
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)