Reference Library
DBPoint Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbPoint")]
public class DBPoint : Entity
<WrapperAttribute("AcDbPoint")> _
Public Class DBPoint _
	Inherits Entity
[WrapperAttribute(L"AcDbPoint")]
public ref class DBPoint : public Entity
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DBPoint(IntPtr, Boolean)
DBPoint(Point3d)
DBPoint()
EcsRotation
Normal
Position
Thickness
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | DBPoint
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)