Reference Library
Evaluate Method (evaluationOptions, database)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Field »Evaluate(Int32, Database)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Evaluate(
	int evaluationOptions,
	Database database
)
Public Sub Evaluate ( _
	evaluationOptions As Integer, _
	database As Database _
)
public:
void Evaluate(
	int evaluationOptions,
	Database^ database
)
 Parameters
evaluationOptions(Int32)
database(Database)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)