Reference Library
PolylineCurve2d Constructor (knots, controlPoints)
Namespaces »ZwSoft.ZwCAD.Geometry »PolylineCurve2d »PolylineCurve2d(KnotCollection, Point2dCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PolylineCurve2d(
	KnotCollection knots,
	Point2dCollection controlPoints
)
Public Sub New ( _
	knots As KnotCollection, _
	controlPoints As Point2dCollection _
)
public:
PolylineCurve2d(
	KnotCollection^ knots,
	Point2dCollection^ controlPoints
)
 Parameters
knots(KnotCollection)
controlPoints(Point2dCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)