Reference Library
Dimexo Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimexo
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double Dimexo { get; set; }
Public Overridable Property Dimexo As Double
	Get
	Set
public:
virtual property double Dimexo {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)