Reference Library
PointOnSurface Class
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnSurface
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGePointOnSurface")]
public sealed class PointOnSurface : PointEntity3d
<WrapperAttribute("ZcGePointOnSurface")> _
Public NotInheritable Class PointOnSurface _
	Inherits PointEntity3d
[WrapperAttribute(L"ZcGePointOnSurface")]
public ref class PointOnSurface sealed : public PointEntity3d
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PointOnSurface(Surface, Point2d)
PointOnSurface()
Create(IntPtr, Boolean)
GetInverseTangentVector(Vector3d, Surface, Point2d)
GetInverseTangentVector(Vector3d, Point2d)
GetInverseTangentVector(Vector3d)
GetMixedPartial(Surface, Point2d)
GetMixedPartial(Point2d)
GetMixedPartial()
GetNormal(Surface, Point2d)
GetNormal(Point2d)
GetNormal()
GetPoint(Surface, Point2d)
GetPoint(Point2d)
GetTangentVector(Vector2d, Surface, Point2d)
GetTangentVector(Vector2d, Point2d)
GetTangentVector(Vector2d)
GetUDerivative(Int32, Surface, Point2d)
GetUDerivative(Int32, Point2d)
GetUDerivative(Int32)
GetVDerivative(Int32, Surface, Point2d)
GetVDerivative(Int32, Point2d)
GetVDerivative(Int32)
Parameter
Surface
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity3d
|  |  | PointEntity3d
|  |  |  | PointOnSurface
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)