Reference Library
AlignChange Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »AlignChange
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string AlignChange { get; }
Public Shared ReadOnly Property AlignChange As String
	Get
public:
static property String^ AlignChange {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)