Reference Library
ActiveViewportId Property
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »ActiveViewportId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId ActiveViewportId { get; }
Public ReadOnly Property ActiveViewportId As ObjectId
	Get
public:
property ObjectId ActiveViewportId {
	ObjectId get ();
}
Assembly: ZwManaged (Module: ZwManaged)