Reference Library
IExtensionApplication Interface
Namespaces »ZwSoft.ZwCAD.Runtime »IExtensionApplication
 Declaration Syntax
C# | Visual Basic | Visual C++
public interface IExtensionApplication
Public Interface IExtensionApplication
public interface class IExtensionApplication
 Members
All Members | Methods
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Initialize()
Terminate()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)