Reference Library
CircularArc2d Constructor (center, radius)
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc2d »CircularArc2d(Point2d, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CircularArc2d(
	Point2d center,
	double radius
)
Public Sub New ( _
	center As Point2d, _
	radius As Double _
)
public:
CircularArc2d(
	Point2d center,
	double radius
)
 Parameters
center(Point2d)
radius(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)