Reference Library
AcquireString Method
Namespaces »ZwSoft.ZwCAD.EditorInput »JigPrompts »AcquireString()
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptResult AcquireString()
Public Function AcquireString As PromptResult
public:
PromptResult^ AcquireString()
Assembly: ZwManaged (Module: ZwManaged)