Reference Library
Numerator Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CustomScale »Numerator
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Numerator { get; }
Public ReadOnly Property Numerator As Double
	Get
public:
property double Numerator {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)