Reference Library
TableStyleFlags Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableStyleFlags
 Declaration Syntax
C# | Visual Basic | Visual C++
[FlagsAttribute]
[WrapperAttribute("AcDb::TableStyleFlags")]
public enum TableStyleFlags
<FlagsAttribute> _
<WrapperAttribute("AcDb::TableStyleFlags")> _
Public Enumeration TableStyleFlags
[FlagsAttribute]
[WrapperAttribute(L"AcDb::TableStyleFlags")]
public enum class TableStyleFlags
 Members
Member | Description
TableStyleModified
HorizontalInsideLineThird
HorizontalInsideLineSecond
HorizontalInsideLineFirst
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)