Reference Library
AddFitPointAt Method (index, point)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »AddFitPointAt(Int32, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool AddFitPointAt(
	int index,
	Point3d point
)
Public Function AddFitPointAt ( _
	index As Integer, _
	point As Point3d _
) As Boolean
public:
bool AddFitPointAt(
	int index,
	Point3d point
)
 Parameters
index(Int32)
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)