Reference Library
XrefPreXrefLockFileEventArgs Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefPreXrefLockFileEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class XrefPreXrefLockFileEventArgs : EventArgs
Public NotInheritable Class XrefPreXrefLockFileEventArgs _
	Inherits EventArgs
public ref class XrefPreXrefLockFileEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
btrId
 Inheritance Hierarchy
Object
EventArgs
| XrefPreXrefLockFileEventArgs
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)