Reference Library
PromptedForNestedEntity Event
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »PromptedForNestedEntity
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PromptNestedEntityResultEventHandler PromptedForNestedEntity
Public Event PromptedForNestedEntity As PromptNestedEntityResultEventHandler
public:
 event PromptNestedEntityResultEventHandler^ PromptedForNestedEntity {
	void add (PromptNestedEntityResultEventHandler^ value);
	void remove (PromptNestedEntityResultEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)