Reference Library
Keywords Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DatabaseSummaryInfoBuilder »Keywords
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Keywords { get; set; }
Public Property Keywords As String
	Get
	Set
public:
property String^ Keywords {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)