Reference Library
GetRotation Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »GetRotation(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double GetRotation(
	int row,
	int column
)
Public Overridable Function GetRotation ( _
	row As Integer, _
	column As Integer _
) As Double
public:
virtual double GetRotation(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)