Reference Library
LinearEntity2d Class
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity2d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeLinearEntity2d")]
public abstract class LinearEntity2d : Curve2d
<WrapperAttribute("ZcGeLinearEntity2d")> _
Public MustInherit Class LinearEntity2d _
	Inherits Curve2d
[WrapperAttribute(L"ZcGeLinearEntity2d")]
public ref class LinearEntity2d abstract : public Curve2d
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Create(IntPtr, Boolean)
Direction
GetLine()
GetPerpendicularLine(Point2d)
IntersectWith(LinearEntity2d, Tolerance)
IntersectWith(LinearEntity2d)
IsColinearTo(LinearEntity2d, Tolerance)
IsColinearTo(LinearEntity2d)
IsParallelTo(LinearEntity2d, Tolerance)
IsParallelTo(LinearEntity2d)
IsPerpendicularTo(LinearEntity2d, Tolerance)
IsPerpendicularTo(LinearEntity2d)
Overlap(LinearEntity2d, Tolerance)
Overlap(LinearEntity2d)
PointOnLine
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity2d
|  |  | Curve2d
|  |  |  | LinearEntity2d
|  |  |  |  | Line2d
|  |  |  |  | LineSegment2d
|  |  |  |  | Ray2d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)