Reference Library
SetMessageAndKeywords Method (messageAndKeywords, globalKeywords)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptOptions »SetMessageAndKeywords(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetMessageAndKeywords(
	string messageAndKeywords,
	string globalKeywords
)
Public Sub SetMessageAndKeywords ( _
	messageAndKeywords As String, _
	globalKeywords As String _
)
public:
void SetMessageAndKeywords(
	String^ messageAndKeywords,
	String^ globalKeywords
)
 Parameters
messageAndKeywords(String)
globalKeywords(String)
Assembly: ZwManaged (Module: ZwManaged)