Reference Library
Bulge Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Vertex2d »Bulge
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Bulge { get; set; }
Public Property Bulge As Double
	Get
	Set
public:
property double Bulge {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)