Reference Library
Dimzin Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimzin
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Dimzin { get; set; }
Public Property Dimzin As Integer
	Get
	Set
public:
property int Dimzin {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)