Reference Library
CellReference Structure
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellReference
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct CellReference
Public Structure CellReference
public value class CellReference
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Column
Row
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)