Reference Library
DsdEntryCollectionEnumerator Class
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdEntryCollectionEnumerator
 Declaration Syntax
C# | Visual Basic | Visual C++
public class DsdEntryCollectionEnumerator : IEnumerator
Public Class DsdEntryCollectionEnumerator _
	Implements IEnumerator
public ref class DsdEntryCollectionEnumerator : IEnumerator
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DsdEntryCollectionEnumerator(DsdEntryCollection)
Current
MoveNext()
Reset()
 Inheritance Hierarchy
Object
DsdEntryCollectionEnumerator
Assembly: ZwManaged (Module: ZwManaged)