Reference Library
UcsFollowModeOn Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »UcsFollowModeOn
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool UcsFollowModeOn { get; set; }
Public Property UcsFollowModeOn As Boolean
	Get
	Set
public:
property bool UcsFollowModeOn {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)