Reference Library
SliceByPlane Method (slicePlane)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Surface »SliceByPlane(Plane)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual SurfaceSliceResults SliceByPlane(
	Plane slicePlane
)
Public Overridable Function SliceByPlane ( _
	slicePlane As Plane _
) As SurfaceSliceResults
public:
virtual SurfaceSliceResults SliceByPlane(
	Plane^ slicePlane
)
 Parameters
slicePlane(Plane)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)