Reference Library
XrefEditEnabled Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »XrefEditEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool XrefEditEnabled { get; set; }
Public Property XrefEditEnabled As Boolean
	Get
	Set
public:
property bool XrefEditEnabled {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)