Reference Library
SetRelativeDrawOrder Method (collection)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DrawOrderTable »SetRelativeDrawOrder(ObjectIdCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetRelativeDrawOrder(
	ObjectIdCollection collection
)
Public Sub SetRelativeDrawOrder ( _
	collection As ObjectIdCollection _
)
public:
void SetRelativeDrawOrder(
	ObjectIdCollection^ collection
)
 Parameters
collection(ObjectIdCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)