Reference Library
btrIds Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefSubCommandEventArgs »btrIds
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectIdCollection btrIds { get; }
Public ReadOnly Property btrIds As ObjectIdCollection
	Get
public:
property ObjectIdCollection^ btrIds {
	ObjectIdCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)