Reference Library
NumberOfRows Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »NumberOfRows
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int NumberOfRows { get; }
Public Overridable ReadOnly Property NumberOfRows As Integer
	Get
public:
virtual property int NumberOfRows {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)