Reference Library
DataColumn Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataColumn
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbDataColumn")]
public class DataColumn : RXObject
<WrapperAttribute("ZcDbDataColumn")> _
Public Class DataColumn _
	Inherits RXObject
[WrapperAttribute(L"ZcDbDataColumn")]
public ref class DataColumn : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DataColumn(CellType, String)
DataColumn(DataColumn)
DataColumn()
DataColumn(IntPtr, Boolean)
AppendCell(DataCell)
Assign(DataColumn)
ColumnName
ColumnType
GetCellAt(Int32)
GetIndexAtCell(DataCell)
GrowLength
InsertCellAt(Int32, DataCell)
NumCells
PhysicalLength
RemoveCellAt(Int32)
SetCellAt(Int32, DataCell)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | DataColumn
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)