Reference Library
FinalGatherMode Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FinalGatherMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum FinalGatherMode
Public Enumeration FinalGatherMode
public enum class FinalGatherMode
 Members
Member | Description
FinalGatherCastAndReceive
FinalGatherReceive
FinalGatherCast
FinalGatherNone
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)