Reference Library
StringToAngle Method (value)
Namespaces »ZwSoft.ZwCAD.Runtime »Converter »StringToAngle(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static double StringToAngle(
	string value
)
Public Shared Function StringToAngle ( _
	value As String _
) As Double
public:
static double StringToAngle(
	String^ value
)
 Parameters
value(String)
Assembly: ZwManaged (Module: ZwManaged)