Reference Library
IsReallyClosing Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »IsReallyClosing
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsReallyClosing { get; }
Public ReadOnly Property IsReallyClosing As Boolean
	Get
public:
property bool IsReallyClosing {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)