Reference Library
MassProperties Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »MassProperties
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Solid3dMassProperties MassProperties { get; }
Public Overridable ReadOnly Property MassProperties As Solid3dMassProperties
	Get
public:
virtual property Solid3dMassProperties MassProperties {
	Solid3dMassProperties get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)