Reference Library
Arc Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Arc
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbArc")]
public class Arc : Curve
<WrapperAttribute("AcDbArc")> _
Public Class Arc _
	Inherits Curve
[WrapperAttribute(L"AcDbArc")]
public ref class Arc : public Curve
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Arc(Point3d, Vector3d, Double, Double, Double)
Arc(Point3d, Double, Double, Double)
Arc(IntPtr, Boolean)
Arc()
Center
EndAngle
Length
Normal
Radius
StartAngle
Thickness
TotalAngle
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Curve
|  |  |  |  |  |  | Arc
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)