Reference Library
GetDerivative Method (order)
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve3d »GetDerivative(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d GetDerivative(
	int order
)
Public Function GetDerivative ( _
	order As Integer _
) As Vector3d
public:
Vector3d GetDerivative(
	int order
)
 Parameters
order(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)