Reference Library
Section Constructor (pts, verticalDir)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Section »Section(Point3dCollection, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Section(
	Point3dCollection pts,
	Vector3d verticalDir
)
Public Sub New ( _
	pts As Point3dCollection, _
	verticalDir As Vector3d _
)
public:
Section(
	Point3dCollection^ pts,
	Vector3d verticalDir
)
 Parameters
pts(Point3dCollection)
verticalDir(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)