Reference Library
Update Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataLinkManager »Update()
 Members
Icon | Member | Description
Update(ObjectIdCollection, UpdateDirection, UpdateOption)
Update(UpdateDirection, UpdateOption)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)