Reference Library
Alignment Method (type)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »Alignment(RowType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual CellAlignment Alignment(
	RowType type
)
Public Overridable Function Alignment ( _
	type As RowType _
) As CellAlignment
public:
virtual CellAlignment Alignment(
	RowType type
)
 Parameters
type(RowType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)