Reference Library
PointOnLine Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PickPointDescriptor »PointOnLine
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d PointOnLine { get; }
Public ReadOnly Property PointOnLine As Point3d
	Get
public:
property Point3d PointOnLine {
	Point3d get ();
}
Assembly: ZwManaged (Module: ZwManaged)