Reference Library
OnSize Method (outputRect)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »OnSize(Rectangle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void OnSize(
	Rectangle outputRect
)
Public MustOverride Sub OnSize ( _
	outputRect As Rectangle _
)
public:
virtual void OnSize(
	Rectangle outputRect
) abstract
 Parameters
outputRect(Rectangle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)