Reference Library
GetTransformedCopy Method (transform)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »GetTransformedCopy(Matrix3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Entity GetTransformedCopy(
	Matrix3d transform
)
Public Overridable Function GetTransformedCopy ( _
	transform As Matrix3d _
) As Entity
public:
virtual Entity^ GetTransformedCopy(
	Matrix3d transform
)
 Parameters
transform(Matrix3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)