Reference Library
ClipBoundary2d Constructor (clipBoundary)
Namespaces »ZwSoft.ZwCAD.Geometry »ClipBoundary2d »ClipBoundary2d(Point2dCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ClipBoundary2d(
	Point2dCollection clipBoundary
)
Public Sub New ( _
	clipBoundary As Point2dCollection _
)
public:
ClipBoundary2d(
	Point2dCollection^ clipBoundary
)
 Parameters
clipBoundary(Point2dCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)