Reference Library
FullPath Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfig »FullPath
 Declaration Syntax
C# | Visual Basic | Visual C++
public string FullPath { get; }
Public ReadOnly Property FullPath As String
	Get
public:
property String^ FullPath {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)