Reference Library
Zaxis Property
Namespaces »ZwSoft.ZwCAD.Geometry »CoordinateSystem3d »Zaxis
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d Zaxis { get; }
Public ReadOnly Property Zaxis As Vector3d
	Get
public:
property Vector3d Zaxis {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)