Reference Library
AppendVertex Method (vertexToAppend)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline2d »AppendVertex(Vertex2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId AppendVertex(
	Vertex2d vertexToAppend
)
Public Function AppendVertex ( _
	vertexToAppend As Vertex2d _
) As ObjectId
public:
ObjectId AppendVertex(
	Vertex2d^ vertexToAppend
)
 Parameters
vertexToAppend(Vertex2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)