Reference Library
ResolutionMMPerPixel Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImageDef »ResolutionMMPerPixel
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Vector2d ResolutionMMPerPixel { get; set; }
Public Overridable Property ResolutionMMPerPixel As Vector2d
	Get
	Set
public:
virtual property Vector2d ResolutionMMPerPixel {
	Vector2d get ();
	void set (Vector2d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)