Reference Library
AppendLoop Method (hatchLoop)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »AppendLoop(HatchLoop)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AppendLoop(
	HatchLoop hatchLoop
)
Public Sub AppendLoop ( _
	hatchLoop As HatchLoop _
)
public:
void AppendLoop(
	HatchLoop^ hatchLoop
)
 Parameters
hatchLoop(HatchLoop)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)