Reference Library
ColorValue Property
Namespaces »ZwSoft.ZwCAD.Colors »Color »ColorValue
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color ColorValue { get; }
Public ReadOnly Property ColorValue As Color
	Get
public:
property Color ColorValue {
	Color get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)