Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleDescriptor »Inequality(PlotStyleDescriptor, PlotStyleDescriptor)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	PlotStyleDescriptor a,
	PlotStyleDescriptor b
)
Public Shared Operator <> ( _
	a As PlotStyleDescriptor, _
	b As PlotStyleDescriptor _
) As Boolean
public:
static bool operator !=(
	PlotStyleDescriptor a,
	PlotStyleDescriptor b
)
 Parameters
a(PlotStyleDescriptor)
b(PlotStyleDescriptor)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)