Reference Library
SubentityId Constructor (type, i)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SubentityId »SubentityId(SubentityType, Int64)
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use the overload taking IntPtr.")]
public SubentityId(
	SubentityType type,
	long i
)
<ObsoleteAttribute("Use the overload taking IntPtr.")> _
Public Sub New ( _
	type As SubentityType, _
	i As Long _
)
[ObsoleteAttribute(L"Use the overload taking IntPtr.")]
public:
SubentityId(
	SubentityType type,
	long long i
)
 Parameters
type(SubentityType)
i(Int64)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)