Reference Library
HasSubSelection Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »HasSubSelection
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool HasSubSelection { get; }
Public ReadOnly Property HasSubSelection As Boolean
	Get
public:
property bool HasSubSelection {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)