Reference Library
PromptDistanceOptionsEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDistanceOptionsEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void PromptDistanceOptionsEventHandler(
	Object sender,
	PromptDistanceOptionsEventArgs e
)
Public Delegate Sub PromptDistanceOptionsEventHandler ( _
	sender As Object, _
	e As PromptDistanceOptionsEventArgs _
)
public delegate void PromptDistanceOptionsEventHandler(
	Object^ sender,
	PromptDistanceOptionsEventArgs^ e
)
 Parameters
sender(Object)
e(PromptDistanceOptionsEventArgs)
Assembly: ZwManaged (Module: ZwManaged)