Reference Library
KeywordCollection Class
Namespaces »ZwSoft.ZwCAD.EditorInput »KeywordCollection
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class KeywordCollection : ICollection
Public NotInheritable Class KeywordCollection _
	Implements ICollection
public ref class KeywordCollection sealed : ICollection
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
KeywordCollection()
Add(String, String, String, Boolean, Boolean)
Add(String, String, String)
Add(String, String)
Add(String)
Clear()
CopyTo(Keyword[], Int32)
CopyTo(Array, Int32)
Count
Default
GetDisplayString(Boolean)
GetEnumerator()
IsReadOnly
IsSynchronized
Item[Int32]
SyncRoot
 Inheritance Hierarchy
Object
KeywordCollection
Assembly: ZwManaged (Module: ZwManaged)