Reference Library
PolyType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline2d »PolyType
 Declaration Syntax
C# | Visual Basic | Visual C++
public Poly2dType PolyType { get; set; }
Public Property PolyType As Poly2dType
	Get
	Set
public:
property Poly2dType PolyType {
	Poly2dType get ();
	void set (Poly2dType value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)