Reference Library
ExternalBoundedSurface Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalBoundedSurface »ExternalBoundedSurface()
 Members
Icon | Member | Description
ExternalBoundedSurface(IntPtr, ExternalEntityKind)
ExternalBoundedSurface()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)