Reference Library
WritePoint3d Method (opCode, value, precision)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DxfFiler »WritePoint3d(DxfCode, Point3d, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void WritePoint3d(
	DxfCode opCode,
	Point3d value,
	int precision
)
Public MustOverride Sub WritePoint3d ( _
	opCode As DxfCode, _
	value As Point3d, _
	precision As Integer _
)
public:
virtual void WritePoint3d(
	DxfCode opCode,
	Point3d value,
	int precision
) abstract
 Parameters
opCode(DxfCode)
value(Point3d)
precision(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)