Reference Library
Exception Class
Namespaces »ZwSoft.ZwCAD.Runtime »Exception
 Declaration Syntax
C# | Visual Basic | Visual C++
[SerializableAttribute]
public class Exception : Exception, ISerializable
<SerializableAttribute> _
Public Class Exception _
	Inherits Exception _
	Implements ISerializable
[SerializableAttribute]
public ref class Exception : public Exception,
	ISerializable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Exception(ErrorStatus, String, Exception)
Exception(SerializationInfo, StreamingContext)
Exception(ErrorStatus, String)
Exception(ErrorStatus)
Exception()
ErrorStatus
GetObjectData(SerializationInfo, StreamingContext) |  (Overrides Exception.GetObjectData(SerializationInfo, StreamingContext).)
 Inheritance Hierarchy
Object
Exception
| Exception
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)