Reference Library
GetVisualStyleList Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »GetVisualStyleList()
 Declaration Syntax
C# | Visual Basic | Visual C++
public StringCollection GetVisualStyleList()
Public Function GetVisualStyleList As StringCollection
public:
StringCollection^ GetVisualStyleList()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)