Reference Library
WriteDsd Method (fileName)
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdData »WriteDsd(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void WriteDsd(
	string fileName
)
Public Sub WriteDsd ( _
	fileName As String _
)
public:
void WriteDsd(
	String^ fileName
)
 Parameters
fileName(String)
Assembly: ZwManaged (Module: ZwManaged)