Reference Library
Direction1 Property
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock2d »Direction1
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector2d Direction1 { get; }
Public ReadOnly Property Direction1 As Vector2d
	Get
public:
property Vector2d Direction1 {
	Vector2d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)