Reference Library
Rotation Method (angle, axis, center)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »Rotation(Double, Vector3d, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Matrix3d Rotation(
	double angle,
	Vector3d axis,
	Point3d center
)
Public Shared Function Rotation ( _
	angle As Double, _
	axis As Vector3d, _
	center As Point3d _
) As Matrix3d
public:
static Matrix3d Rotation(
	double angle,
	Vector3d axis,
	Point3d center
)
 Parameters
angle(Double)
axis(Vector3d)
center(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)