Reference Library
SetRevolve Method (axisPoint, axisDirection, revolveAngle, revolveOptions)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolvedSurface »SetRevolve(Point3d, Vector3d, Double, RevolveOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetRevolve(
	Point3d axisPoint,
	Vector3d axisDirection,
	double revolveAngle,
	RevolveOptions revolveOptions
)
Public Sub SetRevolve ( _
	axisPoint As Point3d, _
	axisDirection As Vector3d, _
	revolveAngle As Double, _
	revolveOptions As RevolveOptions _
)
public:
void SetRevolve(
	Point3d axisPoint,
	Vector3d axisDirection,
	double revolveAngle,
	RevolveOptions^ revolveOptions
)
 Parameters
axisPoint(Point3d)
axisDirection(Vector3d)
revolveAngle(Double)
revolveOptions(RevolveOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)