Reference Library
SetFormat Method (row, col, pFormat)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetFormat(Int32, Int32, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetFormat(
	int row,
	int col,
	string pFormat
)
Public Overridable Sub SetFormat ( _
	row As Integer, _
	col As Integer, _
	pFormat As String _
)
public:
virtual void SetFormat(
	int row,
	int col,
	String^ pFormat
)
 Parameters
row(Int32)
col(Int32)
pFormat(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)