Reference Library
Sphere Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Sphere »Sphere()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Sphere()
Public Sub New
public:
Sphere()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)