Reference Library
PixelToModelTransform Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImage »PixelToModelTransform
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Matrix3d PixelToModelTransform { get; }
Public Overridable ReadOnly Property PixelToModelTransform As Matrix3d
	Get
public:
virtual property Matrix3d PixelToModelTransform {
	Matrix3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)