Reference Library
SnapOn Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »SnapOn
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool SnapOn { get; set; }
Public Property SnapOn As Boolean
	Get
	Set
public:
property bool SnapOn {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)