Reference Library
Saveproxygraphics Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Saveproxygraphics
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Saveproxygraphics { get; set; }
Public Property Saveproxygraphics As Integer
	Get
	Set
public:
property int Saveproxygraphics {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)