Reference Library
Curve2dCollection Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2dCollection »Curve2dCollection()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Curve2dCollection()
Public Sub New
public:
Curve2dCollection()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)