Reference Library
ConvertTo Method (context, culture, value, destinationType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LineWeightConverter »ConvertTo(ITypeDescriptorContext, CultureInfo, Object, Type)
 Declaration Syntax
C# | Visual Basic | Visual C++
public override Object ConvertTo(
	ITypeDescriptorContext context,
	CultureInfo culture,
	Object value,
	Type destinationType
)
Public Overrides Function ConvertTo ( _
	context As ITypeDescriptorContext, _
	culture As CultureInfo, _
	value As Object, _
	destinationType As Type _
) As Object
public:
virtual Object^ ConvertTo(
	ITypeDescriptorContext^ context,
	CultureInfo^ culture,
	Object^ value,
	Type^ destinationType
) override
 Parameters
context(ITypeDescriptorContext)
culture(CultureInfo)
value(Object)
destinationType(Type)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)