Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.EditorInput »PickPointDescriptor »Inequality(PickPointDescriptor, PickPointDescriptor)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	PickPointDescriptor a,
	PickPointDescriptor b
)
Public Shared Operator <> ( _
	a As PickPointDescriptor, _
	b As PickPointDescriptor _
) As Boolean
public:
static bool operator !=(
	PickPointDescriptor a,
	PickPointDescriptor b
)
 Parameters
a(PickPointDescriptor)
b(PickPointDescriptor)
Assembly: ZwManaged (Module: ZwManaged)