Reference Library
GetInverseTangentVector Method
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnSurface »GetInverseTangentVector()
 Members
Icon | Member | Description
GetInverseTangentVector(Vector3d, Surface, Point2d)
GetInverseTangentVector(Vector3d, Point2d)
GetInverseTangentVector(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)