Reference Library
Type Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SubentityId »Type
 Declaration Syntax
C# | Visual Basic | Visual C++
public SubentityType Type { get; }
Public ReadOnly Property Type As SubentityType
	Get
public:
property SubentityType Type {
	SubentityType get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)