Reference Library
Load Method (fileName)
Namespaces »ZwSoft.ZwCAD.Runtime »ExtensionLoader »Load(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
[SecurityPermissionAttribute(SecurityAction.LinkDemand, Infrastructure = true)]
public static Assembly Load(
	string fileName
)
<SecurityPermissionAttribute(SecurityAction.LinkDemand, Infrastructure := True)> _
Public Shared Function Load ( _
	fileName As String _
) As Assembly
[SecurityPermissionAttribute(SecurityAction::LinkDemand, Infrastructure = true)]
public:
static Assembly^ Load(
	String^ fileName
)
 Parameters
fileName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)