Reference Library
ServerName Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfig »ServerName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string ServerName { get; }
Public ReadOnly Property ServerName As String
	Get
public:
property String^ ServerName {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)