Reference Library
TaperAngle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ExtrudedSurface »TaperAngle
 Declaration Syntax
C# | Visual Basic | Visual C++
public double TaperAngle { get; set; }
Public Property TaperAngle As Double
	Get
	Set
public:
property double TaperAngle {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)