Reference Library
Dimtvp Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimtvp
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double Dimtvp { get; set; }
Public Overridable Property Dimtvp As Double
	Get
	Set
public:
virtual property double Dimtvp {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)