Reference Library
Dimclrt Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimclrt
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color Dimclrt { get; set; }
Public Property Dimclrt As Color
	Get
	Set
public:
property Color^ Dimclrt {
	Color^ get ();
	void set (Color^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)