Reference Library
BoundBlock2d Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock2d »BoundBlock2d()
 Declaration Syntax
C# | Visual Basic | Visual C++
public BoundBlock2d()
Public Sub New
public:
BoundBlock2d()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)