Reference Library
Addition Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »Addition(Point3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Point3d operator +(
	Point3d a,
	Vector3d vector
)
Public Shared Operator + ( _
	a As Point3d, _
	vector As Vector3d _
) As Point3d
public:
static Point3d operator +(
	Point3d a,
	Vector3d vector
)
 Parameters
a(Point3d)
vector(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)