Reference Library
GetUnderLinePoints Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MTextFragment »GetUnderLinePoints()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d[] GetUnderLinePoints()
Public Function GetUnderLinePoints As Point3d()
public:
array<Point3d>^ GetUnderLinePoints()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)