Reference Library
ThumbnailBitmap Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »ThumbnailBitmap
 Declaration Syntax
C# | Visual Basic | Visual C++
public Bitmap ThumbnailBitmap { get; set; }
Public Property ThumbnailBitmap As Bitmap
	Get
	Set
public:
property Bitmap^ ThumbnailBitmap {
	Bitmap^ get ();
	void set (Bitmap^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)