Reference Library
SubEntityTraits Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »SubEntityTraits
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcGiSubEntityTraits")]
public abstract class SubEntityTraits : DrawableTraits
<WrapperAttribute("AcGiSubEntityTraits")> _
Public MustInherit Class SubEntityTraits _
	Inherits DrawableTraits
[WrapperAttribute(L"AcGiSubEntityTraits")]
public ref class SubEntityTraits abstract : public DrawableTraits
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
SubEntityTraits(IntPtr, Boolean)
SubEntityTraits()
Color
DrawFlags
FillType
Layer
LineType
LineTypeScale
LineWeight
Mapper
Material
PlotStyleDescriptor
Sectionable
SelectionOnlyGeometry
SetSelectionMarker(IntPtr)
ShadowFlags
Thickness
Transparency
TrueColor
VisualStyle
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | DrawableTraits
|  |  |  | SubEntityTraits
|  |  |  |  | NonEntityTraits
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)