Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Handle »Inequality(Handle, Handle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	Handle a,
	Handle b
)
Public Shared Operator <> ( _
	a As Handle, _
	b As Handle _
) As Boolean
public:
static bool operator !=(
	Handle a,
	Handle b
)
 Parameters
a(Handle)
b(Handle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)