Reference Library
IsContinuousAtUpper Method (otherInterval)
Namespaces »ZwSoft.ZwCAD.Geometry »Interval »IsContinuousAtUpper(Interval)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsContinuousAtUpper(
	Interval otherInterval
)
Public Function IsContinuousAtUpper ( _
	otherInterval As Interval _
) As Boolean
public:
bool IsContinuousAtUpper(
	Interval^ otherInterval
)
 Parameters
otherInterval(Interval)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)