Reference Library
TextHeight Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeaderStyle »TextHeight
 Declaration Syntax
C# | Visual Basic | Visual C++
public double TextHeight { get; set; }
Public Property TextHeight As Double
	Get
	Set
public:
property double TextHeight {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)