Reference Library
VertexPosition Method (vertex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline2d »VertexPosition(Vertex2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d VertexPosition(
	Vertex2d vertex
)
Public Function VertexPosition ( _
	vertex As Vertex2d _
) As Point3d
public:
Point3d VertexPosition(
	Vertex2d^ vertex
)
 Parameters
vertex(Vertex2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)