Reference Library
ConvertToPolyMeshType Method (newVal)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolygonMesh »ConvertToPolyMeshType(PolyMeshType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void ConvertToPolyMeshType(
	PolyMeshType newVal
)
Public Sub ConvertToPolyMeshType ( _
	newVal As PolyMeshType _
)
public:
void ConvertToPolyMeshType(
	PolyMeshType newVal
)
 Parameters
newVal(PolyMeshType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)