Reference Library
Dimtm Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimtm
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double Dimtm { get; set; }
Public Overridable Property Dimtm As Double
	Get
	Set
public:
virtual property double Dimtm {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)