Reference Library
Dimblk1s Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimblk1s
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Dimblk1s { get; set; }
Public Property Dimblk1s As String
	Get
	Set
public:
property String^ Dimblk1s {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)