Reference Library
Dimgap Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimgap
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Dimgap { get; set; }
Public Property Dimgap As Double
	Get
	Set
public:
property double Dimgap {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)