Reference Library
GetIterator Method (filter)
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »Index »GetIterator(Filter)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual FilteredBlockIterator GetIterator(
	Filter filter
)
Public Overridable Function GetIterator ( _
	filter As Filter _
) As FilteredBlockIterator
public:
virtual FilteredBlockIterator^ GetIterator(
	Filter^ filter
)
 Parameters
filter(Filter)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)