Reference Library
SetNamesFromDictionaryKey Method (parameter)
Namespaces »ZwSoft.ZwCAD.Colors »Color »SetNamesFromDictionaryKey(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetNamesFromDictionaryKey(
	string parameter
)
Public Sub SetNamesFromDictionaryKey ( _
	parameter As String _
)
public:
void SetNamesFromDictionaryKey(
	String^ parameter
)
 Parameters
parameter(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)