Reference Library
BulgeVertex Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BulgeVertex
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class BulgeVertex
Public NotInheritable Class BulgeVertex
public ref class BulgeVertex sealed
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
BulgeVertex(Point2d, Double)
Bulge
Vertex
 Inheritance Hierarchy
Object
BulgeVertex
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)