Reference Library
UserGiContext Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ImpDevice »UserGiContext
 Declaration Syntax
C# | Visual Basic | Visual C++
public override Context UserGiContext { get; set; }
Public Overrides Property UserGiContext As Context
	Get
	Set
public:
virtual property Context^ UserGiContext {
	Context^ get () override;
	void set (Context^ value) override;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)