Reference Library
SetFormula Method (row, column, contentIndex, formula)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetFormula(Int32, Int32, Int32, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetFormula(
	int row,
	int column,
	int contentIndex,
	string formula
)
Public Overridable Sub SetFormula ( _
	row As Integer, _
	column As Integer, _
	contentIndex As Integer, _
	formula As String _
)
public:
virtual void SetFormula(
	int row,
	int column,
	int contentIndex,
	String^ formula
)
 Parameters
row(Int32)
column(Int32)
contentIndex(Int32)
formula(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)