Reference Library
Height Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Helix »Height
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
public:
property double Height {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)