Reference Library
IsNotifyEnabled Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »IsNotifyEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsNotifyEnabled { get; }
Public ReadOnly Property IsNotifyEnabled As Boolean
	Get
public:
property bool IsNotifyEnabled {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)