Reference Library
Bold Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MTextFragment »Bold
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Bold { get; }
Public ReadOnly Property Bold As Boolean
	Get
public:
property bool Bold {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)