Reference Library
Extrude Method (region, height, taperAngle)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »Extrude(Region, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void Extrude(
	Region region,
	double height,
	double taperAngle
)
Public Overridable Sub Extrude ( _
	region As Region, _
	height As Double, _
	taperAngle As Double _
)
public:
virtual void Extrude(
	Region^ region,
	double height,
	double taperAngle
)
 Parameters
region(Region)
height(Double)
taperAngle(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)