Reference Library
CmlstyleID Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »CmlstyleID
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId CmlstyleID { get; set; }
Public Property CmlstyleID As ObjectId
	Get
	Set
public:
property ObjectId CmlstyleID {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)