Reference Library
BlockInsertionPointsEventArgs Constructor (blockTableRecord, points, alignmentVectors)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockInsertionPointsEventArgs »BlockInsertionPointsEventArgs(BlockTableRecord, Point3dCollection, Vector3dCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public BlockInsertionPointsEventArgs(
	BlockTableRecord blockTableRecord,
	Point3dCollection points,
	Vector3dCollection alignmentVectors
)
Public Sub New ( _
	blockTableRecord As BlockTableRecord, _
	points As Point3dCollection, _
	alignmentVectors As Vector3dCollection _
)
public:
BlockInsertionPointsEventArgs(
	BlockTableRecord^ blockTableRecord,
	Point3dCollection^ points,
	Vector3dCollection^ alignmentVectors
)
 Parameters
blockTableRecord(BlockTableRecord)
points(Point3dCollection)
alignmentVectors(Vector3dCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)