Reference Library
Normal Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Circle »Normal
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d Normal { get; set; }
Public Property Normal As Vector3d
	Get
	Set
public:
property Vector3d Normal {
	Vector3d get ();
	void set (Vector3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)