Reference Library
XrefComandeered Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »XrefComandeered
 Declaration Syntax
C# | Visual Basic | Visual C++
public event XrefComandeeredEventHandler XrefComandeered
Public Event XrefComandeered As XrefComandeeredEventHandler
public:
 event XrefComandeeredEventHandler^ XrefComandeered {
	void add (XrefComandeeredEventHandler^ value);
	void remove (XrefComandeeredEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)