Reference Library
HpOrigin Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »HpOrigin
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d HpOrigin { get; set; }
Public Property HpOrigin As Point2d
	Get
	Set
public:
property Point2d HpOrigin {
	Point2d get ();
	void set (Point2d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)