Reference Library
Shape Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Shape
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbShape")]
public class Shape : Entity
<WrapperAttribute("AcDbShape")> _
Public Class Shape _
	Inherits Entity
[WrapperAttribute(L"AcDbShape")]
public ref class Shape : public Entity
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Shape(Point3d, Double, Double, Double)
Shape()
Shape(IntPtr, Boolean)
Name
Normal
Oblique
Position
Rotation
ShapeIndex
ShapeNumber
Size
StyleId
Thickness
WidthFactor
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Shape
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)