Reference Library
SetFieldCodeWithChildren Method (flag, fieldCode)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Field »SetFieldCodeWithChildren(FieldCodeFlags, FieldCodeWithChildren)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFieldCodeWithChildren(
	FieldCodeFlags flag,
	FieldCodeWithChildren fieldCode
)
Public Sub SetFieldCodeWithChildren ( _
	flag As FieldCodeFlags, _
	fieldCode As FieldCodeWithChildren _
)
public:
void SetFieldCodeWithChildren(
	FieldCodeFlags flag,
	FieldCodeWithChildren^ fieldCode
)
 Parameters
flag(FieldCodeFlags)
fieldCode(FieldCodeWithChildren)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)