Reference Library
MajorRadius Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ellipse »MajorRadius
 Declaration Syntax
C# | Visual Basic | Visual C++
public double MajorRadius { get; }
Public ReadOnly Property MajorRadius As Double
	Get
public:
property double MajorRadius {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)