Reference Library
IEnumerable_GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripDataCollection »IEnumerable.GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
IEnumerator IEnumerable.GetEnumerator()
Private Function IEnumerable_GetEnumerator As IEnumerator
	Implements IEnumerable.GetEnumerator
private:
virtual IEnumerator^ IEnumerable_GetEnumerator() sealed = IEnumerable::GetEnumerator
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)