Reference Library
Drag Method (jig)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »Drag(Jig)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptResult Drag(
	Jig jig
)
Public Function Drag ( _
	jig As Jig _
) As PromptResult
public:
PromptResult^ Drag(
	Jig^ jig
)
 Parameters
jig(Jig)
Assembly: ZwManaged (Module: ZwManaged)