Reference Library
GridColor Method (gridlineType, type)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GridColor(GridLineType, RowType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Color GridColor(
	GridLineType gridlineType,
	RowType type
)
Public Overridable Function GridColor ( _
	gridlineType As GridLineType, _
	type As RowType _
) As Color
public:
virtual Color^ GridColor(
	GridLineType gridlineType,
	RowType type
)
 Parameters
gridlineType(GridLineType)
type(RowType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)