Reference Library
ScaleBy Method (scaleFactor, centerPoint)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »ScaleBy(Double, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d ScaleBy(
	double scaleFactor,
	Point3d centerPoint
)
Public Function ScaleBy ( _
	scaleFactor As Double, _
	centerPoint As Point3d _
) As Point3d
public:
Point3d ScaleBy(
	double scaleFactor,
	Point3d centerPoint
)
 Parameters
scaleFactor(Double)
centerPoint(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)