Reference Library
IList_Add Method (value)
Namespaces »ZwSoft.ZwCAD.Windows »MenuItemCollection »IList.Add(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
int IList.Add(
	Object value
)
Private Function IList_Add ( _
	value As Object _
) As Integer Implements IList.Add
private:
virtual int IList_Add(
	Object^ value
) sealed = IList::Add
 Parameters
value(Object)
Assembly: ZwManaged (Module: ZwManaged)