Reference Library
SetFitData Method (fitPoints, startTangent, endTangent, knotParam, fitTolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »SetFitData(Point2dCollection, Vector2d, Vector2d, KnotParameterizationEnum, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFitData(
	Point2dCollection fitPoints,
	Vector2d startTangent,
	Vector2d endTangent,
	KnotParameterizationEnum knotParam,
	Tolerance fitTolerance
)
Public Sub SetFitData ( _
	fitPoints As Point2dCollection, _
	startTangent As Vector2d, _
	endTangent As Vector2d, _
	knotParam As KnotParameterizationEnum, _
	fitTolerance As Tolerance _
)
public:
void SetFitData(
	Point2dCollection^ fitPoints,
	Vector2d startTangent,
	Vector2d endTangent,
	KnotParameterizationEnum knotParam,
	Tolerance fitTolerance
)
 Parameters
fitPoints(Point2dCollection)
startTangent(Vector2d)
endTangent(Vector2d)
knotParam(KnotParameterizationEnum)
fitTolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)