Reference Library
ClosestPointTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »Surface »ClosestPointTo()
 Members
Icon | Member | Description
ClosestPointTo(Point3d, Tolerance)
ClosestPointTo(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)