Reference Library
SetCurrentConfig Method (deviceName)
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfigManager »SetCurrentConfig(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static PlotConfig SetCurrentConfig(
	string deviceName
)
Public Shared Function SetCurrentConfig ( _
	deviceName As String _
) As PlotConfig
public:
static PlotConfig^ SetCurrentConfig(
	String^ deviceName
)
 Parameters
deviceName(String)
Assembly: ZwManaged (Module: ZwManaged)