Reference Library
DocumentBeginCloseEventArgs Class
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentBeginCloseEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class DocumentBeginCloseEventArgs : EventArgs
Public NotInheritable Class DocumentBeginCloseEventArgs _
	Inherits EventArgs
public ref class DocumentBeginCloseEventArgs sealed : public EventArgs
 Members
All Members | Constructors | Methods
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DocumentBeginCloseEventArgs()
Veto()
 Inheritance Hierarchy
Object
EventArgs
| DocumentBeginCloseEventArgs
Assembly: ZwManaged (Module: ZwManaged)