Reference Library
IsUnbounded Property
Namespaces »ZwSoft.ZwCAD.Geometry »Interval »IsUnbounded
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsUnbounded { get; }
Public ReadOnly Property IsUnbounded As Boolean
	Get
public:
property bool IsUnbounded {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)