Reference Library
CustomScale Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »CustomScale
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Unitless)]
public double CustomScale { get; set; }
<UnitTypeAttribute(UnitType.Unitless)> _
Public Property CustomScale As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Unitless)]
public:
property double CustomScale {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)