Reference Library
IsMClosed Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolygonMesh »IsMClosed
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsMClosed { get; }
Public ReadOnly Property IsMClosed As Boolean
	Get
public:
property bool IsMClosed {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)