Reference Library
XrefRedirectedEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefRedirectedEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void XrefRedirectedEventHandler(
	Object sender,
	XrefRedirectedEventArgs e
)
Public Delegate Sub XrefRedirectedEventHandler ( _
	sender As Object, _
	e As XrefRedirectedEventArgs _
)
public delegate void XrefRedirectedEventHandler(
	Object^ sender,
	XrefRedirectedEventArgs^ e
)
 Parameters
sender(Object)
e(XrefRedirectedEventArgs)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)