Reference Library
SelectCrossingWindow Method (pt1, pt2)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »SelectCrossingWindow(Point3d, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptSelectionResult SelectCrossingWindow(
	Point3d pt1,
	Point3d pt2
)
Public Function SelectCrossingWindow ( _
	pt1 As Point3d, _
	pt2 As Point3d _
) As PromptSelectionResult
public:
PromptSelectionResult^ SelectCrossingWindow(
	Point3d pt1,
	Point3d pt2
)
 Parameters
pt1(Point3d)
pt2(Point3d)
Assembly: ZwManaged (Module: ZwManaged)