Reference Library
GetDistanceTo Method (point, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »GetDistanceTo(Point2d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetDistanceTo(
	Point2d point,
	Tolerance tolerance
)
Public Function GetDistanceTo ( _
	point As Point2d, _
	tolerance As Tolerance _
) As Double
public:
double GetDistanceTo(
	Point2d point,
	Tolerance tolerance
)
 Parameters
point(Point2d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)