Reference Library
ImageIndex Property
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerFilterDisplayImages »ImageIndex
 Declaration Syntax
C# | Visual Basic | Visual C++
public int ImageIndex { get; set; }
Public Property ImageIndex As Integer
	Get
	Set
public:
property int ImageIndex {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)