Reference Library
GetControlPoints Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »NurbsData »GetControlPoints()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3dCollection GetControlPoints()
Public Function GetControlPoints As Point3dCollection
public:
Point3dCollection^ GetControlPoints()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)