Reference Library
Dimblk1 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimblk1
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Dimblk1 { get; set; }
Public Property Dimblk1 As ObjectId
	Get
	Set
public:
property ObjectId Dimblk1 {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)