Reference Library
GetInterval Method
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »GetInterval()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Interval GetInterval()
Public Function GetInterval As Interval
public:
Interval^ GetInterval()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)