Reference Library
CurrentSectionType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »CurrentSectionType
 Declaration Syntax
C# | Visual Basic | Visual C++
public SectionType CurrentSectionType { get; set; }
Public Property CurrentSectionType As SectionType
	Get
	Set
public:
property SectionType CurrentSectionType {
	SectionType get ();
	void set (SectionType value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)