Reference Library
RepairPreExtendedSymbolName Method (oldName, allowVerticalBar)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »RepairPreExtendedSymbolName(String, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string RepairPreExtendedSymbolName(
	string oldName,
	bool allowVerticalBar
)
Public Shared Function RepairPreExtendedSymbolName ( _
	oldName As String, _
	allowVerticalBar As Boolean _
) As String
public:
static String^ RepairPreExtendedSymbolName(
	String^ oldName,
	bool allowVerticalBar
)
 Parameters
oldName(String)
allowVerticalBar(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)