Reference Library
UndoRecording Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »UndoRecording
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool UndoRecording { get; }
Public ReadOnly Property UndoRecording As Boolean
	Get
public:
property bool UndoRecording {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)