Reference Library
Precision Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DxfFiler »Precision
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract int Precision { get; set; }
Public MustOverride Property Precision As Integer
	Get
	Set
public:
virtual property int Precision {
	int get () abstract;
	void set (int value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)