Reference Library
CopyTo Method (array, index)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentCollection »ICollection.CopyTo(Array, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
void ICollection.CopyTo(
	Array array,
	int index
)
Private Sub CopyTo ( _
	array As Array, _
	index As Integer _
) Implements ICollection.CopyTo
private:
virtual void CopyTo(
	Array^ array,
	int index
) sealed = ICollection::CopyTo
 Parameters
array(Array)
index(Int32)
Assembly: ZwManaged (Module: ZwManaged)