Reference Library
PickedPoint Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptEntityResult »PickedPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d PickedPoint { get; }
Public ReadOnly Property PickedPoint As Point3d
	Get
public:
property Point3d PickedPoint {
	Point3d get ();
}
Assembly: ZwManaged (Module: ZwManaged)