Reference Library
MinimumTableWidth Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »MinimumTableWidth
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double MinimumTableWidth { get; }
Public Overridable ReadOnly Property MinimumTableWidth As Double
	Get
public:
virtual property double MinimumTableWidth {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)