Reference Library
CellProperties Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellProperties
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum CellProperties
Public Enumeration CellProperties
public enum class CellProperties
 Members
Member | Description
MarginVertSpacing
MarginHorzSpacing
FlowDirBtoT
MergeAll
ContentLayout
MarginBottom
MarginRight
MarginTop
MarginLeft
BackgroundColor
AutoScale
TextHeight
TextStyle
ContentColor
Scale
Rotation
DataFormat
DataType
Invalid
Alignment
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)