Reference Library
IsPlanar Method (plane)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »IsPlanar(Plane)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPlanar(
	out Plane plane
)
Public Function IsPlanar ( _
	<OutAttribute> ByRef plane As Plane _
) As Boolean
public:
bool IsPlanar(
	[OutAttribute] Plane^% plane
)
 Parameters
plane(Plane%)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)