Reference Library
Key Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »IdPair »Key
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Key { get; }
Public ReadOnly Property Key As ObjectId
	Get
public:
property ObjectId Key {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)