Reference Library
SaveFileDialog.SaveFileDialogFlags Enumeration
Namespaces »ZwSoft.ZwCAD.Windows »SaveFileDialog »SaveFileDialog.SaveFileDialogFlags
 Declaration Syntax
C# | Visual Basic | Visual C++
[FlagsAttribute]
public enum SaveFileDialogFlags
<FlagsAttribute> _
Public Enumeration SaveFileDialogFlags
[FlagsAttribute]
public enum class SaveFileDialogFlags
 Members
Member | Description
NoShellExtensions
NoFtpSites
ForceDefaultFolder
NoUrls
DoNotTransferRemoteFiles
DoNotWarnIfFileExist
DefaultIsFolder
AllowAnyExtension
Assembly: ZwManaged (Module: ZwManaged)