Reference Library
Variant Constructor (value)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Variant »Variant(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Variant(
	string value
)
Public Sub New ( _
	value As String _
)
public:
Variant(
	String^ value
)
 Parameters
value(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)