Reference Library
ZcadDocument Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »ZcadDocument
 Declaration Syntax
C# | Visual Basic | Visual C++
public Object ZcadDocument { get; }
Public ReadOnly Property ZcadDocument As Object
	Get
public:
property Object^ ZcadDocument {
	Object^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)