Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCellCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public DataCell this[
	int index
] { get; set; }
Public Default Property Item ( _
	index As Integer _
) As DataCell
	Get
	Set
public:
property DataCell^ default[int index] {
	DataCell^ get (int index);
	void set (int index, DataCell^ value);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)