Reference Library
RadialDimension Constructor (unmanagedObjPtr, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RadialDimension »RadialDimension(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal RadialDimension(
	IntPtr unmanagedObjPtr,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedObjPtr As IntPtr, _
	autoDelete As Boolean _
)
protected public:
RadialDimension(
	IntPtr unmanagedObjPtr,
	bool autoDelete
)
 Parameters
unmanagedObjPtr(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)