Reference Library
BigFontFileName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TextStyleTableRecord »BigFontFileName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string BigFontFileName { get; set; }
Public Property BigFontFileName As String
	Get
	Set
public:
property String^ BigFontFileName {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)