Reference Library
Color Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »SubEntityTraits »Color
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract short Color { get; set; }
Public MustOverride Property Color As Short
	Get
	Set
public:
virtual property short Color {
	short get () abstract;
	void set (short value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)