Reference Library
Center Property
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc2d »Center
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d Center { get; set; }
Public Property Center As Point2d
	Get
	Set
public:
property Point2d Center {
	Point2d get ();
	void set (Point2d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)