Reference Library
LeaderLineTypeId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »LeaderLineTypeId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId LeaderLineTypeId { get; set; }
Public Property LeaderLineTypeId As ObjectId
	Get
	Set
public:
property ObjectId LeaderLineTypeId {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)