Reference Library
Ellipse Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ellipse
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbEllipse")]
public class Ellipse : Curve
<WrapperAttribute("AcDbEllipse")> _
Public Class Ellipse _
	Inherits Curve
[WrapperAttribute(L"AcDbEllipse")]
public ref class Ellipse : public Curve
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Ellipse(Point3d, Vector3d, Vector3d, Double, Double, Double)
Ellipse(IntPtr, Boolean)
Ellipse()
Center
EndAngle
EndParam |  (Overrides Curve.EndParam.)
GetAngleAtParameter(Double)
GetParameterAtAngle(Double)
IsNull
MajorAxis
MajorRadius
MinorAxis
MinorRadius
Normal
RadiusRatio
Set(Point3d, Vector3d, Vector3d, Double, Double, Double)
StartAngle
StartParam |  (Overrides Curve.StartParam.)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Curve
|  |  |  |  |  |  | Ellipse
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)