Reference Library
Set Method (u, origin, v)
Namespaces »ZwSoft.ZwCAD.Geometry »Plane »Set(Point3d, Point3d, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	Point3d u,
	Point3d origin,
	Point3d v
)
Public Sub Set ( _
	u As Point3d, _
	origin As Point3d, _
	v As Point3d _
)
public:
void Set(
	Point3d u,
	Point3d origin,
	Point3d v
)
 Parameters
u(Point3d)
origin(Point3d)
v(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)