Reference Library
UInt32Collection Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »UInt32Collection »UInt32Collection()
 Members
Icon | Member | Description
UInt32Collection(Int32)
UInt32Collection(UInt32[])
UInt32Collection()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)