Reference Library
IsLinear Method
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc3d »IsLinear()
 Members
Icon | Member | Description
IsLinear(Line3d, Tolerance)
IsLinear(Line3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)