Reference Library
Utils Class
Namespaces »ZwSoft.ZwCAD.Internal »Utils
 Declaration Syntax
C# | Visual Basic | Visual C++
public class Utils
Public Class Utils
public ref class Utils
 Members
All Members | Constructors | Methods
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Utils()
IsStartedByOLE()
SelectObjects(ObjectId[])
SetFocusToDwgView()
SynchZcadDisplay()
 Inheritance Hierarchy
Object
Utils
Assembly: ZwManaged (Module: ZwManaged)