Reference Library
InitCommandVersion Method (nVersion)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »InitCommandVersion(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int InitCommandVersion(
	int nVersion
)
Public Function InitCommandVersion ( _
	nVersion As Integer _
) As Integer
public:
int InitCommandVersion(
	int nVersion
)
 Parameters
nVersion(Int32)
Assembly: ZwManaged (Module: ZwManaged)