Reference Library
IsScaledOrtho Method (tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »IsScaledOrtho(Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsScaledOrtho(
	Tolerance tolerance
)
Public Function IsScaledOrtho ( _
	tolerance As Tolerance _
) As Boolean
public:
bool IsScaledOrtho(
	Tolerance tolerance
)
 Parameters
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)