Reference Library
imageSource Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »GIRasterImage »imageSource
 Declaration Syntax
C# | Visual Basic | Visual C++
public RasterImageSource imageSource { get; }
Public ReadOnly Property imageSource As RasterImageSource
	Get
public:
property RasterImageSource imageSource {
	RasterImageSource get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)