Reference Library
DoPrompt Method (opt)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »DoPrompt(PromptOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptResult DoPrompt(
	PromptOptions opt
)
Public Function DoPrompt ( _
	opt As PromptOptions _
) As PromptResult
public:
PromptResult^ DoPrompt(
	PromptOptions^ opt
)
 Parameters
opt(PromptOptions)
Assembly: ZwManaged (Module: ZwManaged)