Reference Library
Item Property (key)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »IdMapping »Item[ObjectId]
 Declaration Syntax
C# | Visual Basic | Visual C++
public IdPair this[
	ObjectId key
] { get; set; }
Public Default Property Item ( _
	key As ObjectId _
) As IdPair
	Get
	Set
public:
property IdPair default[ObjectId key] {
	IdPair get (ObjectId key);
	void set (ObjectId key, IdPair value);
}
 Parameters
key(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)