Reference Library
NumberOfIntervals Property
Namespaces »ZwSoft.ZwCAD.Geometry »KnotCollection »NumberOfIntervals
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumberOfIntervals { get; }
Public ReadOnly Property NumberOfIntervals As Integer
	Get
public:
property int NumberOfIntervals {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)