Reference Library
Set Method
Namespaces »ZwSoft.ZwCAD.Geometry »NurbSurface »Set()
 Members
Icon | Member | Description
Set(Int32, Int32, Int32, Int32, Int32, Int32, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection, Tolerance)
Set(Int32, Int32, Int32, Int32, Int32, Int32, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)