Reference Library
IList_Remove Method (value)
Namespaces »ZwSoft.ZwCAD.Windows »MenuItemCollection »IList.Remove(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
void IList.Remove(
	Object value
)
Private Sub IList_Remove ( _
	value As Object _
) Implements IList.Remove
private:
virtual void IList_Remove(
	Object^ value
) sealed = IList::Remove
 Parameters
value(Object)
Assembly: ZwManaged (Module: ZwManaged)