Reference Library
EndLimit Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »LightAttenuation »EndLimit
 Declaration Syntax
C# | Visual Basic | Visual C++
public double EndLimit { get; }
Public ReadOnly Property EndLimit As Double
	Get
public:
property double EndLimit {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)