Reference Library
SetPlane Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Leader »SetPlane(Plane)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetPlane(
	Plane value
)
Public Overridable Sub SetPlane ( _
	value As Plane _
)
public:
virtual void SetPlane(
	Plane^ value
)
 Parameters
value(Plane)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)