Reference Library
CreateZWCADView Method (drawable)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Manager »CreateZWCADView(Drawable)
 Declaration Syntax
C# | Visual Basic | Visual C++
public View CreateZWCADView(
	Drawable drawable
)
Public Function CreateZWCADView ( _
	drawable As Drawable _
) As View
public:
View^ CreateZWCADView(
	Drawable^ drawable
)
 Parameters
drawable(Drawable)
Assembly: ZwManaged (Module: ZwManaged)