Reference Library
BoundBlock3d Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock3d »BoundBlock3d()
 Members
Icon | Member | Description
BoundBlock3d(Point3d, Vector3d, Vector3d, Vector3d)
BoundBlock3d()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)