Reference Library
SyncRoot Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GraphNodeCollection »SyncRoot
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual Object SyncRoot { get; }
Protected Overridable ReadOnly Property SyncRoot As Object
	Get
protected:
virtual property Object^ SyncRoot {
	Object^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)