Reference Library
SetString Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCell »SetString(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetString(
	string value
)
Public Sub SetString ( _
	value As String _
)
public:
void SetString(
	String^ value
)
 Parameters
value(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)