Reference Library
Dimscale Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimscale
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Dimscale { get; set; }
Public Property Dimscale As Double
	Get
	Set
public:
property double Dimscale {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)