Reference Library
Multiply Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Scale3d »Multiply(Scale3d, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Scale3d operator *(
	Scale3d a,
	double factor
)
Public Shared Operator * ( _
	a As Scale3d, _
	factor As Double _
) As Scale3d
public:
static Scale3d operator *(
	Scale3d a,
	double factor
)
 Parameters
a(Scale3d)
factor(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)