Reference Library
SetRgb Method (red, green, blue)
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor »SetRgb(Byte, Byte, Byte)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetRgb(
	byte red,
	byte green,
	byte blue
)
Public Sub SetRgb ( _
	red As Byte, _
	green As Byte, _
	blue As Byte _
)
public:
void SetRgb(
	unsigned char red,
	unsigned char green,
	unsigned char blue
)
 Parameters
red(Byte)
green(Byte)
blue(Byte)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)