Reference Library
is16bitBGR Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PixelFormatInfo »is16bitBGR()
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool is16bitBGR()
Public Function is16bitBGR As Boolean
public:
bool is16bitBGR()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)