Reference Library
Manager Constructor (unmanagedPointer)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Manager »Manager(IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal Manager(
	IntPtr unmanagedPointer
)
Protected Friend Sub New ( _
	unmanagedPointer As IntPtr _
)
protected public:
Manager(
	IntPtr unmanagedPointer
)
 Parameters
unmanagedPointer(IntPtr)
Assembly: ZwManaged (Module: ZwManaged)