Reference Library
BlockInsertionPointsEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockInsertionPointsEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void BlockInsertionPointsEventHandler(
	Object sender,
	BlockInsertionPointsEventArgs e
)
Public Delegate Sub BlockInsertionPointsEventHandler ( _
	sender As Object, _
	e As BlockInsertionPointsEventArgs _
)
public delegate void BlockInsertionPointsEventHandler(
	Object^ sender,
	BlockInsertionPointsEventArgs^ e
)
 Parameters
sender(Object)
e(BlockInsertionPointsEventArgs)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)