Reference Library
DataType Method (type)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »DataType(RowType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual DataType DataType(
	RowType type
)
Public Overridable Function DataType ( _
	type As RowType _
) As DataType
public:
virtual DataType DataType(
	RowType type
)
 Parameters
type(RowType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)