Reference Library
TangentsExist Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2dFitData »TangentsExist
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool TangentsExist { get; }
Public ReadOnly Property TangentsExist As Boolean
	Get
public:
property bool TangentsExist {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)