Reference Library
IteratorNext Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FileDependencyManager »IteratorNext
 Declaration Syntax
C# | Visual Basic | Visual C++
public int IteratorNext { get; }
Public ReadOnly Property IteratorNext As Integer
	Get
public:
property int IteratorNext {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)