Reference Library
SetLinetype Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »SetLinetype()
 Members
Icon | Member | Description
SetLinetype(String)
SetLinetype(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)