Reference Library
m_pLayerStateToBeRenamed Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »m_pLayerStateToBeRenamed
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerStateRenameEventHandler m_pLayerStateToBeRenamed
Public m_pLayerStateToBeRenamed As LayerStateRenameEventHandler
public:
LayerStateRenameEventHandler^ m_pLayerStateToBeRenamed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)