Reference Library
XrefStatus Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefGraphNode »XrefStatus
 Declaration Syntax
C# | Visual Basic | Visual C++
public XrefStatus XrefStatus { get; }
Public ReadOnly Property XrefStatus As XrefStatus
	Get
public:
property XrefStatus XrefStatus {
	XrefStatus get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)