Reference Library
NumberOfFitPoints Property
Namespaces »ZwSoft.ZwCAD.Geometry »PolylineCurve3d »NumberOfFitPoints
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumberOfFitPoints { get; }
Public ReadOnly Property NumberOfFitPoints As Integer
	Get
public:
property int NumberOfFitPoints {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)