Reference Library
GetDerivative Method (order, curve, parameter)
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve3d »GetDerivative(Int32, Curve3d, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Vector3d GetDerivative(
	int order,
	Curve3d curve,
	double parameter
)
Public Shared Function GetDerivative ( _
	order As Integer, _
	curve As Curve3d, _
	parameter As Double _
) As Vector3d
public:
static Vector3d GetDerivative(
	int order,
	Curve3d^ curve,
	double parameter
)
 Parameters
order(Int32)
curve(Curve3d)
parameter(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)