Reference Library
SetTextStyleId Method (row, column, contentIndex, id)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetTextStyleId(Int32, Int32, Int32, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetTextStyleId(
	int row,
	int column,
	int contentIndex,
	ObjectId id
)
Public Overridable Sub SetTextStyleId ( _
	row As Integer, _
	column As Integer, _
	contentIndex As Integer, _
	id As ObjectId _
)
public:
virtual void SetTextStyleId(
	int row,
	int column,
	int contentIndex,
	ObjectId id
)
 Parameters
row(Int32)
column(Int32)
contentIndex(Int32)
id(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)