Reference Library
Unbounded Property
Namespaces »ZwSoft.ZwCAD.Geometry »Interval »Unbounded
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Interval Unbounded { get; }
Public Shared ReadOnly Property Unbounded As Interval
	Get
public:
static property Interval^ Unbounded {
	Interval^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)