Reference Library
Constant Property
Namespaces »ZwSoft.ZwCAD.LayerManager »RelationalExpression »Constant
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Constant { get; }
Public ReadOnly Property Constant As String
	Get
public:
property String^ Constant {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)