Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.Geometry »KnotCollection »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public IEnumerator GetEnumerator()
Public Function GetEnumerator As IEnumerator
public:
virtual IEnumerator^ GetEnumerator() sealed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)