Reference Library
DelPlotStyle Method (pPsPtr)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleTable »DelPlotStyle(PlotStyle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual PlotStyle DelPlotStyle(
	PlotStyle pPsPtr
)
Public Overridable Function DelPlotStyle ( _
	pPsPtr As PlotStyle _
) As PlotStyle
public:
virtual PlotStyle^ DelPlotStyle(
	PlotStyle^ pPsPtr
)
 Parameters
pPsPtr(PlotStyle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)