Reference Library
SuppressAngularLeadingZeros Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »SuppressAngularLeadingZeros
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool SuppressAngularLeadingZeros { get; set; }
Public Overridable Property SuppressAngularLeadingZeros As Boolean
	Get
	Set
public:
virtual property bool SuppressAngularLeadingZeros {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)