Reference Library
ViewportId Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Viewport »ViewportId
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract IntPtr ViewportId { get; }
Public MustOverride ReadOnly Property ViewportId As IntPtr
	Get
public:
virtual property IntPtr ViewportId {
	IntPtr get () abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)