Reference Library
ConvertToBrepAtSubentPaths Method (paths)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »ConvertToBrepAtSubentPaths(FullSubentityPath[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void ConvertToBrepAtSubentPaths(
	FullSubentityPath[] paths
)
Public Sub ConvertToBrepAtSubentPaths ( _
	paths As FullSubentityPath() _
)
public:
void ConvertToBrepAtSubentPaths(
	array<FullSubentityPath>^ paths
)
 Parameters
paths(FullSubentityPath[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)