Reference Library
GetPoint Method
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnSurface »GetPoint()
 Members
Icon | Member | Description
GetPoint(Surface, Point2d)
GetPoint(Point2d)
GetPoint()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)