Reference Library
LessThan Operator
Namespaces »ZwSoft.ZwCAD.Colors »Color »LessThan(Color, Color)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static int operator <(
	Color a,
	Color b
)
Public Shared Operator < ( _
	a As Color, _
	b As Color _
) As Integer
public:
static int operator <(
	Color^ a,
	Color^ b
)
 Parameters
a(Color)
b(Color)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)