Reference Library
InsertLoopAt Method (loopIndex, hatchLoop)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »InsertLoopAt(Int32, HatchLoop)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void InsertLoopAt(
	int loopIndex,
	HatchLoop hatchLoop
)
Public Sub InsertLoopAt ( _
	loopIndex As Integer, _
	hatchLoop As HatchLoop _
)
public:
void InsertLoopAt(
	int loopIndex,
	HatchLoop^ hatchLoop
)
 Parameters
loopIndex(Int32)
hatchLoop(HatchLoop)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)