Reference Library
ToString Method
Namespaces »ZwSoft.ZwCAD.EditorInput »CrossingOrWindowSelectedSubObject »ToString()
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed string ToString()
Public Overrides NotOverridable Function ToString As String
public:
virtual String^ ToString() override sealed
Assembly: ZwManaged (Module: ZwManaged)