Reference Library
HasFields Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »HasFields
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool HasFields { get; }
Public ReadOnly Property HasFields As Boolean
	Get
public:
property bool HasFields {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)