Reference Library
Snap Method (snapMode, input)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »Snap(String, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d Snap(
	string snapMode,
	Point3d input
)
Public Function Snap ( _
	snapMode As String, _
	input As Point3d _
) As Point3d
public:
Point3d Snap(
	String^ snapMode,
	Point3d input
)
 Parameters
snapMode(String)
input(Point3d)
Assembly: ZwManaged (Module: ZwManaged)