Reference Library
WriteHandle Method (handle)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »WriteHandle(Handle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void WriteHandle(
	Handle handle
)
Public MustOverride Sub WriteHandle ( _
	handle As Handle _
)
public:
virtual void WriteHandle(
	Handle handle
) abstract
 Parameters
handle(Handle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)