Reference Library
m_pLayoutRenamed Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »m_pLayoutRenamed
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayoutRenamedEventHandler m_pLayoutRenamed
Public m_pLayoutRenamed As LayoutRenamedEventHandler
public:
LayoutRenamedEventHandler^ m_pLayoutRenamed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)