Reference Library
ClosestPointTo Method (point)
Namespaces »ZwSoft.ZwCAD.Geometry »Surface »ClosestPointTo(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d ClosestPointTo(
	Point3d point
)
Public Function ClosestPointTo ( _
	point As Point3d _
) As Point3d
public:
Point3d ClosestPointTo(
	Point3d point
)
 Parameters
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)