Reference Library
GetValue Method (row, column, contentIndex, formatOption)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GetValue(Int32, Int32, Int32, FormatOption)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Object GetValue(
	int row,
	int column,
	int contentIndex,
	FormatOption formatOption
)
Public Overridable Function GetValue ( _
	row As Integer, _
	column As Integer, _
	contentIndex As Integer, _
	formatOption As FormatOption _
) As Object
public:
virtual Object^ GetValue(
	int row,
	int column,
	int contentIndex,
	FormatOption formatOption
)
 Parameters
row(Int32)
column(Int32)
contentIndex(Int32)
formatOption(FormatOption)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)