Reference Library
LowerLeft Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Rectangle3d »LowerLeft
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d LowerLeft { get; }
Public ReadOnly Property LowerLeft As Point3d
	Get
public:
property Point3d LowerLeft {
	Point3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)