Reference Library
NumberOfKnots Property
Namespaces »ZwSoft.ZwCAD.Geometry »SplineEntity3d »NumberOfKnots
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumberOfKnots { get; }
Public ReadOnly Property NumberOfKnots As Integer
	Get
public:
property int NumberOfKnots {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)