Reference Library
GetHostDwgXrefGraph Method (includeGhosts)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »GetHostDwgXrefGraph(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public XrefGraph GetHostDwgXrefGraph(
	bool includeGhosts
)
Public Function GetHostDwgXrefGraph ( _
	includeGhosts As Boolean _
) As XrefGraph
public:
XrefGraph^ GetHostDwgXrefGraph(
	bool includeGhosts
)
 Parameters
includeGhosts(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)