Reference Library
IsPerpendicularTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »BoundedPlane »IsPerpendicularTo()
 Members
Icon | Member | Description
IsPerpendicularTo(PlanarEntity, Tolerance)
IsPerpendicularTo(LinearEntity3d, Tolerance)
IsPerpendicularTo(PlanarEntity)
IsPerpendicularTo(LinearEntity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)