Reference Library
NumberofSavedUCS Method
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Utilities »NumberofSavedUCS()
 Declaration Syntax
C# | Visual Basic | Visual C++
public static int NumberofSavedUCS()
Public Shared Function NumberofSavedUCS As Integer
public:
static int NumberofSavedUCS()
Assembly: ZwManaged (Module: ZwManaged)