Reference Library
VisualStyleOperation Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »VisualStyleOperation
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiVisualStyleOperations::Operation")]
public enum VisualStyleOperation
<WrapperAttribute("ZcGiVisualStyleOperations::Operation")> _
Public Enumeration VisualStyleOperation
[WrapperAttribute(L"ZcGiVisualStyleOperations::Operation")]
public enum class VisualStyleOperation
 Members
Member | Description
InvalidOperation
Inherit
Enable
Set
Disable
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)