Reference Library
CurrentViewportId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Layout »CurrentViewportId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId CurrentViewportId { get; }
Public ReadOnly Property CurrentViewportId As ObjectId
	Get
public:
property ObjectId CurrentViewportId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)