Reference Library
Position Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DxfFiler »Position
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract long Position { get; }
Public MustOverride ReadOnly Property Position As Long
	Get
public:
virtual property long long Position {
	long long get () abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)