Reference Library
EnableBlockRotation Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeaderStyle »EnableBlockRotation
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool EnableBlockRotation { get; set; }
Public Property EnableBlockRotation As Boolean
	Get
	Set
public:
property bool EnableBlockRotation {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)