Reference Library
Multiply Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »Multiply(Double, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Point2d operator *(
	double value,
	Point2d a
)
Public Shared Operator * ( _
	value As Double, _
	a As Point2d _
) As Point2d
public:
static Point2d operator *(
	double value,
	Point2d a
)
 Parameters
value(Double)
a(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)