Reference Library
IndexOf Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3dCollection »IndexOf(Curve3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int IndexOf(
	Curve3d value
)
Public Function IndexOf ( _
	value As Curve3d _
) As Integer
public:
int IndexOf(
	Curve3d^ value
)
 Parameters
value(Curve3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)