Reference Library
Insert Method (index, value)
Namespaces »ZwSoft.ZwCAD.Geometry »UInt32Collection »Insert(Int32, UInt32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void Insert(
	int index,
	uint value
)
Public Overridable Sub Insert ( _
	index As Integer, _
	value As UInteger _
)
public:
virtual void Insert(
	int index,
	unsigned int value
)
 Parameters
index(Int32)
value(UInt32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)