Reference Library
Explodable Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockTableRecord »Explodable
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Explodable { get; set; }
Public Property Explodable As Boolean
	Get
	Set
public:
property bool Explodable {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)