Reference Library
LayerFilter Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »LayerFilter »LayerFilter()
 Members
Icon | Member | Description
LayerFilter()
LayerFilter(IntPtr, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)