Reference Library
GetObject Method (mode, openErased, forceOpenOnLockedLayer)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectId »GetObject(OpenMode, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DBObject GetObject(
	OpenMode mode,
	bool openErased,
	bool forceOpenOnLockedLayer
)
Public Function GetObject ( _
	mode As OpenMode, _
	openErased As Boolean, _
	forceOpenOnLockedLayer As Boolean _
) As DBObject
public:
DBObject^ GetObject(
	OpenMode mode,
	bool openErased,
	bool forceOpenOnLockedLayer
)
 Parameters
mode(OpenMode)
openErased(Boolean)
forceOpenOnLockedLayer(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)