Reference Library
UserGiContext Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »UserGiContext
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Context UserGiContext { get; set; }
Public MustOverride Property UserGiContext As Context
	Get
	Set
public:
virtual property Context^ UserGiContext {
	Context^ get () abstract;
	void set (Context^ value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)