Reference Library
Publisher Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »Publisher
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Publisher Publisher { get; }
Public Shared ReadOnly Property Publisher As Publisher
	Get
public:
static property Publisher^ Publisher {
	Publisher^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)