Reference Library
AboutToEndPublishingEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.Publishing »AboutToEndPublishingEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void AboutToEndPublishingEventHandler(
	Object sender,
	PublishEventArgs e
)
Public Delegate Sub AboutToEndPublishingEventHandler ( _
	sender As Object, _
	e As PublishEventArgs _
)
public delegate void AboutToEndPublishingEventHandler(
	Object^ sender,
	PublishEventArgs^ e
)
 Parameters
sender(Object)
e(PublishEventArgs)
Assembly: ZwManaged (Module: ZwManaged)