Reference Library
MLeader Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »MLeader()
 Declaration Syntax
C# | Visual Basic | Visual C++
public MLeader()
Public Sub New
public:
MLeader()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)