Reference Library
AxisPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolvedSurface »AxisPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d AxisPoint { get; set; }
Public Property AxisPoint As Point3d
	Get
	Set
public:
property Point3d AxisPoint {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)