Reference Library
Update Method (dataIds, direction, option)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataLinkManager »Update(ObjectIdCollection, UpdateDirection, UpdateOption)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Update(
	ObjectIdCollection dataIds,
	UpdateDirection direction,
	UpdateOption option
)
Public Sub Update ( _
	dataIds As ObjectIdCollection, _
	direction As UpdateDirection, _
	option As UpdateOption _
)
public:
void Update(
	ObjectIdCollection^ dataIds,
	UpdateDirection direction,
	UpdateOption option
)
 Parameters
dataIds(ObjectIdCollection)
direction(UpdateDirection)
option(UpdateOption)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)