Reference Library
IsLinetypeByLayerName Method (name)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »IsLinetypeByLayerName(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool IsLinetypeByLayerName(
	string name
)
Public Shared Function IsLinetypeByLayerName ( _
	name As String _
) As Boolean
public:
static bool IsLinetypeByLayerName(
	String^ name
)
 Parameters
name(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)