Reference Library
PatternName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »PatternName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string PatternName { get; }
Public ReadOnly Property PatternName As String
	Get
public:
property String^ PatternName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)