Reference Library
CursorType Enumeration
Namespaces »ZwSoft.ZwCAD.EditorInput »CursorType
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum CursorType
Public Enumeration CursorType
public enum class CursorType
 Members
Member | Description
PickfirstOrGrips
EntitySelectNoPerspective
Parallelogram
EntitySelect
Invisible
CrosshairNoRotate
RotatedCrosshair
TargetBox
NotRotated
RubberBand
RectangularCursor
Crosshair
NoSpecialCursor
Assembly: ZwManaged (Module: ZwManaged)