Reference Library
ModifyUndone Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »ModifyUndone
 Declaration Syntax
C# | Visual Basic | Visual C++
public event EventHandler ModifyUndone
Public Event ModifyUndone As EventHandler
public:
 event EventHandler^ ModifyUndone {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)