Reference Library
Remove Method (value)
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdEntryCollection »Remove(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void Remove(
	Object value
)
Public Overridable Sub Remove ( _
	value As Object _
)
public:
virtual void Remove(
	Object^ value
)
 Parameters
value(Object)
Assembly: ZwManaged (Module: ZwManaged)