Reference Library
ShadowPlaneLocation Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »ShadowPlaneLocation
 Declaration Syntax
C# | Visual Basic | Visual C++
public double ShadowPlaneLocation { get; set; }
Public Property ShadowPlaneLocation As Double
	Get
	Set
public:
property double ShadowPlaneLocation {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)