Reference Library
SpatialFilterVolume Structure
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »SpatialFilterVolume
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct SpatialFilterVolume
Public Structure SpatialFilterVolume
public value class SpatialFilterVolume
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
SpatialFilterVolume(Point3d, Point3d, Vector3d, Vector2d)
FromPoint
ToPoint
UpDirection
ViewField
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)