Reference Library
Blue Property
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor »Blue
 Declaration Syntax
C# | Visual Basic | Visual C++
public byte Blue { get; }
Public ReadOnly Property Blue As Byte
	Get
public:
property unsigned char Blue {
	unsigned char get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)