Reference Library
PlaneSurface Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlaneSurface »PlaneSurface()
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlaneSurface()
Public Sub New
public:
PlaneSurface()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)