Reference Library
Clear Method
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2dCollection »Clear()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Clear()
Public Sub Clear
public:
virtual void Clear() sealed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)