Reference Library
ToSweepOptions Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweepOptionsBuilder »ToSweepOptions()
 Declaration Syntax
C# | Visual Basic | Visual C++
public SweepOptions ToSweepOptions()
Public Function ToSweepOptions As SweepOptions
public:
SweepOptions^ ToSweepOptions()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)