Reference Library
StackStart Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »StackStart
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string StackStart { get; }
Public Shared ReadOnly Property StackStart As String
	Get
public:
static property String^ StackStart {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)