Reference Library
SetDoglegLength Method (leaderIndex, doglegLength)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »SetDoglegLength(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetDoglegLength(
	int leaderIndex,
	double doglegLength
)
Public Sub SetDoglegLength ( _
	leaderIndex As Integer, _
	doglegLength As Double _
)
public:
void SetDoglegLength(
	int leaderIndex,
	double doglegLength
)
 Parameters
leaderIndex(Int32)
doglegLength(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)