Reference Library
Sphere Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Sphere »Sphere()
 Members
Icon | Member | Description
Sphere(Double, Point3d, Vector3d, Vector3d, Double, Double, Double, Double)
Sphere(Double, Point3d)
Sphere()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)