Reference Library
LogTerminalError Method (message)
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotLogger »LogTerminalError(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void LogTerminalError(
	string message
)
Public Sub LogTerminalError ( _
	message As String _
)
public:
void LogTerminalError(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)