Reference Library
AllowArbitraryInput Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptCornerOptions »AllowArbitraryInput
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool AllowArbitraryInput { get; set; }
Public Property AllowArbitraryInput As Boolean
	Get
	Set
public:
property bool AllowArbitraryInput {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)