Reference Library
Clone Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweepOptions »Clone()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Object Clone()
Public Function Clone As Object
public:
virtual Object^ Clone() sealed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)