Reference Library
BlockInsertionPoints Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockTableRecord »BlockInsertionPoints
 Declaration Syntax
C# | Visual Basic | Visual C++
public static event BlockInsertionPointsEventHandler BlockInsertionPoints
Public Shared Event BlockInsertionPoints As BlockInsertionPointsEventHandler
public:
static  event BlockInsertionPointsEventHandler^ BlockInsertionPoints {
	void add (BlockInsertionPointsEventHandler^ value);
	void remove (BlockInsertionPointsEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)