Reference Library
Value Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DbDictionaryEnumerator »Value
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Value { get; }
Public ReadOnly Property Value As ObjectId
	Get
public:
property ObjectId Value {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)