Reference Library
JogPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RadialDimensionLarge »JogPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d JogPoint { get; set; }
Public Property JogPoint As Point3d
	Get
	Set
public:
property Point3d JogPoint {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)