Reference Library
LineType Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »NonEntityTraits »LineType
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed ObjectId LineType { get; set; }
Public Overrides NotOverridable Property LineType As ObjectId
	Get
	Set
public:
virtual property ObjectId LineType {
	ObjectId get () override sealed;
	void set (ObjectId value) override sealed;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)