Reference Library
IsEqualTo Method (point)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »IsEqualTo(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	Point3d point
)
Public Function IsEqualTo ( _
	point As Point3d _
) As Boolean
public:
bool IsEqualTo(
	Point3d point
)
 Parameters
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)