Reference Library
IsNull Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Body »IsNull
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool IsNull { get; }
Public Overridable ReadOnly Property IsNull As Boolean
	Get
public:
virtual property bool IsNull {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)