Reference Library
Useri4 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Useri4
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Useri4 { get; set; }
Public Property Useri4 As Integer
	Get
	Set
public:
property int Useri4 {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)