Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DbHomeView »Equality(DbHomeView, DbHomeView)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	DbHomeView lhvw,
	DbHomeView rhvw
)
Public Shared Operator = ( _
	lhvw As DbHomeView, _
	rhvw As DbHomeView _
) As Boolean
public:
static bool operator ==(
	DbHomeView^ lhvw,
	DbHomeView^ rhvw
)
 Parameters
lhvw(DbHomeView)
rhvw(DbHomeView)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)