Reference Library
FullFileName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FileDependencyInfo »FullFileName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string FullFileName { get; }
Public ReadOnly Property FullFileName As String
	Get
public:
property String^ FullFileName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)