Reference Library
Polyline Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HatchLoop »Polyline
 Declaration Syntax
C# | Visual Basic | Visual C++
public BulgeVertexCollection Polyline { get; }
Public ReadOnly Property Polyline As BulgeVertexCollection
	Get
public:
property BulgeVertexCollection^ Polyline {
	BulgeVertexCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)