Reference Library
DocumentActivationChangedEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentActivationChangedEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void DocumentActivationChangedEventHandler(
	Object sender,
	DocumentActivationChangedEventArgs e
)
Public Delegate Sub DocumentActivationChangedEventHandler ( _
	sender As Object, _
	e As DocumentActivationChangedEventArgs _
)
public delegate void DocumentActivationChangedEventHandler(
	Object^ sender,
	DocumentActivationChangedEventArgs^ e
)
 Parameters
sender(Object)
e(DocumentActivationChangedEventArgs)
Assembly: ZwManaged (Module: ZwManaged)