Reference Library
PolygonMesh Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolygonMesh »PolygonMesh()
 Members
Icon | Member | Description
PolygonMesh(PolyMeshType, Int32, Int32, Point3dCollection, Boolean, Boolean)
PolygonMesh()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)