Reference Library
LeaderLineCount Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »LeaderLineCount
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use GetLeaderLineIndexes instead")]
public int LeaderLineCount { get; }
<ObsoleteAttribute("Use GetLeaderLineIndexes instead")> _
Public ReadOnly Property LeaderLineCount As Integer
	Get
[ObsoleteAttribute(L"Use GetLeaderLineIndexes instead")]
public:
property int LeaderLineCount {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)