Reference Library
PostMLeaderToDb Method (db)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »PostMLeaderToDb(Database)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void PostMLeaderToDb(
	Database db
)
Public Sub PostMLeaderToDb ( _
	db As Database _
)
public:
void PostMLeaderToDb(
	Database^ db
)
 Parameters
db(Database)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)