Reference Library
Purge Method (idGraph)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Purge(ObjectIdGraph)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Purge(
	ObjectIdGraph idGraph
)
Public Sub Purge ( _
	idGraph As ObjectIdGraph _
)
public:
void Purge(
	ObjectIdGraph^ idGraph
)
 Parameters
idGraph(ObjectIdGraph)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)