Reference Library
BeginSheet Event
Namespaces »ZwSoft.ZwCAD.Publishing »Publisher »BeginSheet
 Declaration Syntax
C# | Visual Basic | Visual C++
public event BeginSheetEventHandler BeginSheet
Public Event BeginSheet As BeginSheetEventHandler
public:
 event BeginSheetEventHandler^ BeginSheet {
	void add (BeginSheetEventHandler^ value);
	void remove (BeginSheetEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)