Reference Library
XLine2Point Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RotatedDimension »XLine2Point
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d XLine2Point { get; set; }
Public Property XLine2Point As Point3d
	Get
	Set
public:
property Point3d XLine2Point {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)