Reference Library
EndTangent Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FitData »EndTangent
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d EndTangent { get; }
Public ReadOnly Property EndTangent As Vector3d
	Get
public:
property Vector3d EndTangent {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)