Reference Library
Ucsname Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Ucsname
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Ucsname { get; }
Public ReadOnly Property Ucsname As ObjectId
	Get
public:
property ObjectId Ucsname {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)