Reference Library
AttributeDefinition Constructor (position, value, tag, prompt, style)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AttributeDefinition »AttributeDefinition(Point3d, String, String, String, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public AttributeDefinition(
	Point3d position,
	string value,
	string tag,
	string prompt,
	ObjectId style
)
Public Sub New ( _
	position As Point3d, _
	value As String, _
	tag As String, _
	prompt As String, _
	style As ObjectId _
)
public:
AttributeDefinition(
	Point3d position,
	String^ value,
	String^ tag,
	String^ prompt,
	ObjectId style
)
 Parameters
position(Point3d)
value(String)
tag(String)
prompt(String)
style(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)