Reference Library
Position Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBPoint »Position
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d Position { get; set; }
Public Property Position As Point3d
	Get
	Set
public:
property Point3d Position {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)