Reference Library
GetArrowSymbolId Method (leaderLineIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »GetArrowSymbolId(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId GetArrowSymbolId(
	int leaderLineIndex
)
Public Function GetArrowSymbolId ( _
	leaderLineIndex As Integer _
) As ObjectId
public:
ObjectId GetArrowSymbolId(
	int leaderLineIndex
)
 Parameters
leaderLineIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)