Reference Library
Pelevation Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Pelevation
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Pelevation { get; set; }
Public Property Pelevation As Double
	Get
	Set
public:
property double Pelevation {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)