Reference Library
WriteDouble Method (opCode, value, precision)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DxfFiler »WriteDouble(DxfCode, Double, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void WriteDouble(
	DxfCode opCode,
	double value,
	int precision
)
Public MustOverride Sub WriteDouble ( _
	opCode As DxfCode, _
	value As Double, _
	precision As Integer _
)
public:
virtual void WriteDouble(
	DxfCode opCode,
	double value,
	int precision
) abstract
 Parameters
opCode(DxfCode)
value(Double)
precision(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)