Reference Library
SaveFileDialog Constructor (title, defaultName, extension, dialogName, flags)
Namespaces »ZwSoft.ZwCAD.Windows »SaveFileDialog »SaveFileDialog(String, String, String, String, SaveFileDialog.SaveFileDialogFlags)
 Declaration Syntax
C# | Visual Basic | Visual C++
public SaveFileDialog(
	string title,
	string defaultName,
	string extension,
	string dialogName,
	SaveFileDialog.SaveFileDialogFlags flags
)
Public Sub New ( _
	title As String, _
	defaultName As String, _
	extension As String, _
	dialogName As String, _
	flags As SaveFileDialog.SaveFileDialogFlags _
)
public:
SaveFileDialog(
	String^ title,
	String^ defaultName,
	String^ extension,
	String^ dialogName,
	SaveFileDialog.SaveFileDialogFlags flags
)
 Parameters
title(String)
defaultName(String)
extension(String)
dialogName(String)
flags(SaveFileDialog.SaveFileDialogFlags)
Assembly: ZwManaged (Module: ZwManaged)