Reference Library
ViewportTable Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewportTable
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbViewportTable")]
public class ViewportTable : SymbolTable
<WrapperAttribute("AcDbViewportTable")> _
Public Class ViewportTable _
	Inherits SymbolTable
[WrapperAttribute(L"AcDbViewportTable")]
public ref class ViewportTable : public SymbolTable
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
ViewportTable(IntPtr, Boolean)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | SymbolTable
|  |  |  |  |  | ViewportTable
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)