Reference Library
SaveAs Method (fileName, version, saveThumbnailImage)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »SaveAs(String, DwgVersion, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SaveAs(
	string fileName,
	DwgVersion version,
	bool saveThumbnailImage
)
Public Sub SaveAs ( _
	fileName As String, _
	version As DwgVersion, _
	saveThumbnailImage As Boolean _
)
public:
void SaveAs(
	String^ fileName,
	DwgVersion version,
	bool saveThumbnailImage
)
 Parameters
fileName(String)
version(DwgVersion)
saveThumbnailImage(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)