Reference Library
ViewportTableId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »ViewportTableId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId ViewportTableId { get; }
Public ReadOnly Property ViewportTableId As ObjectId
	Get
public:
property ObjectId ViewportTableId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)