Reference Library
LayoutManager Constructor (pImpObj, db)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »LayoutManager(IntPtr, Database)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal LayoutManager(
	IntPtr pImpObj,
	Database db
)
Protected Friend Sub New ( _
	pImpObj As IntPtr, _
	db As Database _
)
protected public:
LayoutManager(
	IntPtr pImpObj,
	Database^ db
)
 Parameters
pImpObj(IntPtr)
db(Database)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)