Reference Library
IsVS3dType Property
Namespaces »ZwSoft.ZwCAD.EditorInput »EditorVisualStyle »IsVS3dType
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool IsVS3dType { get; }
Public Shared ReadOnly Property IsVS3dType As Boolean
	Get
public:
static property bool IsVS3dType {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)