Reference Library
DrawingOpenEventArgs Class
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DrawingOpenEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class DrawingOpenEventArgs : EventArgs
Public NotInheritable Class DrawingOpenEventArgs _
	Inherits EventArgs
public ref class DrawingOpenEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Database
FileName
 Inheritance Hierarchy
Object
EventArgs
| DrawingOpenEventArgs
Assembly: ZwManaged (Module: ZwManaged)