Reference Library
GetObject Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectId »GetObject()
 Members
Icon | Member | Description
GetObject(OpenMode, Boolean, Boolean)
GetObject(OpenMode, Boolean)
GetObject(OpenMode)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)