Reference Library
WriteBoolean Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »WriteBoolean(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void WriteBoolean(
	bool value
)
Public MustOverride Sub WriteBoolean ( _
	value As Boolean _
)
public:
virtual void WriteBoolean(
	bool value
) abstract
 Parameters
value(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)