Reference Library
CharacterSet Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FontDescriptor »CharacterSet
 Declaration Syntax
C# | Visual Basic | Visual C++
public int CharacterSet { get; }
Public ReadOnly Property CharacterSet As Integer
	Get
public:
property int CharacterSet {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)