Reference Library
DestPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MeshPointMap »DestPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d DestPoint { get; set; }
Public Property DestPoint As Point2d
	Get
	Set
public:
property Point2d DestPoint {
	Point2d get ();
	void set (Point2d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)