Reference Library
CompositeParameter Constructor (segmentIndex, localParameter)
Namespaces »ZwSoft.ZwCAD.Geometry »CompositeParameter »CompositeParameter(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CompositeParameter(
	int segmentIndex,
	double localParameter
)
Public Sub New ( _
	segmentIndex As Integer, _
	localParameter As Double _
)
public:
CompositeParameter(
	int segmentIndex,
	double localParameter
)
 Parameters
segmentIndex(Int32)
localParameter(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)