Reference Library
CommandMethodAttribute Constructor (groupName, globalName, localizedNameId, flags, contextMenuExtensionType)
Namespaces »ZwSoft.ZwCAD.Runtime »CommandMethodAttribute »CommandMethodAttribute(String, String, String, CommandFlags, Type)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CommandMethodAttribute(
	string groupName,
	string globalName,
	string localizedNameId,
	CommandFlags flags,
	Type contextMenuExtensionType
)
Public Sub New ( _
	groupName As String, _
	globalName As String, _
	localizedNameId As String, _
	flags As CommandFlags, _
	contextMenuExtensionType As Type _
)
public:
CommandMethodAttribute(
	String^ groupName,
	String^ globalName,
	String^ localizedNameId,
	CommandFlags flags,
	Type^ contextMenuExtensionType
)
 Parameters
groupName(String)
globalName(String)
localizedNameId(String)
flags(CommandFlags)
contextMenuExtensionType(Type)
Assembly: ZwManaged (Module: ZwManaged)