Reference Library
IntersectWith Method (boundPlane, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Plane »IntersectWith(BoundedPlane, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LineSegment3d IntersectWith(
	BoundedPlane boundPlane,
	Tolerance tolerance
)
Public Function IntersectWith ( _
	boundPlane As BoundedPlane, _
	tolerance As Tolerance _
) As LineSegment3d
public:
LineSegment3d^ IntersectWith(
	BoundedPlane^ boundPlane,
	Tolerance tolerance
)
 Parameters
boundPlane(BoundedPlane)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)