Reference Library
IsOn Method (point, value)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »IsOn(Point3d, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsOn(
	Point3d point,
	out double value
)
Public Function IsOn ( _
	point As Point3d, _
	<OutAttribute> ByRef value As Double _
) As Boolean
public:
bool IsOn(
	Point3d point,
	[OutAttribute] double% value
)
 Parameters
point(Point3d)
value(Double%)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)