Reference Library
PreValidateSymbolName Method (symname, preserveCase)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »PreValidateSymbolName(String, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string PreValidateSymbolName(
	string symname,
	bool preserveCase
)
Public Shared Function PreValidateSymbolName ( _
	symname As String, _
	preserveCase As Boolean _
) As String
public:
static String^ PreValidateSymbolName(
	String^ symname,
	bool preserveCase
)
 Parameters
symname(String)
preserveCase(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)