Reference Library
GetSelection Method
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »GetSelection()
 Members
Icon | Member | Description
GetSelection(PromptSelectionOptions, SelectionFilter)
GetSelection(SelectionFilter)
GetSelection(PromptSelectionOptions)
GetSelection()
Assembly: ZwManaged (Module: ZwManaged)