Reference Library
Multiply Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »Multiply(Double, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Point3d operator *(
	double value,
	Point3d a
)
Public Shared Operator * ( _
	value As Double, _
	a As Point3d _
) As Point3d
public:
static Point3d operator *(
	double value,
	Point3d a
)
 Parameters
value(Double)
a(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)