Reference Library
GetDistanceTo Method (point)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »GetDistanceTo(Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetDistanceTo(
	Point2d point
)
Public Function GetDistanceTo ( _
	point As Point2d _
) As Double
public:
double GetDistanceTo(
	Point2d point
)
 Parameters
point(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)