Reference Library
IsEmpty Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedData »IsEmpty
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool IsEmpty { get; }
Public Overridable ReadOnly Property IsEmpty As Boolean
	Get
public:
virtual property bool IsEmpty {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)