Reference Library
PropertyName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicBlockReferenceProperty »PropertyName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string PropertyName { get; }
Public ReadOnly Property PropertyName As String
	Get
public:
property String^ PropertyName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)