Reference Library
SetSubentityColor Method (subEntityId, color)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »SetSubentityColor(SubentityId, Color)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetSubentityColor(
	SubentityId subEntityId,
	Color color
)
Public Overridable Sub SetSubentityColor ( _
	subEntityId As SubentityId, _
	color As Color _
)
public:
virtual void SetSubentityColor(
	SubentityId subEntityId,
	Color^ color
)
 Parameters
subEntityId(SubentityId)
color(Color)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)