Reference Library
ImportLayerState Method (fileName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »ImportLayerState(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void ImportLayerState(
	string fileName
)
Public Sub ImportLayerState ( _
	fileName As String _
)
public:
void ImportLayerState(
	String^ fileName
)
 Parameters
fileName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)