Reference Library
ObjectClosedEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectClosedEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void ObjectClosedEventHandler(
	Object sender,
	ObjectClosedEventArgs e
)
Public Delegate Sub ObjectClosedEventHandler ( _
	sender As Object, _
	e As ObjectClosedEventArgs _
)
public delegate void ObjectClosedEventHandler(
	Object^ sender,
	ObjectClosedEventArgs^ e
)
 Parameters
sender(Object)
e(ObjectClosedEventArgs)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)