Reference Library
SetOverride Method (row, column, gridLinetype, gridProperty)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »SetOverride(Int32, Int32, GridLineType, GridProperties)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetOverride(
	int row,
	int column,
	GridLineType gridLinetype,
	GridProperties gridProperty
)
Public Overridable Sub SetOverride ( _
	row As Integer, _
	column As Integer, _
	gridLinetype As GridLineType, _
	gridProperty As GridProperties _
)
public:
virtual void SetOverride(
	int row,
	int column,
	GridLineType gridLinetype,
	GridProperties gridProperty
)
 Parameters
row(Int32)
column(Int32)
gridLinetype(GridLineType)
gridProperty(GridProperties)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)