Reference Library
FitTolerance Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3dFitData »FitTolerance
 Declaration Syntax
C# | Visual Basic | Visual C++
public Tolerance FitTolerance { get; }
Public ReadOnly Property FitTolerance As Tolerance
	Get
public:
property Tolerance FitTolerance {
	Tolerance get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)