Reference Library
BooleanOperation Method (operation, solid)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »BooleanOperation(BooleanOperationType, Solid3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void BooleanOperation(
	BooleanOperationType operation,
	Solid3d solid
)
Public Overridable Sub BooleanOperation ( _
	operation As BooleanOperationType, _
	solid As Solid3d _
)
public:
virtual void BooleanOperation(
	BooleanOperationType operation,
	Solid3d^ solid
)
 Parameters
operation(BooleanOperationType)
solid(Solid3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)