Reference Library
Tdcreate Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Tdcreate
 Declaration Syntax
C# | Visual Basic | Visual C++
public DateTime Tdcreate { get; }
Public ReadOnly Property Tdcreate As DateTime
	Get
public:
property DateTime Tdcreate {
	DateTime get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)