Reference Library
TStackAlign Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »TStackAlign
 Declaration Syntax
C# | Visual Basic | Visual C++
public int TStackAlign { get; set; }
Public Property TStackAlign As Integer
	Get
	Set
public:
property int TStackAlign {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)