Reference Library
Dimblk2 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimblk2
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Dimblk2 { get; set; }
Public Property Dimblk2 As ObjectId
	Get
	Set
public:
property ObjectId Dimblk2 {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)