Reference Library
GetDimstyleData Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FeatureControlFrame »GetDimstyleData()
 Declaration Syntax
C# | Visual Basic | Visual C++
public DimStyleTableRecord GetDimstyleData()
Public Function GetDimstyleData As DimStyleTableRecord
public:
DimStyleTableRecord^ GetDimstyleData()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)