Reference Library
DisablePartialOpen Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »DisablePartialOpen()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void DisablePartialOpen()
Public Sub DisablePartialOpen
public:
void DisablePartialOpen()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)