Reference Library
SetImpliedSelection Method (selectionSet)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »SetImpliedSelection(SelectionSet)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetImpliedSelection(
	SelectionSet selectionSet
)
Public Sub SetImpliedSelection ( _
	selectionSet As SelectionSet _
)
public:
void SetImpliedSelection(
	SelectionSet^ selectionSet
)
 Parameters
selectionSet(SelectionSet)
Assembly: ZwManaged (Module: ZwManaged)