Reference Library
MinorAxis Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ellipse »MinorAxis
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d MinorAxis { get; }
Public ReadOnly Property MinorAxis As Vector3d
	Get
public:
property Vector3d MinorAxis {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)