Reference Library
MediaBounds Constructor (pageSize, lowerLeftPrintableArea, upperRightPrintableArea)
Namespaces »ZwSoft.ZwCAD.PlottingServices »MediaBounds »MediaBounds(Point2d, Point2d, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public MediaBounds(
	Point2d pageSize,
	Point2d lowerLeftPrintableArea,
	Point2d upperRightPrintableArea
)
Public Sub New ( _
	pageSize As Point2d, _
	lowerLeftPrintableArea As Point2d, _
	upperRightPrintableArea As Point2d _
)
public:
MediaBounds(
	Point2d pageSize,
	Point2d lowerLeftPrintableArea,
	Point2d upperRightPrintableArea
)
 Parameters
pageSize(Point2d)
lowerLeftPrintableArea(Point2d)
upperRightPrintableArea(Point2d)
Assembly: ZwManaged (Module: ZwManaged)