Reference Library
LineEndStyle Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LineEndStyle
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("OdPs::LineEndStyle")]
public enum LineEndStyle
<WrapperAttribute("OdPs::LineEndStyle")> _
Public Enumeration LineEndStyle
[WrapperAttribute(L"OdPs::LineEndStyle")]
public enum class LineEndStyle
 Members
Member | Description
LesUseObject
LesDiamond
LesRound
LesSquare
LesButt
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)