Reference Library
FaceRecord Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FaceRecord »FaceRecord()
 Declaration Syntax
C# | Visual Basic | Visual C++
public FaceRecord()
Public Sub New
public:
FaceRecord()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)