Reference Library
PutRemoteFile Method (url, localFile)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HostApplicationServices »PutRemoteFile(Uri, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void PutRemoteFile(
	Uri url,
	string localFile
)
Public Overridable Sub PutRemoteFile ( _
	url As Uri, _
	localFile As String _
)
public:
virtual void PutRemoteFile(
	Uri^ url,
	String^ localFile
)
 Parameters
url(Uri)
localFile(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)