Reference Library
Transparency Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerTableRecord »Transparency
 Declaration Syntax
C# | Visual Basic | Visual C++
public Transparency Transparency { get; set; }
Public Property Transparency As Transparency
	Get
	Set
public:
property Transparency Transparency {
	Transparency get ();
	void set (Transparency value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)