Reference Library
ObjectIdCollection Constructor (values)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectIdCollection »ObjectIdCollection(ObjectId[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectIdCollection(
	ObjectId[] values
)
Public Sub New ( _
	values As ObjectId() _
)
public:
ObjectIdCollection(
	array<ObjectId>^ values
)
 Parameters
values(ObjectId[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)