Reference Library
SystemVariableChangingEventArgs Class
Namespaces »ZwSoft.ZwCAD.ApplicationServices »SystemVariableChangingEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class SystemVariableChangingEventArgs : EventArgs
Public NotInheritable Class SystemVariableChangingEventArgs _
	Inherits EventArgs
public ref class SystemVariableChangingEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Name
 Inheritance Hierarchy
Object
EventArgs
| SystemVariableChangingEventArgs
Assembly: ZwManaged (Module: ZwManaged)