Reference Library
Sectionable Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »SubEntityTraits »Sectionable
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool Sectionable { get; set; }
Public MustOverride Property Sectionable As Boolean
	Get
	Set
public:
virtual property bool Sectionable {
	bool get () abstract;
	void set (bool value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)