Reference Library
SetFitData Method (degree, fitPoints, fitTolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »SetFitData(Int32, Point2dCollection, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFitData(
	int degree,
	Point2dCollection fitPoints,
	Tolerance fitTolerance
)
Public Sub SetFitData ( _
	degree As Integer, _
	fitPoints As Point2dCollection, _
	fitTolerance As Tolerance _
)
public:
void SetFitData(
	int degree,
	Point2dCollection^ fitPoints,
	Tolerance fitTolerance
)
 Parameters
degree(Int32)
fitPoints(Point2dCollection)
fitTolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)