Reference Library
OriginalDxfName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ProxyObject »OriginalDxfName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string OriginalDxfName { get; }
Public ReadOnly Property OriginalDxfName As String
	Get
public:
property String^ OriginalDxfName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)