Reference Library
SetGridColor Method (row, column, gridLinetype, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »SetGridColor(Int32, Int32, GridLineType, Color)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetGridColor(
	int row,
	int column,
	GridLineType gridLinetype,
	Color value
)
Public Overridable Sub SetGridColor ( _
	row As Integer, _
	column As Integer, _
	gridLinetype As GridLineType, _
	value As Color _
)
public:
virtual void SetGridColor(
	int row,
	int column,
	GridLineType gridLinetype,
	Color^ value
)
 Parameters
row(Int32)
column(Int32)
gridLinetype(GridLineType)
value(Color)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)