Reference Library
FingerprintGuid Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FileDependencyInfo »FingerprintGuid
 Declaration Syntax
C# | Visual Basic | Visual C++
public string FingerprintGuid { get; }
Public ReadOnly Property FingerprintGuid As String
	Get
public:
property String^ FingerprintGuid {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)