Reference Library
EndAngle Property
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc2d »EndAngle
 Declaration Syntax
C# | Visual Basic | Visual C++
public double EndAngle { get; }
Public ReadOnly Property EndAngle As Double
	Get
public:
property double EndAngle {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)