Reference Library
LispCancelled Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »LispCancelled
 Declaration Syntax
C# | Visual Basic | Visual C++
public event EventHandler LispCancelled
Public Event LispCancelled As EventHandler
public:
 event EventHandler^ LispCancelled {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)