Reference Library
SetDatabaseDefaults Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »SetDatabaseDefaults()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetDatabaseDefaults()
Public Sub SetDatabaseDefaults
public:
void SetDatabaseDefaults()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)