Reference Library
CircularArc2d Constructor (startPoint, endPoint, bulge, bulgeFlag)
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc2d »CircularArc2d(Point2d, Point2d, Double, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CircularArc2d(
	Point2d startPoint,
	Point2d endPoint,
	double bulge,
	bool bulgeFlag
)
Public Sub New ( _
	startPoint As Point2d, _
	endPoint As Point2d, _
	bulge As Double, _
	bulgeFlag As Boolean _
)
public:
CircularArc2d(
	Point2d startPoint,
	Point2d endPoint,
	double bulge,
	bool bulgeFlag
)
 Parameters
startPoint(Point2d)
endPoint(Point2d)
bulge(Double)
bulgeFlag(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)