Reference Library
RXObject Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.Runtime »RXObject »RXObject(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected RXObject(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Protected Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
protected:
RXObject(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)