Reference Library
Solid3dMassProperties Constructor (dummy)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3dMassProperties »Solid3dMassProperties(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Solid3dMassProperties(
	int dummy
)
Public Sub New ( _
	dummy As Integer _
)
public:
Solid3dMassProperties(
	int dummy
)
 Parameters
dummy(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)