Reference Library
ConstantWidth Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline2d »ConstantWidth
 Declaration Syntax
C# | Visual Basic | Visual C++
public double ConstantWidth { get; set; }
Public Property ConstantWidth As Double
	Get
	Set
public:
property double ConstantWidth {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)