Reference Library
KeepFocus Property
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »KeepFocus
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool KeepFocus { get; set; }
Public Overridable Property KeepFocus As Boolean
	Get
	Set
public:
virtual property bool KeepFocus {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)