Reference Library
OriginalSurface Property
Namespaces »ZwSoft.ZwCAD.Geometry »OffsetSurface »OriginalSurface
 Declaration Syntax
C# | Visual Basic | Visual C++
public Surface OriginalSurface { get; }
Public ReadOnly Property OriginalSurface As Surface
	Get
public:
property Surface^ OriginalSurface {
	Surface^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)