Reference Library
SubWorldDraw Method (wd)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »SubWorldDraw(WorldDraw)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal override bool SubWorldDraw(
	WorldDraw wd
)
Protected Friend Overrides Function SubWorldDraw ( _
	wd As WorldDraw _
) As Boolean
protected public:
virtual bool SubWorldDraw(
	WorldDraw^ wd
) override
 Parameters
wd(WorldDraw)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)