Reference Library
DisposableSelectionSet Class
Namespaces »ZwSoft.ZwCAD.EditorInput »DisposableSelectionSet
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class DisposableSelectionSet : IDisposable
Public NotInheritable Class DisposableSelectionSet _
	Implements IDisposable
public ref class DisposableSelectionSet sealed : IDisposable
 Members
All Members | Constructors | Methods
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DisposableSelectionSet(SelectionSetDelayMarshalled)
Dispose()
 Inheritance Hierarchy
Object
DisposableSelectionSet
Assembly: ZwManaged (Module: ZwManaged)