Reference Library
GetNumPixelsInUnitSquare Method (givenWorldpt)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »GetNumPixelsInUnitSquare(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d GetNumPixelsInUnitSquare(
	Point3d givenWorldpt
)
Public Function GetNumPixelsInUnitSquare ( _
	givenWorldpt As Point3d _
) As Point2d
public:
Point2d GetNumPixelsInUnitSquare(
	Point3d givenWorldpt
)
 Parameters
givenWorldpt(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)