Reference Library
GetCurves Method
Namespaces »ZwSoft.ZwCAD.Geometry »CompositeCurve3d »GetCurves()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Curve3d[] GetCurves()
Public Function GetCurves As Curve3d()
public:
array<Curve3d^>^ GetCurves()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)