Reference Library
Add Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Int32Collection »Add(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Add(
	int value
)
Public Overridable Function Add ( _
	value As Integer _
) As Integer
public:
virtual int Add(
	int value
)
 Parameters
value(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)