Reference Library
CurrentSpaceId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »CurrentSpaceId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId CurrentSpaceId { get; }
Public ReadOnly Property CurrentSpaceId As ObjectId
	Get
public:
property ObjectId CurrentSpaceId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)