Reference Library
LeaderLineColor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »LeaderLineColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color LeaderLineColor { get; set; }
Public Property LeaderLineColor As Color
	Get
	Set
public:
property Color^ LeaderLineColor {
	Color^ get ();
	void set (Color^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)