Reference Library
Add Method (p)
Namespaces »ZwSoft.ZwCAD.Geometry »Point2dCollection »Add(Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Add(
	Point2d p
)
Public Function Add ( _
	p As Point2d _
) As Integer
public:
int Add(
	Point2d p
)
 Parameters
p(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)