Reference Library
IntegerCollection Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »IntegerCollection »IntegerCollection()
 Declaration Syntax
C# | Visual Basic | Visual C++
public IntegerCollection()
Public Sub New
public:
IntegerCollection()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)