Reference Library
Remove Method (value)
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerFilterCollection »Remove(LayerFilter)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Remove(
	LayerFilter value
)
Public Sub Remove ( _
	value As LayerFilter _
)
public:
void Remove(
	LayerFilter^ value
)
 Parameters
value(LayerFilter)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)