Reference Library
setCvpVS2d Method
Namespaces »ZwSoft.ZwCAD.EditorInput »EditorVisualStyle »setCvpVS2d()
 Declaration Syntax
C# | Visual Basic | Visual C++
public static void setCvpVS2d()
Public Shared Sub setCvpVS2d
public:
static void setCvpVS2d()
Assembly: ZwManaged (Module: ZwManaged)