Reference Library
OrthoProject Method (plane)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »OrthoProject(Plane)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d OrthoProject(
	Plane plane
)
Public Function OrthoProject ( _
	plane As Plane _
) As Point3d
public:
Point3d OrthoProject(
	Plane^ plane
)
 Parameters
plane(Plane)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)