Reference Library
PreferCommandLine Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptFileOptions »PreferCommandLine
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool PreferCommandLine { get; set; }
Public Property PreferCommandLine As Boolean
	Get
	Set
public:
property bool PreferCommandLine {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)