Reference Library
CorrectSpelling Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBText »CorrectSpelling()
 Declaration Syntax
C# | Visual Basic | Visual C++
public int CorrectSpelling()
Public Function CorrectSpelling As Integer
public:
int CorrectSpelling()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)