Reference Library
IsSolidFill Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »IsSolidFill
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsSolidFill { get; }
Public ReadOnly Property IsSolidFill As Boolean
	Get
public:
property bool IsSolidFill {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)