Reference Library
GetObject Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Transaction »GetObject()
 Members
Icon | Member | Description
GetObject(ObjectId, OpenMode, Boolean, Boolean)
GetObject(ObjectId, OpenMode, Boolean)
GetObject(ObjectId, OpenMode)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)