Reference Library
CircularArc Method (center, radius, normal, startVector, sweepAngle, arcType)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »CircularArc(Point3d, Double, Vector3d, Vector3d, Double, ArcType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool CircularArc(
	Point3d center,
	double radius,
	Vector3d normal,
	Vector3d startVector,
	double sweepAngle,
	ArcType arcType
)
Public MustOverride Function CircularArc ( _
	center As Point3d, _
	radius As Double, _
	normal As Vector3d, _
	startVector As Vector3d, _
	sweepAngle As Double, _
	arcType As ArcType _
) As Boolean
public:
virtual bool CircularArc(
	Point3d center,
	double radius,
	Vector3d normal,
	Vector3d startVector,
	double sweepAngle,
	ArcType arcType
) abstract
 Parameters
center(Point3d)
radius(Double)
normal(Vector3d)
startVector(Vector3d)
sweepAngle(Double)
arcType(ArcType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)