Reference Library
Elevation Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Section »Elevation
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public double Elevation { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Property Elevation As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
property double Elevation {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)