Reference Library
FireAboutToMoveFile Method (e)
Namespaces »ZwSoft.ZwCAD.Publishing »Publisher »FireAboutToMoveFile(PublishEventArgs)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void FireAboutToMoveFile(
	PublishEventArgs e
)
Public Sub FireAboutToMoveFile ( _
	e As PublishEventArgs _
)
public:
void FireAboutToMoveFile(
	PublishEventArgs^ e
)
 Parameters
e(PublishEventArgs)
Assembly: ZwManaged (Module: ZwManaged)