Reference Library
IsEqualTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »Scale3d »IsEqualTo()
 Members
Icon | Member | Description
IsEqualTo(Scale3d, Tolerance)
IsEqualTo(Scale3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)