Reference Library
GetInternalArray Method (col)
Namespaces »ZwSoft.ZwCAD.Runtime »Marshaler »GetInternalArray(DoubleCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static double[] GetInternalArray(
	DoubleCollection col
)
Public Shared Function GetInternalArray ( _
	col As DoubleCollection _
) As Double()
public:
static array<double>^ GetInternalArray(
	DoubleCollection^ col
)
 Parameters
col(DoubleCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)