Reference Library
RadialDimensionLarge Constructor (center, chordPoint, overrideCenter, jogPoint, jogAngle, dimensionText, dimensionStyle)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RadialDimensionLarge »RadialDimensionLarge(Point3d, Point3d, Point3d, Point3d, Double, String, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public RadialDimensionLarge(
	Point3d center,
	Point3d chordPoint,
	Point3d overrideCenter,
	Point3d jogPoint,
	double jogAngle,
	string dimensionText,
	ObjectId dimensionStyle
)
Public Sub New ( _
	center As Point3d, _
	chordPoint As Point3d, _
	overrideCenter As Point3d, _
	jogPoint As Point3d, _
	jogAngle As Double, _
	dimensionText As String, _
	dimensionStyle As ObjectId _
)
public:
RadialDimensionLarge(
	Point3d center,
	Point3d chordPoint,
	Point3d overrideCenter,
	Point3d jogPoint,
	double jogAngle,
	String^ dimensionText,
	ObjectId dimensionStyle
)
 Parameters
center(Point3d)
chordPoint(Point3d)
overrideCenter(Point3d)
jogPoint(Point3d)
jogAngle(Double)
dimensionText(String)
dimensionStyle(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)