Reference Library
TwistAngle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolveOptionsBuilder »TwistAngle
 Declaration Syntax
C# | Visual Basic | Visual C++
public double TwistAngle { get; set; }
Public Property TwistAngle As Double
	Get
	Set
public:
property double TwistAngle {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)