Reference Library
Erase Method (pView)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »Erase(View)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool Erase(
	View pView
)
Public MustOverride Function Erase ( _
	pView As View _
) As Boolean
public:
virtual bool Erase(
	View^ pView
) abstract
 Parameters
pView(View)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)