Reference Library
Dimdli Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimdli
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double Dimdli { get; set; }
Public Overridable Property Dimdli As Double
	Get
	Set
public:
virtual property double Dimdli {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)