Reference Library
Format Method (rowType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableStyle »Format(RowType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string Format(
	RowType rowType
)
Public Overridable Function Format ( _
	rowType As RowType _
) As String
public:
virtual String^ Format(
	RowType rowType
)
 Parameters
rowType(RowType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)