Reference Library
PrincipalMoments Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3dMassProperties »PrincipalMoments
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d PrincipalMoments { get; }
Public ReadOnly Property PrincipalMoments As Vector3d
	Get
public:
property Vector3d PrincipalMoments {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)