Reference Library
ProjectName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »ProjectName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string ProjectName { get; set; }
Public Property ProjectName As String
	Get
	Set
public:
property String^ ProjectName {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)