Reference Library
FileName Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »TextStyle »FileName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string FileName { get; set; }
Public Property FileName As String
	Get
	Set
public:
property String^ FileName {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)