Reference Library
Out Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GraphNode »Out(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public GraphNode Out(
	int index
)
Public Function Out ( _
	index As Integer _
) As GraphNode
public:
GraphNode^ Out(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)