Reference Library
SetShapeNumberAt Method (index, shapeNumber)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinetypeTableRecord »SetShapeNumberAt(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetShapeNumberAt(
	int index,
	int shapeNumber
)
Public Sub SetShapeNumberAt ( _
	index As Integer, _
	shapeNumber As Integer _
)
public:
void SetShapeNumberAt(
	int index,
	int shapeNumber
)
 Parameters
index(Int32)
shapeNumber(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)