Reference Library
EntityColor Constructor (red, green, blue)
Namespaces »ZwSoft.ZwCAD.Colors »EntityColor »EntityColor(Byte, Byte, Byte)
 Declaration Syntax
C# | Visual Basic | Visual C++
public EntityColor(
	byte red,
	byte green,
	byte blue
)
Public Sub New ( _
	red As Byte, _
	green As Byte, _
	blue As Byte _
)
public:
EntityColor(
	unsigned char red,
	unsigned char green,
	unsigned char blue
)
 Parameters
red(Byte)
green(Byte)
blue(Byte)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)