Reference Library
Next Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »FilteredBlockIterator »Next
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Next { get; }
Public ReadOnly Property Next As ObjectId
	Get
public:
property ObjectId Next {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)