Reference Library
GetOrthoProjectEntity Method (projectionPlane, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »GetOrthoProjectEntity(Plane, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Entity3d GetOrthoProjectEntity(
	Plane projectionPlane,
	Tolerance tolerance
)
Public Function GetOrthoProjectEntity ( _
	projectionPlane As Plane, _
	tolerance As Tolerance _
) As Entity3d
public:
Entity3d^ GetOrthoProjectEntity(
	Plane^ projectionPlane,
	Tolerance tolerance
)
 Parameters
projectionPlane(Plane)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)