Reference Library
VertexType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolygonMeshVertex »VertexType
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vertex3dType VertexType { get; }
Public ReadOnly Property VertexType As Vertex3dType
	Get
public:
property Vertex3dType VertexType {
	Vertex3dType get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)