Reference Library
GetMaximumPoint Method
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock2d »GetMaximumPoint()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d GetMaximumPoint()
Public Function GetMaximumPoint As Point2d
public:
Point2d GetMaximumPoint()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)