Reference Library
IList_Add Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3dCollection »IList_Add(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
internal int IList_Add(
	Object value
)
Friend Function IList_Add ( _
	value As Object _
) As Integer
internal:
virtual int IList_Add(
	Object^ value
) sealed
 Parameters
value(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)