Reference Library
ReadInt32 Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »ReadInt32()
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract int ReadInt32()
Public MustOverride Function ReadInt32 As Integer
public:
virtual int ReadInt32() abstract
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)