Reference Library
PlotToFilePath Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »PlotToFilePath
 Declaration Syntax
C# | Visual Basic | Visual C++
public string PlotToFilePath { get; }
Public ReadOnly Property PlotToFilePath As String
	Get
public:
property String^ PlotToFilePath {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)