Reference Library
SetDsdEntryCollection Method (entries)
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdData »SetDsdEntryCollection(DsdEntryCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetDsdEntryCollection(
	DsdEntryCollection entries
)
Public Sub SetDsdEntryCollection ( _
	entries As DsdEntryCollection _
)
public:
void SetDsdEntryCollection(
	DsdEntryCollection^ entries
)
 Parameters
entries(DsdEntryCollection)
Assembly: ZwManaged (Module: ZwManaged)