Reference Library
IsColinearTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »LineSegment2d »IsColinearTo()
 Members
Icon | Member | Description
IsColinearTo(LinearEntity2d, Tolerance)
IsColinearTo(LinearEntity2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)