Reference Library
FrontClipAtEyeOn Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »FrontClipAtEyeOn
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool FrontClipAtEyeOn { get; set; }
Public Property FrontClipAtEyeOn As Boolean
	Get
	Set
public:
property bool FrontClipAtEyeOn {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)