Reference Library
StartPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Line »StartPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public override Point3d StartPoint { get; set; }
Public Overrides Property StartPoint As Point3d
	Get
	Set
public:
virtual property Point3d StartPoint {
	Point3d get () override;
	void set (Point3d value) override;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)