Reference Library
PointRef Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PointRef »PointRef()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal PointRef()
Protected Friend Sub New
protected public:
PointRef()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)