Reference Library
Tdindwg Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Tdindwg
 Declaration Syntax
C# | Visual Basic | Visual C++
public TimeSpan Tdindwg { get; }
Public ReadOnly Property Tdindwg As TimeSpan
	Get
public:
property TimeSpan Tdindwg {
	TimeSpan get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)