Reference Library
SetAxisPoint Method (axisPoint, moveStartPoint)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Helix »SetAxisPoint(Point3d, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetAxisPoint(
	Point3d axisPoint,
	bool moveStartPoint
)
Public Sub SetAxisPoint ( _
	axisPoint As Point3d, _
	moveStartPoint As Boolean _
)
public:
void SetAxisPoint(
	Point3d axisPoint,
	bool moveStartPoint
)
 Parameters
axisPoint(Point3d)
moveStartPoint(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)