Reference Library
SetTextString Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetTextString()
 Members
Icon | Member | Description
SetTextString(Int32, Int32, Int32, String)
SetTextString(Int32, Int32, String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)