Reference Library
Background Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Background
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbBackground")]
public class Background : DBObject
<WrapperAttribute("AcDbBackground")> _
Public Class Background _
	Inherits DBObject
[WrapperAttribute(L"AcDbBackground")]
public ref class Background : public DBObject
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Background(IntPtr, Boolean)
GetBackgroundDictionaryId(Database, Boolean)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Background
|  |  |  |  |  | GradientBackground
|  |  |  |  |  | GroundPlaneBackground
|  |  |  |  |  | SkyBackground
|  |  |  |  |  | SolidBackground
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)