Reference Library
GetSegmentLength Method (fromParameter, toParameter, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »LineSegment2d »GetSegmentLength(Double, Double, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetSegmentLength(
	double fromParameter,
	double toParameter,
	Tolerance tolerance
)
Public Function GetSegmentLength ( _
	fromParameter As Double, _
	toParameter As Double, _
	tolerance As Tolerance _
) As Double
public:
double GetSegmentLength(
	double fromParameter,
	double toParameter,
	Tolerance tolerance
)
 Parameters
fromParameter(Double)
toParameter(Double)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)