Reference Library
AcadObject Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »AcadObject
 Declaration Syntax
C# | Visual Basic | Visual C++
public Object AcadObject { get; }
Public ReadOnly Property AcadObject As Object
	Get
public:
property Object^ AcadObject {
	Object^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)