Reference Library
UpdateAction Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UpdateAction
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum UpdateAction
Public Enumeration UpdateAction
public enum class UpdateAction
 Members
Member | Description
None
UpdateRequired
Ignore
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)