Reference Library
Coordinate Property (i)
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »Coordinate[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public double this[
	int i
] { get; }
Public ReadOnly Default Property Coordinate ( _
	i As Integer _
) As Double
	Get
public:
property double default[int i] {
	double get (int i);
}
 Parameters
i(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)