Reference Library
Userr5 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Userr5
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Userr5 { get; set; }
Public Property Userr5 As Double
	Get
	Set
public:
property double Userr5 {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)