Reference Library
OptionalDetails Property
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectedObject »OptionalDetails
 Declaration Syntax
C# | Visual Basic | Visual C++
public SelectionDetails OptionalDetails { get; internal set; }
Public Property OptionalDetails As SelectionDetails
	Get
	Friend Set
public:
property SelectionDetails^ OptionalDetails {
	SelectionDetails^ get ();
	internal: void set (SelectionDetails^ value);
}
Assembly: ZwManaged (Module: ZwManaged)