Reference Library
Scale2d Constructor (factor)
Namespaces »ZwSoft.ZwCAD.Geometry »Scale2d »Scale2d(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Scale2d(
	double factor
)
Public Sub New ( _
	factor As Double _
)
public:
Scale2d(
	double factor
)
 Parameters
factor(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)