Reference Library
ClipFront Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FrontAndBackClipping »ClipFront
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool ClipFront { get; }
Public ReadOnly Property ClipFront As Boolean
	Get
public:
property bool ClipFront {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)