Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FitData »Equality(FitData, FitData)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	FitData a,
	FitData b
)
Public Shared Operator = ( _
	a As FitData, _
	b As FitData _
) As Boolean
public:
static bool operator ==(
	FitData a,
	FitData b
)
 Parameters
a(FitData)
b(FitData)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)