Reference Library
KeyLength Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SecurityParameters »KeyLength
 Declaration Syntax
C# | Visual Basic | Visual C++
public int KeyLength { get; set; }
Public Property KeyLength As Integer
	Get
	Set
public:
property int KeyLength {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)