Reference Library
DwgOut Method (filer)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »DwgOut(DwgFiler)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void DwgOut(
	DwgFiler filer
)
Public Sub DwgOut ( _
	filer As DwgFiler _
)
public:
void DwgOut(
	DwgFiler^ filer
)
 Parameters
filer(DwgFiler)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)