Reference Library
BoundedPlane Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »BoundedPlane »BoundedPlane()
 Members
Icon | Member | Description
BoundedPlane(Point3d, Vector3d, Vector3d)
BoundedPlane(Point3d, Point3d, Point3d)
BoundedPlane()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)