Reference Library
IsAProxy Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »IsAProxy
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsAProxy { get; }
Public ReadOnly Property IsAProxy As Boolean
	Get
public:
property bool IsAProxy {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)