Reference Library
GlobalName Property
Namespaces »ZwSoft.ZwCAD.Runtime »LispFunctionAttribute »GlobalName
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string GlobalName { get; }
Public Overridable ReadOnly Property GlobalName As String
	Get
public:
virtual property String^ GlobalName {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)