Reference Library
EllipticalArc3d Class
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc3d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeEllipArc3d")]
public sealed class EllipticalArc3d : Curve3d
<WrapperAttribute("ZcGeEllipArc3d")> _
Public NotInheritable Class EllipticalArc3d _
	Inherits Curve3d
[WrapperAttribute(L"ZcGeEllipArc3d")]
public ref class EllipticalArc3d sealed : public Curve3d
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
EllipticalArc3d(Point3d, Vector3d, Vector3d, Double, Double, Double, Double)
EllipticalArc3d(Point3d, Vector3d, Vector3d, Double, Double)
EllipticalArc3d()
Center
ClosestPointToPlane(PlanarEntity, Tolerance)
ClosestPointToPlane(PlanarEntity)
Create(IntPtr, Boolean)
EndAngle
EndPoint
GetPlane()
IntersectWith(PlanarEntity, Tolerance)
IntersectWith(LinearEntity3d, Tolerance)
IntersectWith(PlanarEntity)
IntersectWith(LinearEntity3d)
IsCircular(Tolerance)
IsCircular()
IsInside(Point3d, Tolerance)
IsInside(Point3d)
MajorAxis
MajorRadius
MinorAxis
MinorRadius
Normal
ProjectedIntersectWith(LinearEntity3d, Vector3d, Tolerance)
ProjectedIntersectWith(LinearEntity3d, Vector3d)
Set(Point3d, Vector3d, Vector3d, Double, Double, Double, Double)
Set(Point3d, Vector3d, Vector3d, Double, Double)
SetAngles(Double, Double)
SetAxes(Vector3d, Vector3d)
StartAngle
StartPoint
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity3d
|  |  | Curve3d
|  |  |  | EllipticalArc3d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)