Reference Library
CopyTo Method (arr, index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GraphNodeCollection »CopyTo(GraphNode[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	GraphNode[] arr,
	int index
)
Public Sub CopyTo ( _
	arr As GraphNode(), _
	index As Integer _
)
public:
void CopyTo(
	array<GraphNode^>^ arr,
	int index
)
 Parameters
arr(GraphNode[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)