Reference Library
ToArray Method
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »ToArray()
 Declaration Syntax
C# | Visual Basic | Visual C++
public double[] ToArray()
Public Function ToArray As Double()
public:
array<double>^ ToArray()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)