Reference Library
GetIntersectionParameters Method (intersection)
Namespaces »ZwSoft.ZwCAD.Geometry »CurveCurveIntersector3d »GetIntersectionParameters(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double[] GetIntersectionParameters(
	int intersection
)
Public Function GetIntersectionParameters ( _
	intersection As Integer _
) As Double()
public:
array<double>^ GetIntersectionParameters(
	int intersection
)
 Parameters
intersection(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)