Reference Library
PageCancelledEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.PlottingServices »PageCancelledEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void PageCancelledEventHandler(
	Object sender,
	EventArgs e
)
Public Delegate Sub PageCancelledEventHandler ( _
	sender As Object, _
	e As EventArgs _
)
public delegate void PageCancelledEventHandler(
	Object^ sender,
	EventArgs^ e
)
 Parameters
sender(Object)
e(EventArgs)
Assembly: ZwManaged (Module: ZwManaged)