Reference Library
HyperLink Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Field »HyperLink
 Declaration Syntax
C# | Visual Basic | Visual C++
public HyperLink HyperLink { get; set; }
Public Property HyperLink As HyperLink
	Get
	Set
public:
property HyperLink^ HyperLink {
	HyperLink^ get ();
	void set (HyperLink^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)