Reference Library
SetWeightAt Method (index, value)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »SetWeightAt(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetWeightAt(
	int index,
	double value
)
Public Sub SetWeightAt ( _
	index As Integer, _
	value As Double _
)
public:
void SetWeightAt(
	int index,
	double value
)
 Parameters
index(Int32)
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)