Reference Library
GetDistinctKnots Method
Namespaces »ZwSoft.ZwCAD.Geometry »KnotCollection »GetDistinctKnots()
 Declaration Syntax
C# | Visual Basic | Visual C++
public DoubleCollection GetDistinctKnots()
Public Function GetDistinctKnots As DoubleCollection
public:
DoubleCollection^ GetDistinctKnots()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)