Reference Library
IsParallelTo Method (otherPlanarEntity)
Namespaces »ZwSoft.ZwCAD.Geometry »PlanarEntity »IsParallelTo(PlanarEntity)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsParallelTo(
	PlanarEntity otherPlanarEntity
)
Public Function IsParallelTo ( _
	otherPlanarEntity As PlanarEntity _
) As Boolean
public:
bool IsParallelTo(
	PlanarEntity^ otherPlanarEntity
)
 Parameters
otherPlanarEntity(PlanarEntity)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)