Reference Library
NumFitPoints Property
Namespaces »ZwSoft.ZwCAD.Geometry »CubicSplineCurve2d »NumFitPoints
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumFitPoints { get; }
Public ReadOnly Property NumFitPoints As Integer
	Get
public:
property int NumFitPoints {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)