Reference Library
From Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BeginWblockEntireDatabaseEventArgs »From
 Declaration Syntax
C# | Visual Basic | Visual C++
public Database From { get; }
Public ReadOnly Property From As Database
	Get
public:
property Database^ From {
	Database^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)