Reference Library
FrontClipZ Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ClipBoundary »FrontClipZ
 Declaration Syntax
C# | Visual Basic | Visual C++
public double FrontClipZ { get; set; }
Public Property FrontClipZ As Double
	Get
	Set
public:
property double FrontClipZ {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)