Reference Library
IsUsed Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerTableRecord »IsUsed
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsUsed { get; }
Public ReadOnly Property IsUsed As Boolean
	Get
public:
property bool IsUsed {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)