Reference Library
GetHatchPatternType Method (nSecType, nGeometry)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »GetHatchPatternType(SectionType, SectionGeometry)
 Declaration Syntax
C# | Visual Basic | Visual C++
public HatchPatternType GetHatchPatternType(
	SectionType nSecType,
	SectionGeometry nGeometry
)
Public Function GetHatchPatternType ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry _
) As HatchPatternType
public:
HatchPatternType GetHatchPatternType(
	SectionType nSecType,
	SectionGeometry nGeometry
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)