Reference Library
DocumentCollectionEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentCollectionEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void DocumentCollectionEventHandler(
	Object sender,
	DocumentCollectionEventArgs e
)
Public Delegate Sub DocumentCollectionEventHandler ( _
	sender As Object, _
	e As DocumentCollectionEventArgs _
)
public delegate void DocumentCollectionEventHandler(
	Object^ sender,
	DocumentCollectionEventArgs^ e
)
 Parameters
sender(Object)
e(DocumentCollectionEventArgs)
Assembly: ZwManaged (Module: ZwManaged)