Reference Library
GetProjectedCurve Method (planeToProjectOn, projectionDirection)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »GetProjectedCurve(Plane, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Curve GetProjectedCurve(
	Plane planeToProjectOn,
	Vector3d projectionDirection
)
Public Overridable Function GetProjectedCurve ( _
	planeToProjectOn As Plane, _
	projectionDirection As Vector3d _
) As Curve
public:
virtual Curve^ GetProjectedCurve(
	Plane^ planeToProjectOn,
	Vector3d projectionDirection
)
 Parameters
planeToProjectOn(Plane)
projectionDirection(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)