Reference Library
IsSingleton Property
Namespaces »ZwSoft.ZwCAD.Geometry »Interval »IsSingleton
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsSingleton { get; }
Public ReadOnly Property IsSingleton As Boolean
	Get
public:
property bool IsSingleton {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)