Reference Library
DivisionLines Method (nSecType, nGeometry)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »DivisionLines(SectionType, SectionGeometry)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool DivisionLines(
	SectionType nSecType,
	SectionGeometry nGeometry
)
Public Function DivisionLines ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry _
) As Boolean
public:
bool DivisionLines(
	SectionType nSecType,
	SectionGeometry nGeometry
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)