Reference Library
EndParam Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ellipse »EndParam
 Declaration Syntax
C# | Visual Basic | Visual C++
public override double EndParam { get; set; }
Public Overrides Property EndParam As Double
	Get
	Set
public:
virtual property double EndParam {
	double get () override;
	void set (double value) override;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)