Reference Library
GetTraitFlag Method (vsProp, flagValue)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBVisualStyle »GetTraitFlag(VisualStyleProperty, UInt32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool GetTraitFlag(
	VisualStyleProperty vsProp,
	uint flagValue
)
Public Function GetTraitFlag ( _
	vsProp As VisualStyleProperty, _
	flagValue As UInteger _
) As Boolean
public:
bool GetTraitFlag(
	VisualStyleProperty vsProp,
	unsigned int flagValue
)
 Parameters
vsProp(VisualStyleProperty)
flagValue(UInt32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)