Reference Library
IsUniscaledOrtho Method (tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2d »IsUniscaledOrtho(Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsUniscaledOrtho(
	Tolerance tolerance
)
Public Function IsUniscaledOrtho ( _
	tolerance As Tolerance _
) As Boolean
public:
bool IsUniscaledOrtho(
	Tolerance tolerance
)
 Parameters
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)