Reference Library
PolylineCurve3d Constructor (points)
Namespaces »ZwSoft.ZwCAD.Geometry »PolylineCurve3d »PolylineCurve3d(Point3dCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PolylineCurve3d(
	Point3dCollection points
)
Public Sub New ( _
	points As Point3dCollection _
)
public:
PolylineCurve3d(
	Point3dCollection^ points
)
 Parameters
points(Point3dCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)