Reference Library
OnSize Method (outputRect)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »OnSize(Extents2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void OnSize(
	Extents2d outputRect
)
Public MustOverride Sub OnSize ( _
	outputRect As Extents2d _
)
public:
virtual void OnSize(
	Extents2d outputRect
) abstract
 Parameters
outputRect(Extents2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)