Reference Library
IsSynchronized Property
Namespaces »ZwSoft.ZwCAD.Publishing »EPlotAttributeCollection »IsSynchronized
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool IsSynchronized { get; }
Public Overridable ReadOnly Property IsSynchronized As Boolean
	Get
public:
virtual property bool IsSynchronized {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)