Reference Library
GridVisibility Method (row, col, edge)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GridVisibility(Int32, Int32, CellEdgeMasks)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool GridVisibility(
	int row,
	int col,
	CellEdgeMasks edge
)
Public Overridable Function GridVisibility ( _
	row As Integer, _
	col As Integer, _
	edge As CellEdgeMasks _
) As Boolean
public:
virtual bool GridVisibility(
	int row,
	int col,
	CellEdgeMasks edge
)
 Parameters
row(Int32)
col(Int32)
edge(CellEdgeMasks)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)