Reference Library
Surface1Right Property
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersectorConfigurations »Surface1Right
 Declaration Syntax
C# | Visual Basic | Visual C++
public SurfaceSurfaceIntersectorConfiguration Surface1Right { get; }
Public ReadOnly Property Surface1Right As SurfaceSurfaceIntersectorConfiguration
	Get
public:
property SurfaceSurfaceIntersectorConfiguration Surface1Right {
	SurfaceSurfaceIntersectorConfiguration get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)