Reference Library
Layout Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Layout »Layout(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal Layout(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
protected public:
Layout(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)