Reference Library
IList_Item Property (index)
Namespaces »ZwSoft.ZwCAD.Colors »EntityColorCollection »IList.Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
Object IList.this[
	int index
] { get; set; }
Private Property IList_Item ( _
	index As Integer _
) As Object Implements IList.Item
	Get
	Set
private:
virtual property Object^ IList_Item[int index] {
	Object^ get (int index) sealed = IList::Item::get;
	void set (int index, Object^ value) sealed = IList::Item::set;
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)