Reference Library
CartesianSnappedPoint Property
Namespaces »ZwSoft.ZwCAD.EditorInput »InputPointContext »CartesianSnappedPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d CartesianSnappedPoint { get; }
Public ReadOnly Property CartesianSnappedPoint As Point3d
	Get
public:
property Point3d CartesianSnappedPoint {
	Point3d get ();
}
Assembly: ZwManaged (Module: ZwManaged)