Reference Library
SkyBackground Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SkyBackground »SkyBackground(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal SkyBackground(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
protected public:
SkyBackground(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)