Reference Library
Vector2d Structure
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeVector2d")]
public struct Vector2d : IFormattable
<WrapperAttribute("ZcGeVector2d")> _
Public Structure Vector2d _
	Implements IFormattable
[WrapperAttribute(L"ZcGeVector2d")]
public value class Vector2d : IFormattable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Vector2d(Double, Double)
Vector2d(Double[])
Add(Vector2d)
Addition(Vector2d, Vector2d)
Angle
Coordinate[Int32]
DivideBy(Double)
Division(Vector2d, Double)
DotProduct(Vector2d)
Equality(Vector2d, Vector2d)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetAngleTo(Vector2d)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
GetNormal(Tolerance)
GetNormal()
GetPerpendicularVector()
Inequality(Vector2d, Vector2d)
IsCodirectionalTo(Vector2d, Tolerance)
IsCodirectionalTo(Vector2d)
IsEqualTo(Vector2d, Tolerance)
IsEqualTo(Vector2d)
IsParallelTo(Vector2d, Tolerance)
IsParallelTo(Vector2d)
IsPerpendicularTo(Vector2d, Tolerance)
IsPerpendicularTo(Vector2d)
IsUnitLength(Tolerance)
IsUnitLength()
IsZeroLength(Tolerance)
IsZeroLength()
Length
LengthSqrd
Mirror(Vector2d)
Multiply(Double, Vector2d)
Multiply(Vector2d, Double)
Multiply(Matrix2d, Vector2d)
MultiplyBy(Double)
Negate()
RotateBy(Double)
Subtract(Vector2d)
Subtraction(Vector2d, Vector2d)
ToArray()
ToString(String, IFormatProvider)
ToString(IFormatProvider)
ToString() |  (Overrides ValueType.ToString().)
TransformBy(Matrix2d)
UnaryNegation(Vector2d)
X
XAxis
Y
YAxis
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)