Reference Library
SetBreakSpacing Method (spacing)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetBreakSpacing(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetBreakSpacing(
	double spacing
)
Public Overridable Sub SetBreakSpacing ( _
	spacing As Double _
)
public:
virtual void SetBreakSpacing(
	double spacing
)
 Parameters
spacing(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)