Reference Library
LastUpdatedAtU Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »Index »LastUpdatedAtU
 Declaration Syntax
C# | Visual Basic | Visual C++
public DateTime LastUpdatedAtU { get; set; }
Public Property LastUpdatedAtU As DateTime
	Get
	Set
public:
property DateTime LastUpdatedAtU {
	DateTime get ();
	void set (DateTime value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)