Reference Library
IsPlotCancelled Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotProgress »IsPlotCancelled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPlotCancelled { get; }
Public ReadOnly Property IsPlotCancelled As Boolean
	Get
public:
property bool IsPlotCancelled {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)