Reference Library
Add Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2dCollection »Add(Curve2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Add(
	Curve2d value
)
Public Function Add ( _
	value As Curve2d _
) As Integer
public:
int Add(
	Curve2d^ value
)
 Parameters
value(Curve2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)