Reference Library
IsBoundedPlane Property
Namespaces »ZwSoft.ZwCAD.Geometry »OffsetSurface »IsBoundedPlane
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsBoundedPlane { get; }
Public ReadOnly Property IsBoundedPlane As Boolean
	Get
public:
property bool IsBoundedPlane {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)