Reference Library
MoveVertexAt Method (index, newPosition)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Mline »MoveVertexAt(Int32, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void MoveVertexAt(
	int index,
	Point3d newPosition
)
Public Sub MoveVertexAt ( _
	index As Integer, _
	newPosition As Point3d _
)
public:
void MoveVertexAt(
	int index,
	Point3d newPosition
)
 Parameters
index(Int32)
newPosition(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)