Reference Library
OrientationFlag Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »VertexData »OrientationFlag
 Declaration Syntax
C# | Visual Basic | Visual C++
public OrientationType OrientationFlag { get; set; }
Public Property OrientationFlag As OrientationType
	Get
	Set
public:
property OrientationType OrientationFlag {
	OrientationType get ();
	void set (OrientationType value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)