Reference Library
CopyTo Method (array, index)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3dCollection »CopyTo(Vector3d[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	Vector3d[] array,
	int index
)
Public Sub CopyTo ( _
	array As Vector3d(), _
	index As Integer _
)
public:
virtual void CopyTo(
	array<Vector3d>^ array,
	int index
) sealed
 Parameters
array(Vector3d[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)