Reference Library
IntersectWith Method (plane)
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc3d »IntersectWith(PlanarEntity)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d[] IntersectWith(
	PlanarEntity plane
)
Public Function IntersectWith ( _
	plane As PlanarEntity _
) As Point3d()
public:
array<Point3d>^ IntersectWith(
	PlanarEntity^ plane
)
 Parameters
plane(PlanarEntity)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)