Reference Library
NumVertices Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolyFaceMesh »NumVertices
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumVertices { get; }
Public ReadOnly Property NumVertices As Integer
	Get
public:
property int NumVertices {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)