Reference Library
GetTrimmedOffset Method
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »GetTrimmedOffset()
 Members
Icon | Member | Description
GetTrimmedOffset(Double, OffsetCurveExtensionType, Tolerance)
GetTrimmedOffset(Double, OffsetCurveExtensionType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)