Reference Library
Remove Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2dCollection »Remove(Curve2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Remove(
	Curve2d value
)
Public Sub Remove ( _
	value As Curve2d _
)
public:
void Remove(
	Curve2d^ value
)
 Parameters
value(Curve2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)