Reference Library
AcisOut Method (fileName, entitiesOutToFile)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Body »AcisOut(String, DBObjectCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static void AcisOut(
	string fileName,
	DBObjectCollection entitiesOutToFile
)
Public Shared Sub AcisOut ( _
	fileName As String, _
	entitiesOutToFile As DBObjectCollection _
)
public:
static void AcisOut(
	String^ fileName,
	DBObjectCollection^ entitiesOutToFile
)
 Parameters
fileName(String)
entitiesOutToFile(DBObjectCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)