Reference Library
GetPerpendicularLine Method (point)
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity2d »GetPerpendicularLine(Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Line2d GetPerpendicularLine(
	Point2d point
)
Public Function GetPerpendicularLine ( _
	point As Point2d _
) As Line2d
public:
Line2d^ GetPerpendicularLine(
	Point2d point
)
 Parameters
point(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)