Reference Library
PostMultiplyBy Method (rightSide)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »PostMultiplyBy(Matrix3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Matrix3d PostMultiplyBy(
	Matrix3d rightSide
)
Public Function PostMultiplyBy ( _
	rightSide As Matrix3d _
) As Matrix3d
public:
Matrix3d PostMultiplyBy(
	Matrix3d rightSide
)
 Parameters
rightSide(Matrix3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)