Reference Library
EvaluateDiesel Method (dieselCmd)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »EvaluateDiesel(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string EvaluateDiesel(
	string dieselCmd
)
Public Shared Function EvaluateDiesel ( _
	dieselCmd As String _
) As String
public:
static String^ EvaluateDiesel(
	String^ dieselCmd
)
 Parameters
dieselCmd(String)
Assembly: ZwManaged (Module: ZwManaged)