Reference Library
WriteInt64 Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »WriteInt64(Int64)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void WriteInt64(
	long value
)
Public MustOverride Sub WriteInt64 ( _
	value As Long _
)
public:
virtual void WriteInt64(
	long long value
) abstract
 Parameters
value(Int64)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)