Reference Library
IsClosedInV Method
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalBoundedSurface »IsClosedInV()
 Members
Icon | Member | Description
IsClosedInV(Tolerance)
IsClosedInV()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)