Reference Library
SnapIsoPair Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »SnapIsoPair
 Declaration Syntax
C# | Visual Basic | Visual C++
public int SnapIsoPair { get; set; }
Public Property SnapIsoPair As Integer
	Get
	Set
public:
property int SnapIsoPair {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)