Reference Library
Vertical Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellBorders »Vertical
 Declaration Syntax
C# | Visual Basic | Visual C++
public CellBorder Vertical { get; }
Public ReadOnly Property Vertical As CellBorder
	Get
public:
property CellBorder^ Vertical {
	CellBorder^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)