Reference Library
AllowZero Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptNumericalOptions »AllowZero
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool AllowZero { get; set; }
Public Property AllowZero As Boolean
	Get
	Set
public:
property bool AllowZero {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)