Reference Library
GetProjectedEntity Method
Namespaces »ZwSoft.ZwCAD.Geometry »AugmentedPolylineCurve3d »GetProjectedEntity()
 Members
Icon | Member | Description
GetProjectedEntity(Plane, Vector3d, Tolerance)
GetProjectedEntity(Plane, Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)