Reference Library
SetPoint Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCell »SetPoint(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetPoint(
	Point3d value
)
Public Sub SetPoint ( _
	value As Point3d _
)
public:
void SetPoint(
	Point3d value
)
 Parameters
value(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)