Reference Library
IsInside Method (pointValue)
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc3d »IsInside(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsInside(
	Point3d pointValue
)
Public Function IsInside ( _
	pointValue As Point3d _
) As Boolean
public:
bool IsInside(
	Point3d pointValue
)
 Parameters
pointValue(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)