Reference Library
SetPointAt Method (index, point)
Namespaces »ZwSoft.ZwCAD.Geometry »AugmentedPolylineCurve3d »SetPointAt(Int32, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetPointAt(
	int index,
	Point3d point
)
Public Sub SetPointAt ( _
	index As Integer, _
	point As Point3d _
)
public:
void SetPointAt(
	int index,
	Point3d point
)
 Parameters
index(Int32)
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)