Reference Library
Contains Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObjectCollection »Contains(DBObject)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Contains(
	DBObject value
)
Public Function Contains ( _
	value As DBObject _
) As Boolean
public:
bool Contains(
	DBObject^ value
)
 Parameters
value(DBObject)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)