Reference Library
DeviceName Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfig »DeviceName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string DeviceName { get; }
Public ReadOnly Property DeviceName As String
	Get
public:
property String^ DeviceName {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)