Reference Library
btrId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefPreXrefLockFileEventArgs »btrId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId btrId { get; }
Public ReadOnly Property btrId As ObjectId
	Get
public:
property ObjectId btrId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)