Reference Library
CellType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Cell »CellType
 Declaration Syntax
C# | Visual Basic | Visual C++
public TableCellType CellType { get; }
Public ReadOnly Property CellType As TableCellType
	Get
public:
property TableCellType CellType {
	TableCellType get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)