Reference Library
LayoutBoundsMaxX Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »LayoutBoundsMaxX
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LayoutBoundsMaxX { get; }
Public ReadOnly Property LayoutBoundsMaxX As Double
	Get
public:
property double LayoutBoundsMaxX {
	double get ();
}
Assembly: ZwManaged (Module: ZwManaged)