Reference Library
Current Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicBlockReferencePropertyCollectionEnumerator »Current
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Object Current { get; }
Public Overridable ReadOnly Property Current As Object
	Get
public:
virtual property Object^ Current {
	Object^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)