Reference Library
IsPerspective Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »IsPerspective
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPerspective { get; }
Public ReadOnly Property IsPerspective As Boolean
	Get
public:
property bool IsPerspective {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)