Reference Library
Set Method (point, vector)
Namespaces »ZwSoft.ZwCAD.Geometry »LineSegment3d »Set(Point3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	Point3d point,
	Vector3d vector
)
Public Sub Set ( _
	point As Point3d, _
	vector As Vector3d _
)
public:
void Set(
	Point3d point,
	Vector3d vector
)
 Parameters
point(Point3d)
vector(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)