Reference Library
Item Property ()
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2dCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public Curve2d this[
	int
] { get; set; }
Public Default Property Item ( _
	 As Integer _
) As Curve2d
	Get
	Set
public:
property Curve2d^ default[int ] {
	Curve2d^ get (int );
	void set (int , Curve2d^ value);
}
 Parameters
(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)