Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.Colors »TransparencyCollection »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public TransparencyCollectionEnumerator GetEnumerator()
Public Function GetEnumerator As TransparencyCollectionEnumerator
public:
virtual TransparencyCollectionEnumerator^ GetEnumerator() sealed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)