Reference Library
Knots Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3dData »Knots
 Declaration Syntax
C# | Visual Basic | Visual C++
public KnotCollection Knots { get; }
Public ReadOnly Property Knots As KnotCollection
	Get
public:
property KnotCollection^ Knots {
	KnotCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)