Reference Library
GetDistAtPoint Method (point)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »GetDistAtPoint(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double GetDistAtPoint(
	Point3d point
)
Public Overridable Function GetDistAtPoint ( _
	point As Point3d _
) As Double
public:
virtual double GetDistAtPoint(
	Point3d point
)
 Parameters
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)