Reference Library
GetPlotDeviceList Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsValidator »GetPlotDeviceList()
 Declaration Syntax
C# | Visual Basic | Visual C++
public StringCollection GetPlotDeviceList()
Public Function GetPlotDeviceList As StringCollection
public:
StringCollection^ GetPlotDeviceList()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)