Reference Library
ClientViewInfo Structure
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ClientViewInfo
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcGsClientViewInfo")]
public struct ClientViewInfo
<WrapperAttribute("AcGsClientViewInfo")> _
Public Structure ClientViewInfo
[WrapperAttribute(L"AcGsClientViewInfo")]
public value class ClientViewInfo
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
AcadWindowId
ViewportId
ViewportObjectId
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)