Reference Library
StartLimit Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »LightAttenuation »StartLimit
 Declaration Syntax
C# | Visual Basic | Visual C++
public double StartLimit { get; }
Public ReadOnly Property StartLimit As Double
	Get
public:
property double StartLimit {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)