Reference Library
RecomputeDimensionBlock Method (forceUpdate)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »RecomputeDimensionBlock(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void RecomputeDimensionBlock(
	bool forceUpdate
)
Public Sub RecomputeDimensionBlock ( _
	forceUpdate As Boolean _
)
public:
void RecomputeDimensionBlock(
	bool forceUpdate
)
 Parameters
forceUpdate(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)