Reference Library
PromptEditorOptions Constructor (messageAndKeywords, globalKeywords)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptEditorOptions »PromptEditorOptions(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal PromptEditorOptions(
	string messageAndKeywords,
	string globalKeywords
)
Protected Friend Sub New ( _
	messageAndKeywords As String, _
	globalKeywords As String _
)
protected public:
PromptEditorOptions(
	String^ messageAndKeywords,
	String^ globalKeywords
)
 Parameters
messageAndKeywords(String)
globalKeywords(String)
Assembly: ZwManaged (Module: ZwManaged)