Reference Library
PathLength Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweptSurface »PathLength
 Declaration Syntax
C# | Visual Basic | Visual C++
public double PathLength { get; }
Public ReadOnly Property PathLength As Double
	Get
public:
property double PathLength {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)