Reference Library
GetPointAtParameter Method (parameter)
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve3d »GetPointAtParameter(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d GetPointAtParameter(
	double parameter
)
Public Function GetPointAtParameter ( _
	parameter As Double _
) As Point3d
public:
Point3d GetPointAtParameter(
	double parameter
)
 Parameters
parameter(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)