Reference Library
DefaultResolution Method (xPelsPerUnit, yPelsPerUnit)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »GIRasterImage »DefaultResolution(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Units DefaultResolution(
	double xPelsPerUnit,
	double yPelsPerUnit
)
Public Function DefaultResolution ( _
	<OutAttribute> xPelsPerUnit As Double, _
	<OutAttribute> yPelsPerUnit As Double _
) As Units
public:
Units DefaultResolution(
	[OutAttribute] double xPelsPerUnit,
	[OutAttribute] double yPelsPerUnit
)
 Parameters
xPelsPerUnit(Double)
yPelsPerUnit(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)