Reference Library
BeginAggregation Event
Namespaces »ZwSoft.ZwCAD.Publishing »Publisher »BeginAggregation
 Declaration Syntax
C# | Visual Basic | Visual C++
public event BeginAggregationEventHandler BeginAggregation
Public Event BeginAggregation As BeginAggregationEventHandler
public:
 event BeginAggregationEventHandler^ BeginAggregation {
	void add (BeginAggregationEventHandler^ value);
	void remove (BeginAggregationEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)