Reference Library
PromptAngleOptions Constructor (messageAndKeywords, globalKeywords)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptAngleOptions »PromptAngleOptions(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptAngleOptions(
	string messageAndKeywords,
	string globalKeywords
)
Public Sub New ( _
	messageAndKeywords As String, _
	globalKeywords As String _
)
public:
PromptAngleOptions(
	String^ messageAndKeywords,
	String^ globalKeywords
)
 Parameters
messageAndKeywords(String)
globalKeywords(String)
Assembly: ZwManaged (Module: ZwManaged)