Reference Library
CopyTo Method (array, index)
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerCollection »CopyTo(ObjectId[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	ObjectId[] array,
	int index
)
Public Sub CopyTo ( _
	array As ObjectId(), _
	index As Integer _
)
public:
void CopyTo(
	array<ObjectId>^ array,
	int index
)
 Parameters
array(ObjectId[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)