Reference Library
PlotCancelStatus Enumeration
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotCancelStatus
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum PlotCancelStatus
Public Enumeration PlotCancelStatus
public enum class PlotCancelStatus
 Members
Member | Description
CancelStatusCount
CanceledByCancelAllButton
CanceledByCaller
Continue
Assembly: ZwManaged (Module: ZwManaged)