Reference Library
DataCellCollection Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCellCollection
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbDataCellArray")]
public sealed class DataCellCollection : DisposableWrapper,
	IList
<WrapperAttribute("ZcDbDataCellArray")> _
Public NotInheritable Class DataCellCollection _
	Inherits DisposableWrapper _
	Implements IList
[WrapperAttribute(L"ZcDbDataCellArray")]
public ref class DataCellCollection sealed : public DisposableWrapper,
	IList
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DataCellCollection()
Add(DataCell)
Clear()
Contains(DataCell)
CopyTo(DataCell[], Int32)
Count
GetEnumerator()
ICollection.CopyTo(Array, Int32)
IList.Add(Object)
IList.Contains(Object)
IList.IndexOf(Object)
IList.Insert(Int32, Object)
IList.IsFixedSize
IList.IsReadOnly
IList.Item[Int32]
IList.Remove(Object)
IndexOf(DataCell)
Insert(Int32, DataCell)
ICollection.IsSynchronized
Item[Int32]
Remove(DataCell)
RemoveAt(Int32)
ICollection.SyncRoot
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | DataCellCollection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)