Reference Library
ProjectedIntersectWith Method (line, projectionDirection, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc3d »ProjectedIntersectWith(LinearEntity3d, Vector3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d[] ProjectedIntersectWith(
	LinearEntity3d line,
	Vector3d projectionDirection,
	Tolerance tolerance
)
Public Function ProjectedIntersectWith ( _
	line As LinearEntity3d, _
	projectionDirection As Vector3d, _
	tolerance As Tolerance _
) As Point3d()
public:
array<Point3d>^ ProjectedIntersectWith(
	LinearEntity3d^ line,
	Vector3d projectionDirection,
	Tolerance tolerance
)
 Parameters
line(LinearEntity3d)
projectionDirection(Vector3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)