Reference Library
PromptDistanceOptions Constructor (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDistanceOptions »PromptDistanceOptions(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDistanceOptions(
	string message
)
Public Sub New ( _
	message As String _
)
public:
PromptDistanceOptions(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)