Reference Library
EstimatedHitFraction Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »FilteredBlockIterator »EstimatedHitFraction
 Declaration Syntax
C# | Visual Basic | Visual C++
public double EstimatedHitFraction { get; }
Public ReadOnly Property EstimatedHitFraction As Double
	Get
public:
property double EstimatedHitFraction {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)