Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TypedValue »Equality(TypedValue, TypedValue)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	TypedValue a,
	TypedValue b
)
Public Shared Operator = ( _
	a As TypedValue, _
	b As TypedValue _
) As Boolean
public:
static bool operator ==(
	TypedValue a,
	TypedValue b
)
 Parameters
a(TypedValue)
b(TypedValue)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)