Reference Library
GetContextCollection Method (collectionName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectContextManager »GetContextCollection(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectContextCollection GetContextCollection(
	string collectionName
)
Public Function GetContextCollection ( _
	collectionName As String _
) As ObjectContextCollection
public:
ObjectContextCollection^ GetContextCollection(
	String^ collectionName
)
 Parameters
collectionName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)