Reference Library
UnderlineOn Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »UnderlineOn
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string UnderlineOn { get; }
Public Shared ReadOnly Property UnderlineOn As String
	Get
public:
static property String^ UnderlineOn {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)