Reference Library
ForceSubSelections Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionOptions »ForceSubSelections
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool ForceSubSelections { get; set; }
Public Property ForceSubSelections As Boolean
	Get
	Set
public:
property bool ForceSubSelections {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)