Reference Library
FieldEvaluationOptions Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldEvaluationOptions
 Declaration Syntax
C# | Visual Basic | Visual C++
[FlagsAttribute]
public enum FieldEvaluationOptions
<FlagsAttribute> _
Public Enumeration FieldEvaluationOptions
[FlagsAttribute]
public enum class FieldEvaluationOptions
 Members
Member | Description
OnSave
Automatic
OnDemand
OnRegen
OnEtransmit
OnPlot
OnOpen
Disable
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)