Reference Library
Version Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »Version
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Version Version { get; }
Public Shared ReadOnly Property Version As Version
	Get
public:
static property Version^ Version {
	Version^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)