Reference Library
CircleSide Method
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Utilities »CircleSide()
 Declaration Syntax
C# | Visual Basic | Visual C++
public static short CircleSide()
Public Shared Function CircleSide As Short
public:
static short CircleSide()
Assembly: ZwManaged (Module: ZwManaged)