Reference Library
Dimrnd Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimrnd
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Dimrnd { get; set; }
Public Property Dimrnd As Double
	Get
	Set
public:
property double Dimrnd {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)