Reference Library
IEnumerator_get_Current Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectContextCollectionEnumerator »IEnumerator_get_Current()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Object IEnumerator_get_Current()
Public Overridable Function IEnumerator_get_Current As Object
public:
virtual Object^ IEnumerator_get_Current()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)