Reference Library
IsEqualTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc2d »IsEqualTo()
 Members
Icon | Member | Description
IsEqualTo(Entity2d, Tolerance)
IsEqualTo(Entity2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)