Reference Library
CreateTorus Method (majorRadius, minorRadius)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »CreateTorus(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void CreateTorus(
	double majorRadius,
	double minorRadius
)
Public Overridable Sub CreateTorus ( _
	majorRadius As Double, _
	minorRadius As Double _
)
public:
virtual void CreateTorus(
	double majorRadius,
	double minorRadius
)
 Parameters
majorRadius(Double)
minorRadius(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)