Reference Library
AnnoType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Leader »AnnoType
 Declaration Syntax
C# | Visual Basic | Visual C++
public AnnotationType AnnoType { get; }
Public ReadOnly Property AnnoType As AnnotationType
	Get
public:
property AnnotationType AnnoType {
	AnnotationType get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)