Reference Library
SetRowHeight Method (row, height)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableContent »SetRowHeight(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetRowHeight(
	int row,
	double height
)
Public Overridable Sub SetRowHeight ( _
	row As Integer, _
	height As Double _
)
public:
virtual void SetRowHeight(
	int row,
	double height
)
 Parameters
row(Int32)
height(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)