Reference Library
CheckLoftCurves Method (crossSectionCurves, guideCurves, pPathCurve, displayErrorMessages)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LoftOptions »CheckLoftCurves(Entity[], Entity[], Entity, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LoftOptionsCheckCurvesOut CheckLoftCurves(
	Entity[] crossSectionCurves,
	Entity[] guideCurves,
	Entity pPathCurve,
	bool displayErrorMessages
)
Public Function CheckLoftCurves ( _
	crossSectionCurves As Entity(), _
	guideCurves As Entity(), _
	pPathCurve As Entity, _
	displayErrorMessages As Boolean _
) As LoftOptionsCheckCurvesOut
public:
LoftOptionsCheckCurvesOut^ CheckLoftCurves(
	array<Entity^>^ crossSectionCurves,
	array<Entity^>^ guideCurves,
	Entity^ pPathCurve,
	bool displayErrorMessages
)
 Parameters
crossSectionCurves(Entity[])
guideCurves(Entity[])
pPathCurve(Entity)
displayErrorMessages(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)