Reference Library
Layout Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotInfo »Layout
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Layout { get; set; }
Public Property Layout As ObjectId
	Get
	Set
public:
property ObjectId Layout {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwManaged (Module: ZwManaged)