Reference Library
WblockAborted Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »WblockAborted
 Declaration Syntax
C# | Visual Basic | Visual C++
public event EventHandler WblockAborted
Public Event WblockAborted As EventHandler
public:
 event EventHandler^ WblockAborted {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)