Reference Library
Splframe Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Splframe
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Splframe { get; set; }
Public Property Splframe As Boolean
	Get
	Set
public:
property bool Splframe {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)