Reference Library
PurgeFitData Method
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »PurgeFitData()
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool PurgeFitData()
Public Function PurgeFitData As Boolean
public:
bool PurgeFitData()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)