Reference Library
IsSingular Method
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2d »IsSingular()
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsSingular()
Public Function IsSingular As Boolean
public:
bool IsSingular()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)