Reference Library
SetLineTypes Method (lineTypes)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeData »SetLineTypes(ObjectId[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetLineTypes(
	ObjectId[] lineTypes
)
Public Sub SetLineTypes ( _
	lineTypes As ObjectId() _
)
public:
void SetLineTypes(
	array<ObjectId>^ lineTypes
)
 Parameters
lineTypes(ObjectId[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)