Reference Library
IndexOf Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObjectCollection »IndexOf(DBObject)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int IndexOf(
	DBObject value
)
Public Function IndexOf ( _
	value As DBObject _
) As Integer
public:
int IndexOf(
	DBObject^ value
)
 Parameters
value(DBObject)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)