Reference Library
SetToOwnCurves Method
Namespaces »ZwSoft.ZwCAD.Geometry »CurveBoundary »SetToOwnCurves()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetToOwnCurves()
Public Sub SetToOwnCurves
public:
void SetToOwnCurves()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)