Reference Library
DataTable Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataTable »DataTable()
 Declaration Syntax
C# | Visual Basic | Visual C++
public DataTable()
Public Sub New
public:
DataTable()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)