Reference Library
Bottom Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellBorders »Bottom
 Declaration Syntax
C# | Visual Basic | Visual C++
public CellBorder Bottom { get; }
Public ReadOnly Property Bottom As CellBorder
	Get
public:
property CellBorder^ Bottom {
	CellBorder^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)