Reference Library
EvalPoint Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PointRef »EvalPoint()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Point3d EvalPoint()
Public Overridable Function EvalPoint As Point3d
public:
virtual Point3d EvalPoint()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)