Reference Library
SuggestName Method (imageDictionary, newImagePathName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImageDef »SuggestName(DBDictionary, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string SuggestName(
	DBDictionary imageDictionary,
	string newImagePathName
)
Public Shared Function SuggestName ( _
	imageDictionary As DBDictionary, _
	newImagePathName As String _
) As String
public:
static String^ SuggestName(
	DBDictionary^ imageDictionary,
	String^ newImagePathName
)
 Parameters
imageDictionary(DBDictionary)
newImagePathName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)