Reference Library
Converter Class
Namespaces »ZwSoft.ZwCAD.Runtime »Converter
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class Converter
Public NotInheritable Class Converter
public ref class Converter sealed
 Members
All Members | Methods
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
AngleToString(Double, AngularUnitFormat, Int32)
AngleToString(Double)
DistanceToString(Double, DistanceUnitFormat, Int32)
DistanceToString(Double)
RawAngleToString(Double, AngularUnitFormat, Int32)
RawAngleToString(Double)
StringToAngle(String, AngularUnitFormat)
StringToAngle(String)
StringToDistance(String, DistanceUnitFormat)
StringToDistance(String)
StringToRawAngle(String, AngularUnitFormat)
StringToRawAngle(String)
 Inheritance Hierarchy
Object
Converter
Assembly: ZwManaged (Module: ZwManaged)