Reference Library
SetPointAt Method (index, pt)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline »SetPointAt(Int32, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetPointAt(
	int index,
	Point2d pt
)
Public Sub SetPointAt ( _
	index As Integer, _
	pt As Point2d _
)
public:
void SetPointAt(
	int index,
	Point2d pt
)
 Parameters
index(Int32)
pt(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)