Reference Library
HaltAtClassBoundaries Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DxfFiler »HaltAtClassBoundaries(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void HaltAtClassBoundaries(
	bool value
)
Public Overridable Sub HaltAtClassBoundaries ( _
	value As Boolean _
)
public:
virtual void HaltAtClassBoundaries(
	bool value
)
 Parameters
value(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)