Reference Library
NumColors Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »GIRasterImage »NumColors
 Declaration Syntax
C# | Visual Basic | Visual C++
public uint NumColors { get; }
Public ReadOnly Property NumColors As UInteger
	Get
public:
property unsigned int NumColors {
	unsigned int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)