Reference Library
Curves Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HatchLoop »Curves
 Declaration Syntax
C# | Visual Basic | Visual C++
public Curve2dCollection Curves { get; }
Public ReadOnly Property Curves As Curve2dCollection
	Get
public:
property Curve2dCollection^ Curves {
	Curve2dCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)