Reference Library
m_value Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionaryEntry »m_value
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId m_value
Public m_value As ObjectId
public:
ObjectId m_value
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)