Reference Library
EndPlotEventArgs Class
Namespaces »ZwSoft.ZwCAD.PlottingServices »EndPlotEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public class EndPlotEventArgs : EventArgs
Public Class EndPlotEventArgs _
	Inherits EventArgs
public ref class EndPlotEventArgs : public EventArgs
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
EndPlotEventArgs(PlotCancelStatus)
Status
 Inheritance Hierarchy
Object
EventArgs
| EndPlotEventArgs
Assembly: ZwManaged (Module: ZwManaged)