Reference Library
PromptCornerOptions Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptCornerOptions
 Declaration Syntax
C# | Visual Basic | Visual C++
public class PromptCornerOptions : PromptEditorOptions
Public Class PromptCornerOptions _
	Inherits PromptEditorOptions
public ref class PromptCornerOptions : public PromptEditorOptions
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PromptCornerOptions(String, String, Point3d)
PromptCornerOptions(String, Point3d)
AllowArbitraryInput
AllowNone
BasePoint
DoIt() |  (Overrides PromptOptions.DoIt().)
LimitsChecked
UseDashedLine
 Inheritance Hierarchy
Object
PromptOptions
| PromptEditorOptions
|  | PromptCornerOptions
|  |  | PromptPointOptions
Assembly: ZwManaged (Module: ZwManaged)