Reference Library
Current Property
Namespaces »ZwSoft.ZwCAD.Geometry »Int32CollectionEnumerator »Current
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Current { get; }
Public ReadOnly Property Current As Integer
	Get
public:
property int Current {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)