Reference Library
Point3d Structure
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGePoint3d")]
public struct Point3d : IFormattable
<WrapperAttribute("ZcGePoint3d")> _
Public Structure Point3d _
	Implements IFormattable
[WrapperAttribute(L"ZcGePoint3d")]
public value class Point3d : IFormattable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Point3d(Double, Double, Double)
Point3d(PlanarEntity, Point2d)
Point3d(Double[])
Add(Vector3d)
Addition(Point3d, Vector3d)
Convert2d(PlanarEntity)
Coordinate[Int32]
DistanceTo(Point3d)
DivideBy(Double)
Division(Point3d, Double)
Equality(Point3d, Point3d)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetAsVector()
GetHashCode() |  (Overrides ValueType.GetHashCode().)
GetVectorTo(Point3d)
Inequality(Point3d, Point3d)
IsEqualTo(Point3d, Tolerance)
IsEqualTo(Point3d)
Mirror(Plane)
Multiply(Double, Point3d)
Multiply(Point3d, Double)
Multiply(Matrix3d, Point3d)
MultiplyBy(Double)
Origin
OrthoProject(Plane)
Project(Plane, Vector3d)
RotateBy(Double, Vector3d, Point3d)
ScaleBy(Double, Point3d)
Subtract(Vector3d)
Subtraction(Point3d, Vector3d)
Subtraction(Point3d, Point3d)
ToArray()
ToString(String, IFormatProvider)
ToString(IFormatProvider)
ToString() |  (Overrides ValueType.ToString().)
TransformBy(Matrix3d)
X
Y
Z
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)