Reference Library
Extents2d Structure
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Extents2d
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct Extents2d : IFormattable
Public Structure Extents2d _
	Implements IFormattable
public value class Extents2d : IFormattable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Extents2d(Double, Double, Double, Double)
Extents2d(Point2d, Point2d)
Equality(Extents2d, Extents2d)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
Inequality(Extents2d, Extents2d)
IsEqualTo(Extents2d, Tolerance)
IsEqualTo(Extents2d)
MaxPoint
MinPoint
ToString(String, IFormatProvider)
ToString(IFormatProvider)
ToString() |  (Overrides ValueType.ToString().)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)