Reference Library
SetD2VectorAt Method (index, point)
Namespaces »ZwSoft.ZwCAD.Geometry »AugmentedPolylineCurve3d »SetD2VectorAt(Int32, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetD2VectorAt(
	int index,
	Vector3d point
)
Public Sub SetD2VectorAt ( _
	index As Integer, _
	point As Vector3d _
)
public:
void SetD2VectorAt(
	int index,
	Vector3d point
)
 Parameters
index(Int32)
point(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)