Reference Library
ReadDwgFile Method (fileName, fileSharing, allowCPConversion, password)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »ReadDwgFile(String, FileShare, Boolean, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void ReadDwgFile(
	string fileName,
	FileShare fileSharing,
	bool allowCPConversion,
	string password
)
Public Sub ReadDwgFile ( _
	fileName As String, _
	fileSharing As FileShare, _
	allowCPConversion As Boolean, _
	password As String _
)
public:
void ReadDwgFile(
	String^ fileName,
	FileShare fileSharing,
	bool allowCPConversion,
	String^ password
)
 Parameters
fileName(String)
fileSharing(FileShare)
allowCPConversion(Boolean)
password(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)