Reference Library
SyncRoot Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »SyncRoot
 Declaration Syntax
C# | Visual Basic | Visual C++
protected Object SyncRoot { get; }
Protected ReadOnly Property SyncRoot As Object
	Get
protected:
property Object^ SyncRoot {
	Object^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)