Reference Library
PostTableStyleToDatabase Method (databasePointer, styleName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableStyle »PostTableStyleToDatabase(Database, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId PostTableStyleToDatabase(
	Database databasePointer,
	string styleName
)
Public Overridable Function PostTableStyleToDatabase ( _
	databasePointer As Database, _
	styleName As String _
) As ObjectId
public:
virtual ObjectId PostTableStyleToDatabase(
	Database^ databasePointer,
	String^ styleName
)
 Parameters
databasePointer(Database)
styleName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)