Reference Library
X Property
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »X
 Declaration Syntax
C# | Visual Basic | Visual C++
public double X { get; }
Public ReadOnly Property X As Double
	Get
public:
property double X {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)