Reference Library
MakeMClosed Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolygonMesh »MakeMClosed()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void MakeMClosed()
Public Sub MakeMClosed
public:
void MakeMClosed()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)