Reference Library
SetControlPointAt Method (index, point)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Spline »SetControlPointAt(Int32, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetControlPointAt(
	int index,
	Point3d point
)
Public Sub SetControlPointAt ( _
	index As Integer, _
	point As Point3d _
)
public:
void SetControlPointAt(
	int index,
	Point3d point
)
 Parameters
index(Int32)
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)