Reference Library
GridBoundToLimits Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewportTableRecord »GridBoundToLimits
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool GridBoundToLimits { get; set; }
Public Property GridBoundToLimits As Boolean
	Get
	Set
public:
property bool GridBoundToLimits {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)