Reference Library
SetLeaderLineTypeId Method (leaderLineIndex, leaderLineTypeId)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »SetLeaderLineTypeId(Int32, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetLeaderLineTypeId(
	int leaderLineIndex,
	ObjectId leaderLineTypeId
)
Public Sub SetLeaderLineTypeId ( _
	leaderLineIndex As Integer, _
	leaderLineTypeId As ObjectId _
)
public:
void SetLeaderLineTypeId(
	int leaderLineIndex,
	ObjectId leaderLineTypeId
)
 Parameters
leaderLineIndex(Int32)
leaderLineTypeId(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)