Reference Library
SetContentLayout Method (row, column, layout)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetContentLayout(Int32, Int32, CellContentLayout)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetContentLayout(
	int row,
	int column,
	CellContentLayout layout
)
Public Overridable Sub SetContentLayout ( _
	row As Integer, _
	column As Integer, _
	layout As CellContentLayout _
)
public:
virtual void SetContentLayout(
	int row,
	int column,
	CellContentLayout layout
)
 Parameters
row(Int32)
column(Int32)
layout(CellContentLayout)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)