Reference Library
EvaluatorId Method (pField)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldEvaluator »EvaluatorId(Field)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract string EvaluatorId(
	Field pField
)
Public MustOverride Function EvaluatorId ( _
	pField As Field _
) As String
public:
virtual String^ EvaluatorId(
	Field^ pField
) abstract
 Parameters
pField(Field)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)