Reference Library
LineWeightDialog Class
Namespaces »ZwSoft.ZwCAD.Windows »LineWeightDialog
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class LineWeightDialog
Public NotInheritable Class LineWeightDialog
public ref class LineWeightDialog sealed
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
LineWeightDialog()
IncludeByBlockByLayer
LineWeight
ShowDialog()
ShowModal()
 Inheritance Hierarchy
Object
LineWeightDialog
Assembly: ZwManaged (Module: ZwManaged)