Reference Library
SetDatabaseDefaults Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »SetDatabaseDefaults()
 Members
Icon | Member | Description
SetDatabaseDefaults(Database)
SetDatabaseDefaults()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)