Reference Library
IsEqualTo Method (scaleVector, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Scale3d »IsEqualTo(Scale3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	Scale3d scaleVector,
	Tolerance tolerance
)
Public Function IsEqualTo ( _
	scaleVector As Scale3d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsEqualTo(
	Scale3d scaleVector,
	Tolerance tolerance
)
 Parameters
scaleVector(Scale3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)