Reference Library
SelectionAddedEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionAddedEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void SelectionAddedEventHandler(
	Object sender,
	SelectionAddedEventArgs e
)
Public Delegate Sub SelectionAddedEventHandler ( _
	sender As Object, _
	e As SelectionAddedEventArgs _
)
public delegate void SelectionAddedEventHandler(
	Object^ sender,
	SelectionAddedEventArgs^ e
)
 Parameters
sender(Object)
e(SelectionAddedEventArgs)
Assembly: ZwManaged (Module: ZwManaged)