Reference Library
CoordinateSystem2d Structure
Namespaces »ZwSoft.ZwCAD.Geometry »CoordinateSystem2d
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct CoordinateSystem2d : IFormattable
Public Structure CoordinateSystem2d _
	Implements IFormattable
public value class CoordinateSystem2d : IFormattable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
CoordinateSystem2d(Point2d, Vector2d, Vector2d)
Equality(CoordinateSystem2d, CoordinateSystem2d)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetHashCode() |  (Overrides ValueType.GetHashCode().)
Inequality(CoordinateSystem2d, CoordinateSystem2d)
IsEqualTo(CoordinateSystem2d, Tolerance)
IsEqualTo(CoordinateSystem2d)
Origin
ToString(String, IFormatProvider)
ToString(IFormatProvider)
ToString() |  (Overrides ValueType.ToString().)
Xaxis
Yaxis
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)