Reference Library
CreateLayout Method (newName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »CreateLayout(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId CreateLayout(
	string newName
)
Public Function CreateLayout ( _
	newName As String _
) As ObjectId
public:
ObjectId CreateLayout(
	String^ newName
)
 Parameters
newName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)