Reference Library
CallHotGrip Method (entityId, contextFlags)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripData »CallHotGrip(ObjectId, GripData.Context)
 Declaration Syntax
C# | Visual Basic | Visual C++
public GripData.ReturnValue CallHotGrip(
	ObjectId entityId,
	GripData.Context contextFlags
)
Public Function CallHotGrip ( _
	entityId As ObjectId, _
	contextFlags As GripData.Context _
) As GripData.ReturnValue
public:
GripData.ReturnValue CallHotGrip(
	ObjectId entityId,
	GripData.Context contextFlags
)
 Parameters
entityId(ObjectId)
contextFlags(GripData.Context)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)