Reference Library
Vector2dCollection Constructor (values)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2dCollection »Vector2dCollection(Vector2d[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector2dCollection(
	Vector2d[] values
)
Public Sub New ( _
	values As Vector2d() _
)
public:
Vector2dCollection(
	array<Vector2d>^ values
)
 Parameters
values(Vector2d[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)