Reference Library
Plane Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Plane »Plane()
 Members
Icon | Member | Description
Plane(Double, Double, Double, Double)
Plane(Point3d, Vector3d, Vector3d)
Plane(Point3d, Point3d, Point3d)
Plane(Point3d, Vector3d)
Plane(Plane)
Plane()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)