Reference Library
Surfu Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Surfu
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Surfu { get; set; }
Public Property Surfu As Integer
	Get
	Set
public:
property int Surfu {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)