Reference Library
EndPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »EndPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Point3d EndPoint { get; set; }
Public Overridable Property EndPoint As Point3d
	Get
	Set
public:
virtual property Point3d EndPoint {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)