Reference Library
StringToDistance Method
Namespaces »ZwSoft.ZwCAD.Runtime »Converter »StringToDistance()
 Members
Icon | Member | Description
StringToDistance(String, DistanceUnitFormat)
StringToDistance(String)
Assembly: ZwManaged (Module: ZwManaged)