Reference Library
DrawableTraits Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »DrawableTraits
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcGiDrawableTraits")]
public abstract class DrawableTraits : RXObject
<WrapperAttribute("AcGiDrawableTraits")> _
Public MustInherit Class DrawableTraits _
	Inherits RXObject
[WrapperAttribute(L"AcGiDrawableTraits")]
public ref class DrawableTraits abstract : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DrawableTraits(IntPtr, Boolean)
DrawableTraits()
AddLight(ObjectId)
SetLayerFlags(DrawableTraits.LayerFlags)
SetupForEntity(Entity)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | DrawableTraits
|  |  |  | SubEntityTraits
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)