Reference Library
Add Method (gripData)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripDataCollection »Add(GripData)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Add(
	GripData gripData
)
Public Sub Add ( _
	gripData As GripData _
)
public:
virtual void Add(
	GripData^ gripData
) sealed
 Parameters
gripData(GripData)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)