Reference Library
IsRational Property
Namespaces »ZwSoft.ZwCAD.Geometry »SplineEntity3d »IsRational
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsRational { get; }
Public ReadOnly Property IsRational As Boolean
	Get
public:
property bool IsRational {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)