Reference Library
AlternateBasePoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripData »AlternateBasePoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Nullable<Point3d> AlternateBasePoint { get; set; }
Public Property AlternateBasePoint As Nullable(Of Point3d)
	Get
	Set
public:
property Nullable<Point3d> AlternateBasePoint {
	Nullable<Point3d> get ();
	void set (Nullable<Point3d> value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)