Reference Library
RemoveVertex Method (nIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Section »RemoveVertex(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use Boundary property instead")]
public void RemoveVertex(
	int nIndex
)
<ObsoleteAttribute("Use Boundary property instead")> _
Public Sub RemoveVertex ( _
	nIndex As Integer _
)
[ObsoleteAttribute(L"Use Boundary property instead")]
public:
void RemoveVertex(
	int nIndex
)
 Parameters
nIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)