Reference Library
Location Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MTextFragment »Location
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d Location { get; }
Public ReadOnly Property Location As Point3d
	Get
public:
property Point3d Location {
	Point3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)