Reference Library
NamedObjectsDictionaryId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »NamedObjectsDictionaryId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId NamedObjectsDictionaryId { get; }
Public ReadOnly Property NamedObjectsDictionaryId As ObjectId
	Get
public:
property ObjectId NamedObjectsDictionaryId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)