Reference Library
IEnumerator_Current Property
Namespaces »ZwSoft.ZwCAD.Geometry »IntegerCollectionEnumerator »IEnumerator_Current
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Object IEnumerator_Current { get; }
Public Overridable ReadOnly Property IEnumerator_Current As Object
	Get
public:
virtual property Object^ IEnumerator_Current {
	Object^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)