Reference Library
Matrix3d Structure
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeMatrix3d")]
public struct Matrix3d : IFormattable
<WrapperAttribute("ZcGeMatrix3d")> _
Public Structure Matrix3d _
	Implements IFormattable
[WrapperAttribute(L"ZcGeMatrix3d")]
public value class Matrix3d : IFormattable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Matrix3d(Double[])
AlignCoordinateSystem(Point3d, Vector3d, Vector3d, Vector3d, Point3d, Vector3d, Vector3d, Vector3d)
CoordinateSystem3d
Displacement(Vector3d)
ElementAt[Int32, Int32]
Equality(Matrix3d, Matrix3d)
Equals(Object) |  (Overrides ValueType.Equals(Object).)
GetDeterminant()
GetHashCode() |  (Overrides ValueType.GetHashCode().)
GetScale()
Identity
Inequality(Matrix3d, Matrix3d)
Inverse()
IsEqualTo(Matrix3d, Tolerance)
IsEqualTo(Matrix3d)
IsInverse(Matrix3d, Tolerance)
IsInverse(Matrix3d)
IsScaledOrtho(Tolerance)
IsScaledOrtho()
IsSingular(Tolerance)
IsSingular()
IsUniscaledOrtho(Tolerance)
IsUniscaledOrtho()
Mirroring(Point3d)
Mirroring(Plane)
Mirroring(Line3d)
Multiply(Matrix3d, Matrix3d)
Normal
PlaneToWorld(Vector3d)
PlaneToWorld(Plane)
PostMultiplyBy(Matrix3d)
PreMultiplyBy(Matrix3d)
Projection(Plane, Vector3d)
Rotation(Double, Vector3d, Point3d)
Scaling(Double, Point3d)
ToArray()
ToString(String, IFormatProvider)
ToString(IFormatProvider)
ToString() |  (Overrides ValueType.ToString().)
Translation
Transpose()
WorldToPlane(Vector3d)
WorldToPlane(Plane)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)