Reference Library
Int32CollectionEnumerator Class
Namespaces »ZwSoft.ZwCAD.Geometry »Int32CollectionEnumerator
 Declaration Syntax
C# | Visual Basic | Visual C++
public class Int32CollectionEnumerator : IEnumerator
Public Class Int32CollectionEnumerator _
	Implements IEnumerator
public ref class Int32CollectionEnumerator : IEnumerator
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Current
IEnumerator_Current
MoveNext()
Reset()
 Inheritance Hierarchy
Object
Int32CollectionEnumerator
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)