Reference Library
SetPreviousBackground Method (value, type)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »SetPreviousBackground(ObjectId, DrawableType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetPreviousBackground(
	ObjectId value,
	DrawableType type
)
Public Sub SetPreviousBackground ( _
	value As ObjectId, _
	type As DrawableType _
)
public:
void SetPreviousBackground(
	ObjectId value,
	DrawableType type
)
 Parameters
value(ObjectId)
type(DrawableType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)