Reference Library
MeasurementValue Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MeasurementValue
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDb::MeasurementValue")]
public enum MeasurementValue
<WrapperAttribute("ZcDb::MeasurementValue")> _
Public Enumeration MeasurementValue
[WrapperAttribute(L"ZcDb::MeasurementValue")]
public enum class MeasurementValue
 Members
Member | Description
Metric
English
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)