Reference Library
SelectionOnlyGeometry Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »SubEntityTraits »SelectionOnlyGeometry
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool SelectionOnlyGeometry { get; set; }
Public MustOverride Property SelectionOnlyGeometry As Boolean
	Get
	Set
public:
virtual property bool SelectionOnlyGeometry {
	bool get () abstract;
	void set (bool value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)