Reference Library
IsPerpendicularTo Method (linearEntity)
Namespaces »ZwSoft.ZwCAD.Geometry »PlanarEntity »IsPerpendicularTo(LinearEntity3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPerpendicularTo(
	LinearEntity3d linearEntity
)
Public Function IsPerpendicularTo ( _
	linearEntity As LinearEntity3d _
) As Boolean
public:
bool IsPerpendicularTo(
	LinearEntity3d^ linearEntity
)
 Parameters
linearEntity(LinearEntity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)