Reference Library
LowerBound Property
Namespaces »ZwSoft.ZwCAD.Geometry »Interval »LowerBound
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LowerBound { get; }
Public ReadOnly Property LowerBound As Double
	Get
public:
property double LowerBound {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)