Reference Library
Pdsize Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Pdsize
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Pdsize { get; set; }
Public Property Pdsize As Double
	Get
	Set
public:
property double Pdsize {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)