Reference Library
Subject Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DatabaseSummaryInfo »Subject
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Subject { get; }
Public ReadOnly Property Subject As String
	Get
public:
property String^ Subject {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)