Reference Library
IsScaledOrtho Method
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »IsScaledOrtho()
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsScaledOrtho()
Public Function IsScaledOrtho As Boolean
public:
bool IsScaledOrtho()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)