Reference Library
Line Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Line »Line()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Line()
Public Sub New
public:
Line()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)