Reference Library
UnaryNegation Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »UnaryNegation(Vector2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Vector2d operator -(
	Vector2d a
)
Public Shared Operator - ( _
	a As Vector2d _
) As Vector2d
public:
static Vector2d operator -(
	Vector2d a
)
 Parameters
a(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)