Reference Library
SunDirection Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Sun »SunDirection
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d SunDirection { get; set; }
Public Property SunDirection As Vector3d
	Get
	Set
public:
property Vector3d SunDirection {
	Vector3d get ();
	void set (Vector3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)