Reference Library
Add Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »IntPtrCollection »Add(IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Add(
	IntPtr value
)
Public Overridable Function Add ( _
	value As IntPtr _
) As Integer
public:
virtual int Add(
	IntPtr value
)
 Parameters
value(IntPtr)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)