Reference Library
IsPerspective Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Viewport »IsPerspective
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool IsPerspective { get; }
Public MustOverride ReadOnly Property IsPerspective As Boolean
	Get
public:
virtual property bool IsPerspective {
	bool get () abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)