Reference Library
ToArray Method
Namespaces »ZwSoft.ZwCAD.Geometry »IntPtrCollection »ToArray()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual IntPtr[] ToArray()
Public Overridable Function ToArray As IntPtr()
public:
virtual array<IntPtr>^ ToArray()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)