Reference Library
Icon Property
Namespaces »ZwSoft.ZwCAD.Windows »Window »Icon
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Icon Icon { get; set; }
Public Overridable Property Icon As Icon
	Get
	Set
public:
virtual property Icon^ Icon {
	Icon^ get ();
	void set (Icon^ value);
}
Assembly: ZwManaged (Module: ZwManaged)