Reference Library
PlotSettingsShadePlotType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsShadePlotType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbPlotSettings::ShadePlotType")]
public enum PlotSettingsShadePlotType
<WrapperAttribute("ZcDbPlotSettings::ShadePlotType")> _
Public Enumeration PlotSettingsShadePlotType
[WrapperAttribute(L"ZcDbPlotSettings::ShadePlotType")]
public enum class PlotSettingsShadePlotType
 Members
Member | Description
RenderPreset
VisualStyle
Rendered
Hidden
AsDisplayed
Wireframe
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)