Reference Library
FieldResult Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldResult
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("OdFdFieldResult")]
public abstract class FieldResult : RXObject
<WrapperAttribute("OdFdFieldResult")> _
Public MustInherit Class FieldResult _
	Inherits RXObject
[WrapperAttribute(L"OdFdFieldResult")]
public ref class FieldResult abstract : public RXObject
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
setEvaluationStatus(FieldEvaluationStatus, Int32, String)
SetFieldValue(Object)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | FieldResult
|  |  |  | FieldResultImp
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)