Reference Library
StartJob Method
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotLogger »StartJob()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void StartJob()
Public Sub StartJob
public:
void StartJob()
Assembly: ZwManaged (Module: ZwManaged)