Reference Library
EvaluateHatch Method (underEstimateNumLines)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »EvaluateHatch(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void EvaluateHatch(
	bool underEstimateNumLines
)
Public Sub EvaluateHatch ( _
	underEstimateNumLines As Boolean _
)
public:
void EvaluateHatch(
	bool underEstimateNumLines
)
 Parameters
underEstimateNumLines(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)