Reference Library
AssertNotifyEnabled Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »AssertNotifyEnabled()
 Declaration Syntax
C# | Visual Basic | Visual C++
protected void AssertNotifyEnabled()
Protected Sub AssertNotifyEnabled
protected:
void AssertNotifyEnabled()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)