Reference Library
Center Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Arc »Center
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d Center { get; set; }
Public Property Center As Point3d
	Get
	Set
public:
property Point3d Center {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)