Reference Library
ZwSoft.ZwCAD.Geometry Namespace
Namespaces »ZwSoft.ZwCAD.Geometry
 Declaration Syntax
C# | Visual Basic | Visual C++
namespace ZwSoft.ZwCAD.Geometry
Namespace ZwSoft.ZwCAD.Geometry
namespace ZwSoft.ZwCAD.Geometry
 Types
All Types | Classes | Structures | Enumerations
Icon | Type | Description
AugmentedPolylineCurve3d
BoundBlock2d
BoundBlock3d
BoundedPlane
CircularArc2d
CircularArc3d
ClipBoundary2d
ClipBoundary2dData
ClipCondition
ClipError
CompositeCurve2d
CompositeCurve3d
CompositeParameter
Cone
CoordinateSystem2d
CoordinateSystem3d
CubicSplineCurve2d
CubicSplineCurve3d
Curve2d
Curve2dCollection
Curve3d
Curve3dCollection
CurveBoundary
CurveBoundaryData
CurveCurveIntersector2d
CurveCurveIntersector3d
Cylinder
DoubleCollection
DoubleCollectionEnumerator
EllipticalArc2d
EllipticalArc3d
Entity2d
Entity3d
ExternalBoundedSurface
ExternalEntityKind
ExternalSurface
GeoDataLonLatAltInfo
Int32Collection
Int32CollectionEnumerator
IntegerCollection
IntegerCollectionEnumerator
Interval
IntPtrCollection
IntPtrCollectionEnumerator
KnotCollection
KnotParameterizationEnum
Line2d
Line2dCollection
Line3d
LinearEntity2d
LinearEntity3d
LineSegment2d
LineSegment3d
Matrix2d
Matrix2dBuilder
Matrix2dInfo
Matrix3d
Matrix3dBuilder
NurbCurve2d
NurbCurve2dData
NurbCurve2dFitData
NurbCurve3d
NurbCurve3dData
NurbCurve3dFitData
NurbSurface
NurbSurfaceDefinition
OffsetCurve2d
OffsetCurve3d
OffsetCurveExtensionType
OffsetSurface
PlanarEntity
PlanarEquationCoefficients
Plane
Point2d
Point2dCollection
Point3d
Point3dCollection
PointEntity2d
PointEntity3d
PointOnCurve2d
PointOnCurve3d
PointOnSurface
PolylineCurve2d
PolylineCurve3d
Position2d
Position3d
Ray2d
Ray3d
Scale2d
Scale3d
Sphere
SplineEntity2d
SplineEntity3d
Surface
SurfaceSurfaceIntersector
SurfaceSurfaceIntersectorConfiguration
SurfaceSurfaceIntersectorConfigurations
SurfaceSurfaceIntersectorType
Tolerance
Torus
UInt32Collection
UInt32CollectionEnumerator
Vector2d
Vector2dCollection
Vector2dCollectionEnumerator
Vector3d
Vector3dCollection
Vector3dCollectionEnumerator