Reference Library
Menuitems Property
Namespaces »ZwSoft.ZwCAD.Windows »PaletteAddContextMenuEventArgs »Menuitems
 Declaration Syntax
C# | Visual Basic | Visual C++
public List<MenuItem> Menuitems { get; }
Public ReadOnly Property Menuitems As List(Of MenuItem)
	Get
public:
property List<MenuItem^>^ Menuitems {
	List<MenuItem^>^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)