Reference Library
XrefBeginRestore Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »XrefBeginRestore
 Declaration Syntax
C# | Visual Basic | Visual C++
public event XrefBeginOperationEventHandler XrefBeginRestore
Public Event XrefBeginRestore As XrefBeginOperationEventHandler
public:
 event XrefBeginOperationEventHandler^ XrefBeginRestore {
	void add (XrefBeginOperationEventHandler^ value);
	void remove (XrefBeginOperationEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)