Reference Library
InsertColumns Method (col, width, columns)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »InsertColumns(Int32, Double, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void InsertColumns(
	int col,
	double width,
	int columns
)
Public Overridable Sub InsertColumns ( _
	col As Integer, _
	width As Double, _
	columns As Integer _
)
public:
virtual void InsertColumns(
	int col,
	double width,
	int columns
)
 Parameters
col(Int32)
width(Double)
columns(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)