Reference Library
IsColinearTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »Ray3d »IsColinearTo()
 Members
Icon | Member | Description
IsColinearTo(LinearEntity3d, Tolerance)
IsColinearTo(LinearEntity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)