Reference Library
Polyline3d Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline3d »Polyline3d()
 Members
Icon | Member | Description
Polyline3d(Poly3dType, Point3dCollection, Boolean)
Polyline3d()
Polyline3d(IntPtr, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)