Reference Library
AppendLoop Method (loopType, dbObjIds)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »AppendLoop(HatchLoopTypes, ObjectIdCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AppendLoop(
	HatchLoopTypes loopType,
	ObjectIdCollection dbObjIds
)
Public Sub AppendLoop ( _
	loopType As HatchLoopTypes, _
	dbObjIds As ObjectIdCollection _
)
public:
void AppendLoop(
	HatchLoopTypes loopType,
	ObjectIdCollection^ dbObjIds
)
 Parameters
loopType(HatchLoopTypes)
dbObjIds(ObjectIdCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)