Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionSetDelayMarshalled »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public override SelectedObject this[
	int index
] { get; }
Public Overrides ReadOnly Default Property Item ( _
	index As Integer _
) As SelectedObject
	Get
public:
virtual property SelectedObject^ default[int index] {
	SelectedObject^ get (int index) override;
}
 Parameters
index(Int32)
Assembly: ZwManaged (Module: ZwManaged)