Reference Library
GetIntersectionPoint Method (number)
Namespaces »ZwSoft.ZwCAD.Geometry »CurveCurveIntersector2d »GetIntersectionPoint(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d GetIntersectionPoint(
	int number
)
Public Function GetIntersectionPoint ( _
	number As Integer _
) As Point2d
public:
Point2d GetIntersectionPoint(
	int number
)
 Parameters
number(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)