Reference Library
SetWorldUcsBaseOrigin Method (origin, orthoView)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »SetWorldUcsBaseOrigin(Point3d, OrthographicView)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetWorldUcsBaseOrigin(
	Point3d origin,
	OrthographicView orthoView
)
Public Sub SetWorldUcsBaseOrigin ( _
	origin As Point3d, _
	orthoView As OrthographicView _
)
public:
void SetWorldUcsBaseOrigin(
	Point3d origin,
	OrthographicView orthoView
)
 Parameters
origin(Point3d)
orthoView(OrthographicView)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)