Reference Library
SetFormat Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetFormat()
 Members
Icon | Member | Description
SetFormat(Int32, Int32, String)
SetFormat(String, Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)