Reference Library
Ole2Frame.ItemType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ole2Frame »Ole2Frame.ItemType
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum ItemType
Public Enumeration ItemType
public enum class ItemType
 Members
Member | Description
Link
Embedded
Static
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)