Reference Library
ViewTableRecord Constructor (obj, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewTableRecord »ViewTableRecord(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal ViewTableRecord(
	IntPtr obj,
	bool autoDelete
)
Protected Friend Sub New ( _
	obj As IntPtr, _
	autoDelete As Boolean _
)
protected public:
ViewTableRecord(
	IntPtr obj,
	bool autoDelete
)
 Parameters
obj(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)