Reference Library
FindFile Method (fileName, database, hint)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HostApplicationServices »FindFile(String, Database, FindFileHint)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract string FindFile(
	string fileName,
	Database database,
	FindFileHint hint
)
Public MustOverride Function FindFile ( _
	fileName As String, _
	database As Database, _
	hint As FindFileHint _
) As String
public:
virtual String^ FindFile(
	String^ fileName,
	Database^ database,
	FindFileHint hint
) abstract
 Parameters
fileName(String)
database(Database)
hint(FindFileHint)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)