Reference Library
Keywords Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionOptions »Keywords
 Declaration Syntax
C# | Visual Basic | Visual C++
public KeywordCollection Keywords { get; }
Public ReadOnly Property Keywords As KeywordCollection
	Get
public:
property KeywordCollection^ Keywords {
	KeywordCollection^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)