Reference Library
Dimdec Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimdec
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Dimdec { get; set; }
Public Overridable Property Dimdec As Integer
	Get
	Set
public:
virtual property int Dimdec {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)