Reference Library
PromptDragOptions Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDragOptions
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PromptDragOptions : PromptEditorOptions
Public NotInheritable Class PromptDragOptions _
	Inherits PromptEditorOptions
public ref class PromptDragOptions sealed : public PromptEditorOptions
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PromptDragOptions(SelectionSet, String, String, DragCallback)
PromptDragOptions(SelectionSet, String, DragCallback)
AllowArbitraryInput
AllowNone
Callback
Cursor
Selection
 Inheritance Hierarchy
Object
PromptOptions
| PromptEditorOptions
|  | PromptDragOptions
Assembly: ZwManaged (Module: ZwManaged)