Reference Library
Trace Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Trace »Trace()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Trace()
Public Sub New
public:
Trace()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)