Reference Library
setEvaluationStatus Method (errorStatus, errorCode, errorMessage)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldResult »setEvaluationStatus(FieldEvaluationStatus, Int32, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void setEvaluationStatus(
	FieldEvaluationStatus errorStatus,
	int errorCode,
	string errorMessage
)
Public MustOverride Sub setEvaluationStatus ( _
	errorStatus As FieldEvaluationStatus, _
	errorCode As Integer, _
	errorMessage As String _
)
public:
virtual void setEvaluationStatus(
	FieldEvaluationStatus errorStatus,
	int errorCode,
	String^ errorMessage
) abstract
 Parameters
errorStatus(FieldEvaluationStatus)
errorCode(Int32)
errorMessage(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)