Reference Library
PropertiesInV Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbSurfaceDefinition »PropertiesInV
 Declaration Syntax
C# | Visual Basic | Visual C++
public int PropertiesInV { get; }
Public ReadOnly Property PropertiesInV As Integer
	Get
public:
property int PropertiesInV {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)