Reference Library
AsciiDescription Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinetypeTableRecord »AsciiDescription
 Declaration Syntax
C# | Visual Basic | Visual C++
public string AsciiDescription { get; set; }
Public Property AsciiDescription As String
	Get
	Set
public:
property String^ AsciiDescription {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)