Reference Library
ContextMenuExtension Class
Namespaces »ZwSoft.ZwCAD.Windows »ContextMenuExtension
 Declaration Syntax
C# | Visual Basic | Visual C++
public class ContextMenuExtension : Menu,
	IDisposable
Public Class ContextMenuExtension _
	Inherits Menu _
	Implements IDisposable
public ref class ContextMenuExtension : public Menu,
	IDisposable
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
ContextMenuExtension()
Dispose(Boolean)
Dispose()
Popup
Title
 Inheritance Hierarchy
Object
Menu
| ContextMenuExtension
Assembly: ZwManaged (Module: ZwManaged)