Reference Library
NumFound Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldUpdateResult »NumFound
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumFound
Public NumFound As Integer
public:
int NumFound
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)