Reference Library
PrepareOptionalDetails Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionOptions »PrepareOptionalDetails
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool PrepareOptionalDetails { get; set; }
Public Property PrepareOptionalDetails As Boolean
	Get
	Set
public:
property bool PrepareOptionalDetails {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)