Reference Library
ObjectErasedEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectErasedEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void ObjectErasedEventHandler(
	Object sender,
	ObjectErasedEventArgs e
)
Public Delegate Sub ObjectErasedEventHandler ( _
	sender As Object, _
	e As ObjectErasedEventArgs _
)
public delegate void ObjectErasedEventHandler(
	Object^ sender,
	ObjectErasedEventArgs^ e
)
 Parameters
sender(Object)
e(ObjectErasedEventArgs)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)