Reference Library
CreateExtrudedSolid Method (sweepEntity, directionVector, sweepOptions)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »CreateExtrudedSolid(Entity, Vector3d, SweepOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void CreateExtrudedSolid(
	Entity sweepEntity,
	Vector3d directionVector,
	SweepOptions sweepOptions
)
Public Overridable Sub CreateExtrudedSolid ( _
	sweepEntity As Entity, _
	directionVector As Vector3d, _
	sweepOptions As SweepOptions _
)
public:
virtual void CreateExtrudedSolid(
	Entity^ sweepEntity,
	Vector3d directionVector,
	SweepOptions^ sweepOptions
)
 Parameters
sweepEntity(Entity)
directionVector(Vector3d)
sweepOptions(SweepOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)