Reference Library
Vertex2d Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Vertex2d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDb2dVertex")]
public class Vertex2d : Vertex
<WrapperAttribute("AcDb2dVertex")> _
Public Class Vertex2d _
	Inherits Vertex
[WrapperAttribute(L"AcDb2dVertex")]
public ref class Vertex2d : public Vertex
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Vertex2d(Point3d, Double, Double, Double, Double)
Vertex2d()
Vertex2d(IntPtr, Boolean)
Bulge
EndWidth
Position
StartWidth
Tangent
TangentUsed
VertexType
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Vertex
|  |  |  |  |  |  | Vertex2d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)