Reference Library
EPlotProperty Class
Namespaces »ZwSoft.ZwCAD.Publishing »EPlotProperty
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class EPlotProperty
Public NotInheritable Class EPlotProperty
public ref class EPlotProperty sealed
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
EPlotProperty(String, String)
EPlotProperty()
Category
Name
Type
Units
Value
 Inheritance Hierarchy
Object
EPlotProperty
Assembly: ZwManaged (Module: ZwManaged)