Reference Library
ImageQuality Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterVariables »ImageQuality
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ImageQuality ImageQuality { get; set; }
Public Overridable Property ImageQuality As ImageQuality
	Get
	Set
public:
virtual property ImageQuality ImageQuality {
	ImageQuality get ();
	void set (ImageQuality value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)