Reference Library
GetTrimmedOffset Method (distance, planeNormal, extensionType, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »GetTrimmedOffset(Double, Vector3d, OffsetCurveExtensionType, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Curve3d[] GetTrimmedOffset(
	double distance,
	Vector3d planeNormal,
	OffsetCurveExtensionType extensionType,
	Tolerance tolerance
)
Public Function GetTrimmedOffset ( _
	distance As Double, _
	planeNormal As Vector3d, _
	extensionType As OffsetCurveExtensionType, _
	tolerance As Tolerance _
) As Curve3d()
public:
array<Curve3d^>^ GetTrimmedOffset(
	double distance,
	Vector3d planeNormal,
	OffsetCurveExtensionType extensionType,
	Tolerance tolerance
)
 Parameters
distance(Double)
planeNormal(Vector3d)
extensionType(OffsetCurveExtensionType)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)