Reference Library
MajorVersion Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FullDwgVersion »MajorVersion
 Declaration Syntax
C# | Visual Basic | Visual C++
public DwgVersion MajorVersion { get; }
Public ReadOnly Property MajorVersion As DwgVersion
	Get
public:
property DwgVersion MajorVersion {
	DwgVersion get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)