Reference Library
DBDictionary Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbDictionary")]
public class DBDictionary : DBObject,
	IDictionary
<WrapperAttribute("AcDbDictionary")> _
Public Class DBDictionary _
	Inherits DBObject _
	Implements IDictionary
[WrapperAttribute(L"AcDbDictionary")]
public ref class DBDictionary : public DBObject,
	IDictionary
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DBDictionary()
DBDictionary(IntPtr, Boolean)
Contains(String)
Contains(ObjectId)
Copy()
CopyTo(DBDictionaryEntry[], Int32)
Count
GetAt(String)
GetEnumerator()
ICollection_CopyTo(Array, Int32)
IDictionary_Add(Object, Object)
IDictionary_Clear()
IDictionary_Contains(Object)
IDictionary_GetEnumerator()
IDictionary_IsFixedSize
IDictionary_IsReadOnly
IDictionary_IsSynchronized
IDictionary_Item[Object]
IDictionary_Keys
IDictionary_Remove(Object)
IDictionary_SyncRoot
IDictionary_Values
IEnumerable_GetEnumerator()
IncludingErased
IsFixedSize
IsReadOnly
IsSynchronized
Item[String]
Keys
MergeStyle |  (Overrides DBObject.MergeStyle.)
NameAt(ObjectId)
Remove(String)
Remove(ObjectId)
SetAt(String, DBObject)
SetName(String, String)
SkipDeleted
SyncRoot
TreatElementsAsHard
Values
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | DBDictionary
|  |  |  |  |  | DictionaryWithDefaultDictionary
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)