Reference Library
SetDefaultPlotConfig Method (plotSet)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsValidator »SetDefaultPlotConfig(PlotSettings)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetDefaultPlotConfig(
	PlotSettings plotSet
)
Public Sub SetDefaultPlotConfig ( _
	plotSet As PlotSettings _
)
public:
void SetDefaultPlotConfig(
	PlotSettings^ plotSet
)
 Parameters
plotSet(PlotSettings)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)