Reference Library
Create Method (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Graph »Create(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Graph Create(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Public Shared Function Create ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
) As Graph
public:
static Graph^ Create(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)