Reference Library
CurrentPublishedSheetSetPath Property
Namespaces »ZwSoft.ZwCAD.Publishing »Publisher »CurrentPublishedSheetSetPath
 Declaration Syntax
C# | Visual Basic | Visual C++
public string CurrentPublishedSheetSetPath { get; }
Public ReadOnly Property CurrentPublishedSheetSetPath As String
	Get
public:
property String^ CurrentPublishedSheetSetPath {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)