Reference Library
get_Elem Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Variant »get_Elem()
 Members
Icon | Member | Description
get_Elem(String, Variant)
get_Elem(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)