Reference Library
GetObjectId Method (createIfNotFound, objHandle, identifier)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »GetObjectId(Boolean, Handle, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId GetObjectId(
	bool createIfNotFound,
	Handle objHandle,
	int identifier
)
Public Function GetObjectId ( _
	createIfNotFound As Boolean, _
	objHandle As Handle, _
	identifier As Integer _
) As ObjectId
public:
ObjectId GetObjectId(
	bool createIfNotFound,
	Handle objHandle,
	int identifier
)
 Parameters
createIfNotFound(Boolean)
objHandle(Handle)
identifier(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)