Reference Library
View Constructor (clientViewInfo, enableLayerVisibilityPerView)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »View(ClientViewInfo, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public View(
	ClientViewInfo clientViewInfo,
	bool enableLayerVisibilityPerView
)
Public Sub New ( _
	clientViewInfo As ClientViewInfo, _
	enableLayerVisibilityPerView As Boolean _
)
public:
View(
	ClientViewInfo clientViewInfo,
	bool enableLayerVisibilityPerView
)
 Parameters
clientViewInfo(ClientViewInfo)
enableLayerVisibilityPerView(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)