Reference Library
InsertRow Method (index, rowsNumber)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »InsertRow(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int InsertRow(
	int index,
	int rowsNumber
)
Public Overridable Function InsertRow ( _
	index As Integer, _
	rowsNumber As Integer _
) As Integer
public:
virtual int InsertRow(
	int index,
	int rowsNumber
)
 Parameters
index(Int32)
rowsNumber(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)