Reference Library
CommandMethodAttribute Constructor (groupName, globalName, localizedNameId, flags)
Namespaces »ZwSoft.ZwCAD.Runtime »CommandMethodAttribute »CommandMethodAttribute(String, String, String, CommandFlags)
 Declaration Syntax
C# | Visual Basic | Visual C++
public CommandMethodAttribute(
	string groupName,
	string globalName,
	string localizedNameId,
	CommandFlags flags
)
Public Sub New ( _
	groupName As String, _
	globalName As String, _
	localizedNameId As String, _
	flags As CommandFlags _
)
public:
CommandMethodAttribute(
	String^ groupName,
	String^ globalName,
	String^ localizedNameId,
	CommandFlags flags
)
 Parameters
groupName(String)
globalName(String)
localizedNameId(String)
flags(CommandFlags)
Assembly: ZwManaged (Module: ZwManaged)