Reference Library
IntersectWith Method (otherPlane, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Plane »IntersectWith(Plane, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Line3d IntersectWith(
	Plane otherPlane,
	Tolerance tolerance
)
Public Function IntersectWith ( _
	otherPlane As Plane, _
	tolerance As Tolerance _
) As Line3d
public:
Line3d^ IntersectWith(
	Plane^ otherPlane,
	Tolerance tolerance
)
 Parameters
otherPlane(Plane)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)