Reference Library
LayerStateDeleted Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »LayerStateDeleted
 Declaration Syntax
C# | Visual Basic | Visual C++
public event LayerStateDeletedEventHandler LayerStateDeleted
Public Event LayerStateDeleted As LayerStateDeletedEventHandler
public:
 event LayerStateDeletedEventHandler^ LayerStateDeleted {
	void add (LayerStateDeletedEventHandler^ value);
	void remove (LayerStateDeletedEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)