Reference Library
ErrorCode Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldEvaluationStatusResult »ErrorCode
 Declaration Syntax
C# | Visual Basic | Visual C++
public int ErrorCode { get; }
Public ReadOnly Property ErrorCode As Integer
	Get
public:
property int ErrorCode {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)