Reference Library
HyperlinkBase Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DatabaseSummaryInfoBuilder »HyperlinkBase
 Declaration Syntax
C# | Visual Basic | Visual C++
public string HyperlinkBase { get; set; }
Public Property HyperlinkBase As String
	Get
	Set
public:
property String^ HyperlinkBase {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)