Reference Library
SetColor Method (color)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »SetColor(Color)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetColor(
	Color color
)
Public Sub SetColor ( _
	color As Color _
)
public:
void SetColor(
	Color^ color
)
 Parameters
color(Color)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)