Reference Library
SetGridColor Method (row, col, edges, color)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetGridColor(Int32, Int32, Int16, Color)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetGridColor(
	int row,
	int col,
	short edges,
	Color color
)
Public Overridable Sub SetGridColor ( _
	row As Integer, _
	col As Integer, _
	edges As Short, _
	color As Color _
)
public:
virtual void SetGridColor(
	int row,
	int col,
	short edges,
	Color^ color
)
 Parameters
row(Int32)
col(Int32)
edges(Int16)
color(Color)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)