Reference Library
Bank Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweptSurface »Bank
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Bank { get; set; }
Public Property Bank As Boolean
	Get
	Set
public:
property bool Bank {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)