Reference Library
ViewToBeDestroyed Event
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Manager »ViewToBeDestroyed
 Declaration Syntax
C# | Visual Basic | Visual C++
public event ViewToBeDestroyedEventHandler ViewToBeDestroyed
Public Event ViewToBeDestroyed As ViewToBeDestroyedEventHandler
public:
 event ViewToBeDestroyedEventHandler^ ViewToBeDestroyed {
	void add (ViewToBeDestroyedEventHandler^ value);
	void remove (ViewToBeDestroyedEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)