Reference Library
MultiplyBy Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »MultiplyBy(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector2d MultiplyBy(
	double value
)
Public Function MultiplyBy ( _
	value As Double _
) As Vector2d
public:
Vector2d MultiplyBy(
	double value
)
 Parameters
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)