Reference Library
GetCustomData Method (key)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »GetCustomData(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Object GetCustomData(
	string key
)
Public Function GetCustomData ( _
	key As String _
) As Object
public:
Object^ GetCustomData(
	String^ key
)
 Parameters
key(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)