Reference Library
ProjectedIntersectWith Method
Namespaces »ZwSoft.ZwCAD.Geometry »Line3d »ProjectedIntersectWith()
 Members
Icon | Member | Description
ProjectedIntersectWith(LinearEntity3d, Vector3d, Tolerance)
ProjectedIntersectWith(LinearEntity3d, Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)