Reference Library
PaletteActivatedEventArgs Class
Namespaces »ZwSoft.ZwCAD.Windows »PaletteActivatedEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PaletteActivatedEventArgs : EventArgs
Public NotInheritable Class PaletteActivatedEventArgs _
	Inherits EventArgs
public ref class PaletteActivatedEventArgs sealed : public EventArgs
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PaletteActivatedEventArgs(Palette, Palette)
Activated
Deactivated
 Inheritance Hierarchy
Object
EventArgs
| PaletteActivatedEventArgs
Assembly: ZwManaged (Module: ZwManaged)