Reference Library
IsPartiallyOpened Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »IsPartiallyOpened
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPartiallyOpened { get; }
Public ReadOnly Property IsPartiallyOpened As Boolean
	Get
public:
property bool IsPartiallyOpened {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)