Reference Library
PromptNestedEntityOptions Constructor (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptNestedEntityOptions »PromptNestedEntityOptions(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptNestedEntityOptions(
	string message
)
Public Sub New ( _
	message As String _
)
public:
PromptNestedEntityOptions(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)