Reference Library
IsEqualTo Method (a)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2dInfo »IsEqualTo(Matrix2dInfo)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	Matrix2dInfo a
)
Public Function IsEqualTo ( _
	a As Matrix2dInfo _
) As Boolean
public:
bool IsEqualTo(
	Matrix2dInfo a
)
 Parameters
a(Matrix2dInfo)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)