Reference Library
LinkedTableData Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »LinkedTableData()
 Declaration Syntax
C# | Visual Basic | Visual C++
public LinkedTableData()
Public Sub New
public:
LinkedTableData()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)