Reference Library
CreateOffsetSurface Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Surface »CreateOffsetSurface()
 Members
Icon | Member | Description
CreateOffsetSurface(Entity, Double, Boolean)
CreateOffsetSurface(Entity, Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)