Reference Library
StereoParameters Constructor (magnitude, parallax)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »StereoParameters »StereoParameters(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public StereoParameters(
	double magnitude,
	double parallax
)
Public Sub New ( _
	magnitude As Double, _
	parallax As Double _
)
public:
StereoParameters(
	double magnitude,
	double parallax
)
 Parameters
magnitude(Double)
parallax(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)