Reference Library
PlaceHolder Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlaceHolder
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbPlaceHolder")]
public sealed class PlaceHolder : DBObject
<WrapperAttribute("AcDbPlaceHolder")> _
Public NotInheritable Class PlaceHolder _
	Inherits DBObject
[WrapperAttribute(L"AcDbPlaceHolder")]
public ref class PlaceHolder sealed : public DBObject
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PlaceHolder()
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | PlaceHolder
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)