Reference Library
GetAsVector Method
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »GetAsVector()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d GetAsVector()
Public Function GetAsVector As Vector3d
public:
Vector3d GetAsVector()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)