Reference Library
DbHomeView Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DbHomeView
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbHomeView")]
public class DbHomeView : DisposableWrapper, ICloneable
<WrapperAttribute("ZcDbHomeView")> _
Public Class DbHomeView _
	Inherits DisposableWrapper _
	Implements ICloneable
[WrapperAttribute(L"ZcDbHomeView")]
public ref class DbHomeView : public DisposableWrapper,
	ICloneable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DbHomeView(IntPtr, Boolean)
Clone()
DeleteUnmanagedObject() |  (Overrides DisposableWrapper.DeleteUnmanagedObject().)
Equality(DbHomeView, DbHomeView)
Equals(Object) |  (Overrides DisposableWrapper.Equals(Object).)
Inequality(DbHomeView, DbHomeView)
ToggleDefaultSettings()
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | DbHomeView
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)