Reference Library
GetParameterAtDistance Method (dist)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »GetParameterAtDistance(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double GetParameterAtDistance(
	double dist
)
Public Overridable Function GetParameterAtDistance ( _
	dist As Double _
) As Double
public:
virtual double GetParameterAtDistance(
	double dist
)
 Parameters
dist(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)