Reference Library
ClosestPointToPlanarEntity Method
Namespaces »ZwSoft.ZwCAD.Geometry »Plane »ClosestPointToPlanarEntity()
 Members
Icon | Member | Description
ClosestPointToPlanarEntity(PlanarEntity, Tolerance)
ClosestPointToPlanarEntity(PlanarEntity)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)