Reference Library
IsFixedSize Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HyperLinkCollection »IList.IsFixedSize
 Declaration Syntax
C# | Visual Basic | Visual C++
bool IList.IsFixedSize { get; }
Private ReadOnly Property IsFixedSize As Boolean
	Implements IList.IsFixedSize
	Get
private:
virtual property bool IsFixedSize {
	bool get () sealed = IList::IsFixedSize::get;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)