Reference Library
BlockModelSpaceName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »BlockModelSpaceName
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string BlockModelSpaceName { get; }
Public Shared ReadOnly Property BlockModelSpaceName As String
	Get
public:
static property String^ BlockModelSpaceName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)