Reference Library
GetDerivative Method (order, parameter)
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnCurve3d »GetDerivative(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d GetDerivative(
	int order,
	double parameter
)
Public Function GetDerivative ( _
	order As Integer, _
	parameter As Double _
) As Vector3d
public:
Vector3d GetDerivative(
	int order,
	double parameter
)
 Parameters
order(Int32)
parameter(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)