Reference Library
ModifiedGraphics Method (pObj)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimAssoc »ModifiedGraphics(DBObject)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void ModifiedGraphics(
	DBObject pObj
)
Public Sub ModifiedGraphics ( _
	pObj As DBObject _
)
public:
void ModifiedGraphics(
	DBObject^ pObj
)
 Parameters
pObj(DBObject)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)