Reference Library
ZcadObject Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »ZcadObject
 Declaration Syntax
C# | Visual Basic | Visual C++
public Object ZcadObject { get; }
Public ReadOnly Property ZcadObject As Object
	Get
public:
property Object^ ZcadObject {
	Object^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)