Reference Library
AltToleranceSuppressZeroInches Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »AltToleranceSuppressZeroInches
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool AltToleranceSuppressZeroInches { get; set; }
Public Overridable Property AltToleranceSuppressZeroInches As Boolean
	Get
	Set
public:
virtual property bool AltToleranceSuppressZeroInches {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)