Reference Library
ColumnWidth Method (col)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »ColumnWidth(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double ColumnWidth(
	int col
)
Public Overridable Function ColumnWidth ( _
	col As Integer _
) As Double
public:
virtual double ColumnWidth(
	int col
)
 Parameters
col(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)