Reference Library
Palette Class
Namespaces »ZwSoft.ZwCAD.Windows »Palette
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AdUiPalette")]
public sealed class Palette
<WrapperAttribute("AdUiPalette")> _
Public NotInheritable Class Palette
[WrapperAttribute(L"AdUiPalette")]
public ref class Palette sealed
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Name
PaletteSet
 Inheritance Hierarchy
Object
Palette
Assembly: ZwManaged (Module: ZwManaged)