Reference Library
VIsoLineDensity Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Surface »VIsoLineDensity
 Declaration Syntax
C# | Visual Basic | Visual C++
public short VIsoLineDensity { get; set; }
Public Property VIsoLineDensity As Short
	Get
	Set
public:
property short VIsoLineDensity {
	short get ();
	void set (short value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)