Reference Library
Name Property
Namespaces »ZwSoft.ZwCAD.Runtime »RXClass »Name
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Name { get; }
Public ReadOnly Property Name As String
	Get
public:
property String^ Name {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)