Reference Library
UpperPlotProgressRange Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotProgress »UpperPlotProgressRange
 Declaration Syntax
C# | Visual Basic | Visual C++
public int UpperPlotProgressRange { get; set; }
Public Property UpperPlotProgressRange As Integer
	Get
	Set
public:
property int UpperPlotProgressRange {
	int get ();
	void set (int value);
}
Assembly: ZwManaged (Module: ZwManaged)