Reference Library
Left Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellBorders »Left
 Declaration Syntax
C# | Visual Basic | Visual C++
public CellBorder Left { get; }
Public ReadOnly Property Left As CellBorder
	Get
public:
property CellBorder^ Left {
	CellBorder^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)