Reference Library
Flags Property
Namespaces »ZwSoft.ZwCAD.Runtime »LispFunctionAttribute »Flags
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual CommandFlags Flags { get; }
Public Overridable ReadOnly Property Flags As CommandFlags
	Get
public:
virtual property CommandFlags Flags {
	CommandFlags get ();
}
Assembly: ZwManaged (Module: ZwManaged)