Reference Library
ElemAt Method (pos, key, value)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Variant »ElemAt(Int32, String, Variant)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void ElemAt(
	int pos,
	ref string key,
	Variant value
)
Public Sub ElemAt ( _
	pos As Integer, _
	ByRef key As String, _
	value As Variant _
)
public:
void ElemAt(
	int pos,
	String^% key,
	Variant^ value
)
 Parameters
pos(Int32)
key(String%)
value(Variant)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)