Reference Library
IsUrl Method (url)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HostApplicationServices »IsUrl(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool IsUrl(
	string url
)
Public Overridable Function IsUrl ( _
	url As String _
) As Boolean
public:
virtual bool IsUrl(
	String^ url
)
 Parameters
url(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)