Reference Library
Set Method (origin, u, v)
Namespaces »ZwSoft.ZwCAD.Geometry »Plane »Set(Point3d, Vector3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	Point3d origin,
	Vector3d u,
	Vector3d v
)
Public Sub Set ( _
	origin As Point3d, _
	u As Vector3d, _
	v As Vector3d _
)
public:
void Set(
	Point3d origin,
	Vector3d u,
	Vector3d v
)
 Parameters
origin(Point3d)
u(Vector3d)
v(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)