Reference Library
TrayItem Class
Namespaces »ZwSoft.ZwCAD.Windows »TrayItem
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcTrayItem")]
public sealed class TrayItem : StatusBarItem
<WrapperAttribute("AcTrayItem")> _
Public NotInheritable Class TrayItem _
	Inherits StatusBarItem
[WrapperAttribute(L"AcTrayItem")]
public ref class TrayItem sealed : public StatusBarItem
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
TrayItem()
CloseBubbleWindows()
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | StatusBarItem
|  |  | TrayItem
Assembly: ZwManaged (Module: ZwManaged)