Reference Library
SaveAs Method (fileName, security)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »SaveAs(String, SecurityParameters)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SaveAs(
	string fileName,
	SecurityParameters security
)
Public Sub SaveAs ( _
	fileName As String, _
	security As SecurityParameters _
)
public:
void SaveAs(
	String^ fileName,
	SecurityParameters^ security
)
 Parameters
fileName(String)
security(SecurityParameters)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)