Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripDataCollection »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public IEnumerator<GripData> GetEnumerator()
Public Function GetEnumerator As IEnumerator(Of GripData)
public:
virtual IEnumerator<GripData^>^ GetEnumerator() sealed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)