Reference Library
SetTrait Method (vsProp, val, vsOp)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBVisualStyle »SetTrait(VisualStyleProperty, Variant, VisualStyleOperation)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetTrait(
	VisualStyleProperty vsProp,
	Variant val,
	VisualStyleOperation vsOp
)
Public Sub SetTrait ( _
	vsProp As VisualStyleProperty, _
	val As Variant, _
	vsOp As VisualStyleOperation _
)
public:
void SetTrait(
	VisualStyleProperty vsProp,
	Variant^ val,
	VisualStyleOperation vsOp
)
 Parameters
vsProp(VisualStyleProperty)
val(Variant)
vsOp(VisualStyleOperation)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)