Reference Library
SurfaceSurfaceIntersectorType Enumeration
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersectorType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGe::ssiType")]
public enum SurfaceSurfaceIntersectorType
<WrapperAttribute("ZcGe::ssiType")> _
Public Enumeration SurfaceSurfaceIntersectorType
[WrapperAttribute(L"ZcGe::ssiType")]
public enum class SurfaceSurfaceIntersectorType
 Members
Member | Description
AntiTangent
Tangent
Transverse
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)