Reference Library
UpdateDirection Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UpdateDirection
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum UpdateDirection
Public Enumeration UpdateDirection
public enum class UpdateDirection
 Members
Member | Description
DataToSource
SourceToData
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)