Reference Library
GetLeaderLineTypeId Method (leaderLineIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »GetLeaderLineTypeId(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId GetLeaderLineTypeId(
	int leaderLineIndex
)
Public Function GetLeaderLineTypeId ( _
	leaderLineIndex As Integer _
) As ObjectId
public:
ObjectId GetLeaderLineTypeId(
	int leaderLineIndex
)
 Parameters
leaderLineIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)