Reference Library
IndexOf Method (p)
Namespaces »ZwSoft.ZwCAD.Windows »PaneCollection »IndexOf(Pane)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int IndexOf(
	Pane p
)
Public Function IndexOf ( _
	p As Pane _
) As Integer
public:
int IndexOf(
	Pane^ p
)
 Parameters
p(Pane)
Assembly: ZwManaged (Module: ZwManaged)