Reference Library
Contains Method (value)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »LinetypeCollection »Contains(Linetype)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Contains(
	Linetype value
)
Public Function Contains ( _
	value As Linetype _
) As Boolean
public:
bool Contains(
	Linetype value
)
 Parameters
value(Linetype)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)