Reference Library
ICollection_CopyTo Method (arr, index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »ICollection_CopyTo(Array, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual void ICollection_CopyTo(
	Array arr,
	int index
)
Protected Overridable Sub ICollection_CopyTo ( _
	arr As Array, _
	index As Integer _
)
protected:
virtual void ICollection_CopyTo(
	Array^ arr,
	int index
)
 Parameters
arr(Array)
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)