Reference Library
DwgFiler Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbDwgFiler")]
public abstract class DwgFiler : RXObject
<WrapperAttribute("ZcDbDwgFiler")> _
Public MustInherit Class DwgFiler _
	Inherits RXObject
[WrapperAttribute(L"ZcDbDwgFiler")]
public ref class DwgFiler abstract : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DwgFiler(IntPtr, Boolean)
DwgFiler()
Database
DwgVersion
FilerStatus
FilerType
Position
ReadAddress()
ReadBinaryChunk()
ReadBoolean()
ReadByte()
ReadBytes(Byte[])
ReadDouble()
ReadHandle()
ReadHardOwnershipId()
ReadHardPointerId()
ReadInt16()
ReadInt32()
ReadInt64()
ReadPoint2d()
ReadPoint3d()
ReadScale3d()
ReadSoftOwnershipId()
ReadSoftPointerId()
ReadString()
ReadUInt16()
ReadUInt32()
ReadUInt64()
ReadVector2d()
ReadVector3d()
ResetFilerStatus()
Seek(Int32, Int32)
Seek(Int64, Int32)
WriteAddress(IntPtr)
WriteBinaryChunk(Byte[])
WriteBoolean(Boolean)
WriteByte(Byte)
WriteBytes(Byte[])
WriteDouble(Double)
WriteHandle(Handle)
WriteHardOwnershipId(ObjectId)
WriteHardPointerId(ObjectId)
WriteInt16(Int16)
WriteInt32(Int32)
WriteInt64(Int64)
WritePoint2d(Point2d)
WritePoint3d(Point3d)
WriteScale3d(Scale3d)
WriteSoftOwnershipId(ObjectId)
WriteSoftPointerId(ObjectId)
WriteString(String)
WriteUInt16(UInt16)
WriteUInt32(UInt32)
WriteUInt64(UInt64)
WriteVector2d(Vector2d)
WriteVector3d(Vector3d)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | DwgFiler
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)