Reference Library
IsEqualTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »CompositeCurve3d »IsEqualTo()
 Members
Icon | Member | Description
IsEqualTo(Entity3d, Tolerance)
IsEqualTo(Entity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)