Reference Library
SetFromGeCurve Method (geCurve)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »SetFromGeCurve(Curve3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFromGeCurve(
	Curve3d geCurve
)
Public Sub SetFromGeCurve ( _
	geCurve As Curve3d _
)
public:
void SetFromGeCurve(
	Curve3d^ geCurve
)
 Parameters
geCurve(Curve3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)