Reference Library
Dispose Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayDefinition »Dispose()
 Members
Icon | Member | Description
Dispose(Boolean) |  (Overrides DisposableWrapper.Dispose(Boolean).)
Dispose()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)