Reference Library
ShadePlotResLevel Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ShadePlotResLevel
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbPlotSettings::ShadePlotResLevel")]
public enum ShadePlotResLevel
<WrapperAttribute("ZcDbPlotSettings::ShadePlotResLevel")> _
Public Enumeration ShadePlotResLevel
[WrapperAttribute(L"ZcDbPlotSettings::ShadePlotResLevel")]
public enum class ShadePlotResLevel
 Members
Member | Description
Custom
Maximum
Presentation
Normal
Preview
Draft
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)