Reference Library
ExportMIFileName Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraits »ExportMIFileName
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract string ExportMIFileName { get; set; }
Public MustOverride Property ExportMIFileName As String
	Get
	Set
public:
virtual property String^ ExportMIFileName {
	String^ get () abstract;
	void set (String^ value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)