Reference Library
PromptStringOptionsEventArgs Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptStringOptionsEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PromptStringOptionsEventArgs : EventArgs
Public NotInheritable Class PromptStringOptionsEventArgs _
	Inherits EventArgs
public ref class PromptStringOptionsEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Options
 Inheritance Hierarchy
Object
EventArgs
| PromptStringOptionsEventArgs
Assembly: ZwManaged (Module: ZwManaged)