Reference Library
CurrentMode Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentLockModeChangedEventArgs »CurrentMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public DocumentLockMode CurrentMode { get; }
Public ReadOnly Property CurrentMode As DocumentLockMode
	Get
public:
property DocumentLockMode CurrentMode {
	DocumentLockMode get ();
}
Assembly: ZwManaged (Module: ZwManaged)