Reference Library
SetVertexAt Method (faceIndex, vertexIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FaceRecord »SetVertexAt(Int16, Int16)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetVertexAt(
	short faceIndex,
	short vertexIndex
)
Public Sub SetVertexAt ( _
	faceIndex As Short, _
	vertexIndex As Short _
)
public:
void SetVertexAt(
	short faceIndex,
	short vertexIndex
)
 Parameters
faceIndex(Int16)
vertexIndex(Int16)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)