Reference Library
DefaultLightingOn Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AbstractViewTableRecord »DefaultLightingOn
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool DefaultLightingOn { get; set; }
Public Property DefaultLightingOn As Boolean
	Get
	Set
public:
property bool DefaultLightingOn {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)