Reference Library
CreateRevolvedSolid Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »CreateRevolvedSolid()
 Members
Icon | Member | Description
CreateRevolvedSolid(Entity, SubentityId, Point3d, Vector3d, Double, Double, RevolveOptions)
CreateRevolvedSolid(Entity, Point3d, Vector3d, Double, Double, RevolveOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)