Reference Library
MLeaderStyle Constructor (mleaderStyle)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeaderStyle »MLeaderStyle(MLeaderStyle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public MLeaderStyle(
	MLeaderStyle mleaderStyle
)
Public Sub New ( _
	mleaderStyle As MLeaderStyle _
)
public:
MLeaderStyle(
	MLeaderStyle^ mleaderStyle
)
 Parameters
mleaderStyle(MLeaderStyle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)