Reference Library
OldId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectId »OldId
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use System::IntPtr OldIdPtr")]
public long OldId { get; }
<ObsoleteAttribute("Use System::IntPtr OldIdPtr")> _
Public ReadOnly Property OldId As Long
	Get
[ObsoleteAttribute(L"Use System::IntPtr OldIdPtr")]
public:
property long long OldId {
	long long get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)