Reference Library
Polyline Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline »Polyline()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Polyline()
Public Sub New
public:
Polyline()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)