Reference Library
BlockBegin Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MText »BlockBegin
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string BlockBegin { get; }
Public Shared ReadOnly Property BlockBegin As String
	Get
public:
static property String^ BlockBegin {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)