Reference Library
ContentColor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »ContentColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color ContentColor { get; set; }
Public Property ContentColor As Color
	Get
	Set
public:
property Color^ ContentColor {
	Color^ get ();
	void set (Color^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)