Reference Library
Invalidate Method (rect)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »Invalidate(Rectangle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Invalidate(
	Rectangle rect
)
Public Sub Invalidate ( _
	rect As Rectangle _
)
public:
void Invalidate(
	Rectangle rect
)
 Parameters
rect(Rectangle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)