Reference Library
SetLastVertex Method (leaderLineIndex, point)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »SetLastVertex(Int32, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetLastVertex(
	int leaderLineIndex,
	Point3d point
)
Public Sub SetLastVertex ( _
	leaderLineIndex As Integer, _
	point As Point3d _
)
public:
void SetLastVertex(
	int leaderLineIndex,
	Point3d point
)
 Parameters
leaderLineIndex(Int32)
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)