Reference Library
IsHomogeneous Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdData »IsHomogeneous
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsHomogeneous { get; set; }
Public Property IsHomogeneous As Boolean
	Get
	Set
public:
property bool IsHomogeneous {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)