Reference Library
GetClosestPointTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »BoundedPlane »GetClosestPointTo()
 Members
Icon | Member | Description
GetClosestPointTo(Point3d, Tolerance)
GetClosestPointTo(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)