Reference Library
Cell Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Cell
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcCell")]
public class Cell : CellRange
<WrapperAttribute("AcCell")> _
Public Class Cell _
	Inherits CellRange
[WrapperAttribute(L"AcCell")]
public ref class Cell : public CellRange
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Cell(Table, Int32, Int32)
AttachmentPoint
BlockTableRecordId
CellType
Column
Contents
ContentTypes
DataLink
FieldId
GetBlockAttributeValue(ObjectId)
GetDataLinkRange()
GetExtents()
GetMergeRange()
GetTextString(FormatOption)
GetValue(FormatOption)
RemoveDataLink()
ResetValue()
Row
SetBlockAttributeValue(ObjectId, String)
SetValue(Object, ParseOption)
TextString
ToolTip
UpdateDataLink(UpdateDirection, UpdateOption)
Value
 Inheritance Hierarchy
Object
CellRange
| Cell
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)