Reference Library
IsCircular Method
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc3d »IsCircular()
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsCircular()
Public Function IsCircular As Boolean
public:
bool IsCircular()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)