Reference Library
Line3d Constructor (point1, point2)
Namespaces »ZwSoft.ZwCAD.Geometry »Line3d »Line3d(Point3d, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Line3d(
	Point3d point1,
	Point3d point2
)
Public Sub New ( _
	point1 As Point3d, _
	point2 As Point3d _
)
public:
Line3d(
	Point3d point1,
	Point3d point2
)
 Parameters
point1(Point3d)
point2(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)