Reference Library
GetArea Method (startParameter, endParameter, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »GetArea(Double, Double, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetArea(
	double startParameter,
	double endParameter,
	Tolerance tolerance
)
Public Function GetArea ( _
	startParameter As Double, _
	endParameter As Double, _
	tolerance As Tolerance _
) As Double
public:
double GetArea(
	double startParameter,
	double endParameter,
	Tolerance tolerance
)
 Parameters
startParameter(Double)
endParameter(Double)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)