Reference Library
GetClosestPointTo Method (curve, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »GetClosestPointTo(Curve2d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnCurve2d[] GetClosestPointTo(
	Curve2d curve,
	Tolerance tolerance
)
Public Function GetClosestPointTo ( _
	curve As Curve2d, _
	tolerance As Tolerance _
) As PointOnCurve2d()
public:
array<PointOnCurve2d^>^ GetClosestPointTo(
	Curve2d^ curve,
	Tolerance tolerance
)
 Parameters
curve(Curve2d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)