Reference Library
Int32Collection Class
Namespaces »ZwSoft.ZwCAD.Geometry »Int32Collection
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeInt32Array")]
public class Int32Collection : IList
<WrapperAttribute("ZcGeInt32Array")> _
Public Class Int32Collection _
	Implements IList
[WrapperAttribute(L"ZcGeInt32Array")]
public ref class Int32Collection : IList
 Members
All Members | Constructors | Methods | Properties | Fields
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Int32Collection(Int32)
Int32Collection(Int32[])
Int32Collection()
Add(Int32)
AddRange(Int32[])
Capacity
Clear()
Contains(Int32)
CopyTo(Int32[], Int32)
Count
DefaultSize
GetEnumerator()
ICollection.CopyTo(Array, Int32)
IEnumerable_GetEnumerator()
IList.Add(Object)
IList.Contains(Object)
IList.IndexOf(Object)
IList.Insert(Int32, Object)
IList.Item[Int32]
IList.Remove(Object)
IndexOf(Int32)
Insert(Int32, Int32)
IsFixedSize
IsReadOnly
IsSynchronized
Item[Int32]
Remove(Int32)
RemoveAt(Int32)
SyncRoot
ToArray()
TrimToSize()
 Inheritance Hierarchy
Object
Int32Collection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)