Reference Library
Set Method (x, y)
Namespaces »ZwSoft.ZwCAD.Geometry »Position2d »Set(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	double x,
	double y
)
Public Sub Set ( _
	x As Double, _
	y As Double _
)
public:
void Set(
	double x,
	double y
)
 Parameters
x(Double)
y(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)