Reference Library
Add Method (i, field)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldCodeWithChildren »Add(Int32, Field)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Add(
	int i,
	Field field
)
Public Sub Add ( _
	i As Integer, _
	field As Field _
)
public:
void Add(
	int i,
	Field^ field
)
 Parameters
i(Int32)
field(Field)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)