Reference Library
TextHeight Method (cellStyle)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableStyle »TextHeight(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double TextHeight(
	string cellStyle
)
Public Function TextHeight ( _
	cellStyle As String _
) As Double
public:
double TextHeight(
	String^ cellStyle
)
 Parameters
cellStyle(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)