Reference Library
Unmerge Method (range)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »Unmerge(CellRange)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void Unmerge(
	CellRange range
)
Public Overridable Sub Unmerge ( _
	range As CellRange _
)
public:
virtual void Unmerge(
	CellRange^ range
)
 Parameters
range(CellRange)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)