Reference Library
FieldFromMText Method (dimMText)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »FieldFromMText(MText)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void FieldFromMText(
	MText dimMText
)
Public Sub FieldFromMText ( _
	dimMText As MText _
)
public:
void FieldFromMText(
	MText^ dimMText
)
 Parameters
dimMText(MText)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)