Reference Library
CellStyles Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableStyle »CellStyles
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ArrayList CellStyles { get; }
Public Overridable ReadOnly Property CellStyles As ArrayList
	Get
public:
virtual property ArrayList^ CellStyles {
	ArrayList^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)