Reference Library
SetTextString Method (row, col, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetTextString(Int32, Int32, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetTextString(
	int row,
	int col,
	string value
)
Public Overridable Sub SetTextString ( _
	row As Integer, _
	col As Integer, _
	value As String _
)
public:
virtual void SetTextString(
	int row,
	int col,
	String^ value
)
 Parameters
row(Int32)
col(Int32)
value(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)