Reference Library
GetDocument Method (db)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentCollection »GetDocument(Database)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Document GetDocument(
	Database db
)
Public Function GetDocument ( _
	db As Database _
) As Document
public:
Document^ GetDocument(
	Database^ db
)
 Parameters
db(Database)
Assembly: ZwManaged (Module: ZwManaged)