Reference Library
DictionaryWithDefaultDictionary Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DictionaryWithDefaultDictionary »DictionaryWithDefaultDictionary()
 Declaration Syntax
C# | Visual Basic | Visual C++
public DictionaryWithDefaultDictionary()
Public Sub New
public:
DictionaryWithDefaultDictionary()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)