Reference Library
PageSize Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »MediaBounds »PageSize
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d PageSize { get; set; }
Public Property PageSize As Point2d
	Get
	Set
public:
property Point2d PageSize {
	Point2d get ();
	void set (Point2d value);
}
Assembly: ZwManaged (Module: ZwManaged)