Reference Library
Direction Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PickPointDescriptor »Direction
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d Direction { get; }
Public ReadOnly Property Direction As Vector3d
	Get
public:
property Vector3d Direction {
	Vector3d get ();
}
Assembly: ZwManaged (Module: ZwManaged)