Reference Library
SetGridLineWeight Method (row, column, gridLinetype, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »SetGridLineWeight(Int32, Int32, GridLineType, LineWeight)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetGridLineWeight(
	int row,
	int column,
	GridLineType gridLinetype,
	LineWeight value
)
Public Overridable Sub SetGridLineWeight ( _
	row As Integer, _
	column As Integer, _
	gridLinetype As GridLineType, _
	value As LineWeight _
)
public:
virtual void SetGridLineWeight(
	int row,
	int column,
	GridLineType gridLinetype,
	LineWeight value
)
 Parameters
row(Int32)
column(Int32)
gridLinetype(GridLineType)
value(LineWeight)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)