Reference Library
RevolveOptionsCheckRevolveCurveOut Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolveOptionsCheckRevolveCurveOut
 Declaration Syntax
C# | Visual Basic | Visual C++
public class RevolveOptionsCheckRevolveCurveOut
Public Class RevolveOptionsCheckRevolveCurveOut
public ref class RevolveOptionsCheckRevolveCurveOut
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
RevolveOptionsCheckRevolveCurveOut()
Closed
EndPointsOnAxis
Planar
 Inheritance Hierarchy
Object
RevolveOptionsCheckRevolveCurveOut
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)