Reference Library
DrawAtDragImageGripPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripData »DrawAtDragImageGripPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool DrawAtDragImageGripPoint { get; set; }
Public Property DrawAtDragImageGripPoint As Boolean
	Get
	Set
public:
property bool DrawAtDragImageGripPoint {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)