Reference Library
Item Property (key)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »Item[String]
 Declaration Syntax
C# | Visual Basic | Visual C++
public Object this[
	string key
] { get; set; }
Public Default Property Item ( _
	key As String _
) As Object
	Get
	Set
public:
property Object^ default[String^ key] {
	Object^ get (String^ key);
	void set (String^ key, Object^ value);
}
 Parameters
key(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)