Reference Library
IsEqualTo Method (a)
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersectorConfigurations »IsEqualTo(SurfaceSurfaceIntersectorConfigurations)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	SurfaceSurfaceIntersectorConfigurations a
)
Public Function IsEqualTo ( _
	a As SurfaceSurfaceIntersectorConfigurations _
) As Boolean
public:
bool IsEqualTo(
	SurfaceSurfaceIntersectorConfigurations a
)
 Parameters
a(SurfaceSurfaceIntersectorConfigurations)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)