Reference Library
EdgeStyle Constructor
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeStyle »EdgeStyle()
 Declaration Syntax
C# | Visual Basic | Visual C++
public EdgeStyle()
Public Sub New
public:
EdgeStyle()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)