Reference Library
GetDistanceTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity3d »GetDistanceTo()
 Members
Icon | Member | Description
GetDistanceTo(Point3d, Tolerance)
GetDistanceTo(Curve3d, Tolerance)
GetDistanceTo(Point3d)
GetDistanceTo(Curve3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)