Reference Library
IsOn Method (point, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »IsOn(Point2d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsOn(
	Point2d point,
	Tolerance tolerance
)
Public Function IsOn ( _
	point As Point2d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsOn(
	Point2d point,
	Tolerance tolerance
)
 Parameters
point(Point2d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)