Reference Library
CopyFrom Method (param0, source, options, sourceRange, targetRange)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »CopyFrom(CellRange, Table, TableCopyOptions, CellRange, CellRange)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void CopyFrom(
	ref CellRange param0,
	Table source,
	TableCopyOptions options,
	CellRange sourceRange,
	CellRange targetRange
)
Public Overridable Function CopyFrom ( _
	ByRef param0 As CellRange, _
	source As Table, _
	options As TableCopyOptions, _
	sourceRange As CellRange, _
	targetRange As CellRange _
) As Void
public:
virtual void CopyFrom(
	CellRange^% param0,
	Table^ source,
	TableCopyOptions options,
	CellRange^ sourceRange,
	CellRange^ targetRange
)
 Parameters
param0(CellRange%)
source(Table)
options(TableCopyOptions)
sourceRange(CellRange)
targetRange(CellRange)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)