Reference Library
ExternalSurfaceDefinition Property
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalBoundedSurface »ExternalSurfaceDefinition
 Declaration Syntax
C# | Visual Basic | Visual C++
public IntPtr ExternalSurfaceDefinition { get; }
Public ReadOnly Property ExternalSurfaceDefinition As IntPtr
	Get
public:
property IntPtr ExternalSurfaceDefinition {
	IntPtr get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)