Reference Library
XrefBeginOperationEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefBeginOperationEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void XrefBeginOperationEventHandler(
	Object sender,
	XrefBeginOperationEventArgs e
)
Public Delegate Sub XrefBeginOperationEventHandler ( _
	sender As Object, _
	e As XrefBeginOperationEventArgs _
)
public delegate void XrefBeginOperationEventHandler(
	Object^ sender,
	XrefBeginOperationEventArgs^ e
)
 Parameters
sender(Object)
e(XrefBeginOperationEventArgs)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)