Reference Library
StartAngle Property
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc2d »StartAngle
 Declaration Syntax
C# | Visual Basic | Visual C++
public double StartAngle { get; }
Public ReadOnly Property StartAngle As Double
	Get
public:
property double StartAngle {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)