Reference Library
IsPlane Property
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalSurface »IsPlane
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPlane { get; }
Public ReadOnly Property IsPlane As Boolean
	Get
public:
property bool IsPlane {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)