Reference Library
MentalRayRenderSettingsTraitsDiagnosticGridModeParameter Structure
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraitsDiagnosticGridModeParameter
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct MentalRayRenderSettingsTraitsDiagnosticGridModeParameter
Public Structure MentalRayRenderSettingsTraitsDiagnosticGridModeParameter
public value class MentalRayRenderSettingsTraitsDiagnosticGridModeParameter
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
MentalRayRenderSettingsTraitsDiagnosticGridModeParameter(DiagnosticGridMode, Single)
Mode
Size
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)