Reference Library
ReadHandle Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »ReadHandle()
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Handle ReadHandle()
Public MustOverride Function ReadHandle As Handle
public:
virtual Handle ReadHandle() abstract
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)