Reference Library
HorizontalRotation Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »HorizontalRotation
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.AngleNotTransformed)]
public double HorizontalRotation { get; set; }
<UnitTypeAttribute(UnitType.AngleNotTransformed)> _
Public Property HorizontalRotation As Double
	Get
	Set
[UnitTypeAttribute(UnitType::AngleNotTransformed)]
public:
property double HorizontalRotation {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)