Reference Library
MediaBoundsWeight Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotInfoValidator »MediaBoundsWeight
 Declaration Syntax
C# | Visual Basic | Visual C++
public int MediaBoundsWeight { get; set; }
Public Property MediaBoundsWeight As Integer
	Get
	Set
public:
property int MediaBoundsWeight {
	int get ();
	void set (int value);
}
Assembly: ZwManaged (Module: ZwManaged)