Reference Library
ContextMenuExtensionType Property
Namespaces »ZwSoft.ZwCAD.Runtime »LispFunctionAttribute »ContextMenuExtensionType
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Type ContextMenuExtensionType { get; }
Public Overridable ReadOnly Property ContextMenuExtensionType As Type
	Get
public:
virtual property Type^ ContextMenuExtensionType {
	Type^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)