Reference Library
SetView Method (position, target, upVector, fieldWidth, fieldHeight, projection)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »SetView(Point3d, Point3d, Vector3d, Double, Double, Projection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetView(
	Point3d position,
	Point3d target,
	Vector3d upVector,
	double fieldWidth,
	double fieldHeight,
	Projection projection
)
Public Sub SetView ( _
	position As Point3d, _
	target As Point3d, _
	upVector As Vector3d, _
	fieldWidth As Double, _
	fieldHeight As Double, _
	projection As Projection _
)
public:
void SetView(
	Point3d position,
	Point3d target,
	Vector3d upVector,
	double fieldWidth,
	double fieldHeight,
	Projection projection
)
 Parameters
position(Point3d)
target(Point3d)
upVector(Vector3d)
fieldWidth(Double)
fieldHeight(Double)
projection(Projection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)