Reference Library
AtPut Method (key, value)
Namespaces »ZwSoft.ZwCAD.Runtime »Dictionary »AtPut(String, RXObject)
 Declaration Syntax
C# | Visual Basic | Visual C++
public RXObject AtPut(
	string key,
	RXObject value
)
Public Function AtPut ( _
	key As String, _
	value As RXObject _
) As RXObject
public:
RXObject^ AtPut(
	String^ key,
	RXObject^ value
)
 Parameters
key(String)
value(RXObject)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)