Reference Library
PromptEntityResultEventArgs Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptEntityResultEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PromptEntityResultEventArgs : EventArgs
Public NotInheritable Class PromptEntityResultEventArgs _
	Inherits EventArgs
public ref class PromptEntityResultEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Result
 Inheritance Hierarchy
Object
EventArgs
| PromptEntityResultEventArgs
Assembly: ZwManaged (Module: ZwManaged)