Reference Library
IsSphere Property
Namespaces »ZwSoft.ZwCAD.Geometry »OffsetSurface »IsSphere
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsSphere { get; }
Public ReadOnly Property IsSphere As Boolean
	Get
public:
property bool IsSphere {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)