Reference Library
GetClosestPointTo Method (point)
Namespaces »ZwSoft.ZwCAD.Geometry »Surface »GetClosestPointTo(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnSurface GetClosestPointTo(
	Point3d point
)
Public Function GetClosestPointTo ( _
	point As Point3d _
) As PointOnSurface
public:
PointOnSurface^ GetClosestPointTo(
	Point3d point
)
 Parameters
point(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)