Reference Library
BackClipDistance Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »BackClipDistance
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public double BackClipDistance { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Property BackClipDistance As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
property double BackClipDistance {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)