Reference Library
Inverse Method
Namespaces »ZwSoft.ZwCAD.Geometry »Scale2d »Inverse()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Scale2d Inverse()
Public Function Inverse As Scale2d
public:
Scale2d Inverse()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)