Reference Library
GenerateClipBoundaryFromPline Method (polyId)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayReference »GenerateClipBoundaryFromPline(ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void GenerateClipBoundaryFromPline(
	ObjectId polyId
)
Public Sub GenerateClipBoundaryFromPline ( _
	polyId As ObjectId _
)
public:
void GenerateClipBoundaryFromPline(
	ObjectId polyId
)
 Parameters
polyId(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)