Reference Library
CheckGuideCurves Method (guideCurves, displayErrorMessages)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LoftOptions »CheckGuideCurves(Entity[], Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CheckGuideCurves(
	Entity[] guideCurves,
	bool displayErrorMessages
)
Public Sub CheckGuideCurves ( _
	guideCurves As Entity(), _
	displayErrorMessages As Boolean _
)
public:
void CheckGuideCurves(
	array<Entity^>^ guideCurves,
	bool displayErrorMessages
)
 Parameters
guideCurves(Entity[])
displayErrorMessages(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)