Reference Library
GetObjectSnapPoints Method (snapMode, gsSelectionMark, pickPoint, lastPoint, viewTransform, snapPoints, geometryIds)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »GetObjectSnapPoints(ObjectSnapModes, Int32, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void GetObjectSnapPoints(
	ObjectSnapModes snapMode,
	int gsSelectionMark,
	Point3d pickPoint,
	Point3d lastPoint,
	Matrix3d viewTransform,
	Point3dCollection snapPoints,
	IntegerCollection geometryIds
)
Public Overridable Sub GetObjectSnapPoints ( _
	snapMode As ObjectSnapModes, _
	gsSelectionMark As Integer, _
	pickPoint As Point3d, _
	lastPoint As Point3d, _
	viewTransform As Matrix3d, _
	snapPoints As Point3dCollection, _
	geometryIds As IntegerCollection _
)
public:
virtual void GetObjectSnapPoints(
	ObjectSnapModes snapMode,
	int gsSelectionMark,
	Point3d pickPoint,
	Point3d lastPoint,
	Matrix3d viewTransform,
	Point3dCollection^ snapPoints,
	IntegerCollection^ geometryIds
)
 Parameters
snapMode(ObjectSnapModes)
gsSelectionMark(Int32)
pickPoint(Point3d)
lastPoint(Point3d)
viewTransform(Matrix3d)
snapPoints(Point3dCollection)
geometryIds(IntegerCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)