Reference Library
SelectWindowPolygon Method (polygon, filter)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »SelectWindowPolygon(Point3dCollection, SelectionFilter)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptSelectionResult SelectWindowPolygon(
	Point3dCollection polygon,
	SelectionFilter filter
)
Public Function SelectWindowPolygon ( _
	polygon As Point3dCollection, _
	filter As SelectionFilter _
) As PromptSelectionResult
public:
PromptSelectionResult^ SelectWindowPolygon(
	Point3dCollection^ polygon,
	SelectionFilter^ filter
)
 Parameters
polygon(Point3dCollection)
filter(SelectionFilter)
Assembly: ZwManaged (Module: ZwManaged)