Reference Library
IsLayerZeroName Method (name)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »IsLayerZeroName(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool IsLayerZeroName(
	string name
)
Public Shared Function IsLayerZeroName ( _
	name As String _
) As Boolean
public:
static bool IsLayerZeroName(
	String^ name
)
 Parameters
name(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)