Reference Library
ShowModalDialog Method (formToShow)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »ShowModalDialog(Form)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static DialogResult ShowModalDialog(
	Form formToShow
)
Public Shared Function ShowModalDialog ( _
	formToShow As Form _
) As DialogResult
public:
static DialogResult ShowModalDialog(
	Form^ formToShow
)
 Parameters
formToShow(Form)
Assembly: ZwManaged (Module: ZwManaged)