Reference Library
GetEnumerator Method (option)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »GetEnumerator(TableEnumeratorOption)
 Declaration Syntax
C# | Visual Basic | Visual C++
public TableEnumerator GetEnumerator(
	TableEnumeratorOption option
)
Public Function GetEnumerator ( _
	option As TableEnumeratorOption _
) As TableEnumerator
public:
TableEnumerator^ GetEnumerator(
	TableEnumeratorOption option
)
 Parameters
option(TableEnumeratorOption)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)