Reference Library
DocumentActivated Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentCollection »DocumentActivated
 Declaration Syntax
C# | Visual Basic | Visual C++
public event DocumentCollectionEventHandler DocumentActivated
Public Event DocumentActivated As DocumentCollectionEventHandler
public:
 event DocumentCollectionEventHandler^ DocumentActivated {
	void add (DocumentCollectionEventHandler^ value);
	void remove (DocumentCollectionEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)