Reference Library
SetFieldValue Method (pValue)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldResult »SetFieldValue(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void SetFieldValue(
	Object pValue
)
Public MustOverride Sub SetFieldValue ( _
	pValue As Object _
)
public:
virtual void SetFieldValue(
	Object^ pValue
) abstract
 Parameters
pValue(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)