Reference Library
SecurityParameters Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SecurityParameters »SecurityParameters()
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use other overloads.", true)]
public SecurityParameters()
<ObsoleteAttribute("Use other overloads.", True)> _
Public Sub New
[ObsoleteAttribute(L"Use other overloads.", true)]
public:
SecurityParameters()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)