Reference Library
Polygon Method (points)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »Polygon(Point3dCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool Polygon(
	Point3dCollection points
)
Public MustOverride Function Polygon ( _
	points As Point3dCollection _
) As Boolean
public:
virtual bool Polygon(
	Point3dCollection^ points
) abstract
 Parameters
points(Point3dCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)