Reference Library
MinimumTableHeight Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »MinimumTableHeight
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double MinimumTableHeight { get; }
Public Overridable ReadOnly Property MinimumTableHeight As Double
	Get
public:
virtual property double MinimumTableHeight {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)