Reference Library
GetPlotStyleSheetList Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsValidator »GetPlotStyleSheetList()
 Declaration Syntax
C# | Visual Basic | Visual C++
public StringCollection GetPlotStyleSheetList()
Public Function GetPlotStyleSheetList As StringCollection
public:
StringCollection^ GetPlotStyleSheetList()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)