Reference Library
PaletteSetSizeEventArgs Class
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSetSizeEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PaletteSetSizeEventArgs : EventArgs
Public NotInheritable Class PaletteSetSizeEventArgs _
	Inherits EventArgs
public ref class PaletteSetSizeEventArgs sealed : public EventArgs
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PaletteSetSizeEventArgs(Int32, Int32, Double, Double)
DeviceIndependentHeight
DeviceIndependentWidth
Height
Width
 Inheritance Hierarchy
Object
EventArgs
| PaletteSetSizeEventArgs
Assembly: ZwManaged (Module: ZwManaged)