Reference Library
PlotProgressDialog Class
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotProgressDialog
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcPlPlotProgressDialog")]
public class PlotProgressDialog : PlotProgress
<WrapperAttribute("AcPlPlotProgressDialog")> _
Public Class PlotProgressDialog _
	Inherits PlotProgress
[WrapperAttribute(L"AcPlPlotProgressDialog")]
public ref class PlotProgressDialog : public PlotProgress
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PlotProgressDialog(Boolean, Int32, Boolean)
DeleteUnmanagedObject() |  (Overrides PlotProgress.DeleteUnmanagedObject().)
Destroy()
IsSingleSheetPlot
OnBeginPlot()
OnBeginSheet()
OnEndPlot()
OnEndSheet()
PlotMsgString[PlotMessageIndex]
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | PlotProgress
|  |  | PlotProgressDialog
Assembly: ZwManaged (Module: ZwManaged)