Reference Library
Set Method (surfaceDef, surfaceKind)
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalBoundedSurface »Set(IntPtr, ExternalEntityKind)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	IntPtr surfaceDef,
	ExternalEntityKind surfaceKind
)
Public Sub Set ( _
	surfaceDef As IntPtr, _
	surfaceKind As ExternalEntityKind _
)
public:
void Set(
	IntPtr surfaceDef,
	ExternalEntityKind surfaceKind
)
 Parameters
surfaceDef(IntPtr)
surfaceKind(ExternalEntityKind)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)