Reference Library
Selectable Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »Selectable
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Selectable { get; set; }
Public Property Selectable As Boolean
	Get
	Set
public:
property bool Selectable {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)