Reference Library
Angdir Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Angdir
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Angdir { get; set; }
Public Property Angdir As Boolean
	Get
	Set
public:
property bool Angdir {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)