Reference Library
m_pLayerStateToBeRestored Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »m_pLayerStateToBeRestored
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerStateEventHandler m_pLayerStateToBeRestored
Public m_pLayerStateToBeRestored As LayerStateEventHandler
public:
LayerStateEventHandler^ m_pLayerStateToBeRestored
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)