Reference Library
ContrastLowerLimit Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayReference »ContrastLowerLimit
 Declaration Syntax
C# | Visual Basic | Visual C++
public static int ContrastLowerLimit { get; }
Public Shared ReadOnly Property ContrastLowerLimit As Integer
	Get
public:
static property int ContrastLowerLimit {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)