Reference Library
SetDataLink Method (dataLinkId, bUpdate)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »SetDataLink(ObjectId, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetDataLink(
	ObjectId dataLinkId,
	bool bUpdate
)
Public Sub SetDataLink ( _
	dataLinkId As ObjectId, _
	bUpdate As Boolean _
)
public:
void SetDataLink(
	ObjectId dataLinkId,
	bool bUpdate
)
 Parameters
dataLinkId(ObjectId)
bUpdate(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)