Reference Library
TypeOfCoordinates Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TypeOfCoordinates
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum TypeOfCoordinates
Public Enumeration TypeOfCoordinates
public enum class TypeOfCoordinates
 Members
Member | Description
CoordinateTypeUnknown
CoordinateTypeLocal
CoordinateTypeGrid
CoordinateTypeGeographic
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)