Reference Library
KeywordInput Event
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptSelectionOptions »KeywordInput
 Declaration Syntax
C# | Visual Basic | Visual C++
public event SelectionTextInputEventHandler KeywordInput
Public Event KeywordInput As SelectionTextInputEventHandler
public:
 event SelectionTextInputEventHandler^ KeywordInput {
	void add (SelectionTextInputEventHandler^ value);
	void remove (SelectionTextInputEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)