Reference Library
EnableBlockScale Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeaderStyle »EnableBlockScale
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool EnableBlockScale { get; set; }
Public Property EnableBlockScale As Boolean
	Get
	Set
public:
property bool EnableBlockScale {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)