Reference Library
Drawable Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Drawable
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcGiDrawable")]
public abstract class Drawable : RXObject
<WrapperAttribute("AcGiDrawable")> _
Public MustInherit Class Drawable _
	Inherits RXObject
[WrapperAttribute(L"AcGiDrawable")]
public ref class Drawable abstract : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Drawable(IntPtr, Boolean)
Drawable()
Bounds
drawableType
Id
IsPersistent
SetAttributes(DrawableTraits)
SubSetAttributes(DrawableTraits)
SubViewportDraw(ViewportDraw)
SubViewportDrawLogicalFlags(ViewportDraw)
SubWorldDraw(WorldDraw)
ViewportDraw(ViewportDraw)
ViewportDrawLogicalFlags(ViewportDraw)
WorldDraw(WorldDraw)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)