Reference Library
Size Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Shape »Size
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Size { get; set; }
Public Property Size As Double
	Get
	Set
public:
property double Size {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)