Reference Library
Ushort Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Variant »Ushort
 Declaration Syntax
C# | Visual Basic | Visual C++
public ushort Ushort { get; set; }
Public Property Ushort As UShort
	Get
	Set
public:
property unsigned short Ushort {
	unsigned short get ();
	void set (unsigned short value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)