Reference Library
Load Event
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »Load
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PalettePersistEventHandler Load
Public Event Load As PalettePersistEventHandler
public:
 event PalettePersistEventHandler^ Load {
	void add (PalettePersistEventHandler^ value);
	void remove (PalettePersistEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)