Reference Library
Color Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ViewportBorderProperties »Color
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color Color { get; }
Public ReadOnly Property Color As Color
	Get
public:
property Color Color {
	Color get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)