Reference Library
Poly2dType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Poly2dType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDb::Poly2dType")]
public enum Poly2dType
<WrapperAttribute("ZcDb::Poly2dType")> _
Public Enumeration Poly2dType
[WrapperAttribute(L"ZcDb::Poly2dType")]
public enum class Poly2dType
 Members
Member | Description
CubicSplinePoly
QuadSplinePoly
FitCurvePoly
SimplePoly
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)