Reference Library
IntersectColor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »IntersectColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public int IntersectColor { get; set; }
Public Property IntersectColor As Integer
	Get
	Set
public:
property int IntersectColor {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)