Reference Library
Update Method (pUpdatedRect)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »Update(Rectangle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void Update(
	Rectangle pUpdatedRect
)
Public MustOverride Sub Update ( _
	pUpdatedRect As Rectangle _
)
public:
virtual void Update(
	Rectangle pUpdatedRect
) abstract
 Parameters
pUpdatedRect(Rectangle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)