Reference Library
IsAutoScale Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellContent »IsAutoScale
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsAutoScale { get; set; }
Public Property IsAutoScale As Boolean
	Get
	Set
public:
property bool IsAutoScale {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)