Reference Library
SyncRoot Property
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »ICollection.SyncRoot
 Declaration Syntax
C# | Visual Basic | Visual C++
Object ICollection.SyncRoot { get; }
Private ReadOnly Property SyncRoot As Object
	Implements ICollection.SyncRoot
	Get
private:
virtual property Object^ SyncRoot {
	Object^ get () sealed = ICollection::SyncRoot::get;
}
Assembly: ZwManaged (Module: ZwManaged)