Reference Library
GetClosestPointTo Method (point, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »GetClosestPointTo(Point2d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnCurve2d GetClosestPointTo(
	Point2d point,
	Tolerance tolerance
)
Public Function GetClosestPointTo ( _
	point As Point2d, _
	tolerance As Tolerance _
) As PointOnCurve2d
public:
PointOnCurve2d^ GetClosestPointTo(
	Point2d point,
	Tolerance tolerance
)
 Parameters
point(Point2d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)