Reference Library
UnloadPartialMenu Method (szMenuFileName)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »UnloadPartialMenu(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool UnloadPartialMenu(
	string szMenuFileName
)
Public Shared Function UnloadPartialMenu ( _
	szMenuFileName As String _
) As Boolean
public:
static bool UnloadPartialMenu(
	String^ szMenuFileName
)
 Parameters
szMenuFileName(String)
Assembly: ZwManaged (Module: ZwManaged)