Reference Library
NumberOfVertices Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Mline »NumberOfVertices
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumberOfVertices { get; }
Public ReadOnly Property NumberOfVertices As Integer
	Get
public:
property int NumberOfVertices {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)