Reference Library
PaletteSetSizeEventArgs Constructor (cx, cy, dx, dy)
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSetSizeEventArgs »PaletteSetSizeEventArgs(Int32, Int32, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PaletteSetSizeEventArgs(
	int cx,
	int cy,
	double dx,
	double dy
)
Public Sub New ( _
	cx As Integer, _
	cy As Integer, _
	dx As Double, _
	dy As Double _
)
public:
PaletteSetSizeEventArgs(
	int cx,
	int cy,
	double dx,
	double dy
)
 Parameters
cx(Int32)
cy(Int32)
dx(Double)
dy(Double)
Assembly: ZwManaged (Module: ZwManaged)