Reference Library
GetSelection Method (options)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »GetSelection(PromptSelectionOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptSelectionResult GetSelection(
	PromptSelectionOptions options
)
Public Function GetSelection ( _
	options As PromptSelectionOptions _
) As PromptSelectionResult
public:
PromptSelectionResult^ GetSelection(
	PromptSelectionOptions^ options
)
 Parameters
options(PromptSelectionOptions)
Assembly: ZwManaged (Module: ZwManaged)