Reference Library
CrossingOrWindowSelectedObject Constructor (id, method, gsMarker)
Namespaces »ZwSoft.ZwCAD.EditorInput »CrossingOrWindowSelectedObject »CrossingOrWindowSelectedObject(ObjectId, SelectionMethod, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use overload taking System::IntPtr instead.")]
public CrossingOrWindowSelectedObject(
	ObjectId id,
	SelectionMethod method,
	int gsMarker
)
<ObsoleteAttribute("Use overload taking System::IntPtr instead.")> _
Public Sub New ( _
	id As ObjectId, _
	method As SelectionMethod, _
	gsMarker As Integer _
)
[ObsoleteAttribute(L"Use overload taking System::IntPtr instead.")]
public:
CrossingOrWindowSelectedObject(
	ObjectId id,
	SelectionMethod method,
	int gsMarker
)
 Parameters
id(ObjectId)
method(SelectionMethod)
gsMarker(Int32)
Assembly: ZwManaged (Module: ZwManaged)