Reference Library
Set Method (basePoint, dir1, dir2, dir3)
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock3d »Set(Point3d, Vector3d, Vector3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	Point3d basePoint,
	Vector3d dir1,
	Vector3d dir2,
	Vector3d dir3
)
Public Sub Set ( _
	basePoint As Point3d, _
	dir1 As Vector3d, _
	dir2 As Vector3d, _
	dir3 As Vector3d _
)
public:
void Set(
	Point3d basePoint,
	Vector3d dir1,
	Vector3d dir2,
	Vector3d dir3
)
 Parameters
basePoint(Point3d)
dir1(Vector3d)
dir2(Vector3d)
dir3(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)