Reference Library
Item Property ()
Namespaces »ZwSoft.ZwCAD.Geometry »KnotCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public double this[
	int
] { get; set; }
Public Default Property Item ( _
	 As Integer _
) As Double
	Get
	Set
public:
property double default[int ] {
	double get (int );
	void set (int , double value);
}
 Parameters
(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)