Reference Library
GradientBackground Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GradientBackground »GradientBackground()
 Members
Icon | Member | Description
GradientBackground()
GradientBackground(IntPtr, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)