Reference Library
Add Method (v)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2d »Add(Vector2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector2d Add(
	Vector2d v
)
Public Function Add ( _
	v As Vector2d _
) As Vector2d
public:
Vector2d Add(
	Vector2d v
)
 Parameters
v(Vector2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)