Reference Library
CreateLoftedSolid Method (crossSectionCurves, guideCurves, pathCurve, loftOptions)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »CreateLoftedSolid(Entity[], Entity[], Entity, LoftOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void CreateLoftedSolid(
	Entity[] crossSectionCurves,
	Entity[] guideCurves,
	Entity pathCurve,
	LoftOptions loftOptions
)
Public Overridable Sub CreateLoftedSolid ( _
	crossSectionCurves As Entity(), _
	guideCurves As Entity(), _
	pathCurve As Entity, _
	loftOptions As LoftOptions _
)
public:
virtual void CreateLoftedSolid(
	array<Entity^>^ crossSectionCurves,
	array<Entity^>^ guideCurves,
	Entity^ pathCurve,
	LoftOptions^ loftOptions
)
 Parameters
crossSectionCurves(Entity[])
guideCurves(Entity[])
pathCurve(Entity)
loftOptions(LoftOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)