Reference Library
NumControlPoints Property
Namespaces »ZwSoft.ZwCAD.Geometry »SplineEntity2d »NumControlPoints
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumControlPoints { get; }
Public ReadOnly Property NumControlPoints As Integer
	Get
public:
property int NumControlPoints {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)