Reference Library
KeyAt Method (id)
Namespaces »ZwSoft.ZwCAD.Runtime »Dictionary »KeyAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string KeyAt(
	int id
)
Public Overridable Function KeyAt ( _
	id As Integer _
) As String
public:
virtual String^ KeyAt(
	int id
)
 Parameters
id(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)