Reference Library
IsBoundedAbove Property
Namespaces »ZwSoft.ZwCAD.Geometry »Interval »IsBoundedAbove
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsBoundedAbove { get; }
Public ReadOnly Property IsBoundedAbove As Boolean
	Get
public:
property bool IsBoundedAbove {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)