Reference Library
IsPerViewport Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripData »IsPerViewport
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPerViewport { get; set; }
Public Property IsPerViewport As Boolean
	Get
	Set
public:
property bool IsPerViewport {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)