Reference Library
XrefPreXrefLockFileEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefPreXrefLockFileEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void XrefPreXrefLockFileEventHandler(
	Object sender,
	XrefPreXrefLockFileEventArgs e
)
Public Delegate Sub XrefPreXrefLockFileEventHandler ( _
	sender As Object, _
	e As XrefPreXrefLockFileEventArgs _
)
public delegate void XrefPreXrefLockFileEventHandler(
	Object^ sender,
	XrefPreXrefLockFileEventArgs^ e
)
 Parameters
sender(Object)
e(XrefPreXrefLockFileEventArgs)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)