Reference Library
GetIntersectionRanges Method
Namespaces »ZwSoft.ZwCAD.Geometry »CurveCurveIntersector2d »GetIntersectionRanges()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Interval[] GetIntersectionRanges()
Public Function GetIntersectionRanges As Interval()
public:
array<Interval^>^ GetIntersectionRanges()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)