Reference Library
GroupName Property
Namespaces »ZwSoft.ZwCAD.Runtime »CommandMethodAttribute »GroupName
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string GroupName { get; }
Public Overridable ReadOnly Property GroupName As String
	Get
public:
virtual property String^ GroupName {
	String^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)