Reference Library
ShowPlotStyles Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettings »ShowPlotStyles
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool ShowPlotStyles { get; set; }
Public Property ShowPlotStyles As Boolean
	Get
	Set
public:
property bool ShowPlotStyles {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)