Reference Library
IsTorus Property
Namespaces »ZwSoft.ZwCAD.Geometry »ExternalBoundedSurface »IsTorus
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsTorus { get; }
Public ReadOnly Property IsTorus As Boolean
	Get
public:
property bool IsTorus {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)