Reference Library
Brightness Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »DisplayStyle »Brightness
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Brightness { get; set; }
Public Property Brightness As Double
	Get
	Set
public:
property double Brightness {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)