Reference Library
GetDataLink Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataLinkManager »GetDataLink()
 Members
Icon | Member | Description
GetDataLink(String)
GetDataLink()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)