Reference Library
ProductKey Property
Namespaces »ZwSoft.ZwCAD.Runtime »DynamicLinker »ProductKey
 Declaration Syntax
C# | Visual Basic | Visual C++
public string ProductKey { get; }
Public ReadOnly Property ProductKey As String
	Get
public:
property String^ ProductKey {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)