Reference Library
IsModifiedForRecompute Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »IsModifiedForRecompute
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsModifiedForRecompute { get; }
Public ReadOnly Property IsModifiedForRecompute As Boolean
	Get
public:
property bool IsModifiedForRecompute {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)