Reference Library
IsDegenerate Method
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve3d »IsDegenerate()
 Members
Icon | Member | Description
IsDegenerate(Entity3d, Tolerance)
IsDegenerate(Entity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)