Reference Library
Dimltex1 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimltex1
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId Dimltex1 { get; set; }
Public Overridable Property Dimltex1 As ObjectId
	Get
	Set
public:
virtual property ObjectId Dimltex1 {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)