Reference Library
FileName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DatabaseIOEventArgs »FileName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string FileName { get; }
Public ReadOnly Property FileName As String
	Get
public:
property String^ FileName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)