Reference Library
SetStdScale Method (plotSet, standardScale)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsValidator »SetStdScale(PlotSettings, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetStdScale(
	PlotSettings plotSet,
	double standardScale
)
Public Sub SetStdScale ( _
	plotSet As PlotSettings, _
	standardScale As Double _
)
public:
void SetStdScale(
	PlotSettings^ plotSet,
	double standardScale
)
 Parameters
plotSet(PlotSettings)
standardScale(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)