Reference Library
Clear Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicDimensionDataCollection »Clear()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Clear()
Public Sub Clear
public:
void Clear()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)