Reference Library
Leader1Point Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ArcDimension »Leader1Point
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d Leader1Point { get; set; }
Public Property Leader1Point As Point3d
	Get
	Set
public:
property Point3d Leader1Point {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)