Reference Library
IList_Insert Method (index, value)
Namespaces »ZwSoft.ZwCAD.Geometry »Point2dCollection »IList.Insert(Int32, Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
void IList.Insert(
	int index,
	Object value
)
Private Sub IList_Insert ( _
	index As Integer, _
	value As Object _
) Implements IList.Insert
private:
virtual void IList_Insert(
	int index,
	Object^ value
) sealed = IList::Insert
 Parameters
index(Int32)
value(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)