Reference Library
CopyTo Method (array, index)
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerFilterCollection »CopyTo(LayerFilter[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	LayerFilter[] array,
	int index
)
Public Sub CopyTo ( _
	array As LayerFilter(), _
	index As Integer _
)
public:
void CopyTo(
	array<LayerFilter^>^ array,
	int index
)
 Parameters
array(LayerFilter[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)