Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public TableEnumerator GetEnumerator()
Public Function GetEnumerator As TableEnumerator
public:
TableEnumerator^ GetEnumerator()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)