Reference Library
GetDimensionStyleChildId Method (classDescriptor, parentStyle)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »GetDimensionStyleChildId(RXClass, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId GetDimensionStyleChildId(
	RXClass classDescriptor,
	ObjectId parentStyle
)
Public Function GetDimensionStyleChildId ( _
	classDescriptor As RXClass, _
	parentStyle As ObjectId _
) As ObjectId
public:
ObjectId GetDimensionStyleChildId(
	RXClass^ classDescriptor,
	ObjectId parentStyle
)
 Parameters
classDescriptor(RXClass)
parentStyle(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)