Reference Library
Dimtxt Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »Dimtxt
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double Dimtxt { get; set; }
Public Overridable Property Dimtxt As Double
	Get
	Set
public:
virtual property double Dimtxt {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)