Reference Library
LayerFilterCollection Class
Namespaces »ZwSoft.ZwCAD.LayerManager »LayerFilterCollection
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcArray<AcLyLayerFilter*>")]
public sealed class LayerFilterCollection : ICollection
<WrapperAttribute("AcArray<AcLyLayerFilter*>")> _
Public NotInheritable Class LayerFilterCollection _
	Implements ICollection
[WrapperAttribute(L"AcArray<AcLyLayerFilter*>")]
public ref class LayerFilterCollection sealed : ICollection
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Add(LayerFilter)
Clear()
Contains(LayerFilter)
CopyTo(LayerFilter[], Int32)
Count
GetEnumerator()
ICollection.CopyTo(Array, Int32)
ICollection.IsSynchronized
Item[Int32]
Remove(LayerFilter)
ICollection.SyncRoot
 Inheritance Hierarchy
Object
LayerFilterCollection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)