Reference Library
ShowDwfOptionsDialog Method (dsdData, plotConfig, optionsDialogTitle)
Namespaces »ZwSoft.ZwCAD.Publishing »Publisher »ShowDwfOptionsDialog(DsdData, PlotConfig, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public OptionsDialogResult ShowDwfOptionsDialog(
	DsdData dsdData,
	PlotConfig plotConfig,
	string optionsDialogTitle
)
Public Function ShowDwfOptionsDialog ( _
	dsdData As DsdData, _
	plotConfig As PlotConfig, _
	optionsDialogTitle As String _
) As OptionsDialogResult
public:
OptionsDialogResult ShowDwfOptionsDialog(
	DsdData^ dsdData,
	PlotConfig^ plotConfig,
	String^ optionsDialogTitle
)
 Parameters
dsdData(DsdData)
plotConfig(PlotConfig)
optionsDialogTitle(String)
Assembly: ZwManaged (Module: ZwManaged)