Reference Library
NewId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutCopiedEventArgs »NewId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId NewId { get; }
Public ReadOnly Property NewId As ObjectId
	Get
public:
property ObjectId NewId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)