Reference Library
CopyFromUnmanagedObject Method (unmanagedPointer)
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfig »CopyFromUnmanagedObject(IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static PlotConfig CopyFromUnmanagedObject(
	IntPtr unmanagedPointer
)
Public Shared Function CopyFromUnmanagedObject ( _
	unmanagedPointer As IntPtr _
) As PlotConfig
public:
static PlotConfig^ CopyFromUnmanagedObject(
	IntPtr unmanagedPointer
)
 Parameters
unmanagedPointer(IntPtr)
Assembly: ZwManaged (Module: ZwManaged)