Reference Library
SectionHitTestInfo Structure
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionHitTestInfo
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct SectionHitTestInfo
Public Structure SectionHitTestInfo
public value class SectionHitTestInfo
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Index
PtOnSegment
SubItem
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)