Reference Library
FrontClipEnabled Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AbstractViewTableRecord »FrontClipEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool FrontClipEnabled { get; set; }
Public Property FrontClipEnabled As Boolean
	Get
	Set
public:
property bool FrontClipEnabled {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)