Reference Library
IsPeriodic Method (period)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »IsPeriodic(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPeriodic(
	out double period
)
Public Function IsPeriodic ( _
	<OutAttribute> ByRef period As Double _
) As Boolean
public:
bool IsPeriodic(
	[OutAttribute] double% period
)
 Parameters
period(Double%)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)