Reference Library
SetViewDirection Method (view)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AbstractViewTableRecord »SetViewDirection(OrthographicView)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetViewDirection(
	OrthographicView view
)
Public Sub SetViewDirection ( _
	view As OrthographicView _
)
public:
void SetViewDirection(
	OrthographicView view
)
 Parameters
view(OrthographicView)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)