Reference Library
IsBox Property
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock3d »IsBox
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsBox { get; set; }
Public Property IsBox As Boolean
	Get
	Set
public:
property bool IsBox {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)