Reference Library
CopyTo Method (a, index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AttributeCollection »ICollection.CopyTo(Array, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
void ICollection.CopyTo(
	Array a,
	int index
)
Private Sub CopyTo ( _
	a As Array, _
	index As Integer _
) Implements ICollection.CopyTo
private:
virtual void CopyTo(
	Array^ a,
	int index
) sealed = ICollection::CopyTo
 Parameters
a(Array)
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)