Reference Library
IsVisible Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »IsVisible
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsVisible { get; }
Public ReadOnly Property IsVisible As Boolean
	Get
public:
property bool IsVisible {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)