Reference Library
Kind Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObjectReference »Kind
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Kind { get; }
Public ReadOnly Property Kind As Integer
	Get
public:
property int Kind {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)