Reference Library
GetScale Method
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2d »GetScale()
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetScale()
Public Function GetScale As Double
public:
double GetScale()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)