Reference Library
GridVisibility Method (gridLineType, rowType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableStyle »GridVisibility(GridLineType, RowType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool GridVisibility(
	GridLineType gridLineType,
	RowType rowType
)
Public Overridable Function GridVisibility ( _
	gridLineType As GridLineType, _
	rowType As RowType _
) As Boolean
public:
virtual bool GridVisibility(
	GridLineType gridLineType,
	RowType rowType
)
 Parameters
gridLineType(GridLineType)
rowType(RowType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)