Reference Library
Ids Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ProxyResurrectionCompletedEventArgs »Ids
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectIdCollection Ids { get; }
Public ReadOnly Property Ids As ObjectIdCollection
	Get
public:
property ObjectIdCollection^ Ids {
	ObjectIdCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)