Reference Library
SetCurrentStyleSheet Method (plotSet, styleSheetName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsValidator »SetCurrentStyleSheet(PlotSettings, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetCurrentStyleSheet(
	PlotSettings plotSet,
	string styleSheetName
)
Public Sub SetCurrentStyleSheet ( _
	plotSet As PlotSettings, _
	styleSheetName As String _
)
public:
void SetCurrentStyleSheet(
	PlotSettings^ plotSet,
	String^ styleSheetName
)
 Parameters
plotSet(PlotSettings)
styleSheetName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)