Reference Library
GetTextString Method (formatOption)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellContent »GetTextString(FormatOption)
 Declaration Syntax
C# | Visual Basic | Visual C++
public string GetTextString(
	FormatOption formatOption
)
Public Function GetTextString ( _
	formatOption As FormatOption _
) As String
public:
String^ GetTextString(
	FormatOption formatOption
)
 Parameters
formatOption(FormatOption)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)