Reference Library
ExtensionApplicationAttribute Constructor (entryPointType)
Namespaces »ZwSoft.ZwCAD.Runtime »ExtensionApplicationAttribute »ExtensionApplicationAttribute(Type)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ExtensionApplicationAttribute(
	Type entryPointType
)
Public Sub New ( _
	entryPointType As Type _
)
public:
ExtensionApplicationAttribute(
	Type^ entryPointType
)
 Parameters
entryPointType(Type)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)