Reference Library
Close Method
Namespaces »ZwSoft.ZwCAD.Windows »Window »Close()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Close()
Public Sub Close
public:
void Close()
Assembly: ZwManaged (Module: ZwManaged)