Reference Library
TileSize Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraits »TileSize
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract int TileSize { get; set; }
Public MustOverride Property TileSize As Integer
	Get
	Set
public:
virtual property int TileSize {
	int get () abstract;
	void set (int value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)