Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataTypeParameter »Equality(DataTypeParameter, DataTypeParameter)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	DataTypeParameter t1,
	DataTypeParameter t2
)
Public Shared Operator = ( _
	t1 As DataTypeParameter, _
	t2 As DataTypeParameter _
) As Boolean
public:
static bool operator ==(
	DataTypeParameter t1,
	DataTypeParameter t2
)
 Parameters
t1(DataTypeParameter)
t2(DataTypeParameter)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)