Reference Library
PromptedForKeyword Event
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »PromptedForKeyword
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PromptStringResultEventHandler PromptedForKeyword
Public Event PromptedForKeyword As PromptStringResultEventHandler
public:
 event PromptStringResultEventHandler^ PromptedForKeyword {
	void add (PromptStringResultEventHandler^ value);
	void remove (PromptStringResultEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)