Reference Library
AcquireDistance Method (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »JigPrompts »AcquireDistance(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDoubleResult AcquireDistance(
	string message
)
Public Function AcquireDistance ( _
	message As String _
) As PromptDoubleResult
public:
PromptDoubleResult^ AcquireDistance(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)