Reference Library
Prepend Method (ids)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »Prepend(ObjectIdCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Prepend(
	ObjectIdCollection ids
)
Public Sub Prepend ( _
	ids As ObjectIdCollection _
)
public:
void Prepend(
	ObjectIdCollection^ ids
)
 Parameters
ids(ObjectIdCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)