Reference Library
GsToBeUnloadedEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »GsToBeUnloadedEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void GsToBeUnloadedEventHandler(
	Object sender,
	EventArgs e
)
Public Delegate Sub GsToBeUnloadedEventHandler ( _
	sender As Object, _
	e As EventArgs _
)
public delegate void GsToBeUnloadedEventHandler(
	Object^ sender,
	EventArgs^ e
)
 Parameters
sender(Object)
e(EventArgs)
Assembly: ZwManaged (Module: ZwManaged)