Reference Library
IsDegenerate Method
Namespaces »ZwSoft.ZwCAD.Geometry »LineSegment2d »IsDegenerate()
 Members
Icon | Member | Description
IsDegenerate(Entity2d, Tolerance)
IsDegenerate(Entity2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)