Reference Library
ViewportTableRecord Constructor (obj, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewportTableRecord »ViewportTableRecord(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal ViewportTableRecord(
	IntPtr obj,
	bool autoDelete
)
Protected Friend Sub New ( _
	obj As IntPtr, _
	autoDelete As Boolean _
)
protected public:
ViewportTableRecord(
	IntPtr obj,
	bool autoDelete
)
 Parameters
obj(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)