Reference Library
Xline Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Xline »Xline()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Xline()
Public Sub New
public:
Xline()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)