Reference Library
OffsetDistance Property
Namespaces »ZwSoft.ZwCAD.Geometry »OffsetCurve3d »OffsetDistance
 Declaration Syntax
C# | Visual Basic | Visual C++
public double OffsetDistance { get; set; }
Public Property OffsetDistance As Double
	Get
	Set
public:
property double OffsetDistance {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)