Reference Library
IsReadOnly Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »IsReadOnly
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsReadOnly { get; }
Public ReadOnly Property IsReadOnly As Boolean
	Get
public:
property bool IsReadOnly {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)