Reference Library
Contains Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataCellCollection »Contains(DataCell)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Contains(
	DataCell value
)
Public Function Contains ( _
	value As DataCell _
) As Boolean
public:
bool Contains(
	DataCell^ value
)
 Parameters
value(DataCell)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)