Reference Library
PromptForEntityEnding Event
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »PromptForEntityEnding
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PromptForEntityEndingEventHandler PromptForEntityEnding
Public Event PromptForEntityEnding As PromptForEntityEndingEventHandler
public:
 event PromptForEntityEndingEventHandler^ PromptForEntityEnding {
	void add (PromptForEntityEndingEventHandler^ value);
	void remove (PromptForEntityEndingEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)