Reference Library
GetMerge Method (otherInterval)
Namespaces »ZwSoft.ZwCAD.Geometry »Interval »GetMerge(Interval)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Interval GetMerge(
	Interval otherInterval
)
Public Function GetMerge ( _
	otherInterval As Interval _
) As Interval
public:
Interval^ GetMerge(
	Interval^ otherInterval
)
 Parameters
otherInterval(Interval)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)