Reference Library
SunId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »SunId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId SunId { get; }
Public ReadOnly Property SunId As ObjectId
	Get
public:
property ObjectId SunId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)