Reference Library
Point3AngularDimension Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Point3AngularDimension
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDb3PointAngularDimension")]
public class Point3AngularDimension : Dimension
<WrapperAttribute("AcDb3PointAngularDimension")> _
Public Class Point3AngularDimension _
	Inherits Dimension
[WrapperAttribute(L"AcDb3PointAngularDimension")]
public ref class Point3AngularDimension : public Dimension
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Point3AngularDimension(Point3d, Point3d, Point3d, Point3d, String, ObjectId)
Point3AngularDimension(IntPtr, Boolean)
Point3AngularDimension()
ArcPoint
CenterPoint
XLine1Point
XLine2Point
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Dimension
|  |  |  |  |  |  | Point3AngularDimension
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)