Reference Library
GetCorner Method (options)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »GetCorner(PromptCornerOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptPointResult GetCorner(
	PromptCornerOptions options
)
Public Function GetCorner ( _
	options As PromptCornerOptions _
) As PromptPointResult
public:
PromptPointResult^ GetCorner(
	PromptCornerOptions^ options
)
 Parameters
options(PromptCornerOptions)
Assembly: ZwManaged (Module: ZwManaged)