Reference Library
DwgFiler Constructor (unmanagedPointer, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »DwgFiler(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected DwgFiler(
	IntPtr unmanagedPointer,
	bool autoDelete
)
Protected Sub New ( _
	unmanagedPointer As IntPtr, _
	autoDelete As Boolean _
)
protected:
DwgFiler(
	IntPtr unmanagedPointer,
	bool autoDelete
)
 Parameters
unmanagedPointer(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)