Reference Library
GetGsView Method (viewportNumber, createIfNone)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Manager »GetGsView(Int32, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public View GetGsView(
	int viewportNumber,
	bool createIfNone
)
Public Function GetGsView ( _
	viewportNumber As Integer, _
	createIfNone As Boolean _
) As View
public:
View^ GetGsView(
	int viewportNumber,
	bool createIfNone
)
 Parameters
viewportNumber(Int32)
createIfNone(Boolean)
Assembly: ZwManaged (Module: ZwManaged)