Reference Library
PolylineEye Method (points)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ViewportGeometry »PolylineEye(Point3dCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool PolylineEye(
	Point3dCollection points
)
Public MustOverride Function PolylineEye ( _
	points As Point3dCollection _
) As Boolean
public:
virtual bool PolylineEye(
	Point3dCollection^ points
) abstract
 Parameters
points(Point3dCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)