Reference Library
SetGripStatus Method (status)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »SetGripStatus(GripStatus)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetGripStatus(
	GripStatus status
)
Public Overridable Sub SetGripStatus ( _
	status As GripStatus _
)
public:
virtual void SetGripStatus(
	GripStatus status
)
 Parameters
status(GripStatus)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)