Reference Library
XrefRedirectedEventArgs Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefRedirectedEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class XrefRedirectedEventArgs : EventArgs
Public NotInheritable Class XrefRedirectedEventArgs _
	Inherits EventArgs
public ref class XrefRedirectedEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
NewId
OldId
 Inheritance Hierarchy
Object
EventArgs
| XrefRedirectedEventArgs
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)