Reference Library
AllOpen Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LoftOptionsCheckCurvesOut »AllOpen
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool AllOpen { get; }
Public ReadOnly Property AllOpen As Boolean
	Get
public:
property bool AllOpen {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)