Reference Library
SetDataLink Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »SetDataLink()
 Members
Icon | Member | Description
SetDataLink(Int32, Int32, ObjectId, Boolean)
SetDataLink(CellRange, ObjectId, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)