Reference Library
AuditXData Method (info)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »AuditXData(AuditInfo)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AuditXData(
	AuditInfo info
)
Public Sub AuditXData ( _
	info As AuditInfo _
)
public:
void AuditXData(
	AuditInfo^ info
)
 Parameters
info(AuditInfo)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)