Reference Library
Wipeout Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Wipeout »Wipeout()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Wipeout()
Public Sub New
public:
Wipeout()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)