Reference Library
Icon Property
Namespaces »ZwSoft.ZwCAD.Windows »MenuItem »Icon
 Declaration Syntax
C# | Visual Basic | Visual C++
public Icon Icon { get; set; }
Public Property Icon As Icon
	Get
	Set
public:
property Icon^ Icon {
	Icon^ get ();
	void set (Icon^ value);
}
Assembly: ZwManaged (Module: ZwManaged)