Reference Library
IsCloned Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »IdPair »IsCloned
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsCloned { get; }
Public ReadOnly Property IsCloned As Boolean
	Get
public:
property bool IsCloned {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)