Reference Library
Background Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AbstractViewTableRecord »Background
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Background { get; set; }
Public Property Background As ObjectId
	Get
	Set
public:
property ObjectId Background {
	ObjectId get ();
	void set (ObjectId value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)