Reference Library
IsDegenerate Method (result, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »IsDegenerate(Entity2d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsDegenerate(
	out Entity2d result,
	Tolerance tolerance
)
Public Function IsDegenerate ( _
	<OutAttribute> ByRef result As Entity2d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsDegenerate(
	[OutAttribute] Entity2d^% result,
	Tolerance tolerance
)
 Parameters
result(Entity2d%)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)