Reference Library
Subtraction Operator
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »Subtraction(Point2d, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Vector2d operator -(
	Point2d a,
	Point2d b
)
Public Shared Operator - ( _
	a As Point2d, _
	b As Point2d _
) As Vector2d
public:
static Vector2d operator -(
	Point2d a,
	Point2d b
)
 Parameters
a(Point2d)
b(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)