Reference Library
Contains Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObjectReferenceCollection »Contains(DBObjectReference)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Contains(
	DBObjectReference value
)
Public Function Contains ( _
	value As DBObjectReference _
) As Boolean
public:
bool Contains(
	DBObjectReference value
)
 Parameters
value(DBObjectReference)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)