Reference Library
ReadVector3d Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »ReadVector3d()
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Vector3d ReadVector3d()
Public MustOverride Function ReadVector3d As Vector3d
public:
virtual Vector3d ReadVector3d() abstract
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)