Reference Library
Table Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbTable")]
public class Table : BlockReference
<WrapperAttribute("ZcDbTable")> _
Public Class Table _
	Inherits BlockReference
[WrapperAttribute(L"ZcDbTable")]
public ref class Table : public BlockReference
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Table(IntPtr, Boolean)
Table()
Alignment(Int32, Int32)
Alignment(RowType)
AttachmentPoint(Int32, Int32)
BackgroundColor(Int32, Int32)
BackgroundColor(RowType)
BlockRotation(Int32, Int32)
BlockScale(Int32, Int32)
BlockTableRecordId(Int32, Int32)
BreakEnabled
BreakFlowDirection
BreakOptions
CanDeleteColumns(Int32, Int32)
CanDeleteRows(Int32, Int32)
CanInsertColumn(Int32)
CanInsertRow(Int32)
Cells
CellStyleOverrides(Int32, Int32)
CellType(Int32, Int32)
ClearSubSelection()
ClearTableStyleOverrides(Int32)
Columns
ColumnWidth(Int32)
ContentColor(Int32, Int32)
ContentColor(RowType)
CopyFrom(CellRange, Table, TableCopyOptions, CellRange, CellRange)
CopyFrom(CellRange, LinkedTableData, TableCopyOptions, CellRange, CellRange)
CopyFrom(LinkedTableData, TableCopyOptions)
CreateContent(Int32, Int32, Int32)
DataType(Int32, Int32)
DataType(RowType)
DeleteCellContent(Int32, Int32)
DeleteColumns(Int32, Int32)
DeleteContent(Int32, Int32, Int32)
DeleteContent(Int32, Int32)
DeleteContent(CellRange)
DeleteRows(Int32, Int32)
Direction
FieldId(Int32, Int32)
Fill(CellRange, CellRange, TableFillOptions)
FlowDirection
Format(Int32, Int32)
Format(RowType)
GenerateLayout()
GetBlockAttributeValue(Int32, Int32, Int32, ObjectId)
GetBlockAttributeValue(Int32, Int32, ObjectId)
GetBlockTableRecordId(Int32, Int32, Int32)
GetBreakHeight(Int32)
GetBreakOffset(Int32)
GetBreakSpacing()
GetCellExtents(Int32, Int32, Boolean, Point3dCollection)
GetCellState(Int32, Int32)
GetCellStyle(Int32, Int32)
GetColumnName(Int32)
GetContentColor(Int32, Int32, Int32)
GetContentLayout(Int32, Int32)
GetContentTypes(Int32, Int32, Int32)
GetContentTypes(Int32, Int32)
GetCustomData(Int32, Int32, String)
GetCustomData(Int32, Int32)
GetDataFormat(Int32, Int32, Int32)
GetDataFormat(Int32, Int32)
GetDataLink(Int32, Int32)
GetDataLink(CellRange)
GetDataLink()
GetDataLinkRange(Int32, Int32)
GetDataType(Int32, Int32, Int32)
GetFieldId(Int32, Int32, Int32)
GetFormula(Int32, Int32, Int32)
GetGridColor(Int32, Int32, GridLineType)
GetGridDoubleLineSpacing(Int32, Int32, GridLineType)
GetGridLineStyle(Int32, Int32, GridLineType)
GetGridLinetype(Int32, Int32, GridLineType)
GetGridLineWeight(Int32, Int32, GridLineType)
GetGridProperty(Int32, Int32, GridLineType)
GetGridVisibility(Int32, Int32, GridLineType)
GetIsAutoScale(Int32, Int32, Int32)
GetMargin(Int32, Int32, CellMargins)
GetMergeAllEnabled(Int32, Int32)
GetMergeRange(Int32, Int32)
GetNumberOfContents(Int32, Int32)
GetOverrides(Int32, Int32, Int32)
GetOverrides(Int32, Int32, GridLineType)
GetRotation(Int32, Int32, Int32)
GetScale(Int32, Int32, Int32)
GetTextHeight(Int32, Int32, Int32)
GetTextString(Int32, Int32, Int32, FormatOption)
GetTextString(Int32, Int32, Int32)
GetTextStyleId(Int32, Int32, Int32)
GetToolTip(Int32, Int32)
GetValue(Int32, Int32, Int32, FormatOption)
GetValue(Int32, Int32, Int32)
GridColor(Int32, Int32, CellEdgeMasks)
GridColor(GridLineType, RowType)
GridLineWeight(Int32, Int32, CellEdgeMasks)
GridLineWeight(GridLineType, RowType)
GridVisibility(Int32, Int32, CellEdgeMasks)
GridVisibility(GridLineType, RowType)
HasFormula(Int32, Int32, Int32)
HasSubSelection
Height
HitTest(Point3d, Vector3d)
HorizontalCellMargin
InsertColumns(Int32, Double, Int32)
InsertColumnsAndInherit(Int32, Int32, Int32)
InsertRows(Int32, Double, Int32)
InsertRowsAndInherit(Int32, Int32, Int32)
IsAutoScale(Int32, Int32)
IsBackgroundColorNone(Int32, Int32)
IsBackgroundColorNone(RowType)
IsContentEditable(Int32, Int32)
IsEmpty(Int32, Int32)
IsFormatEditable(Int32, Int32)
IsHeaderSuppressed |  Obsolete.
IsLinked(Int32, Int32)
IsMergedCell(Int32, Int32, CellRange)
IsTitleSuppressed |  Obsolete.
MergeCells(CellRange)
MinimumColumnWidth(Int32)
MinimumRowHeight(Int32)
MinimumTableHeight
MinimumTableWidth
MoveContent(Int32, Int32, Int32, Int32)
NumColumns |  Obsolete.
NumRows |  Obsolete.
RecomputeTableBlock(Boolean)
RemoveAllOverrides(Int32, Int32)
RemoveDataLink(Int32, Int32)
RemoveDataLink()
ReselectSubRegion(FullSubentityPath[])
ResetValue(Int32, Int32)
RowHeight(Int32)
Rows
RowType(Int32)
Select(Point3d, Vector3d, Vector3d, Boolean, Boolean, FullSubentityPath[])
SelectSubRegion(Point3d, Point3d, Vector3d, Vector3d, SelectType, Boolean, Boolean, FullSubentityPath[])
SetAlignment(Int32, Int32, CellAlignment)
SetAlignment(CellAlignment, Int32)
SetAutoScale(Int32, Int32, Boolean)
SetBackgroundColor(Int32, Int32, Color)
SetBackgroundColor(Color, Int32)
SetBackgroundColorNone(Int32, Int32, Boolean)
SetBackgroundColorNone(Boolean, Int32)
SetBlockAttributeValue(Int32, Int32, Int32, ObjectId, String)
SetBlockAttributeValue(Int32, Int32, ObjectId, String)
SetBlockRotation(Int32, Int32, Double)
SetBlockScale(Int32, Int32, Double)
SetBlockTableRecordId(Int32, Int32, Int32, ObjectId, Boolean)
SetBlockTableRecordId(Int32, Int32, ObjectId, Boolean)
SetBreakHeight(Int32, Double)
SetBreakOffset(Int32, Vector3d)
SetBreakSpacing(Double)
SetCellState(Int32, Int32, CellStates)
SetCellStyle(Int32, Int32, String)
SetCellType(Int32, Int32, TableCellType)
SetColumnName(Int32, String)
SetColumnWidth(Int32, Double)
SetColumnWidth(Double)
SetContentColor(Int32, Int32, Int32, Color)
SetContentColor(Int32, Int32, Color)
SetContentColor(Color, Int32)
SetContentLayout(Int32, Int32, CellContentLayout)
SetCustomData(Int32, Int32, String, Object)
SetCustomData(Int32, Int32, Int32)
SetDataFormat(Int32, Int32, Int32, String)
SetDataFormat(Int32, Int32, String)
SetDataLink(Int32, Int32, ObjectId, Boolean)
SetDataLink(CellRange, ObjectId, Boolean)
SetDataType(Int32, Int32, Int32, DataTypeParameter)
SetDataType(Int32, Int32, DataType, UnitType)
SetDataType(DataType, UnitType, Int32)
SetFieldId(Int32, Int32, Int32, ObjectId, CellOption)
SetFieldId(Int32, Int32, ObjectId)
SetFormat(Int32, Int32, String)
SetFormat(String, Int32)
SetFormula(Int32, Int32, Int32, String)
SetGridColor(Int32, Int32, Int16, Color)
SetGridColor(Int32, Int32, GridLineType, Color)
SetGridColor(Color, Int32, Int32)
SetGridDoubleLineSpacing(Int32, Int32, GridLineType, Double)
SetGridLineStyle(Int32, Int32, GridLineType, GridLineStyle)
SetGridLinetype(Int32, Int32, GridLineType, ObjectId)
SetGridLineWeight(Int32, Int32, Int16, LineWeight)
SetGridLineWeight(Int32, Int32, GridLineType, LineWeight)
SetGridLineWeight(LineWeight, Int32, Int32)
SetGridProperty(Int32, Int32, GridLineType, GridPropertyParameter)
SetGridProperty(CellRange, GridLineType, GridPropertyParameter)
SetGridVisibility(Int32, Int32, Int16, Boolean)
SetGridVisibility(Int32, Int32, GridLineType, Visibility)
SetGridVisibility(Boolean, Int32, Int32)
SetIsAutoScale(Int32, Int32, Int32, Boolean)
SetMargin(Int32, Int32, CellMargins, Double)
SetMergeAllEnabled(Int32, Int32, Boolean)
SetOverrides(Int32, Int32, Int32, CellProperties)
SetOverrides(Int32, Int32, GridLineType, CellProperties)
SetRotation(Int32, Int32, Int32, Double)
SetRowHeight(Int32, Double)
SetRowHeight(Double)
SetScale(Int32, Int32, Int32, Double)
SetSize(Int32, Int32)
SetTextHeight(Int32, Int32, Int32, Double)
SetTextHeight(Int32, Int32, Double)
SetTextHeight(Double, Int32)
SetTextRotation(Int32, Int32, RotationAngle)
SetTextString(Int32, Int32, Int32, String)
SetTextString(Int32, Int32, String)
SetTextStyle(Int32, Int32, ObjectId)
SetTextStyle(ObjectId, Int32)
SetTextStyleId(Int32, Int32, Int32, ObjectId)
SetToolTip(Int32, Int32, String)
SetValue(Int32, Int32, Int32, String, ParseOption)
SetValue(Int32, Int32, Int32, Object, ParseOption)
SetValue(Int32, Int32, String, ParseOption)
SetValue(Int32, Int32, Int32, Object)
SetValue(Int32, Int32, Object)
SubSelection
SuppressRegenerateTable(Boolean)
TableStyle
TableStyleOverrides()
TextHeight(Int32, Int32)
TextHeight(RowType)
TextRotation(Int32, Int32)
TextString(Int32, Int32, FormatOption)
TextString(Int32, Int32)
TextStringConst(Int32, Int32)
TextStyle(Int32, Int32)
TextStyle(RowType)
UnitType(Int32, Int32)
UnitType(RowType)
UnmergeCells(CellRange)
UpdateDataLink(Int32, Int32, UpdateDirection, UpdateOption)
UpdateDataLink(UpdateDirection, UpdateOption)
Value(Int32, Int32)
VerticalCellMargin
Width
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | BlockReference
|  |  |  |  |  |  | Table
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)