Reference Library
SupressStartCaps Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Mline »SupressStartCaps
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool SupressStartCaps { get; set; }
Public Property SupressStartCaps As Boolean
	Get
	Set
public:
property bool SupressStartCaps {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)