Reference Library
GetTextStyle Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »GetTextStyle(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId GetTextStyle(
	int row,
	int column
)
Public Overridable Function GetTextStyle ( _
	row As Integer, _
	column As Integer _
) As ObjectId
public:
virtual ObjectId GetTextStyle(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)