Reference Library
ShadowFlags Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »SubEntityTraits »ShadowFlags
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ShadowFlags ShadowFlags { get; set; }
Public Overridable Property ShadowFlags As ShadowFlags
	Get
	Set
public:
virtual property ShadowFlags ShadowFlags {
	ShadowFlags get ();
	void set (ShadowFlags value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)