Reference Library
Insert Method (index, value)
Namespaces »ZwSoft.ZwCAD.Geometry »Line2dCollection »Insert(Int32, Line2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Insert(
	int index,
	Line2d value
)
Public Sub Insert ( _
	index As Integer, _
	value As Line2d _
)
public:
void Insert(
	int index,
	Line2d^ value
)
 Parameters
index(Int32)
value(Line2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)