Reference Library
ArcPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LineAngularDimension2 »ArcPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d ArcPoint { get; set; }
Public Property ArcPoint As Point3d
	Get
	Set
public:
property Point3d ArcPoint {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)