Reference Library
Cecolor Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Cecolor
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color Cecolor { get; set; }
Public Property Cecolor As Color
	Get
	Set
public:
property Color^ Cecolor {
	Color^ get ();
	void set (Color^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)