Reference Library
ViewHeight Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »ViewHeight
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public double ViewHeight { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Property ViewHeight As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
property double ViewHeight {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)