Reference Library
IsFixedSize Property
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3dCollection »IsFixedSize
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool IsFixedSize { get; }
Public Overridable ReadOnly Property IsFixedSize As Boolean
	Get
public:
virtual property bool IsFixedSize {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)