Reference Library
GetMargin Method (row, column, margin)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GetMargin(Int32, Int32, CellMargins)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double GetMargin(
	int row,
	int column,
	CellMargins margin
)
Public Overridable Function GetMargin ( _
	row As Integer, _
	column As Integer, _
	margin As CellMargins _
) As Double
public:
virtual double GetMargin(
	int row,
	int column,
	CellMargins margin
)
 Parameters
row(Int32)
column(Int32)
margin(CellMargins)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)