Reference Library
Dimtoh Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimtoh
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool Dimtoh { get; set; }
Public Overridable Property Dimtoh As Boolean
	Get
	Set
public:
virtual property bool Dimtoh {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)