Reference Library
ToString Method (provider)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableHitTestInfo »ToString(IFormatProvider)
 Declaration Syntax
C# | Visual Basic | Visual C++
public string ToString(
	IFormatProvider provider
)
Public Function ToString ( _
	provider As IFormatProvider _
) As String
public:
String^ ToString(
	IFormatProvider^ provider
)
 Parameters
provider(IFormatProvider)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)