Reference Library
GetObject Method
Namespaces »ZwSoft.ZwCAD.ApplicationServices »TransactionManager »GetObject()
 Members
Icon | Member | Description
GetObject(ObjectId, OpenMode, Boolean, Boolean)
GetObject(ObjectId, OpenMode, Boolean)
GetObject(ObjectId, OpenMode)
Assembly: ZwManaged (Module: ZwManaged)