Reference Library
CopyTo Method (array, index)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3dCollection »CopyTo(Curve3d[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	Curve3d[] array,
	int index
)
Public Sub CopyTo ( _
	array As Curve3d(), _
	index As Integer _
)
public:
void CopyTo(
	array<Curve3d^>^ array,
	int index
)
 Parameters
array(Curve3d[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)