Reference Library
GetSelectionMarkers Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeData »GetSelectionMarkers()
 Declaration Syntax
C# | Visual Basic | Visual C++
public IntPtr[] GetSelectionMarkers()
Public Function GetSelectionMarkers As IntPtr()
public:
array<IntPtr>^ GetSelectionMarkers()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)