Reference Library
PolyFaceMeshVertex Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolyFaceMeshVertex »PolyFaceMeshVertex()
 Declaration Syntax
C# | Visual Basic | Visual C++
public PolyFaceMeshVertex()
Public Sub New
public:
PolyFaceMeshVertex()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)