Reference Library
SetKeys Method (keys)
Namespaces »ZwSoft.ZwCAD.Publishing »Dwf3dNavigationTreeNode »SetKeys(Int32[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetKeys(
	int[] keys
)
Public Sub SetKeys ( _
	keys As Integer() _
)
public:
void SetKeys(
	array<int>^ keys
)
 Parameters
keys(Int32[])
Assembly: ZwManaged (Module: ZwManaged)