Reference Library
CreateRevolvedSolid Method (profileEntity, faceSubEntityId, axisPoint, axisDir, angleOfRevolution, startAngle, revolveOptions)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »CreateRevolvedSolid(Entity, SubentityId, Point3d, Vector3d, Double, Double, RevolveOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void CreateRevolvedSolid(
	Entity profileEntity,
	SubentityId faceSubEntityId,
	Point3d axisPoint,
	Vector3d axisDir,
	double angleOfRevolution,
	double startAngle,
	RevolveOptions revolveOptions
)
Public Overridable Sub CreateRevolvedSolid ( _
	profileEntity As Entity, _
	faceSubEntityId As SubentityId, _
	axisPoint As Point3d, _
	axisDir As Vector3d, _
	angleOfRevolution As Double, _
	startAngle As Double, _
	revolveOptions As RevolveOptions _
)
public:
virtual void CreateRevolvedSolid(
	Entity^ profileEntity,
	SubentityId faceSubEntityId,
	Point3d axisPoint,
	Vector3d axisDir,
	double angleOfRevolution,
	double startAngle,
	RevolveOptions^ revolveOptions
)
 Parameters
profileEntity(Entity)
faceSubEntityId(SubentityId)
axisPoint(Point3d)
axisDir(Vector3d)
angleOfRevolution(Double)
startAngle(Double)
revolveOptions(RevolveOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)