Reference Library
WriteHardPointerId Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »WriteHardPointerId(ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void WriteHardPointerId(
	ObjectId value
)
Public MustOverride Sub WriteHardPointerId ( _
	value As ObjectId _
)
public:
virtual void WriteHardPointerId(
	ObjectId value
) abstract
 Parameters
value(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)