Reference Library
Point2dCollection Constructor (values)
Namespaces »ZwSoft.ZwCAD.Geometry »Point2dCollection »Point2dCollection(Point2d[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2dCollection(
	Point2d[] values
)
Public Sub New ( _
	values As Point2d() _
)
public:
Point2dCollection(
	array<Point2d>^ values
)
 Parameters
values(Point2d[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)