Reference Library
AboutToBeginBackgroundPublishingEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.Publishing »AboutToBeginBackgroundPublishingEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void AboutToBeginBackgroundPublishingEventHandler(
	Object sender,
	AboutToBeginBackgroundPublishingEventArgs e
)
Public Delegate Sub AboutToBeginBackgroundPublishingEventHandler ( _
	sender As Object, _
	e As AboutToBeginBackgroundPublishingEventArgs _
)
public delegate void AboutToBeginBackgroundPublishingEventHandler(
	Object^ sender,
	AboutToBeginBackgroundPublishingEventArgs^ e
)
 Parameters
sender(Object)
e(AboutToBeginBackgroundPublishingEventArgs)
Assembly: ZwManaged (Module: ZwManaged)