Reference Library
DimfxlenOn Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimStyleTableRecord »DimfxlenOn
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool DimfxlenOn { get; set; }
Public Overridable Property DimfxlenOn As Boolean
	Get
	Set
public:
virtual property bool DimfxlenOn {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)