Reference Library
GetDataLink Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »GetDataLink()
 Members
Icon | Member | Description
GetDataLink(Int32, Int32)
GetDataLink(CellRange)
GetDataLink()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)