Reference Library
ICollection_CopyTo Method (a, index)
Namespaces »ZwSoft.ZwCAD.Windows »TrayItemCollection »ICollection.CopyTo(Array, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
void ICollection.CopyTo(
	Array a,
	int index
)
Private Sub ICollection_CopyTo ( _
	a As Array, _
	index As Integer _
) Implements ICollection.CopyTo
private:
virtual void ICollection_CopyTo(
	Array^ a,
	int index
) sealed = ICollection::CopyTo
 Parameters
a(Array)
index(Int32)
Assembly: ZwManaged (Module: ZwManaged)