Reference Library
UnderlayDefinition Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayDefinition
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbUnderlayDefinition")]
public abstract class UnderlayDefinition : DBObject
<WrapperAttribute("AcDbUnderlayDefinition")> _
Public MustInherit Class UnderlayDefinition _
	Inherits DBObject
[WrapperAttribute(L"AcDbUnderlayDefinition")]
public ref class UnderlayDefinition abstract : public DBObject
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
UnderlayDefinition(IntPtr, Boolean)
GetDictionaryKey(Type)
Load(String)
SetUnderlayItem(String, String, UnderlayItem)
UnderlayItem
Unload()
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | UnderlayDefinition
|  |  |  |  |  | DgnDefinition
|  |  |  |  |  | DwfDefinition
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)