Reference Library
GetInterval Method (order, parameter, interval)
Namespaces »ZwSoft.ZwCAD.Geometry »KnotCollection »GetInterval(Int32, Double, Interval)
 Declaration Syntax
C# | Visual Basic | Visual C++
public int GetInterval(
	int order,
	double parameter,
	out Interval interval
)
Public Function GetInterval ( _
	order As Integer, _
	parameter As Double, _
	<OutAttribute> ByRef interval As Interval _
) As Integer
public:
int GetInterval(
	int order,
	double parameter,
	[OutAttribute] Interval^% interval
)
 Parameters
order(Int32)
parameter(Double)
interval(Interval%)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)