Reference Library
DrawLTypeBitmap Method (ltypeId)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Utilities »DrawLTypeBitmap(ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static IntPtr DrawLTypeBitmap(
	ObjectId ltypeId
)
Public Shared Function DrawLTypeBitmap ( _
	ltypeId As ObjectId _
) As IntPtr
public:
static IntPtr DrawLTypeBitmap(
	ObjectId ltypeId
)
 Parameters
ltypeId(ObjectId)
Assembly: ZwManaged (Module: ZwManaged)