Reference Library
OsnapPointRef Constructor (unmanagedObject, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »OsnapPointRef »OsnapPointRef(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal OsnapPointRef(
	IntPtr unmanagedObject,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedObject As IntPtr, _
	autoDelete As Boolean _
)
protected public:
OsnapPointRef(
	IntPtr unmanagedObject,
	bool autoDelete
)
 Parameters
unmanagedObject(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)