Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ResultBuffer »Inequality(ResultBuffer, ResultBuffer)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	ResultBuffer a,
	ResultBuffer b
)
Public Shared Operator <> ( _
	a As ResultBuffer, _
	b As ResultBuffer _
) As Boolean
public:
static bool operator !=(
	ResultBuffer^ a,
	ResultBuffer^ b
)
 Parameters
a(ResultBuffer)
b(ResultBuffer)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)