Reference Library
GetSamplePoints Method (fromParameter, toParameter, approxEps)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »GetSamplePoints(Double, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PointOnCurve2d[] GetSamplePoints(
	double fromParameter,
	double toParameter,
	double approxEps
)
Public Function GetSamplePoints ( _
	fromParameter As Double, _
	toParameter As Double, _
	approxEps As Double _
) As PointOnCurve2d()
public:
array<PointOnCurve2d^>^ GetSamplePoints(
	double fromParameter,
	double toParameter,
	double approxEps
)
 Parameters
fromParameter(Double)
toParameter(Double)
approxEps(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)