Reference Library
GetNormalPoint Method
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity2d »GetNormalPoint()
 Members
Icon | Member | Description
GetNormalPoint(Point2d, Tolerance)
GetNormalPoint(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)