Reference Library
Layer Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »Layer
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Layer { get; set; }
Public Property Layer As String
	Get
	Set
public:
property String^ Layer {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)