Reference Library
MaximumDeviceDotsPerInch Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfig »MaximumDeviceDotsPerInch
 Declaration Syntax
C# | Visual Basic | Visual C++
public int MaximumDeviceDotsPerInch { get; }
Public ReadOnly Property MaximumDeviceDotsPerInch As Integer
	Get
public:
property int MaximumDeviceDotsPerInch {
	int get ();
}
Assembly: ZwManaged (Module: ZwManaged)