Reference Library
IntersectWith Method (linearEntity)
Namespaces »ZwSoft.ZwCAD.Geometry »Cone »IntersectWith(LinearEntity3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d[] IntersectWith(
	LinearEntity3d linearEntity
)
Public Function IntersectWith ( _
	linearEntity As LinearEntity3d _
) As Point3d()
public:
array<Point3d>^ IntersectWith(
	LinearEntity3d^ linearEntity
)
 Parameters
linearEntity(LinearEntity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)