Reference Library
TreatAsBlockRefForExplode Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockReference »TreatAsBlockRefForExplode
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool TreatAsBlockRefForExplode { get; }
Public Overridable ReadOnly Property TreatAsBlockRefForExplode As Boolean
	Get
public:
virtual property bool TreatAsBlockRefForExplode {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)