Reference Library
AnnoAllVisible Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »AnnoAllVisible
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool AnnoAllVisible { get; set; }
Public Property AnnoAllVisible As Boolean
	Get
	Set
public:
property bool AnnoAllVisible {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)