Reference Library
CrossingOrWindowSelectedObject Class
Namespaces »ZwSoft.ZwCAD.EditorInput »CrossingOrWindowSelectedObject
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class CrossingOrWindowSelectedObject : SelectedObject
Public NotInheritable Class CrossingOrWindowSelectedObject _
	Inherits SelectedObject
public ref class CrossingOrWindowSelectedObject sealed : public SelectedObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
CrossingOrWindowSelectedObject(ObjectId, SelectionMethod, IntPtr)
CrossingOrWindowSelectedObject(ObjectId, SelectionMethod, Int32) |  Obsolete.
GetPickPoints()
ToString(IFormatProvider)
ToString() |  (Overrides SelectedObject.ToString().)
 Inheritance Hierarchy
Object
SelectedObject
| CrossingOrWindowSelectedObject
Assembly: ZwManaged (Module: ZwManaged)