Reference Library
StlOut Method (fileName, asciiFormat)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »StlOut(String, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void StlOut(
	string fileName,
	bool asciiFormat
)
Public Overridable Sub StlOut ( _
	fileName As String, _
	asciiFormat As Boolean _
)
public:
virtual void StlOut(
	String^ fileName,
	bool asciiFormat
)
 Parameters
fileName(String)
asciiFormat(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)