Reference Library
Linetype Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GridPropertyParameter »Linetype
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId Linetype
Public Linetype As ObjectId
public:
ObjectId Linetype
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)