Reference Library
PaletteSet Property
Namespaces »ZwSoft.ZwCAD.Windows »Palette »PaletteSet
 Declaration Syntax
C# | Visual Basic | Visual C++
public PaletteSet PaletteSet { get; }
Public ReadOnly Property PaletteSet As PaletteSet
	Get
public:
property PaletteSet^ PaletteSet {
	PaletteSet^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)