Reference Library
PlotStyleTableChanged Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »PlotStyleTableChanged
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PlotStyleTableChangedEventHandler PlotStyleTableChanged
Public Event PlotStyleTableChanged As PlotStyleTableChangedEventHandler
public:
 event PlotStyleTableChangedEventHandler^ PlotStyleTableChanged {
	void add (PlotStyleTableChangedEventHandler^ value);
	void remove (PlotStyleTableChangedEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)