Reference Library
IntersectionType Property
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersectorConfigurations »IntersectionType
 Declaration Syntax
C# | Visual Basic | Visual C++
public SurfaceSurfaceIntersectorType IntersectionType { get; }
Public ReadOnly Property IntersectionType As SurfaceSurfaceIntersectorType
	Get
public:
property SurfaceSurfaceIntersectorType IntersectionType {
	SurfaceSurfaceIntersectorType get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)