Reference Library
MaterialEnabled Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »RenderSettingsTraits »MaterialEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool MaterialEnabled { get; set; }
Public MustOverride Property MaterialEnabled As Boolean
	Get
	Set
public:
virtual property bool MaterialEnabled {
	bool get () abstract;
	void set (bool value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)