Reference Library
PlotMessageIndex Enumeration
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotMessageIndex
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum PlotMessageIndex
Public Enumeration PlotMessageIndex
public enum class PlotMessageIndex
 Members
Member | Description
MessageCount
CancelJobButtonMessage
CancelSheetButtonMessage
MessageCancelingCurrent
MessageCanceling
SheetSetProgressCaption
SheetProgressCaption
SheetNameToolTip
SheetName
DialogTitle
Status
Assembly: ZwManaged (Module: ZwManaged)