Reference Library
set16bitBGR Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PixelFormatInfo »set16bitBGR()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void set16bitBGR()
Public Sub set16bitBGR
public:
void set16bitBGR()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)