Reference Library
Variant Constructor (value)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Variant »Variant(Color)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Variant(
	Color value
)
Public Sub New ( _
	value As Color _
)
public:
Variant(
	Color^ value
)
 Parameters
value(Color)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)