Reference Library
GetMergeRange Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »GetMergeRange(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual CellRange GetMergeRange(
	int row,
	int column
)
Public Overridable Function GetMergeRange ( _
	row As Integer, _
	column As Integer _
) As CellRange
public:
virtual CellRange^ GetMergeRange(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)