Reference Library
GetTrait Method (vsProp)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBVisualStyle »GetTrait(VisualStyleProperty)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Variant GetTrait(
	VisualStyleProperty vsProp
)
Public Function GetTrait ( _
	vsProp As VisualStyleProperty _
) As Variant
public:
Variant^ GetTrait(
	VisualStyleProperty vsProp
)
 Parameters
vsProp(VisualStyleProperty)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)