Reference Library
PlotToFileCapability Enumeration
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotToFileCapability
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum PlotToFileCapability
Public Enumeration PlotToFileCapability
public enum class PlotToFileCapability
 Members
Member | Description
MustPlotToFile
PlotToFileAllowed
NoPlotToFile
Assembly: ZwManaged (Module: ZwManaged)