Reference Library
PolygonMesh Constructor (type, size, sizeValue, vertices, closedValue, closed)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolygonMesh »PolygonMesh(PolyMeshType, Int32, Int32, Point3dCollection, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PolygonMesh(
	PolyMeshType type,
	int size,
	int sizeValue,
	Point3dCollection vertices,
	bool closedValue,
	bool closed
)
Public Sub New ( _
	type As PolyMeshType, _
	size As Integer, _
	sizeValue As Integer, _
	vertices As Point3dCollection, _
	closedValue As Boolean, _
	closed As Boolean _
)
public:
PolygonMesh(
	PolyMeshType type,
	int size,
	int sizeValue,
	Point3dCollection^ vertices,
	bool closedValue,
	bool closed
)
 Parameters
type(PolyMeshType)
size(Int32)
sizeValue(Int32)
vertices(Point3dCollection)
closedValue(Boolean)
closed(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)