Reference Library
RemoveRefTo Method (nodeToRemoveReference)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GraphNode »RemoveRefTo(GraphNode)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void RemoveRefTo(
	GraphNode nodeToRemoveReference
)
Public Sub RemoveRefTo ( _
	nodeToRemoveReference As GraphNode _
)
public:
void RemoveRefTo(
	GraphNode^ nodeToRemoveReference
)
 Parameters
nodeToRemoveReference(GraphNode)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)