Reference Library
Text Method (position, normal, direction, message, raw, textStyle)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »Text(Point3d, Vector3d, Vector3d, String, Boolean, TextStyle)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool Text(
	Point3d position,
	Vector3d normal,
	Vector3d direction,
	string message,
	bool raw,
	TextStyle textStyle
)
Public MustOverride Function Text ( _
	position As Point3d, _
	normal As Vector3d, _
	direction As Vector3d, _
	message As String, _
	raw As Boolean, _
	textStyle As TextStyle _
) As Boolean
public:
virtual bool Text(
	Point3d position,
	Vector3d normal,
	Vector3d direction,
	String^ message,
	bool raw,
	TextStyle^ textStyle
) abstract
 Parameters
position(Point3d)
normal(Vector3d)
direction(Vector3d)
message(String)
raw(Boolean)
textStyle(TextStyle)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)