Reference Library
GetCustomData Method (row, column, key)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »GetCustomData(Int32, Int32, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Object GetCustomData(
	int row,
	int column,
	string key
)
Public Overridable Function GetCustomData ( _
	row As Integer, _
	column As Integer, _
	key As String _
) As Object
public:
virtual Object^ GetCustomData(
	int row,
	int column,
	String^ key
)
 Parameters
row(Int32)
column(Int32)
key(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)