Reference Library
PromptDoubleOptions Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDoubleOptions
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PromptDoubleOptions : PromptNumericalOptions
Public NotInheritable Class PromptDoubleOptions _
	Inherits PromptNumericalOptions
public ref class PromptDoubleOptions sealed : public PromptNumericalOptions
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PromptDoubleOptions(String, String)
PromptDoubleOptions(String)
DefaultValue
 Inheritance Hierarchy
Object
PromptOptions
| PromptEditorOptions
|  | PromptNumericalOptions
|  |  | PromptDoubleOptions
Assembly: ZwManaged (Module: ZwManaged)