Reference Library
xrefOp Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »XrefSubCommandEventArgs »xrefOp
 Declaration Syntax
C# | Visual Basic | Visual C++
public XrefOperation xrefOp { get; }
Public ReadOnly Property xrefOp As XrefOperation
	Get
public:
property XrefOperation xrefOp {
	XrefOperation get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)