Reference Library
TableBreakFlowDirection Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableBreakFlowDirection
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum TableBreakFlowDirection
Public Enumeration TableBreakFlowDirection
public enum class TableBreakFlowDirection
 Members
Member | Description
DownOrUp
Left
Right
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)