Reference Library
Group Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbGroup")]
public class Group : DBObject
<WrapperAttribute("AcDbGroup")> _
Public Class Group _
	Inherits DBObject
[WrapperAttribute(L"AcDbGroup")]
public ref class Group : public DBObject
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Group(String, Boolean)
Group()
Group(IntPtr, Boolean)
Append(ObjectIdCollection)
Append(ObjectId)
Clear()
Description
GetAllEntityIds()
GetIndex(ObjectId)
Has(Entity)
InsertAt(Int32, ObjectIdCollection)
InsertAt(Int32, ObjectId)
IsAnonymous
IsNotAccessible
Name
NumEntities
Prepend(ObjectIdCollection)
Prepend(ObjectId)
Remove(ObjectIdCollection)
Remove(ObjectId)
RemoveAt(Int32, ObjectIdCollection)
RemoveAt(Int32)
Replace(ObjectId, ObjectId)
Reverse()
Selectable
SetAnonymous()
SetColor(Color)
SetColorIndex(Int32)
SetHighlight(Boolean)
SetLayer(String)
SetLayer(ObjectId)
SetLinetype(String)
SetLinetype(ObjectId)
SetLinetypeScale(Double)
SetVisibility(Boolean)
Transfer(Int32, Int32, Int32)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Group
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)