Reference Library
GraphicsMetafileType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GraphicsMetafileType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbProxyEntity::GraphicsMetafileType")]
public enum GraphicsMetafileType
<WrapperAttribute("ZcDbProxyEntity::GraphicsMetafileType")> _
Public Enumeration GraphicsMetafileType
[WrapperAttribute(L"ZcDbProxyEntity::GraphicsMetafileType")]
public enum class GraphicsMetafileType
 Members
Member | Description
FullGraphics
BoundingBox
NoMetafile
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)