Reference Library
TangentUsed Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Vertex2d »TangentUsed
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool TangentUsed { get; set; }
Public Property TangentUsed As Boolean
	Get
	Set
public:
property bool TangentUsed {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)