Reference Library
Count Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RowsCollection »Count
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Count { get; }
Public Overridable ReadOnly Property Count As Integer
	Get
public:
virtual property int Count {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)