Reference Library
Null Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FullSubentityPath »Null
 Declaration Syntax
C# | Visual Basic | Visual C++
public static FullSubentityPath Null { get; }
Public Shared ReadOnly Property Null As FullSubentityPath
	Get
public:
static property FullSubentityPath Null {
	FullSubentityPath get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)