Reference Library
ClosestPointToPlanarEntity Method (otherPlane)
Namespaces »ZwSoft.ZwCAD.Geometry »PlanarEntity »ClosestPointToPlanarEntity(PlanarEntity)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d[] ClosestPointToPlanarEntity(
	PlanarEntity otherPlane
)
Public Function ClosestPointToPlanarEntity ( _
	otherPlane As PlanarEntity _
) As Point3d()
public:
array<Point3d>^ ClosestPointToPlanarEntity(
	PlanarEntity^ otherPlane
)
 Parameters
otherPlane(PlanarEntity)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)