Reference Library
CreateFromGeCurve Method (geCurve, tolerance)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Curve »CreateFromGeCurve(Curve3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Curve CreateFromGeCurve(
	Curve3d geCurve,
	Tolerance tolerance
)
Public Shared Function CreateFromGeCurve ( _
	geCurve As Curve3d, _
	tolerance As Tolerance _
) As Curve
public:
static Curve^ CreateFromGeCurve(
	Curve3d^ geCurve,
	Tolerance tolerance
)
 Parameters
geCurve(Curve3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)