Reference Library
Origin Property
Namespaces »ZwSoft.ZwCAD.Geometry »Point2d »Origin
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Point2d Origin { get; }
Public Shared ReadOnly Property Origin As Point2d
	Get
public:
static property Point2d Origin {
	Point2d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)