Reference Library
PixelWidth Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »GIRasterImage »PixelWidth
 Declaration Syntax
C# | Visual Basic | Visual C++
public uint PixelWidth { get; }
Public ReadOnly Property PixelWidth As UInteger
	Get
public:
property unsigned int PixelWidth {
	unsigned int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)