Reference Library
GetLinetypeByLayerId Method (databasePointer)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »GetLinetypeByLayerId(Database)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static ObjectId GetLinetypeByLayerId(
	Database databasePointer
)
Public Shared Function GetLinetypeByLayerId ( _
	databasePointer As Database _
) As ObjectId
public:
static ObjectId GetLinetypeByLayerId(
	Database^ databasePointer
)
 Parameters
databasePointer(Database)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)