Reference Library
m_pAbortLayerStateDelete Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »m_pAbortLayerStateDelete
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerStateEventHandler m_pAbortLayerStateDelete
Public m_pAbortLayerStateDelete As LayerStateEventHandler
public:
LayerStateEventHandler^ m_pAbortLayerStateDelete
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)