Reference Library
OverlapDirection Property
Namespaces »ZwSoft.ZwCAD.Geometry »CurveCurveIntersector2d »OverlapDirection
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool OverlapDirection { get; }
Public ReadOnly Property OverlapDirection As Boolean
	Get
public:
property bool OverlapDirection {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)