Reference Library
SetViewportFromView Method (viewportNumber, view, regenRequired, rescaleRequired, syncRequired)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Manager »SetViewportFromView(Int32, View, Boolean, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetViewportFromView(
	int viewportNumber,
	View view,
	bool regenRequired,
	bool rescaleRequired,
	bool syncRequired
)
Public Sub SetViewportFromView ( _
	viewportNumber As Integer, _
	view As View, _
	regenRequired As Boolean, _
	rescaleRequired As Boolean, _
	syncRequired As Boolean _
)
public:
void SetViewportFromView(
	int viewportNumber,
	View^ view,
	bool regenRequired,
	bool rescaleRequired,
	bool syncRequired
)
 Parameters
viewportNumber(Int32)
view(View)
regenRequired(Boolean)
rescaleRequired(Boolean)
syncRequired(Boolean)
Assembly: ZwManaged (Module: ZwManaged)