Reference Library
PromptingForDistance Event
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »PromptingForDistance
 Declaration Syntax
C# | Visual Basic | Visual C++
public event PromptDistanceOptionsEventHandler PromptingForDistance
Public Event PromptingForDistance As PromptDistanceOptionsEventHandler
public:
 event PromptDistanceOptionsEventHandler^ PromptingForDistance {
	void add (PromptDistanceOptionsEventHandler^ value);
	void remove (PromptDistanceOptionsEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)