Reference Library
DateTime Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Sun »DateTime
 Declaration Syntax
C# | Visual Basic | Visual C++
public DateTime DateTime { get; set; }
Public Property DateTime As DateTime
	Get
	Set
public:
property DateTime DateTime {
	DateTime get ();
	void set (DateTime value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)