Reference Library
DoubleClick Property
Namespaces »ZwSoft.ZwCAD.Windows »StatusBarMouseDownEventArgs »DoubleClick
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool DoubleClick { get; }
Public ReadOnly Property DoubleClick As Boolean
	Get
public:
property bool DoubleClick {
	bool get ();
}
Assembly: ZwManaged (Module: ZwManaged)