Reference Library
LinetypeScale Method (nSecType, nGeometry)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »LinetypeScale(SectionType, SectionGeometry)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double LinetypeScale(
	SectionType nSecType,
	SectionGeometry nGeometry
)
Public Function LinetypeScale ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry _
) As Double
public:
double LinetypeScale(
	SectionType nSecType,
	SectionGeometry nGeometry
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)