Reference Library
Path Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImage »Path
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Path { get; }
Public ReadOnly Property Path As String
	Get
public:
property String^ Path {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)