Reference Library
Erase Method (viewIndex)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »Erase(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool Erase(
	int viewIndex
)
Public MustOverride Function Erase ( _
	viewIndex As Integer _
) As Boolean
public:
virtual bool Erase(
	int viewIndex
) abstract
 Parameters
viewIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)