Reference Library
RegisterEvaluatorLoader Method (pLoader)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FieldEngine »RegisterEvaluatorLoader(FieldEvaluatorLoader)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void RegisterEvaluatorLoader(
	FieldEvaluatorLoader pLoader
)
Public Overridable Sub RegisterEvaluatorLoader ( _
	pLoader As FieldEvaluatorLoader _
)
public:
virtual void RegisterEvaluatorLoader(
	FieldEvaluatorLoader^ pLoader
)
 Parameters
pLoader(FieldEvaluatorLoader)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)