Reference Library
IsModifiedXData Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »IsModifiedXData
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsModifiedXData { get; }
Public ReadOnly Property IsModifiedXData As Boolean
	Get
public:
property bool IsModifiedXData {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)