Reference Library
RevolveOptionsBuilder Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolveOptionsBuilder »RevolveOptionsBuilder()
 Declaration Syntax
C# | Visual Basic | Visual C++
public RevolveOptionsBuilder()
Public Sub New
public:
RevolveOptionsBuilder()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)