Reference Library
PolyFaceMeshVertex Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PolyFaceMeshVertex »PolyFaceMeshVertex()
 Members
Icon | Member | Description
PolyFaceMeshVertex(Point3d)
PolyFaceMeshVertex()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)