Reference Library
StartUserInteraction Method (modalForm)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »StartUserInteraction(Control)
 Declaration Syntax
C# | Visual Basic | Visual C++
public EditorUserInteraction StartUserInteraction(
	Control modalForm
)
Public Function StartUserInteraction ( _
	modalForm As Control _
) As EditorUserInteraction
public:
EditorUserInteraction^ StartUserInteraction(
	Control^ modalForm
)
 Parameters
modalForm(Control)
Assembly: ZwManaged (Module: ZwManaged)