Reference Library
ChangeImageSource Method (source)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »GIRasterImage »ChangeImageSource(RasterImageSource)
 Declaration Syntax
C# | Visual Basic | Visual C++
public GIRasterImage ChangeImageSource(
	RasterImageSource source
)
Public Function ChangeImageSource ( _
	source As RasterImageSource _
) As GIRasterImage
public:
GIRasterImage^ ChangeImageSource(
	RasterImageSource source
)
 Parameters
source(RasterImageSource)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)