Reference Library
IsSynchronized Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicBlockReferencePropertyCollection »IsSynchronized
 Declaration Syntax
C# | Visual Basic | Visual C++
internal virtual bool IsSynchronized { get; }
Friend Overridable ReadOnly Property IsSynchronized As Boolean
	Get
internal:
virtual property bool IsSynchronized {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)