Reference Library
LayerState Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ViewTableRecord »LayerState
 Declaration Syntax
C# | Visual Basic | Visual C++
public string LayerState { get; set; }
Public Property LayerState As String
	Get
	Set
public:
property String^ LayerState {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)