Reference Library
LayerDefpointsName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »LayerDefpointsName
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string LayerDefpointsName { get; }
Public Shared ReadOnly Property LayerDefpointsName As String
	Get
public:
static property String^ LayerDefpointsName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)