Reference Library
ReadBoolean Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »ReadBoolean()
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool ReadBoolean()
Public MustOverride Function ReadBoolean As Boolean
public:
virtual bool ReadBoolean() abstract
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)