Reference Library
Equals Method (unmanagedObjPtr)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleDescriptor »Equals(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed bool Equals(
	Object unmanagedObjPtr
)
Public Overrides NotOverridable Function Equals ( _
	unmanagedObjPtr As Object _
) As Boolean
public:
virtual bool Equals(
	Object^ unmanagedObjPtr
) override sealed
 Parameters
unmanagedObjPtr(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)