Reference Library
AppendLoop Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »AppendLoop()
 Members
Icon | Member | Description
AppendLoop(HatchLoopTypes, Point2dCollection, DoubleCollection)
AppendLoop(HatchLoopTypes, ObjectIdCollection)
AppendLoop(HatchLoop)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)