Reference Library
IndexOf Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »IntPtrCollection »IndexOf(IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int IndexOf(
	IntPtr value
)
Public Overridable Function IndexOf ( _
	value As IntPtr _
) As Integer
public:
virtual int IndexOf(
	IntPtr value
)
 Parameters
value(IntPtr)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)