Reference Library
SetCurves Method (curves)
Namespaces »ZwSoft.ZwCAD.Geometry »CompositeCurve2d »SetCurves(Curve2d[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetCurves(
	Curve2d[] curves
)
Public Sub SetCurves ( _
	curves As Curve2d() _
)
public:
void SetCurves(
	array<Curve2d^>^ curves
)
 Parameters
curves(Curve2d[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)