Reference Library
IsAutoScale Method (row, col)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »IsAutoScale(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool IsAutoScale(
	int row,
	int col
)
Public Overridable Function IsAutoScale ( _
	row As Integer, _
	col As Integer _
) As Boolean
public:
virtual bool IsAutoScale(
	int row,
	int col
)
 Parameters
row(Int32)
col(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)