Reference Library
SetDataLink Method (row, column, dataLinkId, bUpdate)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedTableData »SetDataLink(Int32, Int32, ObjectId, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetDataLink(
	int row,
	int column,
	ObjectId dataLinkId,
	bool bUpdate
)
Public Overridable Sub SetDataLink ( _
	row As Integer, _
	column As Integer, _
	dataLinkId As ObjectId, _
	bUpdate As Boolean _
)
public:
virtual void SetDataLink(
	int row,
	int column,
	ObjectId dataLinkId,
	bool bUpdate
)
 Parameters
row(Int32)
column(Int32)
dataLinkId(ObjectId)
bUpdate(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)