Reference Library
Dimse2 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimse2
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Dimse2 { get; set; }
Public Property Dimse2 As Boolean
	Get
	Set
public:
property bool Dimse2 {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)