Reference Library
GetBoundingPolyline Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FeatureControlFrame »GetBoundingPolyline()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Point3dCollection GetBoundingPolyline()
Public Overridable Function GetBoundingPolyline As Point3dCollection
public:
virtual Point3dCollection^ GetBoundingPolyline()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)