Reference Library
PaletteSetMoveEventArgs Constructor (x, y)
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSetMoveEventArgs »PaletteSetMoveEventArgs(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PaletteSetMoveEventArgs(
	int x,
	int y
)
Public Sub New ( _
	x As Integer, _
	y As Integer _
)
public:
PaletteSetMoveEventArgs(
	int x,
	int y
)
 Parameters
x(Int32)
y(Int32)
Assembly: ZwManaged (Module: ZwManaged)