Reference Library
IsAllGeomErased Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DimAssoc »IsAllGeomErased()
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsAllGeomErased()
Public Function IsAllGeomErased As Boolean
public:
bool IsAllGeomErased()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)