Reference Library
Node Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Graph »Node(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public GraphNode Node(
	int index
)
Public Function Node ( _
	index As Integer _
) As GraphNode
public:
GraphNode^ Node(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)