Reference Library
DiagnosticPhotonMode Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »DiagnosticPhotonMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum DiagnosticPhotonMode
Public Enumeration DiagnosticPhotonMode
public enum class DiagnosticPhotonMode
 Members
Member | Description
Irradiance
Density
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)