Reference Library
HasPersistentReactor Method (objId)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBObject »HasPersistentReactor(ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool HasPersistentReactor(
	ObjectId objId
)
Public Function HasPersistentReactor ( _
	objId As ObjectId _
) As Boolean
public:
bool HasPersistentReactor(
	ObjectId objId
)
 Parameters
objId(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)