Reference Library
BreakFlowDirection Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »BreakFlowDirection
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual TableBreakFlowDirection BreakFlowDirection { get; set; }
Public Overridable Property BreakFlowDirection As TableBreakFlowDirection
	Get
	Set
public:
virtual property TableBreakFlowDirection BreakFlowDirection {
	TableBreakFlowDirection get ();
	void set (TableBreakFlowDirection value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)