Reference Library
BlockReference Constructor (position, blockTableRecord)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »BlockReference »BlockReference(Point3d, ObjectId)
 Declaration Syntax
C# | Visual Basic | Visual C++
public BlockReference(
	Point3d position,
	ObjectId blockTableRecord
)
Public Sub New ( _
	position As Point3d, _
	blockTableRecord As ObjectId _
)
public:
BlockReference(
	Point3d position,
	ObjectId blockTableRecord
)
 Parameters
position(Point3d)
blockTableRecord(ObjectId)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)