Reference Library
SetDimstyleData Method (style)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »SetDimstyleData(DimStyleTableRecord)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetDimstyleData(
	DimStyleTableRecord style
)
Public Sub SetDimstyleData ( _
	style As DimStyleTableRecord _
)
public:
void SetDimstyleData(
	DimStyleTableRecord^ style
)
 Parameters
style(DimStyleTableRecord)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)