Reference Library
MentalRayRenderSettingsTraitsTraceParameter Structure
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraitsTraceParameter
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct MentalRayRenderSettingsTraitsTraceParameter
Public Structure MentalRayRenderSettingsTraitsTraceParameter
public value class MentalRayRenderSettingsTraitsTraceParameter
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
MentalRayRenderSettingsTraitsTraceParameter(Int32, Int32, Int32)
Reflection
Refraction
Sum
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)