Reference Library
IsBlockPaperSpaceName Method (name)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »IsBlockPaperSpaceName(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool IsBlockPaperSpaceName(
	string name
)
Public Shared Function IsBlockPaperSpaceName ( _
	name As String _
) As Boolean
public:
static bool IsBlockPaperSpaceName(
	String^ name
)
 Parameters
name(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)