Reference Library
SetUnrecognizedData Method
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdData »SetUnrecognizedData()
 Members
Icon | Member | Description
SetUnrecognizedData(StringCollection, StringCollection)
SetUnrecognizedData(String, String)
Assembly: ZwManaged (Module: ZwManaged)