Reference Library
ContentType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »ContentType
 Declaration Syntax
C# | Visual Basic | Visual C++
public ContentType ContentType { get; set; }
Public Property ContentType As ContentType
	Get
	Set
public:
property ContentType ContentType {
	ContentType get ();
	void set (ContentType value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)