Reference Library
DataType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellContent »DataType
 Declaration Syntax
C# | Visual Basic | Visual C++
public DataTypeParameter DataType { get; set; }
Public Property DataType As DataTypeParameter
	Get
	Set
public:
property DataTypeParameter DataType {
	DataTypeParameter get ();
	void set (DataTypeParameter value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)