Reference Library
GetLineTypes Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeData »GetLineTypes()
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId[] GetLineTypes()
Public Function GetLineTypes As ObjectId()
public:
array<ObjectId>^ GetLineTypes()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)