Reference Library
IsPartial Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ArcDimension »IsPartial
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsPartial { get; set; }
Public Property IsPartial As Boolean
	Get
	Set
public:
property bool IsPartial {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)