Reference Library
GetCurve3ds Method
Namespaces »ZwSoft.ZwCAD.Geometry »CurveBoundaryData »GetCurve3ds()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Entity3d[] GetCurve3ds()
Public Function GetCurve3ds As Entity3d()
public:
array<Entity3d^>^ GetCurve3ds()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)