Reference Library
DocumentActivationEnabled Property
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentCollection »DocumentActivationEnabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool DocumentActivationEnabled { get; set; }
Public Property DocumentActivationEnabled As Boolean
	Get
	Set
public:
property bool DocumentActivationEnabled {
	bool get ();
	void set (bool value);
}
Assembly: ZwManaged (Module: ZwManaged)