Reference Library
FitTolerance Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FitData »FitTolerance
 Declaration Syntax
C# | Visual Basic | Visual C++
public double FitTolerance { get; }
Public ReadOnly Property FitTolerance As Double
	Get
public:
property double FitTolerance {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)