Reference Library
GetLineweightAt Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleTable »GetLineweightAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double GetLineweightAt(
	int index
)
Public Overridable Function GetLineweightAt ( _
	index As Integer _
) As Double
public:
virtual double GetLineweightAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)