Reference Library
EndPoint Property
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »EndPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2d EndPoint { get; }
Public ReadOnly Property EndPoint As Point2d
	Get
public:
property Point2d EndPoint {
	Point2d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)