Reference Library
GetStartWidthAt Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline »GetStartWidthAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetStartWidthAt(
	int index
)
Public Function GetStartWidthAt ( _
	index As Integer _
) As Double
public:
double GetStartWidthAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)