Reference Library
TableEnumerator Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableEnumerator
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract class TableEnumerator : IEnumerator
Public MustInherit Class TableEnumerator _
	Implements IEnumerator
public ref class TableEnumerator abstract : IEnumerator
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
TableEnumerator()
IEnumeratorCurrent
MoveNext()
Reset()
 Inheritance Hierarchy
Object
TableEnumerator
| LinkedTableEnumerator
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)