Reference Library
Equality Operator
Namespaces »ZwSoft.ZwCAD.Geometry »CoordinateSystem3d »Equality(CoordinateSystem3d, CoordinateSystem3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator ==(
	CoordinateSystem3d a,
	CoordinateSystem3d b
)
Public Shared Operator = ( _
	a As CoordinateSystem3d, _
	b As CoordinateSystem3d _
) As Boolean
public:
static bool operator ==(
	CoordinateSystem3d a,
	CoordinateSystem3d b
)
 Parameters
a(CoordinateSystem3d)
b(CoordinateSystem3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)