Reference Library
Linetype Method (nSecType, nGeometry)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »Linetype(SectionType, SectionGeometry)
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Linetype(
	SectionType nSecType,
	SectionGeometry nGeometry
)
Public Function Linetype ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry _
) As String
public:
String^ Linetype(
	SectionType nSecType,
	SectionGeometry nGeometry
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)