Reference Library
Dimfxlen Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimfxlen
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double Dimfxlen { get; set; }
Public Overridable Property Dimfxlen As Double
	Get
	Set
public:
virtual property double Dimfxlen {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)