Reference Library
ToArray Method
Namespaces »ZwSoft.ZwCAD.Geometry »DoubleCollection »ToArray()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double[] ToArray()
Public Overridable Function ToArray As Double()
public:
virtual array<double>^ ToArray()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)