Reference Library
Mirroring Method (plane)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »Mirroring(Plane)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Matrix3d Mirroring(
	Plane plane
)
Public Shared Function Mirroring ( _
	plane As Plane _
) As Matrix3d
public:
static Matrix3d Mirroring(
	Plane^ plane
)
 Parameters
plane(Plane)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)