Reference Library
GetWeightAt Method (index)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »GetWeightAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetWeightAt(
	int index
)
Public Function GetWeightAt ( _
	index As Integer _
) As Double
public:
double GetWeightAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)