Reference Library
Veto Method
Namespaces »ZwSoft.ZwCAD.ApplicationServices »DocumentBeginCloseEventArgs »Veto()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Veto()
Public Sub Veto
public:
void Veto()
Assembly: ZwManaged (Module: ZwManaged)