Reference Library
IDictionary_Contains Method (key)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »IDictionary_Contains(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual bool IDictionary_Contains(
	Object key
)
Protected Overridable Function IDictionary_Contains ( _
	key As Object _
) As Boolean
protected:
virtual bool IDictionary_Contains(
	Object^ key
)
 Parameters
key(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)