Reference Library
Tolerance Structure
Namespaces »ZwSoft.ZwCAD.Geometry »Tolerance
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeTol")]
public struct Tolerance
<WrapperAttribute("ZcGeTol")> _
Public Structure Tolerance
[WrapperAttribute(L"ZcGeTol")]
public value class Tolerance
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Tolerance(Double, Double)
EqualPoint
EqualVector
Global
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)