Reference Library
LinearEntity3d Class
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity3d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeLinearEnt3d")]
public abstract class LinearEntity3d : Curve3d
<WrapperAttribute("ZcGeLinearEnt3d")> _
Public MustInherit Class LinearEntity3d _
	Inherits Curve3d
[WrapperAttribute(L"ZcGeLinearEnt3d")]
public ref class LinearEntity3d abstract : public Curve3d
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Create(IntPtr, Boolean)
Direction
GetLine()
GetPerpendicularPlane(Point3d)
IntersectWith(PlanarEntity, Tolerance)
IntersectWith(LinearEntity3d, Tolerance)
IntersectWith(PlanarEntity)
IntersectWith(LinearEntity3d)
IsColinearTo(LinearEntity3d, Tolerance)
IsColinearTo(LinearEntity3d)
IsOn(Plane, Tolerance)
IsOn(Plane)
IsParallelTo(PlanarEntity, Tolerance)
IsParallelTo(LinearEntity3d, Tolerance)
IsParallelTo(PlanarEntity)
IsParallelTo(LinearEntity3d)
IsPerpendicularTo(PlanarEntity, Tolerance)
IsPerpendicularTo(LinearEntity3d, Tolerance)
IsPerpendicularTo(PlanarEntity)
IsPerpendicularTo(LinearEntity3d)
Overlap(LinearEntity3d, Tolerance)
Overlap(LinearEntity3d)
PointOnLine
ProjectedIntersectWith(LinearEntity3d, Vector3d, Tolerance)
ProjectedIntersectWith(LinearEntity3d, Vector3d)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity3d
|  |  | Curve3d
|  |  |  | LinearEntity3d
|  |  |  |  | Line3d
|  |  |  |  | LineSegment3d
|  |  |  |  | Ray3d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)