Reference Library
Window.State Enumeration
Namespaces »ZwSoft.ZwCAD.Windows »Window »Window.State
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum State
Public Enumeration State
public enum class State
 Members
Member | Description
Maximized
Minimized
Normal
Assembly: ZwManaged (Module: ZwManaged)