Reference Library
SetAxes Method (normal, referenceVector)
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc3d »SetAxes(Vector3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetAxes(
	Vector3d normal,
	Vector3d referenceVector
)
Public Sub SetAxes ( _
	normal As Vector3d, _
	referenceVector As Vector3d _
)
public:
void SetAxes(
	Vector3d normal,
	Vector3d referenceVector
)
 Parameters
normal(Vector3d)
referenceVector(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)