Reference Library
SetPropertiesFrom Method (entityPointer)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »SetPropertiesFrom(Entity)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetPropertiesFrom(
	Entity entityPointer
)
Public Sub SetPropertiesFrom ( _
	entityPointer As Entity _
)
public:
void SetPropertiesFrom(
	Entity^ entityPointer
)
 Parameters
entityPointer(Entity)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)