Reference Library
Insert Method (index, p)
Namespaces »ZwSoft.ZwCAD.Windows »MenuItemCollection »Insert(Int32, MenuItem)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Insert(
	int index,
	MenuItem p
)
Public Sub Insert ( _
	index As Integer, _
	p As MenuItem _
)
public:
void Insert(
	int index,
	MenuItem^ p
)
 Parameters
index(Int32)
p(MenuItem)
Assembly: ZwManaged (Module: ZwManaged)