Reference Library
MaxBoundsY Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »MaxBoundsY
 Declaration Syntax
C# | Visual Basic | Visual C++
public double MaxBoundsY { get; }
Public ReadOnly Property MaxBoundsY As Double
	Get
public:
property double MaxBoundsY {
	double get ();
}
Assembly: ZwManaged (Module: ZwManaged)