Reference Library
ReverseNormal Property
Namespaces »ZwSoft.ZwCAD.Geometry »Surface »ReverseNormal
 Declaration Syntax
C# | Visual Basic | Visual C++
public Surface ReverseNormal { get; }
Public ReadOnly Property ReverseNormal As Surface
	Get
public:
property Surface^ ReverseNormal {
	Surface^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)