Reference Library
Set Method
Namespaces »ZwSoft.ZwCAD.Geometry »Ray2d »Set()
 Members
Icon | Member | Description
Set(Point2d, Vector2d)
Set(Point2d, Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)