Reference Library
Diameter Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Circle »Diameter
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Diameter { get; set; }
Public Property Diameter As Double
	Get
	Set
public:
property double Diameter {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)