Reference Library
ObjectContextManager Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »ObjectContextManager
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectContextManager ObjectContextManager { get; }
Public ReadOnly Property ObjectContextManager As ObjectContextManager
	Get
public:
property ObjectContextManager^ ObjectContextManager {
	ObjectContextManager^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)