Reference Library
GetAllObjects Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Transaction »GetAllObjects()
 Declaration Syntax
C# | Visual Basic | Visual C++
public DBObjectCollection GetAllObjects()
Public Function GetAllObjects As DBObjectCollection
public:
DBObjectCollection^ GetAllObjects()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)