Reference Library
Item Property (index)
Namespaces »ZwSoft.ZwCAD.Geometry »IntPtrCollection »Item[Int32]
 Declaration Syntax
C# | Visual Basic | Visual C++
public IntPtr this[
	int index
] { get; set; }
Public Default Property Item ( _
	index As Integer _
) As IntPtr
	Get
	Set
public:
property IntPtr default[int index] {
	IntPtr get (int index);
	void set (int index, IntPtr value);
}
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)