Reference Library
WriteUInt32 Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »WriteUInt32(UInt32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract void WriteUInt32(
	uint value
)
Public MustOverride Sub WriteUInt32 ( _
	value As UInteger _
)
public:
virtual void WriteUInt32(
	unsigned int value
) abstract
 Parameters
value(UInt32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)