Reference Library
RasterImage Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImage
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcDbRasterImage")]
public class RasterImage : Image
<WrapperAttribute("AcDbRasterImage")> _
Public Class RasterImage _
	Inherits Image
[WrapperAttribute(L"AcDbRasterImage")]
public ref class RasterImage : public Image
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
RasterImage()
RasterImage(IntPtr, Boolean)
AssociateRasterDef(RasterImageDef)
Brightness
ClipBoundaryType
Contrast
DisplayOptions
EnableReactors(Boolean)
Fade
GetClipBoundary()
GetVertices()
Height
ImageDefId
ImageHeight
ImageSize(Boolean)
ImageTransparency
ImageWidth
IsClipped
IsSetDisplayOptions(ImageDisplayOptions)
Name
Orientation
Path
PixelToModelTransform
Position
ReactorId
Rotation
Scale
SetClipBoundary(ClipBoundaryType, Point2dCollection)
SetClipBoundary(Vector2d)
SetClipBoundaryToWholeImage()
SetDisplayOptions(ImageDisplayOptions, Boolean)
ShowImage
Width
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | Entity
|  |  |  |  |  | Image
|  |  |  |  |  |  | RasterImage
|  |  |  |  |  |  |  | Wipeout
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)