Reference Library
StartPoint Property
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »StartPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d StartPoint { get; }
Public ReadOnly Property StartPoint As Point3d
	Get
public:
property Point3d StartPoint {
	Point3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)