Reference Library
IsCoplanarTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »BoundedPlane »IsCoplanarTo()
 Members
Icon | Member | Description
IsCoplanarTo(PlanarEntity, Tolerance)
IsCoplanarTo(PlanarEntity)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)