Reference Library
RemoveLastVertex Method (leaderLineIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »RemoveLastVertex(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void RemoveLastVertex(
	int leaderLineIndex
)
Public Sub RemoveLastVertex ( _
	leaderLineIndex As Integer _
)
public:
void RemoveLastVertex(
	int leaderLineIndex
)
 Parameters
leaderLineIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)