Reference Library
FormattedTableData Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbFormattedTableData")]
public class FormattedTableData : LinkedTableData
<WrapperAttribute("ZcDbFormattedTableData")> _
Public Class FormattedTableData _
	Inherits LinkedTableData
[WrapperAttribute(L"ZcDbFormattedTableData")]
public ref class FormattedTableData : public LinkedTableData
 Members
All Members | Constructors | Methods | Properties | Events
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
FormattedTableData()
FormattedTableData(IntPtr, Boolean)
Create(IntPtr, Boolean)
GetAlignment(Int32, Int32)
GetBackgroundColor(Int32, Int32)
GetContentColor(Int32, Int32)
GetGridColor(Int32, Int32, GridLineType)
GetGridLinetype(Int32, Int32, GridLineType)
GetGridLineWeight(Int32, Int32, GridLineType)
GetGridVisibility(Int32, Int32, GridLineType)
GetMargin(Int32, Int32, CellMargins)
GetMergeRange(Int32, Int32)
GetOverride(Int32, Int32, Int32)
GetOverride(Int32, Int32, GridLineType)
GetRotation(Int32, Int32)
GetScale(Int32, Int32)
GetTextHeight(Int32, Int32)
GetTextStyle(Int32, Int32)
IsFormatEditable(Int32, Int32)
IsMerged(Int32, Int32)
Merge(CellRange)
RemoveAllOverrides(Int32, Int32)
SetAlignment(Int32, Int32, CellAlignment)
SetBackgroundColor(Int32, Int32, Color)
SetContentColor(Int32, Int32, Color)
SetGridColor(Int32, Int32, GridLineType, Color)
SetGridLinetype(Int32, Int32, GridLineType, ObjectId)
SetGridLineWeight(Int32, Int32, GridLineType, LineWeight)
SetGridVisibility(Int32, Int32, GridLineType, Visibility)
SetMargin(Int32, Int32, CellMargins, Double)
SetOverride(Int32, Int32, Int32, CellProperties)
SetOverride(Int32, Int32, GridLineType, GridProperties)
SetRotation(Int32, Int32, Double)
SetScale(Int32, Int32, Double)
SetTextHeight(Int32, Int32, Double)
SetTextStyle(Int32, Int32, ObjectId)
Unmerge(CellRange)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | Drawable
|  |  |  | DBObject
|  |  |  |  | LinkedData
|  |  |  |  |  | LinkedTableData
|  |  |  |  |  |  | FormattedTableData
|  |  |  |  |  |  |  | TableContent
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)