Reference Library
TextHeight Method (rowType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TableStyle »TextHeight(RowType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double TextHeight(
	RowType rowType
)
Public Overridable Function TextHeight ( _
	rowType As RowType _
) As Double
public:
virtual double TextHeight(
	RowType rowType
)
 Parameters
rowType(RowType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)