Reference Library
ShowConstraintBar Method (subentityPaths, bToShow)
Namespaces »ZwSoft.ZwCAD.EditorInput »ConstraintUtilities »ShowConstraintBar(FullSubentityPath[], Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool ShowConstraintBar(
	FullSubentityPath[] subentityPaths,
	bool bToShow
)
Public Shared Function ShowConstraintBar ( _
	subentityPaths As FullSubentityPath(), _
	bToShow As Boolean _
) As Boolean
public:
static bool ShowConstraintBar(
	array<FullSubentityPath>^ subentityPaths,
	bool bToShow
)
 Parameters
subentityPaths(FullSubentityPath[])
bToShow(Boolean)
Assembly: ZwManaged (Module: ZwManaged)