Reference Library
Layer Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »SubEntityTraits »Layer
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract ObjectId Layer { get; set; }
Public MustOverride Property Layer As ObjectId
	Get
	Set
public:
virtual property ObjectId Layer {
	ObjectId get () abstract;
	void set (ObjectId value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)