Reference Library
ModuleUnloadAborted Event
Namespaces »ZwSoft.ZwCAD.Runtime »DynamicLinker »ModuleUnloadAborted
 Declaration Syntax
C# | Visual Basic | Visual C++
public event ModuleUnloadAbortedEventHandler ModuleUnloadAborted
Public Event ModuleUnloadAborted As ModuleUnloadAbortedEventHandler
public:
 event ModuleUnloadAbortedEventHandler^ ModuleUnloadAborted {
	void add (ModuleUnloadAbortedEventHandler^ value);
	void remove (ModuleUnloadAbortedEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)