Reference Library
State Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »State
 Declaration Syntax
C# | Visual Basic | Visual C++
public Nullable<CellStates> State { get; set; }
Public Property State As Nullable(Of CellStates)
	Get
	Set
public:
property Nullable<CellStates> State {
	Nullable<CellStates> get ();
	void set (Nullable<CellStates> value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)