Reference Library
CompositeCurve3d Constructor (curves)
Namespaces »ZwSoft.ZwCAD.Geometry »CompositeCurve3d »CompositeCurve3d(Curve3d[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public CompositeCurve3d(
	Curve3d[] curves
)
Public Sub New ( _
	curves As Curve3d() _
)
public:
CompositeCurve3d(
	array<Curve3d^>^ curves
)
 Parameters
curves(Curve3d[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)