Reference Library
ImageSize Method (getCachedValue)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImage »ImageSize(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Vector2d ImageSize(
	bool getCachedValue
)
Public Overridable Function ImageSize ( _
	getCachedValue As Boolean _
) As Vector2d
public:
virtual Vector2d ImageSize(
	bool getCachedValue
)
 Parameters
getCachedValue(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)