Reference Library
RayTraceDepth Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraits »RayTraceDepth
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract MentalRayRenderSettingsTraitsTraceParameter RayTraceDepth { get; set; }
Public MustOverride Property RayTraceDepth As MentalRayRenderSettingsTraitsTraceParameter
	Get
	Set
public:
virtual property MentalRayRenderSettingsTraitsTraceParameter RayTraceDepth {
	MentalRayRenderSettingsTraitsTraceParameter get () abstract;
	void set (MentalRayRenderSettingsTraitsTraceParameter value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)