Reference Library
CopyToUnmanagedObject Method (unmanagedPointer)
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfig »CopyToUnmanagedObject(IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyToUnmanagedObject(
	IntPtr unmanagedPointer
)
Public Sub CopyToUnmanagedObject ( _
	unmanagedPointer As IntPtr _
)
public:
void CopyToUnmanagedObject(
	IntPtr unmanagedPointer
)
 Parameters
unmanagedPointer(IntPtr)
Assembly: ZwManaged (Module: ZwManaged)