Reference Library
Position2d Constructor (x, y)
Namespaces »ZwSoft.ZwCAD.Geometry »Position2d »Position2d(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Position2d(
	double x,
	double y
)
Public Sub New ( _
	x As Double, _
	y As Double _
)
public:
Position2d(
	double x,
	double y
)
 Parameters
x(Double)
y(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)