Reference Library
DecomposeForSaveReplacementRecord Constructor (replacement, exchangeXData)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DecomposeForSaveReplacementRecord »DecomposeForSaveReplacementRecord(DBObject, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DecomposeForSaveReplacementRecord(
	DBObject replacement,
	bool exchangeXData
)
Public Sub New ( _
	replacement As DBObject, _
	exchangeXData As Boolean _
)
public:
DecomposeForSaveReplacementRecord(
	DBObject^ replacement,
	bool exchangeXData
)
 Parameters
replacement(DBObject)
exchangeXData(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)