Reference Library
Dimtfill Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimtfill
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Dimtfill { get; set; }
Public Property Dimtfill As Integer
	Get
	Set
public:
property int Dimtfill {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)