Reference Library
Reflection Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »MentalRayRenderSettingsTraitsTraceParameter »Reflection
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Reflection { get; }
Public ReadOnly Property Reflection As Integer
	Get
public:
property int Reflection {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)