Reference Library
LoopType Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HatchLoop »LoopType
 Declaration Syntax
C# | Visual Basic | Visual C++
public HatchLoopTypes LoopType { get; }
Public ReadOnly Property LoopType As HatchLoopTypes
	Get
public:
property HatchLoopTypes LoopType {
	HatchLoopTypes get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)