Reference Library
SelectionFilter Class
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionFilter
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class SelectionFilter
Public NotInheritable Class SelectionFilter
public ref class SelectionFilter sealed
 Members
All Members | Constructors | Methods
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
SelectionFilter(TypedValue[])
GetFilter()
 Inheritance Hierarchy
Object
SelectionFilter
Assembly: ZwManaged (Module: ZwManaged)