Reference Library
Dispose Method ()
Namespaces »ZwSoft.ZwCAD.Runtime »DisposableWrapper »Dispose(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
[HandleProcessCorruptedStateExceptionsAttribute]
protected virtual void Dispose(
	bool
)
<HandleProcessCorruptedStateExceptionsAttribute> _
Protected Overridable Sub Dispose ( _
	 As Boolean _
)
[HandleProcessCorruptedStateExceptionsAttribute]
protected:
virtual void Dispose(
	bool
)
 Parameters
(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)