Reference Library
RotateBy Method (angle, vector, centerPoint)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »RotateBy(Double, Vector3d, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d RotateBy(
	double angle,
	Vector3d vector,
	Point3d centerPoint
)
Public Function RotateBy ( _
	angle As Double, _
	vector As Vector3d, _
	centerPoint As Point3d _
) As Point3d
public:
Point3d RotateBy(
	double angle,
	Vector3d vector,
	Point3d centerPoint
)
 Parameters
angle(Double)
vector(Vector3d)
centerPoint(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)