Reference Library
IsOn Method (point, parameterPoint, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Surface »IsOn(Point3d, Point2d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsOn(
	Point3d point,
	out Point2d parameterPoint,
	Tolerance tolerance
)
Public Function IsOn ( _
	point As Point3d, _
	<OutAttribute> ByRef parameterPoint As Point2d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsOn(
	Point3d point,
	[OutAttribute] Point2d% parameterPoint,
	Tolerance tolerance
)
 Parameters
point(Point3d)
parameterPoint(Point2d%)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)