Reference Library
DrawingUnits Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AnnotationScale »DrawingUnits
 Declaration Syntax
C# | Visual Basic | Visual C++
public double DrawingUnits { get; set; }
Public Property DrawingUnits As Double
	Get
	Set
public:
property double DrawingUnits {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)