Reference Library
IsClosed Method
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity2d »IsClosed()
 Members
Icon | Member | Description
IsClosed(Tolerance)
IsClosed()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)