Reference Library
CopyTo Method (array, index)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2dCollection »CopyTo(Vector2d[], Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CopyTo(
	Vector2d[] array,
	int index
)
Public Sub CopyTo ( _
	array As Vector2d(), _
	index As Integer _
)
public:
virtual void CopyTo(
	array<Vector2d>^ array,
	int index
) sealed
 Parameters
array(Vector2d[])
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)