Reference Library
GetOutgoing Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Graph »GetOutgoing()
 Declaration Syntax
C# | Visual Basic | Visual C++
public GraphNodeCollection GetOutgoing()
Public Function GetOutgoing As GraphNodeCollection
public:
GraphNodeCollection^ GetOutgoing()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)