Reference Library
GetTextStyleId Method (row, column, contentIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GetTextStyleId(Int32, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual ObjectId GetTextStyleId(
	int row,
	int column,
	int contentIndex
)
Public Overridable Function GetTextStyleId ( _
	row As Integer, _
	column As Integer, _
	contentIndex As Integer _
) As ObjectId
public:
virtual ObjectId GetTextStyleId(
	int row,
	int column,
	int contentIndex
)
 Parameters
row(Int32)
column(Int32)
contentIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)