Reference Library
DeviceIndependentLocation Property
Namespaces »ZwSoft.ZwCAD.Windows »Window »DeviceIndependentLocation
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Point DeviceIndependentLocation { get; set; }
Public Overridable Property DeviceIndependentLocation As Point
	Get
	Set
public:
virtual property Point DeviceIndependentLocation {
	Point get ();
	void set (Point value);
}
Assembly: ZwManaged (Module: ZwManaged)