Reference Library
GetPlane Method
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc3d »GetPlane()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Plane GetPlane()
Public Function GetPlane As Plane
public:
Plane^ GetPlane()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)