Reference Library
DatabaseSummaryInfoBuilder Constructor (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DatabaseSummaryInfoBuilder »DatabaseSummaryInfoBuilder(DatabaseSummaryInfo)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DatabaseSummaryInfoBuilder(
	DatabaseSummaryInfo value
)
Public Sub New ( _
	value As DatabaseSummaryInfo _
)
public:
DatabaseSummaryInfoBuilder(
	DatabaseSummaryInfo value
)
 Parameters
value(DatabaseSummaryInfo)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)