Reference Library
BooleanOperation Method (operation, otherRegion)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Region »BooleanOperation(BooleanOperationType, Region)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void BooleanOperation(
	BooleanOperationType operation,
	Region otherRegion
)
Public Overridable Sub BooleanOperation ( _
	operation As BooleanOperationType, _
	otherRegion As Region _
)
public:
virtual void BooleanOperation(
	BooleanOperationType operation,
	Region^ otherRegion
)
 Parameters
operation(BooleanOperationType)
otherRegion(Region)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)