Reference Library
PaletteSize Property
Namespaces »ZwSoft.ZwCAD.Windows »PaletteSet »PaletteSize
 Declaration Syntax
C# | Visual Basic | Visual C++
public Size PaletteSize { get; }
Public ReadOnly Property PaletteSize As Size
	Get
public:
property Size PaletteSize {
	Size get ();
}
Assembly: ZwManaged (Module: ZwManaged)