Reference Library
Scale Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AnnotationScale »Scale
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Scale { get; }
Public ReadOnly Property Scale As Double
	Get
public:
property double Scale {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)