Reference Library
getContextDataManager Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »getContextDataManager()
 Declaration Syntax
C# | Visual Basic | Visual C++
public IntPtr getContextDataManager()
Public Function getContextDataManager As IntPtr
public:
IntPtr getContextDataManager()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)