Reference Library
DeleteContent Method (range1)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »DeleteContent(CellRange)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void DeleteContent(
	CellRange range1
)
Public Overridable Sub DeleteContent ( _
	range1 As CellRange _
)
public:
virtual void DeleteContent(
	CellRange^ range1
)
 Parameters
range1(CellRange)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)