Reference Library
Dimsd2 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Dimsd2
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Dimsd2 { get; set; }
Public Property Dimsd2 As Boolean
	Get
	Set
public:
property bool Dimsd2 {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)