Reference Library
SetLayerFlags Method (flags)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »NonEntityTraits »SetLayerFlags(DrawableTraits.LayerFlags)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected override sealed void SetLayerFlags(
	DrawableTraits.LayerFlags flags
)
Protected Overrides NotOverridable Sub SetLayerFlags ( _
	flags As DrawableTraits.LayerFlags _
)
protected:
virtual void SetLayerFlags(
	DrawableTraits.LayerFlags flags
) override sealed
 Parameters
flags(DrawableTraits.LayerFlags)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)