Reference Library
GetLayoutId Method (name)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayoutManager »GetLayoutId(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId GetLayoutId(
	string name
)
Public Function GetLayoutId ( _
	name As String _
) As ObjectId
public:
ObjectId GetLayoutId(
	String^ name
)
 Parameters
name(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)