Reference Library
ChordPoint Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RadialDimensionLarge »ChordPoint
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d ChordPoint { get; set; }
Public Property ChordPoint As Point3d
	Get
	Set
public:
property Point3d ChordPoint {
	Point3d get ();
	void set (Point3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)