Reference Library
OriginalFileName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »OriginalFileName
 Declaration Syntax
C# | Visual Basic | Visual C++
public string OriginalFileName { get; }
Public ReadOnly Property OriginalFileName As String
	Get
public:
property String^ OriginalFileName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)