Reference Library
IDictionary_Remove Method (key)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »IDictionary_Remove(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual void IDictionary_Remove(
	Object key
)
Protected Overridable Sub IDictionary_Remove ( _
	key As Object _
)
protected:
virtual void IDictionary_Remove(
	Object^ key
)
 Parameters
key(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)