Reference Library
IntersectWith Method
Namespaces »ZwSoft.ZwCAD.Geometry »Cylinder »IntersectWith()
 Members
Icon | Member | Description
IntersectWith(LinearEntity3d, Tolerance)
IntersectWith(LinearEntity3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)