Reference Library
RotatedDimension Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RotatedDimension »RotatedDimension()
 Declaration Syntax
C# | Visual Basic | Visual C++
public RotatedDimension()
Public Sub New
public:
RotatedDimension()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)