Reference Library
AppendVertex Method (pointToAdd)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Leader »AppendVertex(Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool AppendVertex(
	Point3d pointToAdd
)
Public Overridable Function AppendVertex ( _
	pointToAdd As Point3d _
) As Boolean
public:
virtual bool AppendVertex(
	Point3d pointToAdd
)
 Parameters
pointToAdd(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)