Reference Library
BeginWblockSelectedObjects Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »BeginWblockSelectedObjects
 Declaration Syntax
C# | Visual Basic | Visual C++
public event BeginWblockSelectedObjectsEventHandler BeginWblockSelectedObjects
Public Event BeginWblockSelectedObjects As BeginWblockSelectedObjectsEventHandler
public:
 event BeginWblockSelectedObjectsEventHandler^ BeginWblockSelectedObjects {
	void add (BeginWblockSelectedObjectsEventHandler^ value);
	void remove (BeginWblockSelectedObjectsEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)