Reference Library
SetVertexAt Method (vertexIndex, vertexPosition)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Face »SetVertexAt(Int16, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetVertexAt(
	short vertexIndex,
	Point3d vertexPosition
)
Public Sub SetVertexAt ( _
	vertexIndex As Short, _
	vertexPosition As Point3d _
)
public:
void SetVertexAt(
	short vertexIndex,
	Point3d vertexPosition
)
 Parameters
vertexIndex(Int16)
vertexPosition(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)