Reference Library
Set Method (curve1, curve2, parameter1, parameter2)
Namespaces »ZwSoft.ZwCAD.Geometry »LineSegment3d »Set(Curve3d, Curve3d, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	Curve3d curve1,
	Curve3d curve2,
	double parameter1,
	double parameter2
)
Public Sub Set ( _
	curve1 As Curve3d, _
	curve2 As Curve3d, _
	parameter1 As Double, _
	parameter2 As Double _
)
public:
void Set(
	Curve3d^ curve1,
	Curve3d^ curve2,
	double parameter1,
	double parameter2
)
 Parameters
curve1(Curve3d)
curve2(Curve3d)
parameter1(Double)
parameter2(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)