Reference Library
GroupDictionaryId Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »GroupDictionaryId
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId GroupDictionaryId { get; }
Public ReadOnly Property GroupDictionaryId As ObjectId
	Get
public:
property ObjectId GroupDictionaryId {
	ObjectId get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)