Reference Library
GripData.Context Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripData »GripData.Context
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum Context
Public Enumeration Context
public enum class Context
 Members
Member | Description
SharedGrip
MultiHotGrip
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)