Reference Library
LayerStateManager Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »LayerStateManager
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerStateManager LayerStateManager { get; }
Public ReadOnly Property LayerStateManager As LayerStateManager
	Get
public:
property LayerStateManager^ LayerStateManager {
	LayerStateManager^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)