Reference Library
JigPromptPointOptions Class
Namespaces »ZwSoft.ZwCAD.EditorInput »JigPromptPointOptions
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class JigPromptPointOptions : JigPromptGeometryOptions
Public NotInheritable Class JigPromptPointOptions _
	Inherits JigPromptGeometryOptions
public ref class JigPromptPointOptions sealed : public JigPromptGeometryOptions
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
JigPromptPointOptions(String, String)
JigPromptPointOptions(String)
JigPromptPointOptions()
DefaultValue
 Inheritance Hierarchy
Object
PromptOptions
| JigPromptOptions
|  | JigPromptGeometryOptions
|  |  | JigPromptPointOptions
Assembly: ZwManaged (Module: ZwManaged)