Reference Library
Polyline2d Constructor (type, vertices, elevation, closed, startWidth, endWidth, bulges)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline2d »Polyline2d(Poly2dType, Point3dCollection, Double, Boolean, Double, Double, DoubleCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Polyline2d(
	Poly2dType type,
	Point3dCollection vertices,
	double elevation,
	bool closed,
	double startWidth,
	double endWidth,
	DoubleCollection bulges
)
Public Sub New ( _
	type As Poly2dType, _
	vertices As Point3dCollection, _
	elevation As Double, _
	closed As Boolean, _
	startWidth As Double, _
	endWidth As Double, _
	bulges As DoubleCollection _
)
public:
Polyline2d(
	Poly2dType type,
	Point3dCollection^ vertices,
	double elevation,
	bool closed,
	double startWidth,
	double endWidth,
	DoubleCollection^ bulges
)
 Parameters
type(Poly2dType)
vertices(Point3dCollection)
elevation(Double)
closed(Boolean)
startWidth(Double)
endWidth(Double)
bulges(DoubleCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)