Reference Library
Subtract Method (v)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »Subtract(Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d Subtract(
	Vector3d v
)
Public Function Subtract ( _
	v As Vector3d _
) As Vector3d
public:
Vector3d Subtract(
	Vector3d v
)
 Parameters
v(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)