Reference Library
Name Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »HyperLink »Name
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Name { get; set; }
Public Property Name As String
	Get
	Set
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)