Reference Library
Polypoint Method
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »Polypoint()
 Members
Icon | Member | Description
Polypoint(Point3dCollection, EntityColorCollection, Vector3dCollection, IntPtrCollection)
Polypoint(Point3dCollection, Vector3dCollection, IntPtrCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)