Reference Library
ExpandBy Method (vector)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Extents3d »ExpandBy(Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void ExpandBy(
	Vector3d vector
)
Public Sub ExpandBy ( _
	vector As Vector3d _
)
public:
void ExpandBy(
	Vector3d vector
)
 Parameters
vector(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)