Reference Library
AddObjects Method (ids)
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectionTextInputEventArgs »AddObjects(ObjectId[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void AddObjects(
	ObjectId[] ids
)
Public Sub AddObjects ( _
	ids As ObjectId() _
)
public:
void AddObjects(
	array<ObjectId>^ ids
)
 Parameters
ids(ObjectId[])
Assembly: ZwManaged (Module: ZwManaged)