Reference Library
LineTypeScale Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »NonEntityTraits »LineTypeScale
 Declaration Syntax
C# | Visual Basic | Visual C++
public override sealed double LineTypeScale { get; set; }
Public Overrides NotOverridable Property LineTypeScale As Double
	Get
	Set
public:
virtual property double LineTypeScale {
	double get () override sealed;
	void set (double value) override sealed;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)