Reference Library
DistanceTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »Surface »DistanceTo()
 Members
Icon | Member | Description
DistanceTo(Point3d, Tolerance)
DistanceTo(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)