Reference Library
PlotAsRaster Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »PlotAsRaster
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool PlotAsRaster { get; }
Public ReadOnly Property PlotAsRaster As Boolean
	Get
public:
property bool PlotAsRaster {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)