Reference Library
GetDsdEntryCollection Method
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdData »GetDsdEntryCollection()
 Declaration Syntax
C# | Visual Basic | Visual C++
public DsdEntryCollection GetDsdEntryCollection()
Public Function GetDsdEntryCollection As DsdEntryCollection
public:
DsdEntryCollection^ GetDsdEntryCollection()
Assembly: ZwManaged (Module: ZwManaged)