Reference Library
RadiiOfGyration Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3dMassProperties »RadiiOfGyration
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d RadiiOfGyration { get; }
Public ReadOnly Property RadiiOfGyration As Vector3d
	Get
public:
property Vector3d RadiiOfGyration {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)