Reference Library
Rotation Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellContent »Rotation
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Rotation { get; set; }
Public Property Rotation As Double
	Get
	Set
public:
property double Rotation {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)