Reference Library
SetViewFromViewport Method (view, viewportNumber)
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Manager »SetViewFromViewport(View, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetViewFromViewport(
	View view,
	int viewportNumber
)
Public Sub SetViewFromViewport ( _
	view As View, _
	viewportNumber As Integer _
)
public:
void SetViewFromViewport(
	View^ view,
	int viewportNumber
)
 Parameters
view(View)
viewportNumber(Int32)
Assembly: ZwManaged (Module: ZwManaged)