Reference Library
TextureSampling Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »RenderSettingsTraits »TextureSampling
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract bool TextureSampling { get; set; }
Public MustOverride Property TextureSampling As Boolean
	Get
	Set
public:
virtual property bool TextureSampling {
	bool get () abstract;
	void set (bool value) abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)