Reference Library
DxfIn Method (fileName, logFilename)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »DxfIn(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void DxfIn(
	string fileName,
	string logFilename
)
Public Sub DxfIn ( _
	fileName As String, _
	logFilename As String _
)
public:
void DxfIn(
	String^ fileName,
	String^ logFilename
)
 Parameters
fileName(String)
logFilename(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)