Reference Library
Direction1 Property
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock3d »Direction1
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector3d Direction1 { get; }
Public ReadOnly Property Direction1 As Vector3d
	Get
public:
property Vector3d Direction1 {
	Vector3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)