Reference Library
RemoveAllowedClass Method (type)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptEntityOptions »RemoveAllowedClass(Type)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void RemoveAllowedClass(
	Type type
)
Public Sub RemoveAllowedClass ( _
	type As Type _
)
public:
void RemoveAllowedClass(
	Type^ type
)
 Parameters
type(Type)
Assembly: ZwManaged (Module: ZwManaged)