Reference Library
XrefHandles Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »OsnapPointRef »XrefHandles
 Declaration Syntax
C# | Visual Basic | Visual C++
public Handle[] XrefHandles { get; set; }
Public Property XrefHandles As Handle()
	Get
	Set
public:
property array<Handle>^ XrefHandles {
	array<Handle>^ get ();
	void set (array<Handle>^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)