Reference Library
XrefSubCommandStart Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »XrefSubCommandStart
 Declaration Syntax
C# | Visual Basic | Visual C++
public event XrefSubCommandStartEventHandler XrefSubCommandStart
Public Event XrefSubCommandStart As XrefSubCommandStartEventHandler
public:
 event XrefSubCommandStartEventHandler^ XrefSubCommandStart {
	void add (XrefSubCommandStartEventHandler^ value);
	void remove (XrefSubCommandStartEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)