Reference Library
BooleanIntersect Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RevolvedSurface »BooleanIntersect()
 Members
Icon | Member | Description
BooleanIntersect(Surface)
BooleanIntersect(Solid3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)