Reference Library
PointToWorld Method (pt)
Namespaces »ZwSoft.ZwCAD.EditorInput »Editor »PointToWorld(Point)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d PointToWorld(
	Point pt
)
Public Function PointToWorld ( _
	pt As Point _
) As Point3d
public:
Point3d PointToWorld(
	Point pt
)
 Parameters
pt(Point)
Assembly: ZwManaged (Module: ZwManaged)