Reference Library
Useri3 Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »Useri3
 Declaration Syntax
C# | Visual Basic | Visual C++
public int Useri3 { get; set; }
Public Property Useri3 As Integer
	Get
	Set
public:
property int Useri3 {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)