Reference Library
GetDeterminant Method
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »GetDeterminant()
 Declaration Syntax
C# | Visual Basic | Visual C++
public double GetDeterminant()
Public Function GetDeterminant As Double
public:
double GetDeterminant()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)