Reference Library
UsingDefaultTextPosition Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »UsingDefaultTextPosition
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool UsingDefaultTextPosition { get; set; }
Public Property UsingDefaultTextPosition As Boolean
	Get
	Set
public:
property bool UsingDefaultTextPosition {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)