Reference Library
ViewportObjectId Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »ClientViewInfo »ViewportObjectId
 Declaration Syntax
C# | Visual Basic | Visual C++
public long ViewportObjectId { get; }
Public ReadOnly Property ViewportObjectId As Long
	Get
public:
property long long ViewportObjectId {
	long long get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)