Reference Library
Database Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgFiler »Database
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Database Database { get; }
Public Overridable ReadOnly Property Database As Database
	Get
public:
virtual property Database^ Database {
	Database^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)