Reference Library
SetClipBoundary Method (points)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayReference »SetClipBoundary(Point2d[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetClipBoundary(
	Point2d[] points
)
Public Sub SetClipBoundary ( _
	points As Point2d() _
)
public:
void SetClipBoundary(
	array<Point2d>^ points
)
 Parameters
points(Point2d[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)