Reference Library
FitTolerance Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Spline »FitTolerance
 Declaration Syntax
C# | Visual Basic | Visual C++
[UnitTypeAttribute(UnitType.Distance)]
public double FitTolerance { get; set; }
<UnitTypeAttribute(UnitType.Distance)> _
Public Property FitTolerance As Double
	Get
	Set
[UnitTypeAttribute(UnitType::Distance)]
public:
property double FitTolerance {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)