Reference Library
GetContainers Method
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptNestedEntityResult »GetContainers()
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId[] GetContainers()
Public Function GetContainers As ObjectId()
public:
array<ObjectId>^ GetContainers()
Assembly: ZwManaged (Module: ZwManaged)