Reference Library
Keys Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »Keys
 Declaration Syntax
C# | Visual Basic | Visual C++
protected ICollection Keys { get; }
Protected ReadOnly Property Keys As ICollection
	Get
protected:
property ICollection^ Keys {
	ICollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)