Reference Library
PaperScale Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »PaperScale
 Declaration Syntax
C# | Visual Basic | Visual C++
public double PaperScale { get; }
Public ReadOnly Property PaperScale As Double
	Get
public:
property double PaperScale {
	double get ();
}
Assembly: ZwManaged (Module: ZwManaged)