Reference Library
CloseInput Method (closeFile)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »CloseInput(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CloseInput(
	bool closeFile
)
Public Sub CloseInput ( _
	closeFile As Boolean _
)
public:
void CloseInput(
	bool closeFile
)
 Parameters
closeFile(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)