Reference Library
Rational Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »NurbsData »Rational
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Rational { get; }
Public ReadOnly Property Rational As Boolean
	Get
public:
property bool Rational {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)