Reference Library
GetBackgroundColor Method (row, column)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »GetBackgroundColor(Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Color GetBackgroundColor(
	int row,
	int column
)
Public Overridable Function GetBackgroundColor ( _
	row As Integer, _
	column As Integer _
) As Color
public:
virtual Color^ GetBackgroundColor(
	int row,
	int column
)
 Parameters
row(Int32)
column(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)