Reference Library
NorthPole Property
Namespaces »ZwSoft.ZwCAD.Geometry »Sphere »NorthPole
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d NorthPole { get; }
Public ReadOnly Property NorthPole As Point3d
	Get
public:
property Point3d NorthPole {
	Point3d get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)