Reference Library
Tolerance Constructor (equalVector, equalPoint)
Namespaces »ZwSoft.ZwCAD.Geometry »Tolerance »Tolerance(Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Tolerance(
	double equalVector,
	double equalPoint
)
Public Sub New ( _
	equalVector As Double, _
	equalPoint As Double _
)
public:
Tolerance(
	double equalVector,
	double equalPoint
)
 Parameters
equalVector(Double)
equalPoint(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)