Reference Library
RegAppAcadName Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SymbolUtilityServices »RegAppAcadName
 Declaration Syntax
C# | Visual Basic | Visual C++
public static string RegAppAcadName { get; }
Public Shared ReadOnly Property RegAppAcadName As String
	Get
public:
static property String^ RegAppAcadName {
	String^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)