Reference Library
Update Method (direction, option)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DataLinkManager »Update(UpdateDirection, UpdateOption)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Update(
	UpdateDirection direction,
	UpdateOption option
)
Public Sub Update ( _
	direction As UpdateDirection, _
	option As UpdateOption _
)
public:
void Update(
	UpdateDirection direction,
	UpdateOption option
)
 Parameters
direction(UpdateDirection)
option(UpdateOption)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)