Reference Library
IsLinear Method
Namespaces »ZwSoft.ZwCAD.Geometry »SplineEntity2d »IsLinear()
 Members
Icon | Member | Description
IsLinear(Line2d, Tolerance)
IsLinear(Line2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)