Reference Library
GetParametersOfG1Discontinuity Method (tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »GetParametersOfG1Discontinuity(Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public DoubleCollection GetParametersOfG1Discontinuity(
	Tolerance tolerance
)
Public Function GetParametersOfG1Discontinuity ( _
	tolerance As Tolerance _
) As DoubleCollection
public:
DoubleCollection^ GetParametersOfG1Discontinuity(
	Tolerance tolerance
)
 Parameters
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)