Reference Library
EnableDefaultLighting Method
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »View »EnableDefaultLighting()
 Members
Icon | Member | Description
EnableDefaultLighting(Boolean, DefaultLightingType)
EnableDefaultLighting(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)