Reference Library
IsBoundedBelow Property
Namespaces »ZwSoft.ZwCAD.Geometry »Interval »IsBoundedBelow
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsBoundedBelow { get; }
Public ReadOnly Property IsBoundedBelow As Boolean
	Get
public:
property bool IsBoundedBelow {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)