Reference Library
EdgeColor Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeStyle »EdgeColor
 Declaration Syntax
C# | Visual Basic | Visual C++
public Color EdgeColor { get; set; }
Public Property EdgeColor As Color
	Get
	Set
public:
property Color^ EdgeColor {
	Color^ get ();
	void set (Color^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)