Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.Geometry »IntegerCollection »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual IntegerCollectionEnumerator GetEnumerator()
Public Overridable Function GetEnumerator As IntegerCollectionEnumerator
public:
virtual IntegerCollectionEnumerator^ GetEnumerator()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)