Reference Library
RXClass Class
Namespaces »ZwSoft.ZwCAD.Runtime »RXClass
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcRxClass")]
public sealed class RXClass : RXObject
<WrapperAttribute("ZcRxClass")> _
Public NotInheritable Class RXClass _
	Inherits RXObject
[WrapperAttribute(L"ZcRxClass")]
public ref class RXClass sealed : public RXObject
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
AddX(RXClass, RXObject)
AppName
ClassVersion
Create()
DelX(RXClass)
DxfName
GetX(RXClass)
IsDerivedFrom(RXClass)
MyParent
Name
ProxyFlags
QueryX(RXClass)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | RXClass
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)