Reference Library
FilletEdges Method (subentityIds, radius, startSetback, endSetback)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid3d »FilletEdges(SubentityId[], DoubleCollection, DoubleCollection, DoubleCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void FilletEdges(
	SubentityId[] subentityIds,
	DoubleCollection radius,
	DoubleCollection startSetback,
	DoubleCollection endSetback
)
Public Overridable Sub FilletEdges ( _
	subentityIds As SubentityId(), _
	radius As DoubleCollection, _
	startSetback As DoubleCollection, _
	endSetback As DoubleCollection _
)
public:
virtual void FilletEdges(
	array<SubentityId>^ subentityIds,
	DoubleCollection^ radius,
	DoubleCollection^ startSetback,
	DoubleCollection^ endSetback
)
 Parameters
subentityIds(SubentityId[])
radius(DoubleCollection)
startSetback(DoubleCollection)
endSetback(DoubleCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)