Reference Library
LayerEvaluation Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerEvaluation
 Declaration Syntax
C# | Visual Basic | Visual C++
[FlagsAttribute]
public enum LayerEvaluation
<FlagsAttribute> _
Public Enumeration LayerEvaluation
[FlagsAttribute]
public enum class LayerEvaluation
 Members
Member | Description
NoNewLayerEvaluation
EvalNewXrefLayers
EvalAllNewLayers
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)