Reference Library
PlotToFileCapability Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotConfig »PlotToFileCapability
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlotToFileCapability PlotToFileCapability { get; }
Public ReadOnly Property PlotToFileCapability As PlotToFileCapability
	Get
public:
property PlotToFileCapability PlotToFileCapability {
	PlotToFileCapability get ();
}
Assembly: ZwManaged (Module: ZwManaged)