Reference Library
GetProjectedClosestPointTo Method
Namespaces »ZwSoft.ZwCAD.Geometry »Line3d »GetProjectedClosestPointTo()
 Members
Icon | Member | Description
GetProjectedClosestPointTo(Point3d, Vector3d, Tolerance)
GetProjectedClosestPointTo(Curve3d, Vector3d, Tolerance)
GetProjectedClosestPointTo(Point3d, Vector3d)
GetProjectedClosestPointTo(Curve3d, Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)