Reference Library
TextStyle Constructor (fontName, bigFontName, textSize, x, obliqueAngle, trackingPercent, isBackward, isUpsideDown, isVertical, isOverLined, isUnderlined, styleName)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »TextStyle »TextStyle(String, String, Double, Double, Double, Double, Boolean, Boolean, Boolean, Boolean, Boolean, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public TextStyle(
	string fontName,
	string bigFontName,
	double textSize,
	double x,
	double obliqueAngle,
	double trackingPercent,
	bool isBackward,
	bool isUpsideDown,
	bool isVertical,
	bool isOverLined,
	bool isUnderlined,
	string styleName
)
Public Sub New ( _
	fontName As String, _
	bigFontName As String, _
	textSize As Double, _
	x As Double, _
	obliqueAngle As Double, _
	trackingPercent As Double, _
	isBackward As Boolean, _
	isUpsideDown As Boolean, _
	isVertical As Boolean, _
	isOverLined As Boolean, _
	isUnderlined As Boolean, _
	styleName As String _
)
public:
TextStyle(
	String^ fontName,
	String^ bigFontName,
	double textSize,
	double x,
	double obliqueAngle,
	double trackingPercent,
	bool isBackward,
	bool isUpsideDown,
	bool isVertical,
	bool isOverLined,
	bool isUnderlined,
	String^ styleName
)
 Parameters
fontName(String)
bigFontName(String)
textSize(Double)
x(Double)
obliqueAngle(Double)
trackingPercent(Double)
isBackward(Boolean)
isUpsideDown(Boolean)
isVertical(Boolean)
isOverLined(Boolean)
isUnderlined(Boolean)
styleName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)