Reference Library
TextAngleType Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »TextAngleType
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcDbMLeaderStyle::TextAngleType")]
public enum TextAngleType
<WrapperAttribute("ZcDbMLeaderStyle::TextAngleType")> _
Public Enumeration TextAngleType
[WrapperAttribute(L"ZcDbMLeaderStyle::TextAngleType")]
public enum class TextAngleType
 Members
Member | Description
AlwaysRightReadingAngle
HorizontalAngle
InsertAngle
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)