Reference Library
ModeKeywordsDisabled Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »GripData »ModeKeywordsDisabled
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool ModeKeywordsDisabled { get; set; }
Public Property ModeKeywordsDisabled As Boolean
	Get
	Set
public:
property bool ModeKeywordsDisabled {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)