Reference Library
PlotStyleTableChangedEventHandler Delegate
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleTableChangedEventHandler
 Declaration Syntax
C# | Visual Basic | Visual C++
public delegate void PlotStyleTableChangedEventHandler(
	Object sender,
	PlotStyleTableChangedEventArgs e
)
Public Delegate Sub PlotStyleTableChangedEventHandler ( _
	sender As Object, _
	e As PlotStyleTableChangedEventArgs _
)
public delegate void PlotStyleTableChangedEventHandler(
	Object^ sender,
	PlotStyleTableChangedEventArgs^ e
)
 Parameters
sender(Object)
e(PlotStyleTableChangedEventArgs)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)