Reference Library
FromZcadDocument Method (zcadDocument)
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Document »FromZcadDocument(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Document FromZcadDocument(
	Object zcadDocument
)
Public Shared Function FromZcadDocument ( _
	zcadDocument As Object _
) As Document
public:
static Document^ FromZcadDocument(
	Object^ zcadDocument
)
 Parameters
zcadDocument(Object)
Assembly: ZwManaged (Module: ZwManaged)