Reference Library
GradientOneColorMode Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »GradientOneColorMode
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool GradientOneColorMode { get; set; }
Public Property GradientOneColorMode As Boolean
	Get
	Set
public:
property bool GradientOneColorMode {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)