Reference Library
PlotInfoValidator Class
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotInfoValidator
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcPlPlotInfoValidator")]
public sealed class PlotInfoValidator : RXObject
<WrapperAttribute("AcPlPlotInfoValidator")> _
Public NotInheritable Class PlotInfoValidator _
	Inherits RXObject
[WrapperAttribute(L"AcPlPlotInfoValidator")]
public ref class PlotInfoValidator sealed : public RXObject
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
PlotInfoValidator()
CopyFromUnmanagedObject(IntPtr)
DimensionalWeight
IsCustomPossible(PlotInfo)
MediaBoundsWeight
MediaGroupWeight
MediaMatchingPolicy
MediaMatchingThreshold
PrintableBoundsWeight
SheetDimensionalWeight
SheetMediaGroupWeight
Validate(PlotInfo)
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | PlotInfoValidator
Assembly: ZwManaged (Module: ZwManaged)