Reference Library
BeginDeepClone Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »BeginDeepClone
 Declaration Syntax
C# | Visual Basic | Visual C++
public event IdMappingEventHandler BeginDeepClone
Public Event BeginDeepClone As IdMappingEventHandler
public:
 event IdMappingEventHandler^ BeginDeepClone {
	void add (IdMappingEventHandler^ value);
	void remove (IdMappingEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)