Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellRange »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual IEnumerator<CellReference> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of CellReference)
public:
virtual IEnumerator<CellReference>^ GetEnumerator()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)