Reference Library
EndPage Event
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotReactorManager »EndPage
 Declaration Syntax
C# | Visual Basic | Visual C++
public event EndPageEventHandler EndPage
Public Event EndPage As EndPageEventHandler
public:
 event EndPageEventHandler^ EndPage {
	void add (EndPageEventHandler^ value);
	void remove (EndPageEventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)