Reference Library
Format Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Field »Format
 Declaration Syntax
C# | Visual Basic | Visual C++
public string Format { get; set; }
Public Property Format As String
	Get
	Set
public:
property String^ Format {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)