Reference Library
Reset Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MlineStyle »Reset()
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Reset()
Public Sub Reset
public:
void Reset()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)