Reference Library
GetPreviousBackground Method (type)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »GetPreviousBackground(DrawableType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public ObjectId GetPreviousBackground(
	DrawableType type
)
Public Function GetPreviousBackground ( _
	type As DrawableType _
) As ObjectId
public:
ObjectId GetPreviousBackground(
	DrawableType type
)
 Parameters
type(DrawableType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)