Reference Library
Cylinder Constructor (radius, origin, axisOfSymmetry, referenceAxis, height, startAngle, endAngle)
Namespaces »ZwSoft.ZwCAD.Geometry »Cylinder »Cylinder(Double, Point3d, Vector3d, Vector3d, Interval, Double, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Cylinder(
	double radius,
	Point3d origin,
	Vector3d axisOfSymmetry,
	Vector3d referenceAxis,
	Interval height,
	double startAngle,
	double endAngle
)
Public Sub New ( _
	radius As Double, _
	origin As Point3d, _
	axisOfSymmetry As Vector3d, _
	referenceAxis As Vector3d, _
	height As Interval, _
	startAngle As Double, _
	endAngle As Double _
)
public:
Cylinder(
	double radius,
	Point3d origin,
	Vector3d axisOfSymmetry,
	Vector3d referenceAxis,
	Interval^ height,
	double startAngle,
	double endAngle
)
 Parameters
radius(Double)
origin(Point3d)
axisOfSymmetry(Vector3d)
referenceAxis(Vector3d)
height(Interval)
startAngle(Double)
endAngle(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)