Reference Library
FaceStyle Class
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »FaceStyle
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGiFaceStyle")]
public sealed class FaceStyle : RXObject,
	ICloneable
<WrapperAttribute("ZcGiFaceStyle")> _
Public NotInheritable Class FaceStyle _
	Inherits RXObject _
	Implements ICloneable
[WrapperAttribute(L"ZcGiFaceStyle")]
public ref class FaceStyle sealed : public RXObject,
	ICloneable
 Members
All Members | Constructors | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
FaceStyle()
Clone()
FaceColorMode
FaceModifiers
ICloneable.Clone()
LightingModel
LightingQuality
MonoColor
Opacity
Set(FaceStyle)
SpecularHighlight
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | RXObject
|  |  | FaceStyle
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)