Reference Library
PerspectiveOn Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Viewport »PerspectiveOn
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool PerspectiveOn { get; set; }
Public Property PerspectiveOn As Boolean
	Get
	Set
public:
property bool PerspectiveOn {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)