Reference Library
MeshPointMaps Constructor (sourcePts, destPts)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MeshPointMaps »MeshPointMaps(Point2dCollection, Point2dCollection)
 Declaration Syntax
C# | Visual Basic | Visual C++
public MeshPointMaps(
	Point2dCollection sourcePts,
	Point2dCollection destPts
)
Public Sub New ( _
	sourcePts As Point2dCollection, _
	destPts As Point2dCollection _
)
public:
MeshPointMaps(
	Point2dCollection^ sourcePts,
	Point2dCollection^ destPts
)
 Parameters
sourcePts(Point2dCollection)
destPts(Point2dCollection)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)