Reference Library
Set Method
Namespaces »ZwSoft.ZwCAD.Geometry »LineSegment3d »Set()
 Members
Icon | Member | Description
Set(Curve3d, Curve3d, Double, Double)
Set(Curve3d, Point3d, Double)
Set(Point3d, Vector3d)
Set(Point3d, Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)