Reference Library
MakeEdgeVisibleAt Method (faceIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FaceRecord »MakeEdgeVisibleAt(Int16)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void MakeEdgeVisibleAt(
	short faceIndex
)
Public Sub MakeEdgeVisibleAt ( _
	faceIndex As Short _
)
public:
void MakeEdgeVisibleAt(
	short faceIndex
)
 Parameters
faceIndex(Int16)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)