Reference Library
RemoveContext Method (contextName)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »ObjectContextCollection »RemoveContext(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void RemoveContext(
	string contextName
)
Public Overridable Sub RemoveContext ( _
	contextName As String _
)
public:
virtual void RemoveContext(
	String^ contextName
)
 Parameters
contextName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)