Reference Library
DiametricDimension Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DiametricDimension »DiametricDimension()
 Members
Icon | Member | Description
DiametricDimension(Point3d, Point3d, Double, String, ObjectId)
DiametricDimension(IntPtr, Boolean)
DiametricDimension()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)