Reference Library
MLeaderText Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MLeader »MLeaderText
 Declaration Syntax
C# | Visual Basic | Visual C++
public MText MLeaderText { get; set; }
Public Property MLeaderText As MText
	Get
	Set
public:
property MText^ MLeaderText {
	MText^ get ();
	void set (MText^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)