Reference Library
IsPlanar Method
Namespaces »ZwSoft.ZwCAD.Geometry »CompositeCurve3d »IsPlanar()
 Members
Icon | Member | Description
IsPlanar(Plane, Tolerance)
IsPlanar(Plane)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)