Reference Library
DeviceType Enumeration
Namespaces »ZwSoft.ZwCAD.PlottingServices »DeviceType
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum DeviceType
Public Enumeration DeviceType
public enum class DeviceType
 Members
Member | Description
Uninitialized
OneOffConfig
PC3File
SystemPrinter
Assembly: ZwManaged (Module: ZwManaged)