Reference Library
FrontClipDistance Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AbstractViewTableRecord »FrontClipDistance
 Declaration Syntax
C# | Visual Basic | Visual C++
public double FrontClipDistance { get; set; }
Public Property FrontClipDistance As Double
	Get
	Set
public:
property double FrontClipDistance {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)