Reference Library
DsdData Property
Namespaces »ZwSoft.ZwCAD.Publishing »AboutToBeginPublishingEventArgs »DsdData
 Declaration Syntax
C# | Visual Basic | Visual C++
public DsdData DsdData { get; }
Public ReadOnly Property DsdData As DsdData
	Get
public:
property DsdData^ DsdData {
	DsdData^ get ();
}
Assembly: ZwManaged (Module: ZwManaged)