Reference Library
SaveComplete Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »SaveComplete
 Declaration Syntax
C# | Visual Basic | Visual C++
public event DatabaseIOEventHandler SaveComplete
Public Event SaveComplete As DatabaseIOEventHandler
public:
 event DatabaseIOEventHandler^ SaveComplete {
	void add (DatabaseIOEventHandler^ value);
	void remove (DatabaseIOEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)