Reference Library
SetContentColor Method (row, column, contentIndex, color)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetContentColor(Int32, Int32, Int32, Color)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetContentColor(
	int row,
	int column,
	int contentIndex,
	Color color
)
Public Overridable Sub SetContentColor ( _
	row As Integer, _
	column As Integer, _
	contentIndex As Integer, _
	color As Color _
)
public:
virtual void SetContentColor(
	int row,
	int column,
	int contentIndex,
	Color^ color
)
 Parameters
row(Int32)
column(Int32)
contentIndex(Int32)
color(Color)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)