Reference Library
GetReverseParameterCurve Method
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d »GetReverseParameterCurve()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Curve2d GetReverseParameterCurve()
Public Function GetReverseParameterCurve As Curve2d
public:
Curve2d^ GetReverseParameterCurve()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)