Reference Library
Solid Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Solid »Solid()
 Members
Icon | Member | Description
Solid(Point3d, Point3d, Point3d, Point3d)
Solid(Point3d, Point3d, Point3d)
Solid()
Solid(IntPtr, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)