Reference Library
UnderlayItemCollection Class
Namespaces »ZwSoft.ZwCAD.DatabaseServices »UnderlayItemCollection
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class UnderlayItemCollection : ICollection
Public NotInheritable Class UnderlayItemCollection _
	Implements ICollection
public ref class UnderlayItemCollection sealed : ICollection
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
CopyTo(UnderlayItem[], Int32)
Count
GetEnumerator()
ICollection.CopyTo(Array, Int32)
ICollection.IsSynchronized
Item[Int32]
ICollection.SyncRoot
 Inheritance Hierarchy
Object
UnderlayItemCollection
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)