Reference Library
IsEqualTo Method (a, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2dInfo »IsEqualTo(Matrix2dInfo, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	Matrix2dInfo a,
	Tolerance tolerance
)
Public Function IsEqualTo ( _
	a As Matrix2dInfo, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsEqualTo(
	Matrix2dInfo a,
	Tolerance tolerance
)
 Parameters
a(Matrix2dInfo)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)