Reference Library
IsFixedSize Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionary »IsFixedSize
 Declaration Syntax
C# | Visual Basic | Visual C++
protected bool IsFixedSize { get; }
Protected ReadOnly Property IsFixedSize As Boolean
	Get
protected:
property bool IsFixedSize {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)