Reference Library
IsParallelTo Method (plane, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »LinearEntity3d »IsParallelTo(PlanarEntity, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsParallelTo(
	PlanarEntity plane,
	Tolerance tolerance
)
Public Function IsParallelTo ( _
	plane As PlanarEntity, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsParallelTo(
	PlanarEntity^ plane,
	Tolerance tolerance
)
 Parameters
plane(PlanarEntity)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)