Reference Library
SetBreakHeight Method (index, height)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »SetBreakHeight(Int32, Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetBreakHeight(
	int index,
	double height
)
Public Overridable Sub SetBreakHeight ( _
	index As Integer, _
	height As Double _
)
public:
virtual void SetBreakHeight(
	int index,
	double height
)
 Parameters
index(Int32)
height(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)