Reference Library
Insert Method (index, value)
Namespaces »ZwSoft.ZwCAD.Colors »TransparencyCollection »Insert(Int32, Transparency)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Insert(
	int index,
	Transparency value
)
Public Sub Insert ( _
	index As Integer, _
	value As Transparency _
)
public:
virtual void Insert(
	int index,
	Transparency value
) sealed
 Parameters
index(Int32)
value(Transparency)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)