Reference Library
UpperLimit Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptIntegerOptions »UpperLimit
 Declaration Syntax
C# | Visual Basic | Visual C++
public int UpperLimit { get; set; }
Public Property UpperLimit As Integer
	Get
	Set
public:
property int UpperLimit {
	int get ();
	void set (int value);
}
Assembly: ZwManaged (Module: ZwManaged)