Reference Library
InvalidationHint Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »InvalidationHint
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum InvalidationHint
Public Enumeration InvalidationHint
public enum class InvalidationHint
 Members
Member | Description
kInvalidateMaterials
kInvalidateAll
kInvalidateViewportCache
kInvalidateIsolines
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)