Reference Library
ApplicationData Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DynamicDimensionData »ApplicationData
 Declaration Syntax
C# | Visual Basic | Visual C++
public Object ApplicationData { get; set; }
Public Property ApplicationData As Object
	Get
	Set
public:
property Object^ ApplicationData {
	Object^ get ();
	void set (Object^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)