Reference Library
Elevation Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices.Filters »SpatialFilterDefinition »Elevation
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Elevation { get; }
Public ReadOnly Property Elevation As Double
	Get
public:
property double Elevation {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)