Reference Library
EndAngle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Ellipse »EndAngle
 Declaration Syntax
C# | Visual Basic | Visual C++
public double EndAngle { get; set; }
Public Property EndAngle As Double
	Get
	Set
public:
property double EndAngle {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)