Reference Library
MsLtScale Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »MsLtScale
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool MsLtScale { get; set; }
Public Property MsLtScale As Boolean
	Get
	Set
public:
property bool MsLtScale {
	bool get ();
	void set (bool value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)