Reference Library
SurfaceSurfaceIntersectorConfiguration Enumeration
Namespaces »ZwSoft.ZwCAD.Geometry »SurfaceSurfaceIntersectorConfiguration
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGe::ssiConfig")]
public enum SurfaceSurfaceIntersectorConfiguration
<WrapperAttribute("ZcGe::ssiConfig")> _
Public Enumeration SurfaceSurfaceIntersectorConfiguration
[WrapperAttribute(L"ZcGe::ssiConfig")]
public enum class SurfaceSurfaceIntersectorConfiguration
 Members
Member | Description
Unknown
Coincident
In
Out
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)