Reference Library
C Property
Namespaces »ZwSoft.ZwCAD.Geometry »PlanarEquationCoefficients »C
 Declaration Syntax
C# | Visual Basic | Visual C++
public double C { get; }
Public ReadOnly Property C As Double
	Get
public:
property double C {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)