Reference Library
Explicit Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DBDictionaryEntry »Explicit(DictionaryEntry to DBDictionaryEntry)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static explicit operator DBDictionaryEntry (
	DictionaryEntry entry
)
Public Shared Narrowing Operator CType ( _
	entry As DictionaryEntry _
) As DBDictionaryEntry
static explicit operator DBDictionaryEntry (
	DictionaryEntry entry
)
 Parameters
entry(DictionaryEntry)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)