Reference Library
GetLayerStateMask Method (name)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »GetLayerStateMask(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerStateMasks GetLayerStateMask(
	string name
)
Public Function GetLayerStateMask ( _
	name As String _
) As LayerStateMasks
public:
LayerStateMasks GetLayerStateMask(
	String^ name
)
 Parameters
name(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)