Reference Library
IsCodirectionalTo Method (vector, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »IsCodirectionalTo(Vector3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsCodirectionalTo(
	Vector3d vector,
	Tolerance tolerance
)
Public Function IsCodirectionalTo ( _
	vector As Vector3d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsCodirectionalTo(
	Vector3d vector,
	Tolerance tolerance
)
 Parameters
vector(Vector3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)