Reference Library
LayerTableRecord Constructor
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerTableRecord »LayerTableRecord()
 Members
Icon | Member | Description
LayerTableRecord()
LayerTableRecord(IntPtr, Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)