Reference Library
Set Method (basePoint, maximumPoint)
Namespaces »ZwSoft.ZwCAD.Geometry »BoundBlock3d »Set(Point3d, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Set(
	Point3d basePoint,
	Point3d maximumPoint
)
Public Sub Set ( _
	basePoint As Point3d, _
	maximumPoint As Point3d _
)
public:
void Set(
	Point3d basePoint,
	Point3d maximumPoint
)
 Parameters
basePoint(Point3d)
maximumPoint(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)