Reference Library
SetFaceTransparency Method (nSecType, nGeometry, nTransparency)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SectionSettings »SetFaceTransparency(SectionType, SectionGeometry, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetFaceTransparency(
	SectionType nSecType,
	SectionGeometry nGeometry,
	int nTransparency
)
Public Sub SetFaceTransparency ( _
	nSecType As SectionType, _
	nGeometry As SectionGeometry, _
	nTransparency As Integer _
)
public:
void SetFaceTransparency(
	SectionType nSecType,
	SectionGeometry nGeometry,
	int nTransparency
)
 Parameters
nSecType(SectionType)
nGeometry(SectionGeometry)
nTransparency(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)