Reference Library
Curve2d Class
Namespaces »ZwSoft.ZwCAD.Geometry »Curve2d
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("ZcGeCurve2d")]
public abstract class Curve2d : Entity2d
<WrapperAttribute("ZcGeCurve2d")> _
Public MustInherit Class Curve2d _
	Inherits Entity2d
[WrapperAttribute(L"ZcGeCurve2d")]
public ref class Curve2d abstract : public Entity2d
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
BoundBlock
Create(IntPtr, Boolean)
EndPoint
EvaluatePoint(Double)
Explode(Interval)
GetArea(Double, Double, Tolerance)
GetArea(Double, Double)
GetBoundBlockOf(Interval)
GetClosestPointTo(Point2d, Tolerance)
GetClosestPointTo(Curve2d, Tolerance)
GetClosestPointTo(Point2d)
GetClosestPointTo(Curve2d)
GetDistanceTo(Point2d, Tolerance)
GetDistanceTo(Curve2d, Tolerance)
GetDistanceTo(Point2d)
GetDistanceTo(Curve2d)
GetInterval()
GetLength(Double, Double, Tolerance)
GetLength(Double, Double)
GetNormalPoint(Point2d, Tolerance)
GetNormalPoint(Point2d)
GetOrthoBoundBlockOf(Interval)
GetParameterAtLength(Double, Double, Boolean, Tolerance)
GetParameterAtLength(Double, Double, Boolean)
GetParameterOf(Point2d, Tolerance)
GetParameterOf(Point2d)
GetReverseParameterCurve()
GetSamplePoints(Double, Double, Double)
GetSamplePoints(Int32)
GetSplitCurves(Double)
GetTrimmedOffset(Double, OffsetCurveExtensionType, Tolerance)
GetTrimmedOffset(Double, OffsetCurveExtensionType)
HasEndPoint
HasStartPoint
IsClosed(Tolerance)
IsClosed()
IsDegenerate(Entity2d, Tolerance)
IsDegenerate(Entity2d)
IsLinear(Line2d, Tolerance)
IsLinear(Line2d)
IsOn(Point2d, Double, Tolerance)
IsOn(Double, Tolerance)
IsOn(Point2d, Double)
IsOn(Point2d, Tolerance)
IsOn(Double)
IsOn(Point2d)
IsPeriodic(Double)
OrthoBoundBlock
SetInterval(Interval)
StartPoint
 Inheritance Hierarchy
Object
MarshalByRefObject
| DisposableWrapper
|  | Entity2d
|  |  | Curve2d
|  |  |  | CircularArc2d
|  |  |  | CompositeCurve2d
|  |  |  | EllipticalArc2d
|  |  |  | LinearEntity2d
|  |  |  | OffsetCurve2d
|  |  |  | SplineEntity2d
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)