Reference Library
SetSelectionMarkers Method (selectionMarkers)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »EdgeData »SetSelectionMarkers(IntPtr[])
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetSelectionMarkers(
	IntPtr[] selectionMarkers
)
Public Sub SetSelectionMarkers ( _
	selectionMarkers As IntPtr() _
)
public:
void SetSelectionMarkers(
	array<IntPtr>^ selectionMarkers
)
 Parameters
selectionMarkers(IntPtr[])
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)