Reference Library
ProjectedIntersectWith Method (line, projectionDirection)
Namespaces »ZwSoft.ZwCAD.Geometry »CircularArc3d »ProjectedIntersectWith(LinearEntity3d, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d[] ProjectedIntersectWith(
	LinearEntity3d line,
	Vector3d projectionDirection
)
Public Function ProjectedIntersectWith ( _
	line As LinearEntity3d, _
	projectionDirection As Vector3d _
) As Point3d()
public:
array<Point3d>^ ProjectedIntersectWith(
	LinearEntity3d^ line,
	Vector3d projectionDirection
)
 Parameters
line(LinearEntity3d)
projectionDirection(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)