Reference Library
JigPromptStringOptions Constructor (messageAndKeywords, globalKeywords)
Namespaces »ZwSoft.ZwCAD.EditorInput »JigPromptStringOptions »JigPromptStringOptions(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public JigPromptStringOptions(
	string messageAndKeywords,
	string globalKeywords
)
Public Sub New ( _
	messageAndKeywords As String, _
	globalKeywords As String _
)
public:
JigPromptStringOptions(
	String^ messageAndKeywords,
	String^ globalKeywords
)
 Parameters
messageAndKeywords(String)
globalKeywords(String)
Assembly: ZwManaged (Module: ZwManaged)