Reference Library
PushScaleTransform Method (behavior, extents)
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »Geometry »PushScaleTransform(ScaleBehavior, Point3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract Matrix3d PushScaleTransform(
	ScaleBehavior behavior,
	Point3d extents
)
Public MustOverride Function PushScaleTransform ( _
	behavior As ScaleBehavior, _
	extents As Point3d _
) As Matrix3d
public:
virtual Matrix3d PushScaleTransform(
	ScaleBehavior behavior,
	Point3d extents
) abstract
 Parameters
behavior(ScaleBehavior)
extents(Point3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)