Reference Library
Matrix2dBuilder Constructor (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix2dBuilder »Matrix2dBuilder(Matrix2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Matrix2dBuilder(
	Matrix2d value
)
Public Sub New ( _
	value As Matrix2d _
)
public:
Matrix2dBuilder(
	Matrix2d value
)
 Parameters
value(Matrix2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)