Reference Library
GetHatchLinesData Method
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Hatch »GetHatchLinesData()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Line2dCollection GetHatchLinesData()
Public Function GetHatchLinesData As Line2dCollection
public:
Line2dCollection^ GetHatchLinesData()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)