Reference Library
SheetProgressPos Property
Namespaces »ZwSoft.ZwCAD.PlottingServices »PlotProgress »SheetProgressPos
 Declaration Syntax
C# | Visual Basic | Visual C++
public int SheetProgressPos { get; set; }
Public Property SheetProgressPos As Integer
	Get
	Set
public:
property int SheetProgressPos {
	int get ();
	void set (int value);
}
Assembly: ZwManaged (Module: ZwManaged)