Reference Library
LowerLimit Property
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptIntegerOptions »LowerLimit
 Declaration Syntax
C# | Visual Basic | Visual C++
public int LowerLimit { get; set; }
Public Property LowerLimit As Integer
	Get
	Set
public:
property int LowerLimit {
	int get ();
	void set (int value);
}
Assembly: ZwManaged (Module: ZwManaged)