Reference Library
BoundingBoxIntersectWith Method (entityPointer, intersectType, projectionPlane, points, thisGraphicSystemMarker, otherGraphicSystemMarker)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Entity »BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
[ObsoleteAttribute("Use the overload taking IntPtr instead.")]
public void BoundingBoxIntersectWith(
	Entity entityPointer,
	Intersect intersectType,
	Plane projectionPlane,
	Point3dCollection points,
	int thisGraphicSystemMarker,
	int otherGraphicSystemMarker
)
<ObsoleteAttribute("Use the overload taking IntPtr instead.")> _
Public Sub BoundingBoxIntersectWith ( _
	entityPointer As Entity, _
	intersectType As Intersect, _
	projectionPlane As Plane, _
	points As Point3dCollection, _
	thisGraphicSystemMarker As Integer, _
	otherGraphicSystemMarker As Integer _
)
[ObsoleteAttribute(L"Use the overload taking IntPtr instead.")]
public:
void BoundingBoxIntersectWith(
	Entity^ entityPointer,
	Intersect intersectType,
	Plane^ projectionPlane,
	Point3dCollection^ points,
	int thisGraphicSystemMarker,
	int otherGraphicSystemMarker
)
 Parameters
entityPointer(Entity)
intersectType(Intersect)
projectionPlane(Plane)
points(Point3dCollection)
thisGraphicSystemMarker(Int32)
otherGraphicSystemMarker(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)