Reference Library
IsNull Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FullSubentityPath »IsNull
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsNull { get; }
Public ReadOnly Property IsNull As Boolean
	Get
public:
property bool IsNull {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)