Reference Library
ToString Method (format, provider)
Namespaces »ZwSoft.ZwCAD.Geometry »Matrix3d »ToString(String, IFormatProvider)
 Declaration Syntax
C# | Visual Basic | Visual C++
public string ToString(
	string format,
	IFormatProvider provider
)
Public Function ToString ( _
	format As String, _
	provider As IFormatProvider _
) As String
public:
virtual String^ ToString(
	String^ format,
	IFormatProvider^ provider
) sealed
 Parameters
format(String)
provider(IFormatProvider)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)