Reference Library
PromptOptions Constructor (message)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptOptions »PromptOptions(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal PromptOptions(
	string message
)
Protected Friend Sub New ( _
	message As String _
)
protected public:
PromptOptions(
	String^ message
)
 Parameters
message(String)
Assembly: ZwManaged (Module: ZwManaged)