Reference Library
Plane Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Plane »Plane()
 Declaration Syntax
C# | Visual Basic | Visual C++
public Plane()
Public Sub New
public:
Plane()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)