Reference Library
SetLayer Method (value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »SetLayer(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetLayer(
	string value
)
Public Sub SetLayer ( _
	value As String _
)
public:
void SetLayer(
	String^ value
)
 Parameters
value(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)