Reference Library
GetPoint3dAt Method (index)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Polyline »GetPoint3dAt(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d GetPoint3dAt(
	int index
)
Public Function GetPoint3dAt ( _
	index As Integer _
) As Point3d
public:
Point3d GetPoint3dAt(
	int index
)
 Parameters
index(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)