Reference Library
NumViews Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »NumViews
 Declaration Syntax
C# | Visual Basic | Visual C++
public abstract int NumViews { get; }
Public MustOverride ReadOnly Property NumViews As Integer
	Get
public:
virtual property int NumViews {
	int get () abstract;
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)