Reference Library
GetFormula Method (row, column, contentIndex)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Table »GetFormula(Int32, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string GetFormula(
	int row,
	int column,
	int contentIndex
)
Public Overridable Function GetFormula ( _
	row As Integer, _
	column As Integer, _
	contentIndex As Integer _
) As String
public:
virtual String^ GetFormula(
	int row,
	int column,
	int contentIndex
)
 Parameters
row(Int32)
column(Int32)
contentIndex(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)