Reference Library
Length Property
Namespaces »ZwSoft.ZwCAD.Geometry »LineSegment2d »Length
 Declaration Syntax
C# | Visual Basic | Visual C++
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
public:
property double Length {
	double get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)