Reference Library
Group Constructor (description, selectable)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Group »Group(String, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Group(
	string description,
	bool selectable
)
Public Sub New ( _
	description As String, _
	selectable As Boolean _
)
public:
Group(
	String^ description,
	bool selectable
)
 Parameters
description(String)
selectable(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)