Reference Library
FitPoints Property
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2dFitData »FitPoints
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point2dCollection FitPoints { get; }
Public ReadOnly Property FitPoints As Point2dCollection
	Get
public:
property Point2dCollection^ FitPoints {
	Point2dCollection^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)