Reference Library
SystemVariableChangedEventArgs Class
Namespaces »ZwSoft.ZwCAD.ApplicationServices »SystemVariableChangedEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class SystemVariableChangedEventArgs : EventArgs
Public NotInheritable Class SystemVariableChangedEventArgs _
	Inherits EventArgs
public ref class SystemVariableChangedEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Changed
Name
 Inheritance Hierarchy
Object
EventArgs
| SystemVariableChangedEventArgs
Assembly: ZwManaged (Module: ZwManaged)