Reference Library
NurbCurve2d Constructor (fitPoints, startTangent, endTangent, startTangentDefined, endTangentDefined)
Namespaces »ZwSoft.ZwCAD.Geometry »NurbCurve2d »NurbCurve2d(Point2dCollection, Vector2d, Vector2d, Boolean, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public NurbCurve2d(
	Point2dCollection fitPoints,
	Vector2d startTangent,
	Vector2d endTangent,
	bool startTangentDefined,
	bool endTangentDefined
)
Public Sub New ( _
	fitPoints As Point2dCollection, _
	startTangent As Vector2d, _
	endTangent As Vector2d, _
	startTangentDefined As Boolean, _
	endTangentDefined As Boolean _
)
public:
NurbCurve2d(
	Point2dCollection^ fitPoints,
	Vector2d startTangent,
	Vector2d endTangent,
	bool startTangentDefined,
	bool endTangentDefined
)
 Parameters
fitPoints(Point2dCollection)
startTangent(Vector2d)
endTangent(Vector2d)
startTangentDefined(Boolean)
endTangentDefined(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)