Reference Library
PromptNestedEntityOptionsEventArgs Class
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptNestedEntityOptionsEventArgs
 Declaration Syntax
C# | Visual Basic | Visual C++
public sealed class PromptNestedEntityOptionsEventArgs : EventArgs
Public NotInheritable Class PromptNestedEntityOptionsEventArgs _
	Inherits EventArgs
public ref class PromptNestedEntityOptionsEventArgs sealed : public EventArgs
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
Options
 Inheritance Hierarchy
Object
EventArgs
| PromptNestedEntityOptionsEventArgs
Assembly: ZwManaged (Module: ZwManaged)