Reference Library
Contains Method (id)
Namespaces »ZwSoft.ZwCAD.Runtime »Dictionary »Contains(Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual bool Contains(
	int id
)
Public Overridable Function Contains ( _
	id As Integer _
) As Boolean
public:
virtual bool Contains(
	int id
)
 Parameters
id(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)