Reference Library
SetBackgroundColor Method (row, column, value)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »SetBackgroundColor(Int32, Int32, Color)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual void SetBackgroundColor(
	int row,
	int column,
	Color value
)
Public Overridable Sub SetBackgroundColor ( _
	row As Integer, _
	column As Integer, _
	value As Color _
)
public:
virtual void SetBackgroundColor(
	int row,
	int column,
	Color^ value
)
 Parameters
row(Int32)
column(Int32)
value(Color)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)