Reference Library
IsEqualTo Method (point, tolerance)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »IsEqualTo(Point3d, Tolerance)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsEqualTo(
	Point3d point,
	Tolerance tolerance
)
Public Function IsEqualTo ( _
	point As Point3d, _
	tolerance As Tolerance _
) As Boolean
public:
bool IsEqualTo(
	Point3d point,
	Tolerance tolerance
)
 Parameters
point(Point3d)
tolerance(Tolerance)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)