Reference Library
EffectivePlotOffsetYDevice Property
Namespaces »ZwSoft.ZwCAD.Publishing »PublishSheetEventArgs »EffectivePlotOffsetYDevice
 Declaration Syntax
C# | Visual Basic | Visual C++
public int EffectivePlotOffsetYDevice { get; }
Public ReadOnly Property EffectivePlotOffsetYDevice As Integer
	Get
public:
property int EffectivePlotOffsetYDevice {
	int get ();
}
Assembly: ZwManaged (Module: ZwManaged)