Reference Library
GetEnumerator Method
Namespaces »ZwSoft.ZwCAD.Geometry »Int32Collection »GetEnumerator()
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual Int32CollectionEnumerator GetEnumerator()
Public Overridable Function GetEnumerator As Int32CollectionEnumerator
public:
virtual Int32CollectionEnumerator^ GetEnumerator()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)