Reference Library
GraphicsSystemMarkerPtr Property
Namespaces »ZwSoft.ZwCAD.EditorInput »SelectedSubObject »GraphicsSystemMarkerPtr
 Declaration Syntax
C# | Visual Basic | Visual C++
public IntPtr GraphicsSystemMarkerPtr { get; }
Public ReadOnly Property GraphicsSystemMarkerPtr As IntPtr
	Get
public:
property IntPtr GraphicsSystemMarkerPtr {
	IntPtr get ();
}
Assembly: ZwManaged (Module: ZwManaged)