Reference Library
GetInverseTangentVector Method (vector, point)
Namespaces »ZwSoft.ZwCAD.Geometry »PointOnSurface »GetInverseTangentVector(Vector3d, Point2d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Vector2d GetInverseTangentVector(
	Vector3d vector,
	Point2d point
)
Public Function GetInverseTangentVector ( _
	vector As Vector3d, _
	point As Point2d _
) As Vector2d
public:
Vector2d GetInverseTangentVector(
	Vector3d vector,
	Point2d point
)
 Parameters
vector(Vector3d)
point(Point2d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)