Reference Library
AcquireAngle Method (messageAndKeywords, globalKeywords)
Namespaces »ZwSoft.ZwCAD.EditorInput »JigPrompts »AcquireAngle(String, String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDoubleResult AcquireAngle(
	string messageAndKeywords,
	string globalKeywords
)
Public Function AcquireAngle ( _
	messageAndKeywords As String, _
	globalKeywords As String _
) As PromptDoubleResult
public:
PromptDoubleResult^ AcquireAngle(
	String^ messageAndKeywords,
	String^ globalKeywords
)
 Parameters
messageAndKeywords(String)
globalKeywords(String)
Assembly: ZwManaged (Module: ZwManaged)