Reference Library
Idle Event
Namespaces »ZwSoft.ZwCAD.ApplicationServices »Application »Idle
 Declaration Syntax
C# | Visual Basic | Visual C++
public static event EventHandler Idle
Public Shared Event Idle As EventHandler
public:
static  event EventHandler^ Idle {
	void add (EventHandler^ value);
	void remove (EventHandler^ value);
}
Assembly: ZwManaged (Module: ZwManaged)