Reference Library
DarkPalette Property
Namespaces »ZwSoft.ZwCAD.GraphicsSystem »Device »DarkPalette
 Declaration Syntax
C# | Visual Basic | Visual C++
public static Color[] DarkPalette { get; }
Public Shared ReadOnly Property DarkPalette As Color()
	Get
public:
static property array<Color>^ DarkPalette {
	array<Color>^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)