Reference Library
Rows Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »MInsertBlock »Rows
 Declaration Syntax
C# | Visual Basic | Visual C++
public short Rows { get; set; }
Public Property Rows As Short
	Get
	Set
public:
property short Rows {
	short get ();
	void set (short value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)