Reference Library
LineJoinStyle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotStyleData »LineJoinStyle
 Declaration Syntax
C# | Visual Basic | Visual C++
public LineJoinStyle LineJoinStyle { get; set; }
Public Property LineJoinStyle As LineJoinStyle
	Get
	Set
public:
property LineJoinStyle LineJoinStyle {
	LineJoinStyle get ();
	void set (LineJoinStyle value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)