Reference Library
Closed Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »NurbsData »Closed
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool Closed { get; }
Public ReadOnly Property Closed As Boolean
	Get
public:
property bool Closed {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)