Reference Library
Dispose Method ()
Namespaces »ZwSoft.ZwCAD.Runtime »ExtensionApplicationHolder »Dispose(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected virtual void Dispose(
	bool
)
Protected Overridable Sub Dispose ( _
	 As Boolean _
)
protected:
virtual void Dispose(
	bool
)
 Parameters
(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)