Reference Library
Remove Method (value)
Namespaces »ZwSoft.ZwCAD.Windows »PaneCollection »Remove(Pane)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void Remove(
	Pane value
)
Public Sub Remove ( _
	value As Pane _
)
public:
void Remove(
	Pane^ value
)
 Parameters
value(Pane)
Assembly: ZwManaged (Module: ZwManaged)