Reference Library
DwgFileWasSavedByZwSoftSoftware Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »DwgFileWasSavedByZwSoftSoftware
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool DwgFileWasSavedByZwSoftSoftware { get; }
Public ReadOnly Property DwgFileWasSavedByZwSoftSoftware As Boolean
	Get
public:
property bool DwgFileWasSavedByZwSoftSoftware {
	bool get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)