Reference Library
OptionsDialogResult Structure
Namespaces »ZwSoft.ZwCAD.Publishing »OptionsDialogResult
 Declaration Syntax
C# | Visual Basic | Visual C++
public struct OptionsDialogResult
Public Structure OptionsDialogResult
public value class OptionsDialogResult
 Members
All Members | Methods | Properties
Public
Protected | Instance
Static | Declared
Inherited
Icon | Member | Description
DsdData
PlotConfig
Status
Assembly: ZwManaged (Module: ZwManaged)