Reference Library
GetOverride Method (row, column, content)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »FormattedTableData »GetOverride(Int32, Int32, Int32)
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual CellProperties GetOverride(
	int row,
	int column,
	int content
)
Public Overridable Function GetOverride ( _
	row As Integer, _
	column As Integer, _
	content As Integer _
) As CellProperties
public:
virtual CellProperties GetOverride(
	int row,
	int column,
	int content
)
 Parameters
row(Int32)
column(Int32)
content(Int32)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)