Reference Library
GetImageDictionary Method (database)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »RasterImageDef »GetImageDictionary(Database)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static ObjectId GetImageDictionary(
	Database database
)
Public Shared Function GetImageDictionary ( _
	database As Database _
) As ObjectId
public:
static ObjectId GetImageDictionary(
	Database^ database
)
 Parameters
database(Database)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)