Reference Library
JoinStyle Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »JoinStyle
 Declaration Syntax
C# | Visual Basic | Visual C++
public JoinStyle JoinStyle { get; set; }
Public Property JoinStyle As JoinStyle
	Get
	Set
public:
property JoinStyle JoinStyle {
	JoinStyle get ();
	void set (JoinStyle value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)