Reference Library
SolidHist Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »SolidHist
 Declaration Syntax
C# | Visual Basic | Visual C++
public int SolidHist { get; set; }
Public Property SolidHist As Integer
	Get
	Set
public:
property int SolidHist {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)