Reference Library
OrthoBoundBlock Property
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »OrthoBoundBlock
 Declaration Syntax
C# | Visual Basic | Visual C++
public BoundBlock3d OrthoBoundBlock { get; }
Public ReadOnly Property OrthoBoundBlock As BoundBlock3d
	Get
public:
property BoundBlock3d^ OrthoBoundBlock {
	BoundBlock3d^ get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)