Reference Library
CreateSweptSurface Method (sweepEnt, pathEnt, sweepOptions)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »SweptSurface »CreateSweptSurface(Entity, Entity, SweepOptions)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void CreateSweptSurface(
	Entity sweepEnt,
	Entity pathEnt,
	SweepOptions sweepOptions
)
Public Sub CreateSweptSurface ( _
	sweepEnt As Entity, _
	pathEnt As Entity, _
	sweepOptions As SweepOptions _
)
public:
void CreateSweptSurface(
	Entity^ sweepEnt,
	Entity^ pathEnt,
	SweepOptions^ sweepOptions
)
 Parameters
sweepEnt(Entity)
pathEnt(Entity)
sweepOptions(SweepOptions)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)