Reference Library
DwgVersion Enumeration
Namespaces »ZwSoft.ZwCAD.DatabaseServices »DwgVersion
 Declaration Syntax
C# | Visual Basic | Visual C++
public enum DwgVersion
Public Enumeration DwgVersion
public enum class DwgVersion
 Members
Member | Description
Max
Unknown
Newest
AC2700a
AC2400a
AC2100a
AC1800a
AC1800
AC1500
AC1027
AC1024
AC1021
AC1015
AC1014
AC1013
AC1012
AC1011
AC1010
AC1009
AC1008
AC1007
AC1006
AC1005
AC1004
AC1003
AC1002
AC1001
AC2To22
AC2To21
AC2To20
AC2To10
AC1To50
AC1To40
AC1To2
MC0To0
vAC27
vAC24
vAC21
vAC18
vAC15
vAC14
vAC14beta
vAC13
vAC12
vAC10
vAC09
vAC026
vAC025
Current
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)