Reference Library
AlternateSuffix Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »AlternateSuffix
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual string AlternateSuffix { get; set; }
Public Overridable Property AlternateSuffix As String
	Get
	Set
public:
virtual property String^ AlternateSuffix {
	String^ get ();
	void set (String^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)