Reference Library
Torus Constructor
Namespaces »ZwSoft.ZwCAD.Geometry »Torus »Torus()
 Members
Icon | Member | Description
Torus(Double, Double, Point3d, Vector3d, Vector3d, Double, Double, Double, Double)
Torus(Double, Double, Point3d, Vector3d)
Torus()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)