Reference Library
MajorRadius Property
Namespaces »ZwSoft.ZwCAD.Geometry »EllipticalArc2d »MajorRadius
 Declaration Syntax
C# | Visual Basic | Visual C++
public double MajorRadius { get; set; }
Public Property MajorRadius As Double
	Get
	Set
public:
property double MajorRadius {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)