Reference Library
PromptDragOptions Constructor (selection, message, callback)
Namespaces »ZwSoft.ZwCAD.EditorInput »PromptDragOptions »PromptDragOptions(SelectionSet, String, DragCallback)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PromptDragOptions(
	SelectionSet selection,
	string message,
	DragCallback callback
)
Public Sub New ( _
	selection As SelectionSet, _
	message As String, _
	callback As DragCallback _
)
public:
PromptDragOptions(
	SelectionSet^ selection,
	String^ message,
	DragCallback^ callback
)
 Parameters
selection(SelectionSet)
message(String)
callback(DragCallback)
Assembly: ZwManaged (Module: ZwManaged)