Reference Library
NumErrors Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »AuditInfo »NumErrors
 Declaration Syntax
C# | Visual Basic | Visual C++
public int NumErrors { get; }
Public ReadOnly Property NumErrors As Integer
	Get
public:
property int NumErrors {
	int get ();
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)