Reference Library
LinkedData Constructor (unmanagedObjPtr, autoDelete)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LinkedData »LinkedData(IntPtr, Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
protected internal LinkedData(
	IntPtr unmanagedObjPtr,
	bool autoDelete
)
Protected Friend Sub New ( _
	unmanagedObjPtr As IntPtr, _
	autoDelete As Boolean _
)
protected public:
LinkedData(
	IntPtr unmanagedObjPtr,
	bool autoDelete
)
 Parameters
unmanagedObjPtr(IntPtr)
autoDelete(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)