Reference Library
VisualStyleProperty Enumeration
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »VisualStyleProperty
 Declaration Syntax
C# | Visual Basic | Visual C++
[WrapperAttribute("AcGiVisualStyleProperties::Property")]
public enum VisualStyleProperty
<WrapperAttribute("AcGiVisualStyleProperties::Property")> _
Public Enumeration VisualStyleProperty
[WrapperAttribute(L"AcGiVisualStyleProperties::Property")]
public enum class VisualStyleProperty
 Members
Member | Description
ViewportTransparency
UseDrawOrder
TintEffect
TintColor
PropertyCount
PostPower
PosterizeEffect
PostContrast
PostBrightness
PencilScale
PencilPattern
PencilEffect
PencilColor
PencilAngle
PastelEffect
MonoEffect
LightingEnabled
InvalidProperty
FocusWidth
FocusDistance
FaceSpecular
FaceOpacity
FaceMonoColor
FaceAdjustment
EdgeWiggleAmount
EdgeTexturePath
EdgeSilhouetteWidth
EdgeSilhouetteColor
EdgeOverhang
EdgeOpacity
EdgeObscuredLinePattern
EdgeObscuredColor
EdgeIsolines
EdgeIntersectionLinePattern
EdgeIntersectionColor
EdgeHidePrecision
EdgeHaloGap
EdgeCreaseAngle
DisplayBrightness
DepthOfField
BlurEffect
BlurAmount
BloomThreshold
BloomRadius
BloomIntensity
BloomEffect
EdgeWidth
EdgeColor
DisplayStyle
FaceModifier
FaceLightingQuality
FaceLightingModel
FaceColorMode
EdgeStyle
EdgeModifier
EdgeModel
EdgeJitterAmount
DisplayShadowType
Transparency
Color
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)