Reference Library
NumGreenBits Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »PixelFormatInfo »NumGreenBits
 Declaration Syntax
C# | Visual Basic | Visual C++
public short NumGreenBits { get; set; }
Public Property NumGreenBits As Short
	Get
	Set
public:
property short NumGreenBits {
	short get ();
	void set (short value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)