Reference Library
IsModuleLoaded Method (fileName)
Namespaces »ZwSoft.ZwCAD.Runtime »DynamicLinker »IsModuleLoaded(String)
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsModuleLoaded(
	string fileName
)
Public Function IsModuleLoaded ( _
	fileName As String _
) As Boolean
public:
bool IsModuleLoaded(
	String^ fileName
)
 Parameters
fileName(String)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)