Reference Library
BaryComb Method (blendCoefficient)
Namespaces »ZwSoft.ZwCAD.Geometry »LineSegment3d »BaryComb(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d BaryComb(
	double blendCoefficient
)
Public Function BaryComb ( _
	blendCoefficient As Double _
) As Point3d
public:
Point3d BaryComb(
	double blendCoefficient
)
 Parameters
blendCoefficient(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)