Reference Library
Initialize Method
Namespaces »ZwSoft.ZwCAD.Runtime »IExtensionApplication »Initialize()
 Declaration Syntax
C# | Visual Basic | Visual C++
void Initialize()
Sub Initialize
void Initialize()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)