Reference Library
Dimtp Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimtp
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual double Dimtp { get; set; }
Public Overridable Property Dimtp As Double
	Get
	Set
public:
virtual property double Dimtp {
	double get ();
	void set (double value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)