Reference Library
EvaluatePoint Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Curve3d »EvaluatePoint(Double)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d EvaluatePoint(
	double value
)
Public Function EvaluatePoint ( _
	value As Double _
) As Point3d
public:
Point3d EvaluatePoint(
	double value
)
 Parameters
value(Double)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)