Reference Library
IsUnitLength Method
Namespaces »ZwSoft.ZwCAD.Geometry »Vector3d »IsUnitLength()
 Declaration Syntax
C# | Visual Basic | Visual C++
public bool IsUnitLength()
Public Function IsUnitLength As Boolean
public:
bool IsUnitLength()
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)