Reference Library
AbortLayerStateRename Event
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »AbortLayerStateRename
 Declaration Syntax
C# | Visual Basic | Visual C++
public event LayerStateRenameEventHandler AbortLayerStateRename
Public Event AbortLayerStateRename As LayerStateRenameEventHandler
public:
 event LayerStateRenameEventHandler^ AbortLayerStateRename {
	void add (LayerStateRenameEventHandler^ value);
	void remove (LayerStateRenameEventHandler^ value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)