Reference Library
Dimaltd Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Dimension »Dimaltd
 Declaration Syntax
C# | Visual Basic | Visual C++
public virtual int Dimaltd { get; set; }
Public Overridable Property Dimaltd As Integer
	Get
	Set
public:
virtual property int Dimaltd {
	int get ();
	void set (int value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)