Reference Library
IsVisible Property
Namespaces »ZwSoft.ZwCAD.DatabaseServices »CellBorder »IsVisible
 Declaration Syntax
C# | Visual Basic | Visual C++
public Nullable<bool> IsVisible { get; set; }
Public Property IsVisible As Nullable(Of Boolean)
	Get
	Set
public:
property Nullable<bool> IsVisible {
	Nullable<bool> get ();
	void set (Nullable<bool> value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)