Reference Library
TransformInverseBlockRefXForm Property
Namespaces »ZwSoft.ZwCAD.GraphicsInterface »ClipBoundary »TransformInverseBlockRefXForm
 Declaration Syntax
C# | Visual Basic | Visual C++
public Matrix3d TransformInverseBlockRefXForm { get; set; }
Public Property TransformInverseBlockRefXForm As Matrix3d
	Get
	Set
public:
property Matrix3d TransformInverseBlockRefXForm {
	Matrix3d get ();
	void set (Matrix3d value);
}
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)