Reference Library
m_pLayerStateCompareFailed Field
Namespaces »ZwSoft.ZwCAD.DatabaseServices »LayerStateManager »m_pLayerStateCompareFailed
 Declaration Syntax
C# | Visual Basic | Visual C++
public LayerStateEventHandler m_pLayerStateCompareFailed
Public m_pLayerStateCompareFailed As LayerStateEventHandler
public:
LayerStateEventHandler^ m_pLayerStateCompareFailed
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)