Reference Library
IList_IndexOf Method (value)
Namespaces »ZwSoft.ZwCAD.Geometry »Vector2dCollection »IList_IndexOf(Object)
 Declaration Syntax
C# | Visual Basic | Visual C++
internal int IList_IndexOf(
	Object value
)
Friend Function IList_IndexOf ( _
	value As Object _
) As Integer
internal:
virtual int IList_IndexOf(
	Object^ value
) sealed
 Parameters
value(Object)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)