Reference Library
Project Method (plane, vector)
Namespaces »ZwSoft.ZwCAD.Geometry »Point3d »Project(Plane, Vector3d)
 Declaration Syntax
C# | Visual Basic | Visual C++
public Point3d Project(
	Plane plane,
	Vector3d vector
)
Public Function Project ( _
	plane As Plane, _
	vector As Vector3d _
) As Point3d
public:
Point3d Project(
	Plane^ plane,
	Vector3d vector
)
 Parameters
plane(Plane)
vector(Vector3d)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)