Reference Library
SetPlotType Method (plotSet, plotAreaType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettingsValidator »SetPlotType(PlotSettings, PlotType)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void SetPlotType(
	PlotSettings plotSet,
	PlotType plotAreaType
)
Public Sub SetPlotType ( _
	plotSet As PlotSettings, _
	plotAreaType As PlotType _
)
public:
void SetPlotType(
	PlotSettings^ plotSet,
	PlotType plotAreaType
)
 Parameters
plotSet(PlotSettings)
plotAreaType(PlotType)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)