Reference Library
PlotSettings Constructor (modelType)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »PlotSettings »PlotSettings(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public PlotSettings(
	bool modelType
)
Public Sub New ( _
	modelType As Boolean _
)
public:
PlotSettings(
	bool modelType
)
 Parameters
modelType(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)