Reference Library
Inequality Operator
Namespaces »ZwSoft.ZwCAD.DatabaseServices »NurbsData »Inequality(NurbsData, NurbsData)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static bool operator !=(
	NurbsData a,
	NurbsData b
)
Public Shared Operator <> ( _
	a As NurbsData, _
	b As NurbsData _
) As Boolean
public:
static bool operator !=(
	NurbsData a,
	NurbsData b
)
 Parameters
a(NurbsData)
b(NurbsData)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)