Reference Library
CopyFromUnmanagedObject Method (unmanagedPointer)
Namespaces »ZwSoft.ZwCAD.PlottingServices »DsdEntry »CopyFromUnmanagedObject(IntPtr)
 Declaration Syntax
C# | Visual Basic | Visual C++
public static DsdEntry CopyFromUnmanagedObject(
	IntPtr unmanagedPointer
)
Public Shared Function CopyFromUnmanagedObject ( _
	unmanagedPointer As IntPtr _
) As DsdEntry
public:
static DsdEntry^ CopyFromUnmanagedObject(
	IntPtr unmanagedPointer
)
 Parameters
unmanagedPointer(IntPtr)
Assembly: ZwManaged (Module: ZwManaged)