Reference Library
DisableUndoRecording Method (disable)
Namespaces »ZwSoft.ZwCAD.DatabaseServices »Database »DisableUndoRecording(Boolean)
 Declaration Syntax
C# | Visual Basic | Visual C++
public void DisableUndoRecording(
	bool disable
)
Public Sub DisableUndoRecording ( _
	disable As Boolean _
)
public:
void DisableUndoRecording(
	bool disable
)
 Parameters
disable(Boolean)
Assembly: ZwDatabaseMgd (Module: ZwDatabaseMgd)