Public Member Functions | List of all members
AcGiWorldGeometry Class Reference
AcGi Classes
  Inheritance diagram for AcGiWorldGeometry:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiWorldGeometry)
 virtual void  | setExtents (AcGePoint3d *pNewExtents) const =0
 virtual void  | startAttributesSegment ()
 Public Member Functions inherited from AcGiGeometry
ACRX_DECLARE_MEMBERS (AcGiGeometry)
 virtual Adesk::Boolean  | circle (const AcGePoint3d &center, const double radius, const AcGeVector3d &normal) const =0
 virtual Adesk::Boolean  | circle (const AcGePoint3d &, const AcGePoint3d &, const AcGePoint3d &) const =0
 virtual Adesk::Boolean  | circularArc (const AcGePoint3d &center, const double radius, const AcGeVector3d &normal, const AcGeVector3d &startVector, const double sweepAngle, const AcGiArcType arcType=kAcGiArcSimple) const =0
 virtual Adesk::Boolean  | circularArc (const AcGePoint3d &start, const AcGePoint3d &point, const AcGePoint3d &end, const AcGiArcType arcType=kAcGiArcSimple) const =0
 virtual Adesk::Boolean  | draw (AcGiDrawable *) const =0
 virtual void  | getModelToWorldTransform (AcGeMatrix3d &) const =0
 virtual void  | getWorldToModelTransform (AcGeMatrix3d &) const =0
 virtual Adesk::Boolean  | mesh (const Adesk::UInt32 rows, const Adesk::UInt32 columns, const AcGePoint3d *pVertexList, const AcGiEdgeData *pEdgeData=NULL, const AcGiFaceData *pFaceData=NULL, const AcGiVertexData *pVertexData=NULL, const bool bAutoGenerateNormals=true) const =0
 virtual Adesk::Boolean  | pline (const AcDbPolyline &lwBuf, Adesk::UInt32 fromIndex=0, Adesk::UInt32 numSegs=0) const =0
 virtual Adesk::Boolean  | polygon (const Adesk::UInt32 nbPoints, const AcGePoint3d *pVertexList) const =0
 virtual Adesk::Boolean  | polyline (const Adesk::UInt32 nbPoints, const AcGePoint3d *pVertexList, const AcGeVector3d *pNormal=NULL, Adesk::LongPtr lBaseSubEntMarker=-1) const =0
 virtual Adesk::Boolean  | polypoint (const Adesk::UInt32 nbPoints, const AcGePoint3d *pVertexList, const AcGeVector3d *pNormal=NULL, const Adesk::LongPtr *pSubEntMarkers=NULL) const
 virtual void  | popClipBoundary ()=0
 virtual Adesk::Boolean  | popModelTransform ()=0
 virtual Adesk::Boolean  | pushClipBoundary (AcGiClipBoundary *pBoundary)=0
 virtual Adesk::Boolean  | pushModelTransform (const AcGeVector3d &vNormal)=0
 virtual Adesk::Boolean  | pushModelTransform (const AcGeMatrix3d &xMat)=0
 virtual Adesk::Boolean  | ray (const AcGePoint3d &, const AcGePoint3d &) const =0
 virtual Adesk::Boolean  | shell (const Adesk::UInt32 nbVertex, const AcGePoint3d *pVertexList, const Adesk::UInt32 faceListSize, const Adesk::Int32 *pFaceList, const AcGiEdgeData *pEdgeData=NULL, const AcGiFaceData *pFaceData=NULL, const AcGiVertexData *pVertexData=NULL, const struct resbuf *pResBuf=NULL, const bool bAutoGenerateNormals=true) const =0
 virtual Adesk::Boolean  | text (const AcGePoint3d &position, const AcGeVector3d &normal, const AcGeVector3d &direction, const double height, const double width, const double oblique, const ACHAR *pMsg) const =0
 virtual Adesk::Boolean  | text (const AcGePoint3d &position, const AcGeVector3d &normal, const AcGeVector3d &direction, const ACHAR *pMsg, const Adesk::Int32 length, const Adesk::Boolean raw, const AcGiTextStyle &pTextStyle) const =0
 virtual Adesk::Boolean  | worldLine (const AcGePoint3d pnts[2])
 virtual Adesk::Boolean  | xline (const AcGePoint3d &, const AcGePoint3d &) const =0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acgi.h