Public Member Functions | List of all members
AcEdXrefFileLock Class Reference
 Public Member Functions
 Acad::ErrorStatus  | consistencyCheck (int &retstatus, const AcDbObjectId &selectedBTRid, AcDbObjectIdArray &outofSyncBTRids)
 Acad::ErrorStatus  | consistencyCheck (int &retstatus, const AcDbObjectId &selectedBTRid)
 Acad::ErrorStatus  | consistencyChecklocal (int &retstatus, const AcDbObjectId &selectedBTRid)
 int  | getlockxloadctlType () const
 AcDbObjectIdArray  | getoutofSyncIdArray () const
 Acad::ErrorStatus  | lockFile (int &retstatus, const AcDbObjectId &selectedBTRid)
 Acad::ErrorStatus  | releaseFile (int &retstatus, bool bSkipSaveback=false, bool bReload=true)
 Acad::ErrorStatus  | reloadFile (int &retstatus, const AcDbObjectIdArray &BTRids, const int xldctltype=-1)
 Acad::ErrorStatus  | reloadFile (int &retstatus, const int xldctltype=-1)
 void  | setInternalTNmgmt (bool bTNmgmt)
 Acad::ErrorStatus  | xloadctlType (int &retstatus, const AcDbObjectId &selectedBTRid)
 The documentation for this class was generated from the following file:
xreflock.h