Public Member Functions | List of all members
AcRxArxApp Class Reference
AcRx Classes
  Inheritance diagram for AcRxArxApp:
 Public Member Functions
 virtual AcRx::AppRetCode  | On_kInitAppMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kInvkSubrMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kLoadDwgMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kUnloadAppMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kUnloadDwgMsg (void *pkt)
 Public Member Functions inherited from AcRxDbxApp
 AcRx::AppRetCode  | acrxEntryPoint (AcRx::AppMsgCode msg, void *pkt)
 HINSTANCE &  | GetModuleInstance ()
 virtual AcRx::AppRetCode  | On_kCfgMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kDependencyMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kEndDialogMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kEndMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kInitDialogMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kNoDependencyMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kNullMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kOleUnloadAppMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kPreQuitMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kQuitMsg (void *pkt)
 virtual AcRx::AppRetCode  | On_kSaveMsg (void *pkt)
 virtual void  | RegisterServerComponents ()=0
 Additional Inherited Members
 Protected Attributes inherited from AcRxDbxApp
 bool  | m_bMDIAware
 bool  | m_bUnlocked
 HINSTANCE  | m_hdllInstance
 The documentation for this class was generated from the following file:
arxEntryPoint.h