Public Member Functions | List of all members
AcApLongTransactionManager Class Reference
  Inheritance diagram for AcApLongTransactionManager:
 Public Member Functions
 virtual Acad::ErrorStatus  | abortLongTransaction (AcDbObjectId transId, bool keepObjs=false)=0
ACRX_DECLARE_MEMBERS (AcApLongTransactionManager)
 virtual Acad::ErrorStatus  | addClassFilter (AcRxClass *)=0
 virtual void  | addReactor (AcApLongTransactionReactor *)=0
 virtual Acad::ErrorStatus  | checkIn (AcDbObjectId transId, AcDbIdMapping &errorMap, bool keepObjs=false)=0
 virtual Acad::ErrorStatus  | checkOut (AcDbObjectId &transId, AcDbObjectIdArray &objList, AcDbObjectId toBlock, AcDbIdMapping &errorMap, AcDbObjectId lockBlkRef=AcDbObjectId::kNull)=0
 virtual AcDbObjectId  | currentLongTransactionFor (const AcApDocument *pDoc) const =0
 virtual bool  | isFiltered (AcRxClass *) const =0
 virtual void  | removeReactor (AcApLongTransactionReactor *)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
lngtrans.h