Public Member Functions | List of all members
AcGeBoundBlock3d Class Reference
AcGe Classes
  Inheritance diagram for AcGeBoundBlock3d:
 Public Member Functions
AcGeBoundBlock3d (const AcGePoint3d &base, const AcGeVector3d &dir1, const AcGeVector3d &dir2, const AcGeVector3d &dir3)
AcGeBoundBlock3d (const AcGeBoundBlock3d &block)
 Adesk::Boolean  | contains (const AcGePoint3d &point) const
 AcGeBoundBlock3d &  | extend (const AcGePoint3d &point)
 void  | get (AcGePoint3d &base, AcGeVector3d &dir1, AcGeVector3d &dir2, AcGeVector3d &dir3) const
 void  | getMinMaxPoints (AcGePoint3d &point1, AcGePoint3d &point2) const
 Adesk::Boolean  | isBox () const
 Adesk::Boolean  | isDisjoint (const AcGeBoundBlock3d &block) const
 AcGeBoundBlock3d &  | operator= (const AcGeBoundBlock3d &block)
 AcGeBoundBlock3d &  | set (const AcGePoint3d &point1, const AcGePoint3d &point2)
 AcGeBoundBlock3d &  | set (const AcGePoint3d &base, const AcGeVector3d &dir1, const AcGeVector3d &dir2, const AcGeVector3d &dir3)
 AcGeBoundBlock3d &  | setToBox (Adesk::Boolean)
 AcGeBoundBlock3d &  | swell (double distance)
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeEntity3d
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
geblok3d.h