Public Types | Public Member Functions | List of all members
AcGiEdgeStyle Class Reference
AcGi Classes
  Inheritance diagram for AcGiEdgeStyle:
 Public Types
enum  | EdgeModel { kNoEdges, kIsolines, kFacetEdges }
enum  | EdgeModifier {
 kNoEdgeModifiers = 0, kOverhang = 1, kJitter = 2, kWidth = 4,
 kColor = 8, kHaloGap = 16, kAlwaysOnTop = 64, kOpacity = 128,
 kWiggle = 0x100, kTexture = 0x200
 }
enum  | EdgeStyle {
 kNoEdgeStyle = 0, kVisible = 1, kSilhouette = 2, kObscured = 4,
 kIntersection = 8
 }
enum  | EdgeStyleApply { kDefault, kAll }
enum  | JitterAmount { kJitterLow = 1, kJitterMedium, kJitterHigh }
enum  | Linetype {
 kSolid = 1, kDashed, kDotted, kShortDash,
 kMediumDash, kLongDash, kDoubleShortDash, kDoubleMediumDash,
 kDoubleLongDash, kMediumLongDash, kSparseDot
 }
enum  | WiggleAmount { kWiggleLow = 1, kWiggleMedium = 2, kWiggleHigh = 3 }
 Public Member Functions
AcGiEdgeStyle (void)
AcGiEdgeStyle (const AcGiEdgeStyle &style)
ACRX_DECLARE_MEMBERS (AcGiEdgeStyle)
virtual double  | creaseAngle (void) const
virtual const AcCmColor &  | edgeColor (void) const
virtual AcCmColor &  | edgeColor (void)
virtual EdgeModel  | edgeModel (void) const
virtual unsigned long  | edgeModifiers (void) const
virtual EdgeStyleApply  | edgeStyleApply (void) const
virtual unsigned long  | edgeStyles (void) const
virtual int  | edgeWidth (void) const
virtual int  | haloGap (void) const
virtual bool  | hidePrecision (void) const
virtual const AcCmColor &  | intersectionColor (void) const
virtual AcCmColor &  | intersectionColor (void)
virtual Linetype  | intersectionLinetype (void) const
virtual bool  | isEdgeModifierFlagSet (EdgeModifier flag) const
virtual bool  | isEdgeStyleFlagSet (EdgeStyle flag) const
virtual unsigned short  | isolines (void) const
virtual JitterAmount  | jitterAmount (void) const
virtual const AcCmColor &  | obscuredColor (void) const
virtual AcCmColor &  | obscuredColor (void)
virtual Linetype  | obscuredLinetype (void) const
virtual double  | opacityLevel (void) const
virtual AcGiEdgeStyle &  | operator= (const AcGiEdgeStyle &style)
virtual bool  | operator== (const AcGiEdgeStyle &style) const
virtual int  | overhangAmount (void) const
virtual void  | set (const AcGiEdgeStyle &style)
virtual void  | setCreaseAngle (double nAngle)
virtual void  | setEdgeColor (const AcCmColor &color, bool bEnableModifier)
virtual void  | setEdgeModel (EdgeModel model)
virtual void  | setEdgeModifierFlag (EdgeModifier flag, bool bEnable)
virtual void  | setEdgeModifiers (unsigned long nModifiers)
virtual void  | setEdgeStyleApply (EdgeStyleApply apply)
virtual void  | setEdgeStyleFlag (EdgeStyle flag, bool bEnable)
virtual void  | setEdgeStyles (unsigned long nStyles)
virtual void  | setEdgeWidth (int nWidth, bool bEnableModifier)
virtual void  | setHaloGap (int nHaloGap, bool bEnableModifier)
virtual void  | setHidePrecision (bool bHidePrecision)
virtual void  | setIntersectionColor (const AcCmColor &color)
virtual void  | setIntersectionLinetype (Linetype ltype)
virtual void  | setIsolines (unsigned short nIsolines)
virtual void  | setJitterAmount (JitterAmount amount, bool bEnableModifier)
virtual void  | setObscuredColor (const AcCmColor &color)
virtual void  | setObscuredLinetype (Linetype ltype)
virtual void  | setOpacityLevel (double nLevel, bool bEnableModifier)
virtual void  | setOverhangAmount (int nAmount, bool bEnableModifier)
virtual void  | setSilhouetteColor (const AcCmColor &color)
virtual void  | setSilhouetteWidth (short nWidth)
 virtual void  | setWiggleAmount (WiggleAmount amount, bool bEnableModifier)
virtual const AcCmColor &  | silhouetteColor (void) const
virtual AcCmColor &  | silhouetteColor (void)
virtual short  | silhouetteWidth (void) const
 virtual WiggleAmount  | wiggleAmount () const
virtual  | ~AcGiEdgeStyle (void)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiEdgeStyle::AcGiEdgeStyle  |  ( |  void  |   | )
Warning
Not implemented!
 AcGiEdgeStyle::AcGiEdgeStyle  |  ( |  const AcGiEdgeStyle &  |  style | )
Warning
Not implemented!
 virtual AcGiEdgeStyle::~AcGiEdgeStyle  |  ( |  void  |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual double AcGiEdgeStyle::creaseAngle  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual const AcCmColor& AcGiEdgeStyle::edgeColor  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcCmColor& AcGiEdgeStyle::edgeColor  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 virtual EdgeModel AcGiEdgeStyle::edgeModel  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual unsigned long AcGiEdgeStyle::edgeModifiers  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual EdgeStyleApply AcGiEdgeStyle::edgeStyleApply  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual unsigned long AcGiEdgeStyle::edgeStyles  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual int AcGiEdgeStyle::edgeWidth  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual int AcGiEdgeStyle::haloGap  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcGiEdgeStyle::hidePrecision  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual const AcCmColor& AcGiEdgeStyle::intersectionColor  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcCmColor& AcGiEdgeStyle::intersectionColor  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 virtual Linetype AcGiEdgeStyle::intersectionLinetype  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcGiEdgeStyle::isEdgeModifierFlagSet  |  ( |  EdgeModifier  |  flag | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcGiEdgeStyle::isEdgeStyleFlagSet  |  ( |  EdgeStyle  |  flag | ) |   const
virtual
Warning
Not implemented!
 virtual unsigned short AcGiEdgeStyle::isolines  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual JitterAmount AcGiEdgeStyle::jitterAmount  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual const AcCmColor& AcGiEdgeStyle::obscuredColor  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcCmColor& AcGiEdgeStyle::obscuredColor  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 virtual Linetype AcGiEdgeStyle::obscuredLinetype  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual double AcGiEdgeStyle::opacityLevel  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcGiEdgeStyle& AcGiEdgeStyle::operator=  |  ( |  const AcGiEdgeStyle &  |  style | )
virtual
Warning
Not implemented!
 virtual bool AcGiEdgeStyle::operator==  |  ( |  const AcGiEdgeStyle &  |  style | ) |   const
virtual
Warning
Not implemented!
 virtual int AcGiEdgeStyle::overhangAmount  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::set  |  ( |  const AcGiEdgeStyle &  |  style | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setCreaseAngle  |  ( |  double  |  nAngle | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setEdgeColor  |  ( |  const AcCmColor &  |  color,
|  bool  |  bEnableModifier
)
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setEdgeModel  |  ( |  EdgeModel  |  model | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setEdgeModifierFlag  |  ( |  EdgeModifier  |  flag,
|  bool  |  bEnable
)
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setEdgeModifiers  |  ( |  unsigned long  |  nModifiers | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setEdgeStyleApply  |  ( |  EdgeStyleApply  |  apply | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setEdgeStyleFlag  |  ( |  EdgeStyle  |  flag,
|  bool  |  bEnable
)
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setEdgeStyles  |  ( |  unsigned long  |  nStyles | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setEdgeWidth  |  ( |  int  |  nWidth,
|  bool  |  bEnableModifier
)
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setHaloGap  |  ( |  int  |  nHaloGap,
|  bool  |  bEnableModifier
)
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setHidePrecision  |  ( |  bool  |  bHidePrecision | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setIntersectionColor  |  ( |  const AcCmColor &  |  color | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setIntersectionLinetype  |  ( |  Linetype  |  ltype | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setIsolines  |  ( |  unsigned short  |  nIsolines | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setJitterAmount  |  ( |  JitterAmount  |  amount,
|  bool  |  bEnableModifier
)
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setObscuredColor  |  ( |  const AcCmColor &  |  color | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setObscuredLinetype  |  ( |  Linetype  |  ltype | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setOpacityLevel  |  ( |  double  |  nLevel,
|  bool  |  bEnableModifier
)
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setOverhangAmount  |  ( |  int  |  nAmount,
|  bool  |  bEnableModifier
)
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setSilhouetteColor  |  ( |  const AcCmColor &  |  color | )
virtual
Warning
Not implemented!
 virtual void AcGiEdgeStyle::setSilhouetteWidth  |  ( |  short  |  nWidth | )
virtual
Warning
Not implemented!
 virtual const AcCmColor& AcGiEdgeStyle::silhouetteColor  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcCmColor& AcGiEdgeStyle::silhouetteColor  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 virtual short AcGiEdgeStyle::silhouetteWidth  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acgivisualstyle.h