Public Member Functions | Protected Member Functions | Friends | List of all members
AcEditorReactor Class Reference
AcEd Classes
  Inheritance diagram for AcEditorReactor:
 Public Member Functions
 virtual void  | abortAttach (AcDbDatabase *pFrom)
 virtual void  | abortDeepClone (AcDbIdMapping &)
 virtual void  | abortDxfIn (AcDbDatabase *)
 virtual void  | abortDxfOut (AcDbDatabase *)
 virtual void  | abortInsert (AcDbDatabase *pTo)
 virtual void  | abortRestore (AcDbDatabase *pTo)
 virtual void  | abortSave (AcDbDatabase *)
 virtual void  | abortWblock (AcDbDatabase *pTo)
ACRX_DECLARE_MEMBERS (AcEditorReactor)
 virtual void  | beginAttach (AcDbDatabase *pTo, const ACHAR *, AcDbDatabase *pFrom)
 virtual ADESK_DEPRECATED void  | beginClose (AcDbDatabase *pDwg)
 virtual void  | beginDeepClone (AcDbDatabase *pTo, AcDbIdMapping &)
 virtual void  | beginDeepCloneXlation (AcDbIdMapping &, Acad::ErrorStatus *)
 virtual void  | beginDoubleClick (const AcGePoint3d &clickPoint)
 virtual void  | beginDwgOpen (ACHAR *filename)
 virtual void  | beginDxfIn (AcDbDatabase *)
 virtual void  | beginDxfOut (AcDbDatabase *)
 virtual void  | beginInsert (AcDbDatabase *pTo, const ACHAR *pBlockName, AcDbDatabase *pFrom)
 virtual void  | beginInsert (AcDbDatabase *pTo, const AcGeMatrix3d &xform, AcDbDatabase *pFrom)
 virtual void  | beginQuit ()
 virtual void  | beginRestore (AcDbDatabase *pTo, const ACHAR *, AcDbDatabase *pFrom)
 virtual void  | beginRightClick (const AcGePoint3d &clickPoint)
 virtual void  | beginSave (AcDbDatabase *, const ACHAR *pIntendedName)
 virtual void  | beginWblock (AcDbDatabase *pTo, AcDbDatabase *pFrom, const AcGePoint3d *&insertionPoint)
 virtual void  | beginWblock (AcDbDatabase *pTo, AcDbDatabase *pFrom, AcDbObjectId blockId)
 virtual void  | beginWblock (AcDbDatabase *pTo, AcDbDatabase *pFrom)
 virtual void  | beginWblockObjects (AcDbDatabase *pFrom, AcDbIdMapping &)
 virtual void  | cmdIUnkModified (const ACHAR *strCommand)
 virtual void  | comandeered (AcDbDatabase *pTo, AcDbObjectId id, AcDbDatabase *pFrom)
 virtual void  | commandCancelled (const ACHAR *cmdStr)
 virtual void  | commandEnded (const ACHAR *cmdStr)
 virtual void  | commandFailed (const ACHAR *cmdStr)
 virtual void  | commandWillStart (const ACHAR *cmdStr)
 virtual void  | databaseConstructed (AcDbDatabase *)
 virtual void  | databaseToBeDestroyed (AcDbDatabase *)
 virtual void  | docFrameMovedOrResized (Adesk::LongPtr hwndDocFrame, bool bMoved)
 virtual void  | dwgFileOpened (AcDbDatabase *, ACHAR *fileName)
 virtual void  | dxfInComplete (AcDbDatabase *)
 virtual void  | dxfOutComplete (AcDbDatabase *)
 virtual void  | endAttach (AcDbDatabase *pTo)
 virtual void  | endDeepClone (AcDbIdMapping &)
 virtual void  | endDwgOpen (const ACHAR *filename, AcDbDatabase *pDb)
 virtual void  | endInsert (AcDbDatabase *pTo)
 virtual void  | endRestore (AcDbDatabase *pTo)
 virtual void  | endWblock (AcDbDatabase *pTo)
 virtual void  | initialDwgFileOpenComplete (AcDbDatabase *pDwg)
 virtual void  | layoutSwitched (const ACHAR *newLayoutName)
 virtual void  | lispCancelled ()
 virtual void  | lispEnded ()
 virtual void  | lispWillStart (const ACHAR *firstLine)
 virtual void  | mainFrameMovedOrResized (Adesk::LongPtr hwndMainFrame, bool bMoved)
 virtual void  | modelessOperationEnded (const ACHAR *contextStr)
 virtual void  | modelessOperationWillStart (const ACHAR *contextStr)
 virtual void  | objectsLazyLoaded (const AcDbObjectIdArray &idArray)
 virtual void  | otherAttach (AcDbDatabase *pTo, AcDbDatabase *pFrom)
 virtual void  | otherInsert (AcDbDatabase *pTo, AcDbIdMapping &idMap, AcDbDatabase *pFrom)
 virtual void  | otherWblock (AcDbDatabase *pTo, AcDbIdMapping &, AcDbDatabase *pFrom)
 virtual void  | partialOpenNotice (AcDbDatabase *pDb)
 virtual void  | pickfirstModified ()
 virtual void  | preXrefLockFile (AcDbObjectId btrId)
 virtual void  | quitAborted ()
 virtual void  | quitWillStart ()
 virtual void  | redirected (AcDbObjectId newId, AcDbObjectId oldId)
 virtual void  | saveComplete (AcDbDatabase *, const ACHAR *pActualName)
 virtual void  | sysVarChanged (const ACHAR *varName, Adesk::Boolean success)
 virtual void  | sysVarWillChange (const ACHAR *varName)
 virtual void  | toolbarBitmapSizeChanged (Adesk::Boolean bLarge)
 virtual void  | toolbarBitmapSizeWillChange (Adesk::Boolean bLarge)
 virtual void  | undoSubcommandAuto (int activity, Adesk::Boolean state)
 virtual void  | undoSubcommandBack (int activity)
 virtual void  | undoSubcommandBegin (int activity)
 virtual void  | undoSubcommandControl (int activity, int option)
 virtual void  | undoSubcommandEnd (int activity)
 virtual void  | undoSubcommandMark (int activity)
 virtual void  | undoSubcommandNumber (int activity, int num)
 virtual void  | unknownCommand (const ACHAR *cmdStr, AcDbVoidPtrArray *al)
 virtual void  | viewChanged ()
 virtual void  | wblockNotice (AcDbDatabase *pDb)
 virtual void  | xrefSubcommandAttachItem (AcDbDatabase *pHost, int activity, const ACHAR *pPath)
 virtual void  | xrefSubcommandBindItem (AcDbDatabase *pHost, int activity, AcDbObjectId blockId)
 virtual void  | xrefSubcommandDetachItem (AcDbDatabase *pHost, int activity, AcDbObjectId blockId)
 virtual void  | xrefSubcommandOverlayItem (AcDbDatabase *pHost, int activity, const ACHAR *pPath)
 virtual void  | xrefSubcommandPathItem (int activity, AcDbObjectId blockId, const ACHAR *pNewPath)
 virtual void  | xrefSubcommandReloadItem (AcDbDatabase *pHost, int activity, AcDbObjectId blockId)
 virtual Acad::ErrorStatus  | xrefSubCommandStart (AcXrefSubCommand subcmd, const AcDbObjectIdArray &btrIds, const ACHAR *const *btrNames, const ACHAR *const *paths)
 virtual void  | xrefSubcommandUnloadItem (AcDbDatabase *pHost, int activity, AcDbObjectId blockId)
 Public Member Functions inherited from AcRxEventReactor
ACRX_DECLARE_MEMBERS (AcRxEventReactor)
 virtual void  | preXrefLockFile (AcDbDatabase *pDb, AcDbObjectId btrId)
 virtual void  | xrefSubCommandAborted (AcDbDatabase *pHostDb, AcXrefSubCommand op, const AcArray< AcDbObjectId > &ids, const ACHAR *const *btrNames, const ACHAR *const *paths)
 virtual void  | xrefSubCommandStart (AcDbDatabase *pHostDb, AcXrefSubCommand op, const AcArray< AcDbObjectId > &ids, const ACHAR *const *btrNames, const ACHAR *const *paths, bool &vetoOp)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 Acad::ErrorStatus  | veto ()
 Friends
 class  | AcEditorImp
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
aced.h