Public Member Functions | List of all members
AcGeEllipArc3d Class Reference
AcGe Classes
  Inheritance diagram for AcGeEllipArc3d:
 Public Member Functions
AcGeEllipArc3d (const AcGeEllipArc3d &ell)
AcGeEllipArc3d (const AcGeCircArc3d &arc)
AcGeEllipArc3d (const AcGePoint3d &cent, const AcGeVector3d &majorAxis, const AcGeVector3d &minorAxis, double majorRadius, double minorRadius)
AcGeEllipArc3d (const AcGePoint3d &cent, const AcGeVector3d &majorAxis, const AcGeVector3d &minorAxis, double majorRadius, double minorRadius, double ang1, double ang2)
 AcGePoint3d  | center () const
 AcGePoint3d  | closestPointToPlane (const AcGePlanarEnt &plane, AcGePoint3d &pointOnPlane, const AcGeTol &=AcGeContext::gTol) const
 double  | endAng () const
 AcGePoint3d  | endPoint () const
 void  | getPlane (AcGePlane &plane) const
 Adesk::Boolean  | intersectWith (const AcGeLinearEnt3d &line, int &intn, AcGePoint3d &p1, AcGePoint3d &p2, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | intersectWith (const AcGePlanarEnt &plane, int &numOfIntersect, AcGePoint3d &p1, AcGePoint3d &p2, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isCircular (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isInside (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeVector3d  | majorAxis () const
 double  | majorRadius () const
 AcGeVector3d  | minorAxis () const
 double  | minorRadius () const
 AcGeVector3d  | normal () const
 AcGeEllipArc3d &  | operator= (const AcGeEllipArc3d &ell)
 Adesk::Boolean  | projIntersectWith (const AcGeLinearEnt3d &line, const AcGeVector3d &projDir, int &numInt, AcGePoint3d &pntOnEllipse1, AcGePoint3d &pntOnEllipse2, AcGePoint3d &pntOnLine1, AcGePoint3d &pntOnLine2, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEllipArc3d &  | set (const AcGePoint3d &cent, const AcGeVector3d &majorAxis, const AcGeVector3d &minorAxis, double majorRadius, double minorRadius)
 AcGeEllipArc3d &  | set (const AcGePoint3d &cent, const AcGeVector3d &majorAxis, const AcGeVector3d &minorAxis, double majorRadius, double minorRadius, double startAngle, double endAngle)
 AcGeEllipArc3d &  | set (const AcGeCircArc3d &)
 AcGeEllipArc3d &  | setAngles (double startAngle, double endAngle)
 AcGeEllipArc3d &  | setAxes (const AcGeVector3d &majorAxis, const AcGeVector3d &minorAxis)
 AcGeEllipArc3d &  | setCenter (const AcGePoint3d &cent)
 AcGeEllipArc3d &  | setMajorRadius (double rad)
 AcGeEllipArc3d &  | setMinorRadius (double rad)
 double  | startAng () const
 AcGePoint3d  | startPoint () const
 Public Member Functions inherited from AcGeCurve3d
 Adesk::Boolean  | area (double startParam, double endParam, double &value, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeBoundBlock3d  | boundBlock () const
 AcGeBoundBlock3d  | boundBlock (const AcGeInterval &range) const
 AcGePoint3d  | closestPointTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | closestPointTo (const AcGeCurve3d &curve3d, AcGePoint3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGeCurve3d &curve, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | evalPoint (double param) const
 AcGePoint3d  | evalPoint (double param, int numDeriv, AcGeVector3dArray &derivArray) const
 Adesk::Boolean  | explode (AcGeVoidPointerArray &explodedCurves, AcGeIntArray &newExplodedCurves, const AcGeInterval *intrvl=NULL) const
 void  | getClosestPointTo (const AcGePoint3d &pnt, AcGePointOnCurve3d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getClosestPointTo (const AcGeCurve3d &curve3d, AcGePointOnCurve3d &pntOnThisCrv, AcGePointOnCurve3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getInterval (AcGeInterval &intrvl) const
 void  | getInterval (AcGeInterval &intrvl, AcGePoint3d &start, AcGePoint3d &end) const
 void  | getLocalClosestPoints (const AcGePoint3d &point, AcGePointOnCurve3d &approxPnt, const AcGeInterval *nbhd=0, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getLocalClosestPoints (const AcGeCurve3d &otherCurve, AcGePointOnCurve3d &approxPntOnThisCrv, AcGePointOnCurve3d &approxPntOnOtherCrv, const AcGeInterval *nbhd1=0, const AcGeInterval *nbhd2=0, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | getNormalPoint (const AcGePoint3d &pnt, AcGePointOnCurve3d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getProjClosestPointTo (const AcGePoint3d &pnt, const AcGeVector3d &projectDirection, AcGePointOnCurve3d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getProjClosestPointTo (const AcGeCurve3d &curve3d, const AcGeVector3d &projectDirection, AcGePointOnCurve3d &pntOnThisCrv, AcGePointOnCurve3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getSamplePoints (double fromParam, double toParam, double approxEps, AcGePoint3dArray &pointArray, AcGeDoubleArray &paramArray) const
 void  | getSamplePoints (int numSample, AcGePoint3dArray &pointArray) const
 void  | getSamplePoints (int numSample, AcGePoint3dArray &pointArray, AcGeDoubleArray &paramArray) const
 void  | getSplitCurves (double param, AcGeCurve3d *&piece1, AcGeCurve3d *&piece2) const
 void  | getTrimmedOffset (double distance, const AcGeVector3d &planeNormal, AcGeVoidPointerArray &offsetCurveList, AcGe::OffsetCrvExtType extensionType=AcGe::kFillet, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | hasEndPoint (AcGePoint3d &endPnt) const
 Adesk::Boolean  | hasStartPoint (AcGePoint3d &startPnt) const
 Adesk::Boolean  | isClosed (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isCoplanarWith (const AcGeCurve3d &curve3d, AcGePlane &plane, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isDegenerate (AcGe::EntityId &degenerateType, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isDegenerate (AcGeEntity3d *&pConvertedEntity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isLinear (AcGeLine3d &line, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, double &param, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (double param, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isPeriodic (double &period) const
 Adesk::Boolean  | isPlanar (AcGePlane &plane, const AcGeTol &tol=AcGeContext::gTol) const
 double  | length (double fromParam, double toParam, double tol=AcGeContext::gTol.equalPoint()) const
 AcGeCurve3d &  | operator= (const AcGeCurve3d &curve)
 AcGeBoundBlock3d  | orthoBoundBlock () const
 AcGeBoundBlock3d  | orthoBoundBlock (const AcGeInterval &range) const
 AcGeEntity3d *  | orthoProject (const AcGePlane &projectionPlane, const AcGeTol &tol=AcGeContext::gTol) const
 double  | paramAtLength (double datumParam, double length, Adesk::Boolean posParamDir=Adesk::kTrue, double tol=AcGeContext::gTol.equalPoint()) const
 double  | paramOf (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | projClosestPointTo (const AcGePoint3d &pnt, const AcGeVector3d &projectDirection, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | projClosestPointTo (const AcGeCurve3d &curve3d, const AcGeVector3d &projectDirection, AcGePoint3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d *  | project (const AcGePlane &projectionPlane, const AcGeVector3d &projectDirection, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeCurve3d &  | reverseParam ()
 AcGeCurve3d &  | setInterval ()
 Adesk::Boolean  | setInterval (const AcGeInterval &intrvl)
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeCurve3d
AcGeCurve3d (const AcGeCurve3d &)
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
geell3d.h