Public Types | Public Member Functions | Static Public Member Functions | List of all members
AcDbRasterImageDef Class Reference
AcDb Classes
  Inheritance diagram for AcDbRasterImageDef:
 Public Types
enum  | { kMaxSuggestNameSize = 2049 }
enum  | Units {
 kNone = 0, kMillimeter = 1, kCentimeter = 2, kMeter = 3,
 kKilometer = 4, kInch = 5, kFoot = 6, kYard = 7,
 kMile = 8, kMicroinches = 9, kMils = 10, kAngstroms = 11,
 kNanometers = 12, kMicrons = 13, kDecimeters = 14, kDekameters = 15,
 kHectometers = 16, kGigameters = 17, kAstronomical = 18, kLightYears = 19,
 kParsecs = 20
 }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbRasterImageDef)
 virtual const ACHAR *  | activeFileName () const
 virtual Acad::ErrorStatus  | closeImage ()
 virtual int  | colorDepth () const
 virtual void *  | createThumbnailBitmap (BITMAPINFO *&pBitmapInfo, Adesk::UInt8 brightness=50, Adesk::UInt8 contrast=50, Adesk::UInt8 fade=0)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *filer)
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *filer) const
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *filer)
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *filer) const
 virtual Acad::ErrorStatus  | embed ()
 virtual int  | entityCount (Adesk::Boolean *pbLocked=0) const
 virtual Atil::FileReadDescriptor *  | fileDescCopy () const
 virtual const ACHAR *  | fileType () const
 virtual Atil::Image *  | imageCopy (Adesk::Boolean bForceImageLoad=true) const
 virtual Adesk::Boolean  | imageModified () const
 virtual Adesk::Boolean  | isEmbedded () const
 virtual Adesk::Boolean  | isLoaded () const
 virtual Acad::ErrorStatus  | load ()
 virtual Acad::ErrorStatus  | loadThumbnail (Adesk::UInt16 &maxWidth, Adesk::UInt16 &maxHeight, Adesk::UInt8 *pPalette=0, int nPaletteEntries=0)
 virtual AcGiSentScanLines *  | makeScanLines (const AcGiRequestScanLines *pReq, const AcGeMatrix2d &pixToScreen, AcGePoint2dArray *pActiveClipBndy=0, Adesk::Boolean draftQuality=false, Adesk::Boolean isTransparent=false, const double brightness=50.0, const double contrast=50.0, const double fade=0.0) const
 virtual Acad::ErrorStatus  | openImage (Atil::Image *&pImage)
 virtual AcGiImageOrg  | organization () const
 RasterImageDefImp *  | ptrImp () const
 virtual AcGeVector2d  | resolutionMMPerPixel () const
 virtual Units  | resolutionUnits () const
 virtual const ACHAR *  | searchForActivePath ()
 virtual Acad::ErrorStatus  | setActiveFileName (const ACHAR *pPathName)
 virtual Acad::ErrorStatus  | setImage (const Atil::Image *pImage, const Atil::FileReadDescriptor *pFileDesc, Adesk::Boolean modifyDatabase=true)
 virtual Acad::ErrorStatus  | setImageModified (Adesk::Boolean modified)
 RasterImageDefImp *  | setPtrImp (RasterImageDefImp *pImp)
 virtual Acad::ErrorStatus  | setResolutionMMPerPixel (const AcGeVector2d &resMMPerPixel)
 virtual void  | setResolutionUnits (AcDbRasterImageDef::Units units)
 virtual Acad::ErrorStatus  | setSourceFileName (const ACHAR *pPathName)
 virtual Acad::ErrorStatus  | setUndoStoreSize (unsigned int maxImages=10)
 virtual AcGeVector2d  | size () const
 virtual const ACHAR *  | sourceFileName () const
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual unsigned int  | undoStoreSize () const
 virtual Acad::ErrorStatus  | unload (Adesk::Boolean modifyDatabase=true)
 virtual Acad::ErrorStatus  | unloadThumbnail ()
 virtual void  | updateEntities () const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual AcGsNode *  | gsNode () const
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 virtual void  | setGsNode (AcGsNode *pNode)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual void  | viewportDraw (AcGiViewportDraw *pVd)
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
 static ClassVersion  | classVersion ()
 static Acad::ErrorStatus  | createImageDictionary (AcDbDatabase *pDb, AcDbObjectId &dictId)
 static AcDbObjectId  | imageDictionary (AcDbDatabase *pDb)
 static Acad::ErrorStatus  | suggestName (AcDbDictionary *pImageDictionary, const ACHAR *pNewImagePathName, ACHAR *newImageName)
 The documentation for this class was generated from the following file:
imgdef.h