Public Types | Public Member Functions | Static Public Member Functions | Friends | List of all members
AcGiVisualStyle Class Reference
AcGi Classes
  Inheritance diagram for AcGiVisualStyle:
 Public Types
 typedef
 AcGiVisualStyleOperations::Operation  | Operation
 typedef
 AcGiVisualStyleProperties::Property  | Property
enum  | Type {
 kFlat, kFlatWithEdges, kGouraud, kGouraudWithEdges,
 k2DWireframe, k3DWireframe, kHidden, kBasic,
 kRealistic, kConceptual, kCustom, kDim,
 kBrighten, kThicken, kLinePattern, kFacePattern,
 kColorChange, kFaceOnly, kEdgeOnly, kDisplayOnly,
 kJitterOff, kOverhangOff, kEdgeColorOff, kEmptyStyle
 }
 Public Member Functions
AcGiVisualStyle (void)
AcGiVisualStyle (Type type)
AcGiVisualStyle (const AcGiVisualStyle &visualStyle)
ACRX_DECLARE_MEMBERS (AcGiVisualStyle)
ADESK_DEPRECATED void  | configureForType (Type type)
ADESK_DEPRECATED AcGiDisplayStyle &  | displayStyle (void)
ADESK_DEPRECATED const
 AcGiDisplayStyle &  | displayStyle (void) const
ADESK_DEPRECATED AcGiEdgeStyle &  | edgeStyle (void)
ADESK_DEPRECATED const
 AcGiEdgeStyle &  | edgeStyle (void) const
ADESK_DEPRECATED AcGiFaceStyle &  | faceStyle (void)
ADESK_DEPRECATED const
 AcGiFaceStyle &  | faceStyle (void) const
virtual ACDB_PORT Operation  | operation (Property prop) const
AcGiVisualStyle &  | operator= (const AcGiVisualStyle &visualStyle)
bool  | operator== (const AcGiVisualStyle &visualStyle) const
ADESK_DEPRECATED void  | setDisplayStyle (const AcGiDisplayStyle &style)
ADESK_DEPRECATED void  | setEdgeStyle (const AcGiEdgeStyle &style)
ADESK_DEPRECATED void  | setFaceStyle (const AcGiFaceStyle &style)
virtual ACDB_PORT bool  | setTrait (Property prop, Operation op)
virtual ACDB_PORT bool  | setTrait (Property prop, const AcGiVariant *pVal, Operation op=AcGiVisualStyleOperations::kSet)
virtual ACDB_PORT bool  | setTrait (Property prop, int nVal, Operation op=AcGiVisualStyleOperations::kSet)
virtual ACDB_PORT bool  | setTrait (Property prop, bool bVal, Operation op=AcGiVisualStyleOperations::kSet)
virtual ACDB_PORT bool  | setTrait (Property prop, double dVal, Operation op=AcGiVisualStyleOperations::kSet)
virtual ACDB_PORT bool  | setTrait (Property prop, double red, double green, double blue, Operation op=AcGiVisualStyleOperations::kSet)
virtual ACDB_PORT bool  | setTrait (Property prop, const AcCmColor *pColor, Operation op=AcGiVisualStyleOperations::kSet)
 virtual ACDB_PORT bool  | setTrait (AcGiVisualStyleProperties::Property prop, const AcString *pStr, AcGiVisualStyleOperations::Operation op=AcGiVisualStyleOperations::kSet)
virtual ACDB_PORT bool  | setTraitFlag (Property flagProp, unsigned long flagVal, bool bEnable=true)
ACDB_PORT bool  | setType (Type type)
virtual ACDB_PORT const
 AcGiVariant &  | trait (Property prop, Operation *pOp=NULL) const
virtual ACDB_PORT bool  | traitFlag (Property flagProp, unsigned long flagVal) const
ACDB_PORT Type  | type (void) const
~AcGiVisualStyle (void)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static ACDB_PORT
 AcGiVariant::VariantType  | propertyType (Property prop)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Friends
 class  | AcDbImpVisualStyle
Constructor & Destructor Documentation
 AcGiVisualStyle::AcGiVisualStyle  |  ( |  void  |   | )
Warning
Not implemented!
 AcGiVisualStyle::AcGiVisualStyle  |  ( |  Type  |  type | )
Warning
Not implemented!
 AcGiVisualStyle::AcGiVisualStyle  |  ( |  const AcGiVisualStyle &  |  visualStyle | )
Warning
Not implemented!
 AcGiVisualStyle::~AcGiVisualStyle  |  ( |  void  |   | )
Warning
Not implemented!
Member Function Documentation
 ADESK_DEPRECATED void AcGiVisualStyle::configureForType  |  ( |  Type  |  type | )
Warning
Not implemented!
 ADESK_DEPRECATED AcGiDisplayStyle& AcGiVisualStyle::displayStyle  |  ( |  void  |   | )
Warning
Not implemented!
 ADESK_DEPRECATED const AcGiDisplayStyle& AcGiVisualStyle::displayStyle  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 ADESK_DEPRECATED AcGiEdgeStyle& AcGiVisualStyle::edgeStyle  |  ( |  void  |   | )
Warning
Not implemented!
 ADESK_DEPRECATED const AcGiEdgeStyle& AcGiVisualStyle::edgeStyle  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 ADESK_DEPRECATED AcGiFaceStyle& AcGiVisualStyle::faceStyle  |  ( |  void  |   | )
Warning
Not implemented!
 ADESK_DEPRECATED const AcGiFaceStyle& AcGiVisualStyle::faceStyle  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 virtual ACDB_PORT Operation AcGiVisualStyle::operation  |  ( |  Property  |  prop | ) |   const
virtual
Warning
Not implemented!
 AcGiVisualStyle& AcGiVisualStyle::operator=  |  ( |  const AcGiVisualStyle &  |  visualStyle | )
Warning
Not implemented!
 bool AcGiVisualStyle::operator==  |  ( |  const AcGiVisualStyle &  |  visualStyle | ) |   const
Warning
Not implemented!
 static ACDB_PORT AcGiVariant::VariantType AcGiVisualStyle::propertyType  |  ( |  Property  |  prop | )
static
Warning
Not implemented!
 ADESK_DEPRECATED void AcGiVisualStyle::setDisplayStyle  |  ( |  const AcGiDisplayStyle &  |  style | )
Warning
Not implemented!
 ADESK_DEPRECATED void AcGiVisualStyle::setEdgeStyle  |  ( |  const AcGiEdgeStyle &  |  style | )
Warning
Not implemented!
 ADESK_DEPRECATED void AcGiVisualStyle::setFaceStyle  |  ( |  const AcGiFaceStyle &  |  style | )
Warning
Not implemented!
 virtual ACDB_PORT bool AcGiVisualStyle::setTrait  |  ( |  Property  |  prop,
|  Operation  |  op
)
virtual
Warning
Not implemented!
 virtual ACDB_PORT bool AcGiVisualStyle::setTrait  |  ( |  Property  |  prop,
|  const AcGiVariant *  |  pVal,
|  Operation  |  op = AcGiVisualStyleOperations::kSet
)
virtual
Warning
Not implemented!
 virtual ACDB_PORT bool AcGiVisualStyle::setTrait  |  ( |  Property  |  prop,
|  int  |  nVal,
|  Operation  |  op = AcGiVisualStyleOperations::kSet
)
virtual
Warning
Not implemented!
 virtual ACDB_PORT bool AcGiVisualStyle::setTrait  |  ( |  Property  |  prop,
|  bool  |  bVal,
|  Operation  |  op = AcGiVisualStyleOperations::kSet
)
virtual
Warning
Not implemented!
 virtual ACDB_PORT bool AcGiVisualStyle::setTrait  |  ( |  Property  |  prop,
|  double  |  dVal,
|  Operation  |  op = AcGiVisualStyleOperations::kSet
)
virtual
Warning
Not implemented!
 virtual ACDB_PORT bool AcGiVisualStyle::setTrait  |  ( |  Property  |  prop,
|  double  |  red,
|  double  |  green,
|  double  |  blue,
|  Operation  |  op = AcGiVisualStyleOperations::kSet
)
virtual
Warning
Not implemented!
 virtual ACDB_PORT bool AcGiVisualStyle::setTrait  |  ( |  Property  |  prop,
|  const AcCmColor *  |  pColor,
|  Operation  |  op = AcGiVisualStyleOperations::kSet
)
virtual
Warning
Not implemented!
 virtual ACDB_PORT bool AcGiVisualStyle::setTraitFlag  |  ( |  Property  |  flagProp,
|  unsigned long  |  flagVal,
|  bool  |  bEnable = true
)
virtual
Warning
Not implemented!
 ACDB_PORT bool AcGiVisualStyle::setType  |  ( |  Type  |  type | )
Warning
Not implemented!
 virtual ACDB_PORT const AcGiVariant& AcGiVisualStyle::trait  |  ( |  Property  |  prop,
|  Operation *  |  pOp = NULL
) |   |  const
virtual
Warning
Not implemented!
 virtual ACDB_PORT bool AcGiVisualStyle::traitFlag  |  ( |  Property  |  flagProp,
|  unsigned long  |  flagVal
) |   |  const
virtual
Warning
Not implemented!
 ACDB_PORT Type AcGiVisualStyle::type  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acgivisualstyle.h