Public Types | Public Member Functions | List of all members
AcPlDSDEntry Class Reference
AcPl Classes
  Inheritance diagram for AcPlDSDEntry:
 Public Types
enum  | SheetType {
 kSingleDWF = 0, kMultiDWF = 1, kOriginalDevice = 2, kSingleDWFx = 3,
 kMultiDWFx = 4, kSinglePDF = 5, kMultiPDF = 6
 }
 Public Member Functions
 ACPL_PORT  | AcPlDSDEntry (const AcPlDSDEntry &src)
 ACPL_PORT const ACHAR *  | dwgName () const
 ACPL_PORT bool  | has3dDwfSetup () const
 ACPL_PORT const ACHAR *  | layout () const
 ACPL_PORT const ACHAR *  | NPS () const
 ACPL_PORT const ACHAR *  | NPSSourceDWG () const
 ACPL_PORT AcPlDSDEntry &  | operator= (const AcPlDSDEntry &src)
 ACPL_PORT void  | setDwgName (const ACHAR *pName)
 ACPL_PORT void  | setHas3dDwfSetup (bool b3dDwfSetup)
 ACPL_PORT void  | setLayout (const ACHAR *pLayoutName)
 ACPL_PORT void  | setNPS (const ACHAR *pNPSName)
 ACPL_PORT void  | setNPSSourceDWG (const ACHAR *pNPWDWGName)
 ACPL_PORT void  | setTitle (const ACHAR *pTitle)
 ACPL_PORT const ACHAR *  | title () const
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 The documentation for this class was generated from the following file:
acpldsdentry.h