Public Member Functions | Static Public Attributes | List of all members
AcCmColor Class Reference
AcCm Classes
  Inheritance diagram for AcCmColor:
 Public Member Functions
AcCmColor (const AcCmColor &)
AcCmColor (const AcCmColorBase &)
 Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 virtual Adesk::UInt8  | blue () const
 virtual const ACHAR *  | bookName (void) const
 virtual Adesk::UInt32  | color () const
 virtual Adesk::UInt16  | colorIndex () const
 virtual
 AcCmEntityColor::ColorMethod  | colorMethod () const
 virtual const ACHAR *  | colorName (void) const
 virtual const ACHAR *  | colorNameForDisplay (void)
 AcCmComplexColor *  | complexColor () const
 int  | dictionaryKeyLength (void) const
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pInputFiler)
 Acad::ErrorStatus  | dwgInAsTrueColor (AcDbDwgFiler *pInputFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pOutputFiler) const
 Acad::ErrorStatus  | dwgOutAsTrueColor (AcDbDwgFiler *pOutputFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler, int groupCodeOffset=0)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, int groupCodeOffset=0) const
 AcCmEntityColor  | entityColor (void) const
 Acad::ErrorStatus  | getDescription (ACHAR *&desc) const
 void  | getDictionaryKey (ACHAR *) const
 Acad::ErrorStatus  | getExplanation (ACHAR *&expl) const
 virtual Adesk::UInt8  | green () const
 virtual bool  | hasBookName (void) const
 virtual bool  | hasColorName (void) const
 virtual bool  | isByACI () const
 virtual bool  | isByBlock () const
 virtual bool  | isByColor () const
 virtual bool  | isByLayer () const
 virtual bool  | isByPen () const
 virtual bool  | isForeground () const
 bool  | isNone () const
 bool  | operator!= (const AcCmColor &color) const
 bool  | operator!= (const AcCmColorBase &color) const
 AcCmColor &  | operator= (const AcCmColor &inputColor)
 AcCmColor &  | operator= (const AcCmColorBase &inputColor)
 bool  | operator== (const AcCmColor &color) const
 bool  | operator== (const AcCmColorBase &color) const
 virtual Adesk::UInt16  | penIndex () const
 virtual Adesk::UInt8  | red () const
 Acad::ErrorStatus  | serializeIn (const void *pBuff, int *pBuflen)
 Acad::ErrorStatus  | serializeOut (void *pBuff, int *pBuflen, AcDb::AcDbDwgVersion ver=AcDb::kDHL_CURRENT) const
 virtual Acad::ErrorStatus  | setBlue (Adesk::UInt8 blue)
 virtual Acad::ErrorStatus  | setColor (Adesk::UInt32 color)
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 colorIndex)
 virtual Acad::ErrorStatus  | setColorMethod (AcCmEntityColor::ColorMethod eColorMethod)
 void  | setComplexColor (AcCmComplexColor *pComplex)
 virtual Acad::ErrorStatus  | setGreen (Adesk::UInt8 green)
 virtual Acad::ErrorStatus  | setNames (const ACHAR *colorName, const ACHAR *bookName=NULL)
 Acad::ErrorStatus  | setNamesFromDictionaryKey (const ACHAR *)
 virtual Acad::ErrorStatus  | setPenIndex (Adesk::UInt16 penIndex)
 virtual Acad::ErrorStatus  | setRed (Adesk::UInt8 red)
 virtual Acad::ErrorStatus  | setRGB (Adesk::UInt8 red, Adesk::UInt8 green, Adesk::UInt8 blue)
 Static Public Attributes
 static const Adesk::UInt16  | MaxColorIndex
 The documentation for this class was generated from the following file:
dbmain.h