Public Types | Public Member Functions | List of all members
AcEdSubSelectFilter Class Reference
 Public Types
enum  | SubSelectStatus { kSubSelectionNone = 0, kSubSelectionAugment, kSubSelectionExclusive, kSubSelectAll }
 Public Member Functions
 virtual bool  | cancelAllSubSelect ()
 virtual bool  | cancelSubSelect (AcDbEntity *pEnt)
 virtual bool  | isSubSelected (AcDbEntity *pEnt) const
 virtual bool  | onKey (unsigned long wMsg, unsigned int nChar, unsigned int rptCnt, unsigned int flags)
 virtual bool  | reSubSelectEntity (AcDbEntity *pEnt, AcDbFullSubentPathArray &paths)
 virtual bool  | selectEntity (const AcGePoint3d &wvpt, const AcGeVector3d &wvwdir, const AcGeVector3d &wvwxdir, double wxaper, double wyaper, long flags, const AcGiViewport *pCurVp, AcDbEntity *pEnt) const
 virtual Acad::ErrorStatus  | subSelectClassList (AcArray< AcRxClass * > &clsIds)
 virtual SubSelectStatus  | subSelectEntity (const AcGePoint3d &wpt1, const AcGePoint3d &wpt2, const AcGeVector3d &wvwdir, const AcGeVector3d &wvwxdir, double wxaper, double wyaper, AcDb::SelectType seltype, bool bAugment, bool bIsInPickfirstSet, bool bEvery, const AcGiViewport *pCurVP, AcDbEntity *pEnt, AcDbFullSubentPathArray &paths)
 virtual SubSelectStatus  | subSelectEntity (const resbuf *pResbuf, bool bAugment, bool bIsInPickfirstSet, bool bEvery, const AcGiViewport *pCurVP, AcDbEntity *pEnt, AcDbFullSubentPathArray &paths)
 The documentation for this class was generated from the following file:
subselect.h