Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
AsdkPromptBase< T, TCLSIDWrapper > Class Template Reference
Misc Classes
  Inheritance diagram for AsdkPromptBase< T, TCLSIDWrapper >:
 Public Member Functions
 virtual AcDbObjectId  | promptLoop ()
 Public Member Functions inherited from AcEdJig
 DragStatus  | acquireAngle (double &ang)
 DragStatus  | acquireAngle (double &ang, const AcGePoint3d &basePnt)
 DragStatus  | acquireDist (double &dist)
 DragStatus  | acquireDist (double &dist, const AcGePoint3d &basePnt)
 DragStatus  | acquirePoint (AcGePoint3d &)
 DragStatus  | acquirePoint (AcGePoint3d &, const AcGePoint3d &basePnt)
 DragStatus  | acquireString (ACHAR *str)
ACRX_DECLARE_MEMBERS (AcEdJig)
 AcDbObjectId  | append ()
 virtual AcDbDimDataPtrArray *  | dimData (const double dimScale)
 const ACHAR *  | dispPrompt ()
 DragStatus  | drag ()
 const ACHAR *  | keywordList ()
 virtual Acad::ErrorStatus  | setDimValue (const AcDbDimData *dimData, const double dimValue)
 void  | setDispPrompt (const ACHAR *,...)
 void  | setKeywordList (const ACHAR *)
 void  | setSpecialCursorType (CursorType)
 void  | setUserInputControls (AcEdJig::UserInputControls)
 AcEdJig::CursorType  | specialCursorType ()
 AcEdJig::UserInputControls  | userInputControls ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 LPCWSTR  | BuildPromptString (int index)
 virtual void  | constructorCallback ()
 virtual bool  | defaultValueCallback (int index, LPWSTR szDefaultVal)
 virtual AcDbEntity *  | entity () const
 HRESULT  | FinalConstruct ()
 void  | FinalRelease ()
 virtual PROMPT_MAP_ENTRY *  | GetPromptMap ()=0
 int  | GetPromptMapSize ()
 HRESULT  | GetPropertyTypeInfo ()
 virtual HINSTANCE  | GetResourceInstance ()=0
 virtual void  | initSampler ()=0
 virtual bool  | keywordCallback (int index, TCHAR *kword, void *value)
 int  | LoadString (UINT uID, LPWSTR szString, int nBufferMax=255)
 STDMETHODIMP  | OnChanged (DISPID dispId)
 STDMETHODIMP  | OnRequestEdit (DISPID dispID)
 virtual int  | promptCallback (int index)
 virtual VARTYPE  | propertyTypeCallback (int index, VARTYPE varType)
 HRESULT  | PutProperty (int index)
 virtual AcEdJig::DragStatus  | sampler ()
 virtual AcEdJig::DragStatus  | samplerCallback (int index, bool &compareChange)
 void  | SetDocument (AcApDocument *pDoc)
 virtual void  | setProperty (int index, VARIANT &var, long val)
 virtual void  | setProperty (int index, VARIANT &var, short val)
 virtual void  | setProperty (int index, VARIANT &var, double val)
 virtual void  | setProperty (int index, VARIANT &var, float val)
 virtual void  | setProperty (int index, VARIANT &var, TCHAR *val)
 virtual void  | setProperty (int index, VARIANT &var, AcGePoint3d &val)
 virtual void  | setProperty (int index, VARIANT &var, AcGePoint2d &val)
 void  | setPropertyDefault (int i)
 virtual void  | setPropertyDefaults (int index=-1)
 virtual Adesk::Boolean  | update ()
 virtual bool  | updateCallback (int index)
 Protected Attributes
 double  | m_angle
 CLSID  | m_CLSID_ObjectWrapper
 volatile LONG  | m_cRef
 AcGePoint3d  | m_cursor3dPos
 double  | m_cursorAngle
 double  | m_cursorDist
 AcGePoint2d  | m_cursorPos
 DWORD  | m_dConnectionID
 double  | m_dist
 AcEdJig::CursorType  | m_jigCursorType
 AcEdJig::UserInputControls  | m_jigUserInputControls
 CComQIPtr< IAcadBaseObject2 >  | m_pBaseObj
 CComPtr< IConnectionPoint >  | m_pConPt
 AcDbDatabase *  | m_pDb
 AcDbObject *  | m_pDbrObject
 AcApDocument *  | m_pDoc
 AcGePoint2d  | m_pos
 AcGePoint3d  | m_pos3d
 CComPtr< T >  | m_pWrapperObject
 TCHAR *  | m_szCursorString
 TCHAR *  | m_szString
 Additional Inherited Members
 Public Types inherited from AcEdJig
enum  | CursorType {
 kNoSpecialCursor = -1, kCrosshair = 0, kRectCursor, kRubberBand,
 kNotRotated, kTargetBox, kRotatedCrosshair, kCrosshairNoRotate,
 kInvisible, kEntitySelect, kParallelogram, kEntitySelectNoPersp,
 kPkfirstOrGrips, kCrosshairDashed
 }
enum  | DragStatus {
 kModeless = -17, kNoChange = -6, kCancel = -4, kOther = -3,
 kNull = -1, kNormal = 0, kKW1, kKW2,
 kKW3, kKW4, kKW5, kKW6,
 kKW7, kKW8, kKW9
 }
enum  | UserInputControls {
 kGovernedByOrthoMode = 0x0001, kNullResponseAccepted = 0x0002, kDontEchoCancelForCtrlC = 0x0004, kDontUpdateLastPoint = 0x0008,
 kNoDwgLimitsChecking = 0x0010, kNoZeroResponseAccepted = 0x0020, kNoNegativeResponseAccepted = 0x0040, kAccept3dCoordinates = 0x0080,
 kAcceptMouseUpAsPoint = 0x0100, kAnyBlankTerminatesInput = 0x0200, kInitialBlankTerminatesInput = 0x0400, kAcceptOtherInputString = 0x0800,
 kGovernedByUCSDetect = 0x1000, kNoZDirectionOrtho = 0x2000
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
AsdkPromptBase.h