Public Types | Public Member Functions | List of all members
AcGiLightAttenuation Class Reference
AcGi Classes
  Inheritance diagram for AcGiLightAttenuation:
 Public Types
enum  | AttenuationType { kNone = 0, kInverseLinear, kInverseSquare }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiLightAttenuation)
 virtual AttenuationType  | attenuationType () const
 virtual double  | endLimit () const
 bool  | operator== (const AcGiLightAttenuation &atten) const
 virtual void  | setAttenuationType (AttenuationType typ)
 virtual void  | setLimits (double startlim, double endlim)
 virtual void  | setUseLimits (bool on)
 virtual double  | startLimit () const
 virtual bool  | useLimits () const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
AcGiLightTraits.h