Public Member Functions | Public Attributes | List of all members
AcGiColorRGB Class Reference
AcGi Classes
 Public Member Functions
AcGiColorRGB (double r, double g, double b)
 Public Attributes
 double  | blue
 double  | green
 double  | red
 The documentation for this class was generated from the following file:
acgi.h