Public Member Functions | List of all members
AcDbObjectContextCollection Class Reference
AcDb Classes
  Inheritance diagram for AcDbObjectContextCollection:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbObjectContextCollection)
 virtual Acad::ErrorStatus  | addContext (const AcDbObjectContext *pContext)=0
 virtual AcDbObjectContext *  | currentContext (const AcDbObject *pRequestingObject) const =0
 virtual AcDbObjectContext *  | getContext (const AcString &contextName) const =0
 virtual bool  | hasContext (const AcString &contextName) const =0
 virtual Acad::ErrorStatus  | lockContext (const AcDbObjectContext *pContext)=0
 virtual bool  | locked () const =0
 virtual AcString  | name () const =0
 virtual
 AcDbObjectContextCollectionIterator *  | newIterator () const =0
 virtual Acad::ErrorStatus  | removeContext (const AcString &contextName)=0
 virtual Acad::ErrorStatus  | setCurrentContext (const AcDbObjectContext *pContext)=0
 virtual Acad::ErrorStatus  | unlockContext ()=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbObjectContextCollection.h