Public Member Functions | List of all members
AcGeCurveCurveInt3d Class Reference
AcGe Classes
  Inheritance diagram for AcGeCurveCurveInt3d:
 Public Member Functions
AcGeCurveCurveInt3d (const AcGeCurve3d &curve1, const AcGeCurve3d &curve2, const AcGeVector3d &planeNormal=AcGeVector3d::kIdentity, const AcGeTol &tol=AcGeContext::gTol)
AcGeCurveCurveInt3d (const AcGeCurve3d &curve1, const AcGeCurve3d &curve2, const AcGeInterval &range1, const AcGeInterval &range2, const AcGeVector3d &planeNormal=AcGeVector3d::kIdentity, const AcGeTol &tol=AcGeContext::gTol)
AcGeCurveCurveInt3d (const AcGeCurveCurveInt3d &src)
 void  | changeCurveOrder ()
 const AcGeCurve3d *  | curve1 () const
 const AcGeCurve3d *  | curve2 () const
 void  | getIntConfigs (int intNum, AcGe::AcGeXConfig &config1wrt2, AcGe::AcGeXConfig &config2wrt1) const
 void  | getIntParams (int intNum, double &param1, double &param2) const
 void  | getIntRanges (AcGeInterval &range1, AcGeInterval &range2) const
 void  | getOverlapRanges (int overlapNum, AcGeInterval &range1, AcGeInterval &range2) const
 void  | getPointOnCurve1 (int intNum, AcGePointOnCurve3d &pntOnCrv) const
 void  | getPointOnCurve2 (int intNum, AcGePointOnCurve3d &pntOnCrv) const
 AcGePoint3d  | intPoint (int intNum) const
 double  | intPointTol (int intNum) const
 Adesk::Boolean  | isTangential (int intNum) const
 Adesk::Boolean  | isTransversal (int intNum) const
 int  | numIntPoints () const
 AcGeCurveCurveInt3d &  | operator= (const AcGeCurveCurveInt3d &src)
 AcGeCurveCurveInt3d &  | orderWrt1 ()
 AcGeCurveCurveInt3d &  | orderWrt2 ()
 int  | overlapCount () const
 Adesk::Boolean  | overlapDirection () const
 AcGeVector3d  | planeNormal () const
 AcGeCurveCurveInt3d &  | set (const AcGeCurve3d &curve1, const AcGeCurve3d &curve2, const AcGeVector3d &planeNormal=AcGeVector3d::kIdentity, const AcGeTol &tol=AcGeContext::gTol)
 AcGeCurveCurveInt3d &  | set (const AcGeCurve3d &curve1, const AcGeCurve3d &curve2, const AcGeInterval &range1, const AcGeInterval &range2, const AcGeVector3d &planeNormal=AcGeVector3d::kIdentity, const AcGeTol &tol=AcGeContext::gTol)
 AcGeTol  | tolerance () const
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeEntity3d
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
gecint3d.h