Public Member Functions | List of all members
AcGePosition2d Class Reference
AcGe Classes
  Inheritance diagram for AcGePosition2d:
 Public Member Functions
AcGePosition2d (const AcGePoint2d &pnt)
AcGePosition2d (double x, double y)
AcGePosition2d (const AcGePosition2d &pos)
 AcGePosition2d &  | operator= (const AcGePosition2d &pos)
 AcGePosition2d &  | set (const AcGePoint2d &)
 AcGePosition2d &  | set (double x, double y)
 Public Member Functions inherited from AcGePointEnt2d
operator AcGePoint2d () const
 AcGePointEnt2d &  | operator= (const AcGePointEnt2d &pnt)
 AcGePoint2d  | point2d () const
 Public Member Functions inherited from AcGeEntity2d
 AcGeEntity2d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity2d &entity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity2d &  | mirror (const AcGeLine2d &line)
 Adesk::Boolean  | operator!= (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | operator= (const AcGeEntity2d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | rotateBy (double angle, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | scaleBy (double scaleFactor, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | transformBy (const AcGeMatrix2d &xfm)
 AcGeEntity2d &  | translateBy (const AcGeVector2d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGePointEnt2d
AcGePointEnt2d (const AcGePointEnt2d &)
 Protected Attributes inherited from AcGeEntity2d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
gepos2d.h