Public Types | Public Member Functions | Protected Member Functions | List of all members
AcDbMLeader Class Reference
AcDb Classes
  Inheritance diagram for AcDbMLeader:
 Public Types
enum  | gsMarkType {
 kNone = 0, kArrowMark = 1, kLeaderLineMark = kArrowMark + MAX_LEADERLINE_NUMBER, kDoglegMark = kLeaderLineMark + MAX_LEADERLINE_NUMBER,
 kMTextMark = kDoglegMark + MAX_LEADER_NUMBER, kMTextUnderLineMark = kMTextMark + 1, kToleranceMark = kMTextUnderLineMark + 1, kBlockMark = kToleranceMark + 1,
 kBlockAttribute = kBlockMark + 1
 }
enum  | MoveType { kMoveAllPoints = 0, kMoveAllExceptArrowHeaderPoints = 1, kMoveContentAndDoglegPoints = 2 }
enum  | PropertyOverrideType {
 kLeaderLineType = 0, kLeaderLineColor = 1, kLeaderLineTypeId = 2, kLeaderLineWeight = 3,
 kEnableLanding = 4, kLandingGap = 5, kEnableDogleg = 6, kDoglegLength = 7,
 kArrowSymbolId = 8, kArrowSize = 9, kContentType = 10, kTextStyleId = 11,
 kTextLeftAttachmentType = 12, kTextAngleType = 13, kTextAlignmentType = 14, kTextColor = 15,
 kTextHeight = 16, kEnableFrameText = 17, kDefaultMText = 18, kBlockId = 19,
 kBlockColor = 20, kBlockScale = 21, kBlockRotation = 22, kBlockConnectionType = 23,
 kScale = 24, kTextRightAttachmentType = 25, kTextSwitchAlignmentType = 26, kTextAttachmentDirection = 27,
 kTextTopAttachmentType = 28, kTextBottomAttachmentType = 29, kExtendLeaderToText = 30, kSize = kExtendLeaderToText + 1
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbMLeader)
 Acad::ErrorStatus  | addFirstVertex (int leaderLineIndex, const AcGePoint3d &point)
 Acad::ErrorStatus  | addLastVertex (int leaderLineIndex, const AcGePoint3d &point)
 Acad::ErrorStatus  | addLeader (int &leaderIndex)
 Acad::ErrorStatus  | addLeaderLine (int leaderIndex, int &leaderLineIndex)
 Acad::ErrorStatus  | addLeaderLine (const AcGePoint3d &point, int &leaderLineIndex)
 double  | arrowSize () const
 AcDbObjectId  | arrowSymbolId () const
 AcDbObjectId  | arrowSymbolId (int leaderLineIndex) const
 AcCmColor  | blockColor () const
 AcDbMLeaderStyle::BlockConnectionType  | blockConnectionType () const
 AcDbObjectId  | blockContentId () const
 double  | blockRotation () const
 AcGeScale3d  | blockScale () const
 Acad::ErrorStatus  | connectionPoint (const AcGeVector3d &vect, AcGePoint3d &point) const
 Acad::ErrorStatus  | connectionPoint (const AcGeVector3d &vect, AcGePoint3d &point, AcDbMLeaderStyle::TextAttachmentDirection textAttachmentDirection) const
 AcDbMLeaderStyle::ContentType  | contentType () const
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths)
 Acad::ErrorStatus  | doglegLength (int leaderIndex, double &doglegLength) const
 double  | doglegLength () const
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *filer)
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *filer) const
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *filer)
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *filer) const
 bool  | enableAnnotationScale () const
 bool  | enableDogleg () const
 bool  | enableFrameText () const
 bool  | enableLanding () const
 virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const
 bool  | extendLeaderToText () const
 Acad::ErrorStatus  | getArrowSize (int leaderLineIndex, double &arrowSize) const
 Acad::ErrorStatus  | getArrowSymbolId (int leaderLineIndex, AcDbObjectId &arrowSymbolId) const
 Acad::ErrorStatus  | getBlockAttributeValue (const AcDbObjectId &attdefId, AcDbAttribute *&pAtt) const
 Acad::ErrorStatus  | getBlockAttributeValue (const AcDbObjectId &attdefId, ACHAR *&value) const
 Acad::ErrorStatus  | getBlockPosition (AcGePoint3d &position) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 Acad::ErrorStatus  | getContentGeomExtents (AcDbExtents &extents) const
 void *  | getContextDataManager () const
 Acad::ErrorStatus  | getDoglegDirection (int leaderIndex, AcGeVector3d &vector) const
 Acad::ErrorStatus  | getFirstVertex (int leaderLineIndex, AcGePoint3d &point) const
 virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const
 Acad::ErrorStatus  | getLastVertex (int leaderLineIndex, AcGePoint3d &point) const
 Acad::ErrorStatus  | getLeaderIndex (int leaderLineIndex, int &leaderIndex) const
 Acad::ErrorStatus  | getLeaderIndexes (AcArray< int > &leaderIndexes) const
 Acad::ErrorStatus  | getLeaderLineColor (int leaderLineIndex, AcCmColor &leaderLineColor) const
 Acad::ErrorStatus  | getLeaderLineIndexes (AcArray< int > &leaderLineIndexes) const
 Acad::ErrorStatus  | getLeaderLineIndexes (int leaderIndex, AcArray< int > &leaderLineIndexes) const
 Acad::ErrorStatus  | getLeaderLineType (int leaderLineIndex, AcDbMLeaderStyle::LeaderType &leaderLineType) const
 Acad::ErrorStatus  | getLeaderLineTypeId (int leaderLineIndex, AcDbObjectId &leaderLineTypeId) const
 Acad::ErrorStatus  | getLeaderLineWeight (int leaderLineIndex, AcDb::LineWeight &leaderLineWeight) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 Acad::ErrorStatus  | getOverridedMLeaderStyle (AcDbMLeaderStyle &mleaderStyle)
virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 Acad::ErrorStatus  | getTextLocation (AcGePoint3d &location) const
 Acad::ErrorStatus  | getToleranceLocation (AcGePoint3d &location) const
 virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const
 Acad::ErrorStatus  | getVertex (int leaderLineIndex, int index, AcGePoint3d &point) const
 virtual void  | gripStatus (const AcDb::GripStat status)
 bool  | hasContent () const
 virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 bool  | isOverride (PropertyOverrideType propertyType) const
 double  | landingGap () const
 AcCmColor  | leaderLineColor () const
 AcDbMLeaderStyle::LeaderType  | leaderLineType () const
 AcDbObjectId  | leaderLineTypeId () const
 AcDb::LineWeight  | leaderLineWeight () const
 virtual void  | list () const
 AcDbObjectId  | MLeaderStyle ()
 virtual void  | modified (const AcDbObject *dbObj)
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 Acad::ErrorStatus  | moveMLeader (const AcGeVector3d &vector, MoveType moveType, bool bAutoSwitchDogleg=true)
 virtual Acad::ErrorStatus  | moveStretchPoints (const AcDbIntArray &indices, const AcGeVector3d &offset)
 AcDbMText *  | mtext () const
 AcGeVector3d  | normal () const
 int  | numLeaderLines () const
 int  | numLeaders () const
 Acad::ErrorStatus  | numVertices (int leaderLineIndex, int &num) const
 virtual void  | objectClosed (const AcDbObjectId dbObjId)
 AcGePlane  | plane () const
 Acad::ErrorStatus  | postMLeaderToDb (AcDbDatabase *pDb)
 Acad::ErrorStatus  | recomputeBreakPoints ()
 Acad::ErrorStatus  | removeFirstVertex (int leaderLineIndex)
 Acad::ErrorStatus  | removeLastVertex (int leaderLineIndex)
 Acad::ErrorStatus  | removeLeader (int leaderIndex)
 Acad::ErrorStatus  | removeLeaderLine (int leaderLineIndex)
 Acad::ErrorStatus  | removeLeaderLineRefAssoc (int leaderLineIndex) const
 double  | scale () const
 Acad::ErrorStatus  | setArrowSize (double arrowSize)
 Acad::ErrorStatus  | setArrowSize (int leaderLineIndex, double arrowSize)
 Acad::ErrorStatus  | setArrowSymbolId (AcDbObjectId arrowSymbolId)
 Acad::ErrorStatus  | setArrowSymbolId (int leaderLineIndex, AcDbObjectId arrowSymbolId)
 Acad::ErrorStatus  | setBlockAttributeValue (const AcDbObjectId &attdefId, const AcDbAttribute *pAtt)
 Acad::ErrorStatus  | setBlockAttributeValue (const AcDbObjectId &attdefId, const ACHAR *value)
 Acad::ErrorStatus  | setBlockColor (const AcCmColor &blockColor)
 Acad::ErrorStatus  | setBlockConnectionType (AcDbMLeaderStyle::BlockConnectionType blockConnectionType)
 Acad::ErrorStatus  | setBlockContentId (AcDbObjectId blockId)
 Acad::ErrorStatus  | setBlockPosition (const AcGePoint3d &position)
 Acad::ErrorStatus  | setBlockRotation (double rotation)
 Acad::ErrorStatus  | setBlockScale (const AcGeScale3d &scale)
 Acad::ErrorStatus  | setContentType (AcDbMLeaderStyle::ContentType contentType)
 Acad::ErrorStatus  | setContextDataManager (void *pContextDataManager)
 Acad::ErrorStatus  | setDoglegDirection (int leaderIndex, const AcGeVector3d &vector)
 Acad::ErrorStatus  | setDoglegLength (int leaderIndex, double doglegLength)
 Acad::ErrorStatus  | setDoglegLength (double doglegLength)
 Acad::ErrorStatus  | setEnableAnnotationScale (bool enableAnnotationScale)
 Acad::ErrorStatus  | setEnableDogleg (bool enableDogleg)
 Acad::ErrorStatus  | setEnableFrameText (bool enableFrameText)
 Acad::ErrorStatus  | setEnableLanding (bool enableLanding)
 Acad::ErrorStatus  | setExtendLeaderToText (bool value)
 Acad::ErrorStatus  | setFirstVertex (int leaderLineIndex, const AcGePoint3d &point)
 Acad::ErrorStatus  | setLandingGap (double landingGap)
 Acad::ErrorStatus  | setLastVertex (int leaderLineIndex, const AcGePoint3d &point)
 Acad::ErrorStatus  | setLeaderLineColor (const AcCmColor &leaderLineColor)
 Acad::ErrorStatus  | setLeaderLineColor (int leaderLineIndex, const AcCmColor &leaderLineColor)
 Acad::ErrorStatus  | setLeaderLineType (AcDbMLeaderStyle::LeaderType leaderLineType)
 Acad::ErrorStatus  | setLeaderLineType (int leaderLineIndex, AcDbMLeaderStyle::LeaderType leaderLineType)
 Acad::ErrorStatus  | setLeaderLineTypeId (AcDbObjectId leaderLineTypeId)
 Acad::ErrorStatus  | setLeaderLineTypeId (int leaderLineIndex, AcDbObjectId leaderLineTypeId)
 Acad::ErrorStatus  | setLeaderLineWeight (AcDb::LineWeight leaderLineWeight)
 Acad::ErrorStatus  | setLeaderLineWeight (int leaderLineIndex, AcDb::LineWeight leaderLineWeight)
 Acad::ErrorStatus  | setMLeaderStyle (AcDbObjectId newStyleId)
 Acad::ErrorStatus  | setMText (const AcDbMText *pMText)
 Acad::ErrorStatus  | setOverride (PropertyOverrideType propertyType, bool isOverride=true)
 void  | setPlane (const AcGePlane &plane)
 Acad::ErrorStatus  | setScale (double scale)
 Acad::ErrorStatus  | setTextAlignmentType (AcDbMLeaderStyle::TextAlignmentType textAlignmentType)
 Acad::ErrorStatus  | setTextAngleType (AcDbMLeaderStyle::TextAngleType textAngleType)
 Acad::ErrorStatus  | setTextAttachmentDirection (AcDbMLeaderStyle::TextAttachmentDirection textAttachmentDirection)
 Acad::ErrorStatus  | setTextAttachmentType (AcDbMLeaderStyle::TextAttachmentType textAttachmentType, AcDbMLeaderStyle::LeaderDirectionType leaderDirection)
 Acad::ErrorStatus  | setTextAttachmentType (AcDbMLeaderStyle::TextAttachmentType textAttachmentType)
 Acad::ErrorStatus  | setTextColor (const AcCmColor &textColor)
 Acad::ErrorStatus  | setTextHeight (double textHeight)
 Acad::ErrorStatus  | setTextLocation (const AcGePoint3d &location)
 Acad::ErrorStatus  | setTextStyleId (AcDbObjectId textStyleId)
Acad::ErrorStatus  | setToleranceLocation (const AcGePoint3d &location)
Acad::ErrorStatus  | setVertex (int leaderLineIndex, int index, const AcGePoint3d &point)
virtual Acad::ErrorStatus  | subClose ()
virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &path) const
virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 AcDbMLeaderStyle::TextAlignmentType  | textAlignmentType () const
 AcDbMLeaderStyle::TextAngleType  | textAngleType () const
 AcDbMLeaderStyle::TextAttachmentDirection  | textAttachmentDirection () const
 AcDbMLeaderStyle::TextAttachmentType  | textAttachmentType (AcDbMLeaderStyle::LeaderDirectionType leaderDirection) const
 AcDbMLeaderStyle::TextAttachmentType  | textAttachmentType () const
 AcCmColor  | textColor () const
 double  | textHeight () const
 AcDbObjectId  | textStyleId () const
 virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform)
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
Acad::ErrorStatus  | updateContentScale (AcDbMLeaderObjectContextData *pContext)
Acad::ErrorStatus  | updateLeaderLinePosition ()
virtual void  | viewportDraw (AcGiViewportDraw *mode)
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *mode)
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual bool  | castShadows () const
 virtual Adesk::Boolean  | cloneMeForDragging ()
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 virtual void  | dragStatus (const AcDb::DragStat status)
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable ()
 AcCmEntityColor  | entityColor () const
 virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual void  | getEcs (AcGeMatrix3d &retVal) const
 virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeFastTransform &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const
 virtual Adesk::Boolean  | isPlanar () const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 ACHAR *  | plotStyleName () const
 virtual bool  | receiveShadows () const
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 virtual void  | setCastShadows (bool newVal)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual void  | setGsNode (AcGsNode *pNode)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual void  | setReceiveShadows (bool newVal)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | transformBy (const AcGeFastTransform &xform)
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 AcCmTransparency  | transparency () const
 AcDb::Visibility  | visibility () const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Member Function Documentation
 virtual Acad::ErrorStatus AcDbMLeader::getOsnapPoints  |  ( |  AcDb::OsnapMode  |  osnapMode,
|  Adesk::GsMarker  |  gsSelectionMark,
|  const AcGePoint3d &  |  pickPoint,
|  const AcGePoint3d &  |  lastPoint,
|  const AcGeMatrix3d &  |  viewXform,
|  AcGePoint3dArray &  |  snapPoints,
|  AcDbIntArray &  |  geomIds
) |   |  const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbMLeader::getStretchPoints  |  ( |  AcGePoint3dArray &  |  stretchPoints | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 Acad::ErrorStatus AcDbMLeader::setToleranceLocation  |  ( |  const AcGePoint3d &  |  location | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMLeader::setVertex  |  ( |  int  |  leaderLineIndex,
|  int  |  index,
|  const AcGePoint3d &  |  point
)
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbMLeader::subClose  |  ( |   | )
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual AcDbEntity* AcDbMLeader::subentPtr  |  ( |  const AcDbFullSubentPath &  |  path | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbMLeader::subErase  |  ( |  Adesk::Boolean  |  erasing | )
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual Acad::ErrorStatus AcDbMLeader::unhighlight  |  ( |  const AcDbFullSubentPath &  |  subId = kNullSubent,
|  const Adesk::Boolean  |  highlightAll = false
) |   |  const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 Acad::ErrorStatus AcDbMLeader::updateContentScale  |  ( |  AcDbMLeaderObjectContextData *  |  pContext | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbMLeader::updateLeaderLinePosition  |  ( |   | )
Warning
Not implemented!
 virtual void AcDbMLeader::viewportDraw  |  ( |  AcGiViewportDraw *  |  mode | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 The documentation for this class was generated from the following file:
dbmleader.h