Public Types | Public Member Functions | Static Public Attributes | List of all members
AcGiMapper Class Reference
AcGi Classes
  Inheritance diagram for AcGiMapper:
 Public Types
enum  | AutoTransform { kInheritAutoTransform = 0x0, kNone = 0x1, kObject = 0x2, kModel = 0x4 }
enum  | Projection {
 kInheritProjection = 0, kPlanar, kBox, kCylinder,
 kSphere
 }
enum  | Tiling {
 kInheritTiling = 0, kTile, kCrop, kClamp,
 kMirror
 }
 Public Member Functions
AcGiMapper (const AcGiMapper &mapper)
ACRX_DECLARE_MEMBERS (AcGiMapper)
 virtual AutoTransform  | autoTransform (void) const
 bool  | operator!= (const AcGiMapper &mapper) const
 AcGiMapper &  | operator= (const AcGiMapper &mapper)
 bool  | operator== (const AcGiMapper &mapper) const
 virtual Projection  | projection (void) const
 virtual void  | set (const AcGiMapper &mapper)
 virtual void  | setAutoTransform (AutoTransform autoTransform)
 virtual void  | setProjection (Projection projection)
 virtual ADESK_DEPRECATED void  | setTiling (Tiling tiling)
 virtual void  | setTransform (const AcGeMatrix3d &transform)
 void  | setUTiling (Tiling tiling)
 void  | setVTiling (Tiling tiling)
 virtual ADESK_DEPRECATED Tiling  | tiling (void) const
 virtual const AcGeMatrix3d &  | transform (void) const
 Tiling  | uTiling (void) const
 Tiling  | vTiling (void) const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Attributes
 static ACGIMAT_IMPEXP const
 AcGiMapper  | kIdentity
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acgimaterial.h