Public Types | Public Member Functions | List of all members
AcPlPlotReactor Class Reference
AcPl Classes
  Inheritance diagram for AcPlPlotReactor:
 Public Types
enum  | PlotType { kPlot, kPreview, kBackgroundPackaging, kBackgroundPlot }
 Public Member Functions
 virtual ACPL_PORT void  | beginDocument (AcPlPlotInfo &plotInfo, const ACHAR *pDocname, long nCopies=1, bool bPlotToFile=false, const ACHAR *pFilename=NULL)
 virtual ACPL_PORT void  | beginPage (AcPlPlotPageInfo &pageInfo, AcPlPlotInfo &plotInfo, bool bLastPage)
 virtual ACPL_PORT void  | beginPlot (AcPlPlotProgress *pPlotProgress, PlotType type)
 virtual ACPL_PORT void  | endDocument (AcPlPlotProgress::PlotCancelStatus status)
 virtual ACPL_PORT void  | endPage (AcPlPlotProgress::SheetCancelStatus status)
 virtual ACPL_PORT void  | endPlot (AcPlPlotProgress::PlotCancelStatus status)
 virtual ACPL_PORT void  | pageCancelled ()
 virtual ACPL_PORT void  | plotCancelled ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acplplotreactor.h