Public Member Functions | List of all members
AcDbTransactionManager Class Reference
AcDb Classes
  Inheritance diagram for AcDbTransactionManager:
 Public Member Functions
 virtual Acad::ErrorStatus  | abortTransaction ()=0
ACRX_DECLARE_MEMBERS (AcDbTransactionManager)
 virtual Acad::ErrorStatus  | addNewlyCreatedDBRObject (AcDbObject *obj, bool add=true)=0
 virtual void  | addReactor (AcTransactionReactor *reactor)=0
 virtual Acad::ErrorStatus  | endTransaction ()=0
 virtual Acad::ErrorStatus  | getAllObjects (AcDbVoidPtrArray &objs)=0
 virtual Acad::ErrorStatus  | getObject (AcDbObject *&obj, AcDbObjectId id, AcDb::OpenMode mode, bool openErasedObj=false)=0
 virtual Acad::ErrorStatus  | markObjectPageable (AcDbObject *pObject)=0
 virtual int  | numActiveTransactions ()=0
 virtual Acad::ErrorStatus  | queueForGraphicsFlush ()=0
 virtual void  | removeReactor (AcTransactionReactor *reactor)=0
 virtual AcTransaction *  | startTransaction ()=0
 virtual AcTransaction *  | topTransaction ()=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbtrans.h