Public Member Functions | List of all members
AcDbTableStyle Class Reference
AcDb Classes
  Inheritance diagram for AcDbTableStyle:
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbTableStyle)
 virtual AcDb::CellAlignment  | alignment (AcDb::RowType rowType=AcDb::kDataRow) const
 AcDb::CellAlignment  | alignment (const ACHAR *pszCellStyle) const
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 virtual AcCmColor  | backgroundColor (AcDb::RowType rowType=AcDb::kDataRow) const
 AcCmColor  | backgroundColor (const ACHAR *pszCellStyle) const
 virtual Adesk::UInt32  | bitFlags () const
 int  | cellClass (const ACHAR *pszCellStyle) const
 virtual AcCmColor  | color (AcDb::RowType rowType=AcDb::kDataRow) const
 AcCmColor  | color (const ACHAR *pszCellStyle) const
 Acad::ErrorStatus  | copyCellStyle (const ACHAR *pszSrcCellStyle, const ACHAR *pszTargetCellStyle)
 Acad::ErrorStatus  | copyCellStyle (const AcDbTableStyle *pSrc, const ACHAR *pszSrcCellStyle, const ACHAR *pszTargetCellStyle)
 const ACHAR *  | createCellStyle (void)
 Acad::ErrorStatus  | createCellStyle (const ACHAR *pszCellStyle)
 Acad::ErrorStatus  | createCellStyle (const ACHAR *pszCellStyle, const ACHAR *pszFromCellStyle)
 Acad::ErrorStatus  | deleteCellStyle (const ACHAR *pszCellStyle)
 virtual const ACHAR *  | description (void) const
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | enableMergeAll (bool bEnable, const ACHAR *pszCellStyle)
 virtual AcDb::FlowDirection  | flowDirection (void) const
 virtual ADESK_DEPRECATED const
 ACHAR *  | format (void) const
 virtual ADESK_DEPRECATED const
 ACHAR *  | format (AcDb::RowType rowType) const
 const ACHAR *  | format (const ACHAR *pszCellStyle) const
int  | getCellStyles (AcStringArray &cellstyles) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 virtual Acad::ErrorStatus  | getDataType (AcValue::DataType &nDataType, AcValue::UnitType &nUnitType) const
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | getDataType (AcValue::DataType &nDataType, AcValue::UnitType &nUnitType, AcDb::RowType rowType) const
 Acad::ErrorStatus  | getDataType (AcValue::DataType &nDataType, AcValue::UnitType &nUnitType, const ACHAR *pszCellStyle) const
 Acad::ErrorStatus  | getGridProperty (AcGridProperty &gridProp, AcDb::GridLineType nGridLineTypes, const ACHAR *pszCellStyle) const
 virtual Acad::ErrorStatus  | getName (ACHAR *&pszName) const
AcDbObjectId  | getTemplate (void) const
Acad::ErrorStatus  | getTemplate (AcDbTableTemplate *&pTemplate, AcDb::OpenMode mode)
 Acad::ErrorStatus  | getUniqueCellStyleName (const ACHAR *pszBaseName, AcString &sUniqueName) const
 virtual AcCmColor  | gridColor (AcDb::GridLineType gridLineType, AcDb::RowType rowType=AcDb::kDataRow) const
 AcCmColor  | gridColor (AcDb::GridLineType gridLineType, const ACHAR *pszCellStyle) const
 double  | gridDoubleLineSpacing (AcDb::GridLineType gridLineType, const ACHAR *pszCellStyle) const
 AcDb::GridLineStyle  | gridLineStyle (AcDb::GridLineType gridLineType, const ACHAR *pszCellStyle) const
 AcDbObjectId  | gridLinetype (AcDb::GridLineType gridLineType, const ACHAR *pszCellStyle) const
 virtual AcDb::LineWeight  | gridLineWeight (AcDb::GridLineType gridLineType, AcDb::RowType rowType=AcDb::kDataRow) const
 AcDb::LineWeight  | gridLineWeight (AcDb::GridLineType gridLineType, const ACHAR *pszCellStyle) const
 virtual AcDb::Visibility  | gridVisibility (AcDb::GridLineType gridLineType, AcDb::RowType rowType=AcDb::kDataRow) const
 AcDb::Visibility  | gridVisibility (AcDb::GridLineType gridLineType, const ACHAR *pszCellStyle) const
 virtual ADESK_DEPRECATED double  | horzCellMargin (void) const
 virtual ADESK_DEPRECATED bool  | isBackgroundColorNone (AcDb::RowType rowType=AcDb::kDataRow) const
 bool  | isCellStyleInUse (const ACHAR *pszCellStyle) const
 virtual ADESK_DEPRECATED bool  | isHeaderSuppressed (void) const
 bool  | isMergeAllEnabled (const ACHAR *pszCellStyle) const
 virtual ADESK_DEPRECATED bool  | isTitleSuppressed (void) const
 double  | margin (AcDb::CellMargin nMargin, const ACHAR *pszCellStyle) const
 int  | numCellStyles (void) const
 virtual Acad::ErrorStatus  | postTableStyleToDb (AcDbDatabase *pDb, const ACHAR *styleName, AcDbObjectId &tableStyleId)
 AcDbObjectId  | removeTemplate (void)
 Acad::ErrorStatus  | renameCellStyle (const ACHAR *pszOldName, const ACHAR *pszNewName)
 double  | rotation (const ACHAR *pszCellStyle) const
 virtual Acad::ErrorStatus  | setAlignment (AcDb::CellAlignment alignment, int rowTypes=AcDb::kAllRows)
 Acad::ErrorStatus  | setAlignment (AcDb::CellAlignment alignment, const ACHAR *pszCellStyle)
 virtual Acad::ErrorStatus  | setBackgroundColor (const AcCmColor &color, int rowTypes=AcDb::kAllRows)
 Acad::ErrorStatus  | setBackgroundColor (const AcCmColor &color, const ACHAR *pszCellStyle)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setBackgroundColorNone (bool bValue, int rowTypes=AcDb::kAllRows)
 virtual Acad::ErrorStatus  | setBitFlags (Adesk::UInt32 flags)
 Acad::ErrorStatus  | setCellClass (int nClass, const ACHAR *pszCellStyle)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, int rowTypes=AcDb::kAllRows)
 Acad::ErrorStatus  | setColor (const AcCmColor &color, const ACHAR *pszCellStyle)
 virtual Acad::ErrorStatus  | setDataType (AcValue::DataType nDataType, AcValue::UnitType nUnitType)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setDataType (AcValue::DataType nDataType, AcValue::UnitType nUnitType, int rowTypes)
 Acad::ErrorStatus  | setDataType (AcValue::DataType nDataType, AcValue::UnitType nUnitType, const ACHAR *pszCellStyle)
 virtual Acad::ErrorStatus  | setDescription (const ACHAR *pszDescription)
 virtual Acad::ErrorStatus  | setFlowDirection (AcDb::FlowDirection flow)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setFormat (const ACHAR *pszFormat)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setFormat (const ACHAR *pszFormat, int rowTypes)
 Acad::ErrorStatus  | setFormat (const ACHAR *pszFormat, const ACHAR *pszCellStyle)
 virtual Acad::ErrorStatus  | setGridColor (const AcCmColor color, int gridLineTypes=AcDb::kAllGridLines, int rowTypes=AcDb::kAllRows)
 Acad::ErrorStatus  | setGridColor (const AcCmColor color, AcDb::GridLineType gridLineTypes, const ACHAR *pszCellStyle)
 Acad::ErrorStatus  | setGridDoubleLineSpacing (double fSpacing, AcDb::GridLineType gridLineTypes, const ACHAR *pszCellStyle)
 Acad::ErrorStatus  | setGridLineStyle (AcDb::GridLineStyle nLineStyle, AcDb::GridLineType gridLineTypes, const ACHAR *pszCellStyle)
 Acad::ErrorStatus  | setGridLinetype (const AcDbObjectId &id, AcDb::GridLineType gridLineTypes, const ACHAR *pszCellStyle)
 virtual Acad::ErrorStatus  | setGridLineWeight (AcDb::LineWeight lineWeight, int gridLineTypes=AcDb::kAllGridLines, int rowTypes=AcDb::kAllRows)
 Acad::ErrorStatus  | setGridLineWeight (AcDb::LineWeight lineWeight, AcDb::GridLineType gridLineTypes, const ACHAR *pszCellStyle)
 Acad::ErrorStatus  | setGridProperty (const AcGridProperty &gridProp, AcDb::GridLineType nGridLineTypes, const ACHAR *pszCellStyle)
 virtual Acad::ErrorStatus  | setGridVisibility (AcDb::Visibility visible, int gridLineTypes=AcDb::kAllGridLines, int rowTypes=AcDb::kAllRows)
 Acad::ErrorStatus  | setGridVisibility (AcDb::Visibility visible, AcDb::GridLineType gridLineTypes, const ACHAR *pszCellStyle)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setHorzCellMargin (double dCellMargin)
 Acad::ErrorStatus  | setMargin (AcDb::CellMargin nMargins, double fMargin, const ACHAR *pszCellStyle)
 virtual Acad::ErrorStatus  | setName (const ACHAR *pszName)
 Acad::ErrorStatus  | setRotation (double fRotation, const ACHAR *pszCellStyle)
 Acad::ErrorStatus  | setTemplate (const AcDbObjectId &templateId, AcDb::MergeCellStyleOption nOption)
 Acad::ErrorStatus  | setTemplate (AcDbTableTemplate *pTemplate, AcDb::MergeCellStyleOption nOption, AcDbObjectId &templateId)
 virtual Acad::ErrorStatus  | setTextHeight (double dHeight, int rowTypes=AcDb::kAllRows)
 Acad::ErrorStatus  | setTextHeight (double dHeight, const ACHAR *pszCellStyle)
 virtual Acad::ErrorStatus  | setTextStyle (const AcDbObjectId id, int rowTypes=AcDb::kAllRows)
 Acad::ErrorStatus  | setTextStyle (const AcDbObjectId &id, const ACHAR *pszCellStyle)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setVertCellMargin (double dCellMargin)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | suppressHeaderRow (bool bValue)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | suppressTitleRow (bool bValue)
 virtual double  | textHeight (AcDb::RowType rowType=AcDb::kDataRow) const
 double  | textHeight (const ACHAR *pszCellStyle) const
 virtual AcDbObjectId  | textStyle (AcDb::RowType rowType=AcDb::kDataRow) const
 AcDbObjectId  | textStyle (const ACHAR *pszCellStyle) const
 virtual ADESK_DEPRECATED double  | vertCellMargin (void) const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual AcGsNode *  | gsNode () const
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 virtual void  | setGsNode (AcGsNode *pNode)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual void  | viewportDraw (AcGiViewportDraw *pVd)
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependantGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Member Function Documentation
 int AcDbTableStyle::getCellStyles  |  ( |  AcStringArray &  |  cellstyles | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbTableStyle::getTemplate  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbTableStyle::getTemplate  |  ( |  AcDbTableTemplate *&  |  pTemplate,
|  AcDb::OpenMode  |  mode
)
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbTablestyle.h