Public Types | Public Member Functions | List of all members
AcDbInterferencePE Class Reference
AcDb Classes
  Inheritance diagram for AcDbInterferencePE:
 Public Types
enum  | Flags { kDefault = 0x00 }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbInterferencePE)
 virtual Acad::ErrorStatus  | createInterferenceObjects (AcArray< AcDbEntity * > &interferenceObjects, AcDbEntity *pEnt1, AcDbEntity *pEnt2, unsigned int flags) const =0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbInterferencePE.h