Public Member Functions | List of all members
AcDbEntityHyperlinkPE Class Reference
AcDb Classes
  Inheritance diagram for AcDbEntityHyperlinkPE:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbEntityHyperlinkPE)
 virtual Acad::ErrorStatus  | getHyperlinkCollection (AcDbObject *pObj, AcDbHyperlinkCollection *&pcHCL, bool bOneOnly=false, bool bIgnoreBlockDefinition=true)=0
 virtual Acad::ErrorStatus  | getHyperlinkCollection (const AcArray< AcDbObjectId > *&idContainers, AcDbHyperlinkCollection *&pcHCL, bool bOneOnly=false, bool bIgnoreBlockDefinition=true)=0
 virtual Acad::ErrorStatus  | getHyperlinkCount (AcDbObject *pObj, UINT &nCount, bool bIgnoreBlockDefinition=true)=0
 virtual Acad::ErrorStatus  | getHyperlinkCount (const AcArray< AcDbObjectId > *&idContainers, UINT &nCount, bool bIgnoreBlockDefinition=true)=0
 virtual Acad::ErrorStatus  | hasHyperlink (AcDbObject *pObj, bool &bHasHyperlink, bool bIgnoreBlockDefinition=true)=0
 virtual Acad::ErrorStatus  | hasHyperlink (const AcArray< AcDbObjectId > *&idContainers, bool &bHasHyperlink, bool bIgnoreBlockDefinition=true)=0
 virtual Acad::ErrorStatus  | setHyperlinkCollection (AcDbObject *pObj, AcDbHyperlinkCollection *pcHCL)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
achapi.h