Public Types | Public Member Functions | List of all members
AcDbViewport Class Reference
AcDb Classes
  Inheritance diagram for AcDbViewport:
 Public Types
enum  | ShadePlotType {
 kAsDisplayed = 0, kWireframe = 1, kHidden = 2, kRendered = 3,
 kVisualStyle = 4, kRenderPreset = 5
 }
enum  | StandardScaleType {
 kScaleToFit, kCustomScale, k1_1, k1_2,
 k1_4, k1_5, k1_8, k1_10,
 k1_16, k1_20, k1_30, k1_40,
 k1_50, k1_100, k2_1, k4_1,
 k8_1, k10_1, k100_1, k1_128in_1ft,
 k1_64in_1ft, k1_32in_1ft, k1_16in_1ft, k3_32in_1ft,
 k1_8in_1ft, k3_16in_1ft, k1_4in_1ft, k3_8in_1ft,
 k1_2in_1ft, k3_4in_1ft, k1in_1ft, k1and1_2in_1ft,
 k3in_1ft, k6in_1ft, k1ft_1ft
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbViewport)
 AcCmColor  | ambientLightColor () const
 AcDbAnnotationScale *  | annotationScale () const
 double  | backClipDistance () const
 AcDbObjectId  | background () const
 double  | brightness () const
 AcGePoint3d  | centerPoint () const
 Adesk::UInt16  | circleSides () const
 double  | contrast () const
 virtual void  | copied (const AcDbObject *pDbObj, const AcDbObject *pNewObj)
 double  | customScale () const
 AcGiViewportTraits::DefaultLightingType  | defaultLightingType () const
 Acad::ErrorStatus  | effectivePlotStyleSheet (const ACHAR *&)
 double  | elevation () const
 virtual void  | erased (const AcDbObject *, Adesk::Boolean)
 Acad::ErrorStatus  | freezeLayersInViewport (const AcDbObjectIdArray &)
 double  | frontClipDistance () const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 Acad::ErrorStatus  | getFrozenLayerList (AcDbObjectIdArray &ids) const
 Acad::ErrorStatus  | getLabelBlock (AcDbObjectId &objId) const
 Acad::ErrorStatus  | getModelView (AcDbXrefObjectId &xrefObjId) const
 Acad::ErrorStatus  | getSheetView (AcDbObjectId &objId) const
 Acad::ErrorStatus  | getUcs (AcGePoint3d &origin, AcGeVector3d &xAxis, AcGeVector3d &yAxis) const
 AcGeVector2d  | gridIncrement () const
 Adesk::UInt16  | gridMajor () const
 double  | height () const
 bool  | hiddenLinesRemoved () const
 bool  | isBackClipOn () const
 bool  | isDefaultLightingOn () const
 bool  | isFastZoomOn () const
 bool  | isFrontClipAtEyeOn () const
 bool  | isFrontClipOn () const
 bool  | isGridAdaptive () const
 bool  | isGridBoundToLimits () const
 bool  | isGridFollow () const
 bool  | isGridOn () const
 bool  | isGridSubdivisionRestricted () const
 bool  | isLayerFrozenInViewport (const AcDbObjectId &layerId) const
 bool  | isLocked () const
 bool  | isNonRectClipOn () const
 bool  | isOn () const
 bool  | isPerspectiveOn () const
 bool  | isSnapIsometric () const
 bool  | isSnapOn () const
 bool  | isTransparent () const
 bool  | isUcsFollowModeOn () const
 bool  | isUcsIconAtOrigin () const
 bool  | isUcsIconVisible () const
 bool  | isUcsOrthographic (AcDb::OrthographicView &view) const
 bool  | isUcsSavedWithViewport () const
 bool  | isViewOrthographic (AcDb::OrthographicView &view) const
 double  | lensLength () const
 virtual void  | modified (const AcDbObject *)
 AcDbObjectId  | nonRectClipEntityId () const
 Adesk::Int16  | number () const
 bool  | plotAsRaster () const
 Acad::ErrorStatus  | plotStyleSheet (ACHAR *&) const
 Acad::ErrorStatus  | plotStyleSheet (const ACHAR *&) const
 bool  | plotWireframe () const
 AcDbObjectId  | previousBackground (AcGiDrawable::DrawableType type=AcGiDrawable::kGeometry) const
 Acad::ErrorStatus  | removeHiddenLines ()
 Acad::ErrorStatus  | removeLabelBlock (void)
 Acad::ErrorStatus  | removeModelView (void)
 Acad::ErrorStatus  | removeSheetView (void)
 AcDbAbstractViewTableRecord::RenderMode  | renderMode () const
 Acad::ErrorStatus  | setAmbientLightColor (const AcCmColor &clr)
 Acad::ErrorStatus  | setAnnotationScale (const AcDbAnnotationScale *pScaleObj)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *)
 Acad::ErrorStatus  | setBackClipDistance (double newVal)
 Acad::ErrorStatus  | setBackClipOff ()
 Acad::ErrorStatus  | setBackClipOn ()
 Acad::ErrorStatus  | setBackground (AcDbObjectId backgroundId)
 Acad::ErrorStatus  | setBrightness (double)
 Acad::ErrorStatus  | setCenterPoint (const AcGePoint3d &)
 Acad::ErrorStatus  | setCircleSides (Adesk::UInt16)
 Acad::ErrorStatus  | setContrast (double)
 Acad::ErrorStatus  | setCustomScale (double)
 Acad::ErrorStatus  | setDefaultLightingOn (bool on)
 Acad::ErrorStatus  | setDefaultLightingType (AcGiViewportTraits::DefaultLightingType typ)
 Acad::ErrorStatus  | setElevation (double elev)
 Acad::ErrorStatus  | setFastZoomOff ()
 Acad::ErrorStatus  | setFastZoomOn ()
 Acad::ErrorStatus  | setFrontClipAtEyeOff ()
 Acad::ErrorStatus  | setFrontClipAtEyeOn ()
 Acad::ErrorStatus  | setFrontClipDistance (double newVal)
 Acad::ErrorStatus  | setFrontClipOff ()
 Acad::ErrorStatus  | setFrontClipOn ()
 Acad::ErrorStatus  | setGridAdaptive (bool bNewVal)
 Acad::ErrorStatus  | setGridBoundToLimits (bool bNewVal)
 Acad::ErrorStatus  | setGridFollow (bool bNewVal)
 Acad::ErrorStatus  | setGridIncrement (const AcGeVector2d &)
 Acad::ErrorStatus  | setGridMajor (Adesk::UInt16)
 Acad::ErrorStatus  | setGridOff ()
 Acad::ErrorStatus  | setGridOn ()
 Acad::ErrorStatus  | setGridSubdivisionRestricted (bool bNewVal)
 Acad::ErrorStatus  | setHeight (double)
 Acad::ErrorStatus  | setLabelBlock (AcDbObjectId objId)
 Acad::ErrorStatus  | setLensLength (double)
 Acad::ErrorStatus  | setLocked ()
 Acad::ErrorStatus  | setModelView (const AcDbXrefObjectId &xrefObjId)
 Acad::ErrorStatus  | setNonRectClipEntityId (AcDbObjectId)
 Acad::ErrorStatus  | setNonRectClipOff ()
 Acad::ErrorStatus  | setNonRectClipOn ()
 Acad::ErrorStatus  | setOff ()
 Acad::ErrorStatus  | setOn ()
 Acad::ErrorStatus  | setOpaque ()
 Acad::ErrorStatus  | setPerspectiveOff ()
 Acad::ErrorStatus  | setPerspectiveOn ()
 Acad::ErrorStatus  | setPlotStyleSheet (const ACHAR *)
 Acad::ErrorStatus  | setPreviousBackground (AcDbObjectId backgroundId, AcGiDrawable::DrawableType type=AcGiDrawable::kGeometry)
 void  | setRenderMode (AcDbAbstractViewTableRecord::RenderMode mode)
 Acad::ErrorStatus  | setShadePlot (const ShadePlotType)
 Acad::ErrorStatus  | setShadePlot (const ShadePlotType type, const AcDbObjectId shadePlotId)
 Acad::ErrorStatus  | setSheetView (AcDbObjectId objId)
 Acad::ErrorStatus  | setSnapAngle (double)
 Acad::ErrorStatus  | setSnapBasePoint (const AcGePoint2d &)
 Acad::ErrorStatus  | setSnapIncrement (const AcGeVector2d &)
 Acad::ErrorStatus  | setSnapIsometric ()
 Acad::ErrorStatus  | setSnapIsoPair (Adesk::UInt16)
 Acad::ErrorStatus  | setSnapOff ()
 Acad::ErrorStatus  | setSnapOn ()
 Acad::ErrorStatus  | setSnapStandard ()
 Acad::ErrorStatus  | setStandardScale (const StandardScaleType)
 Acad::ErrorStatus  | setSun (AcDbObjectId &retId, AcDbObject *pSun)
 Acad::ErrorStatus  | setToneOperatorParameters (const AcGiToneOperatorParameters &params)
 Acad::ErrorStatus  | setTransparent ()
 Acad::ErrorStatus  | setTwistAngle (double)
 Acad::ErrorStatus  | setUcs (const AcGePoint3d &origin, const AcGeVector3d &xAxis, const AcGeVector3d &yAxis)
 Acad::ErrorStatus  | setUcs (AcDb::OrthographicView view)
 Acad::ErrorStatus  | setUcs (const AcDbObjectId &ucsId)
 Acad::ErrorStatus  | setUcsFollowModeOff ()
 Acad::ErrorStatus  | setUcsFollowModeOn ()
 Acad::ErrorStatus  | setUcsIconAtCorner ()
 Acad::ErrorStatus  | setUcsIconAtOrigin ()
 Acad::ErrorStatus  | setUcsIconInvisible ()
 Acad::ErrorStatus  | setUcsIconVisible ()
 void  | setUcsPerViewport (bool ucsvp)
 Acad::ErrorStatus  | setUcsToWorld ()
 Acad::ErrorStatus  | setUnlocked ()
 Acad::ErrorStatus  | setViewCenter (const AcGePoint2d &pt)
 Acad::ErrorStatus  | setViewDirection (const AcGeVector3d &)
 Acad::ErrorStatus  | setViewDirection (AcDb::OrthographicView view)
 Acad::ErrorStatus  | setViewHeight (double ht)
 Acad::ErrorStatus  | setViewTarget (const AcGePoint3d &)
 Acad::ErrorStatus  | setVisualStyle (const AcDbObjectId oidVisualStyle)
 Acad::ErrorStatus  | setWidth (double)
 ShadePlotType  | shadePlot () const
 AcDbObjectId  | shadePlotId () const
 Acad::ErrorStatus  | showHiddenLines ()
 double  | snapAngle () const
 AcGePoint2d  | snapBasePoint () const
 AcGeVector2d  | snapIncrement () const
 Adesk::UInt16  | snapIsoPair () const
 StandardScaleType  | standardScale () const
 virtual void  | subObjModified (const AcDbObject *pDbObj, const AcDbObject *pSubObj)
 AcDbObjectId  | sunId () const
 Acad::ErrorStatus  | syncModelView (void)
 Acad::ErrorStatus  | thawAllLayersInViewport ()
 Acad::ErrorStatus  | thawLayersInViewport (const AcDbObjectIdArray &)
 Acad::ErrorStatus  | toneOperatorParameters (AcGiToneOperatorParameters &params) const
 double  | twistAngle () const
 AcDbObjectId  | ucsName () const
 Acad::ErrorStatus  | updateDisplay () const
 AcGePoint2d  | viewCenter () const
 AcGeVector3d  | viewDirection () const
 double  | viewHeight () const
 AcGePoint3d  | viewTarget () const
 AcDbObjectId  | visualStyle () const
 double  | width () const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual bool  | castShadows () const
 virtual Adesk::Boolean  | cloneMeForDragging ()
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual void  | dragStatus (const AcDb::DragStat status)
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable ()
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 AcCmEntityColor  | entityColor () const
 virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const
 virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual void  | getEcs (AcGeMatrix3d &retVal) const
 virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeFastTransform &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const
 virtual void  | gripStatus (const AcDb::GripStat status)
 virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const
 virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Adesk::Boolean  | isPlanar () const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 virtual void  | list () const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 ACHAR *  | plotStyleName () const
 virtual bool  | receiveShadows () const
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st)
 virtual void  | setCastShadows (bool newVal)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual void  | setGsNode (AcGsNode *pNode)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual void  | setReceiveShadows (bool newVal)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &id) const
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | transformBy (const AcGeFastTransform &xform)
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 AcCmTransparency  | transparency () const
 virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual void  | viewportDraw (AcGiViewportDraw *mode)
 AcDb::Visibility  | visibility () const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 The documentation for this class was generated from the following file:
dbents.h