Public Member Functions | Public Attributes | Static Public Attributes | Friends | List of all members
AcGeScale3d Class Reference
AcGe Classes
 Public Member Functions
AcGeScale3d (const AcGeScale3d &src)
AcGeScale3d (double factor)
AcGeScale3d (double xFact, double yFact, double zFact)
 AcGeScale3d &  | extractScale (const AcGeMatrix3d &mat)
 void  | getMatrix (AcGeMatrix3d &mat) const
 AcGeScale3d  | inverse () const
 AcGeScale3d &  | invert ()
 bool  | isEqualTo (const AcGeScale3d &scaleVec, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isProportional (const AcGeTol &tol=AcGeContext::gTol) const
operator AcGeMatrix3d () const
 bool  | operator!= (const AcGeScale3d &sclVec) const
 AcGeScale3d  | operator* (const AcGeScale3d &sclVec) const
 AcGeScale3d  | operator* (double s) const
 AcGeScale3d &  | operator*= (const AcGeScale3d &scl)
 AcGeScale3d &  | operator*= (double s)
 bool  | operator== (const AcGeScale3d &sclVec) const
 double  | operator[] (unsigned int i) const
 double &  | operator[] (unsigned int i)
 AcGeScale3d &  | postMultBy (const AcGeScale3d &rightSide)
 AcGeScale3d &  | preMultBy (const AcGeScale3d &leftSide)
 AcGeScale3d &  | removeScale (AcGeMatrix3d &mat)
 AcGeScale3d &  | set (double sc0, double sc1, double sc2)
 AcGeScale3d &  | setToProduct (const AcGeScale3d &sclVec1, const AcGeScale3d &sclVec2)
 AcGeScale3d &  | setToProduct (const AcGeScale3d &sclVec, double s)
 Public Attributes
 double  | sx
 double  | sy
 double  | sz
 Static Public Attributes
 static const AcGeScale3d  | kIdentity
 Friends
 GE_DLLEXPIMPORT AcGeScale3d  | operator* (double, const AcGeScale3d &scl)
 The documentation for this class was generated from the following file:
gescl3d.h