Public Member Functions | List of all members
Ac3dDwfNavTreeNode Class Reference
  Inheritance diagram for Ac3dDwfNavTreeNode:
 Public Member Functions
 virtual bool  | addChild (const Ac3dDwfNavTreeNode *node)=0
 virtual const AcArray< const
 Ac3dDwfNavTreeNode * > &  | children () const =0
 virtual const AcString &  | displayName () const =0
 virtual bool  | isBlock () const =0
 virtual bool  | isGroup () const =0
 virtual const AcArray< long > &  | keys () const =0
 virtual int  | nDescendants () const =0
 virtual bool  | removeChild (const Ac3dDwfNavTreeNode *node)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
Ac3dDwfNavTree.h