Public Member Functions | List of all members
AcDbSubentId Class Reference
AcDb Classes
 Public Member Functions
AcDbSubentId (AcDb::SubentType type, Adesk::GsMarker index)
AcDbSubentId (AcRxClass *pTypeClass, Adesk::GsMarker index)
 Adesk::GsMarker  | index () const
 bool  | operator!= (const AcDbSubentId &id) const
 bool  | operator== (const AcDbSubentId &id) const
 void  | setIndex (Adesk::GsMarker)
 void  | setType (AcDb::SubentType)
 void  | setTypeClass (AcRxClass *pClass)
 AcDb::SubentType  | type () const
 AcRxClass *  | typeClass () const
 The documentation for this class was generated from the following file:
dbsubeid.h