Public Member Functions | List of all members
AcApProfileManagerReactor Class Reference
AcAp Classes
 Public Member Functions
 virtual void  | currentProfileChanged (const ACHAR *newProfile)
 virtual void  | currentProfileReset (const ACHAR *currentProfile)
 virtual void  | currentProfileSaved (const ACHAR *currentProfile)
 virtual void  | currentProfileWillBeReset (const ACHAR *currentProfile)
 virtual void  | currentProfileWillBeSaved (const ACHAR *currentProfile)
 virtual void  | currentProfileWillChange (const ACHAR *newProfile)
 virtual void  | profileReset (const ACHAR *profileName)
 virtual void  | profileSaved (const ACHAR *profileName)
 virtual void  | profileWillBeSaved (const ACHAR *profileName)
 virtual void  | profileWillReset (const ACHAR *profileName)
 The documentation for this class was generated from the following file:
acprofile.h