Public Member Functions | Public Attributes | Static Public Attributes | Friends | List of all members
AcGePoint2d Class Reference
AcGe Classes
  Inheritance diagram for AcGePoint2d:
 Public Member Functions
AcGePoint2d (const AcGePoint2d &pnt)
AcGePoint2d (double x, double y)
 AcGeVector2d  | asVector () const
 double  | distanceTo (const AcGePoint2d &pnt) const
 bool  | isEqualTo (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint2d &  | mirror (const AcGeLine2d &line)
 bool  | operator!= (const AcGePoint2d &pnt) const
 AcGePoint2d  | operator* (double) const
 AcGePoint2d &  | operator*= (double scl)
 AcGePoint2d  | operator+ (const AcGeVector2d &vec) const
 AcGePoint2d &  | operator+= (const AcGeVector2d &vec)
 AcGePoint2d  | operator- (const AcGeVector2d &vec) const
 AcGeVector2d  | operator- (const AcGePoint2d &pnt) const
 AcGePoint2d &  | operator-= (const AcGeVector2d &vec)
 AcGePoint2d  | operator/ (double scl) const
 AcGePoint2d &  | operator/= (double scl)
 bool  | operator== (const AcGePoint2d &pnt) const
 double  | operator[] (unsigned int i) const
 double &  | operator[] (unsigned int idx)
 AcGePoint2d &  | rotateBy (double angle, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGePoint2d &  | scaleBy (double scaleFactor, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGePoint2d &  | set (double x, double y)
 AcGePoint2d &  | setToProduct (const AcGeMatrix2d &mat, const AcGePoint2d &pnt)
 AcGePoint2d &  | setToSum (const AcGePoint2d &pnt, const AcGeVector2d &vec)
 AcGePoint2d &  | transformBy (const AcGeMatrix2d &leftSide)
 Public Attributes
 double  | x
 double  | y
 Static Public Attributes
 static const AcGePoint2d  | kOrigin
 Friends
 GE_DLLEXPIMPORT AcGePoint2d  | operator* (const AcGeMatrix2d &mat, const AcGePoint2d &pnt)
 AcGePoint2d  | operator* (double, const AcGePoint2d &scl)
 The documentation for this class was generated from the following file:
gepnt2d.h