Public Member Functions | List of all members
AcEdAppGripService Class Reference
AcEd Classes
 Public Member Functions
 virtual Acad::ErrorStatus  | appGetGripPoints (const AcDbEntity *pEnt, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags)
 virtual Acad::ErrorStatus  | appGetGripPoints (const AcDbEntity *pEnt, AcGePoint3dArray &pnts, AcDbIntArray &osmodes, AcDbIntArray &ids)
 virtual Acad::ErrorStatus  | appGripStatus (const AcDbEntity *pEnt, const AcDb::GripStat status)
 virtual Acad::ErrorStatus  | appMoveGripPointsAt (AcDbEntity *pEnt, const AcDbIntArray &pIndices, const AcGeVector3d &pOffset)
 virtual Acad::ErrorStatus  | appMoveGripPointsAt (AcDbEntity *pEnt, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbEntity *pEnt, const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags)
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (AcDbEntity *pEnt, const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 The documentation for this class was generated from the following file:
acedinpt.h