Public Member Functions | Static Public Member Functions | List of all members
AcGiTextEngine Class Reference
AcGi Classes
 Public Member Functions
 virtual void  | getExtents (AcGiTextStyle &ts, ACHAR const *pStr, int nLength, bool bPenUp, bool bRaw, AcGePoint2d &extents)=0
 virtual void  | tessellate (AcGiTextStyle &ts, ACHAR const *pStr, int nLength, bool bRaw, double deviation, void *pVoid, PolylineCallback pPolylineCallback)=0
 virtual void  | tessellate (AcGiTextStyle &ts, ACHAR const *pString, int nLength, bool bRaw, void *pVoid, UnicodeCallback pUnicodeCallback, PolylineCallback pPolylineCallback)=0
 Static Public Member Functions
 static AcGiTextEngine *  | create ()
 The documentation for this class was generated from the following file:
textengine.h