Public Member Functions | List of all members
AcDbPaperOrientationPE Class Reference
AcDb Classes
  Inheritance diagram for AcDbPaperOrientationPE:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbPaperOrientationPE)
 virtual Acad::ErrorStatus  | applyPaperOrientationTransform (AcDbObject *pObject, const AcDbViewport *pVport) const
 virtual bool  | paperOrientation (AcDbObject *pObject) const =0
 virtual Acad::ErrorStatus  | setPaperOrientation (AcDbObject *pObject, const bool bPaperOrientation)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbAnnotativeObjectPE.h