Public Types | Public Member Functions | Protected Member Functions | Friends | List of all members
AcPlPlotConfig Class Reference
AcPl Classes
  Inheritance diagram for AcPlPlotConfig:
 Public Types
enum  | PlotToFileCapability { kNoPlotToFile = 0, kPlotToFileAllowed = 1, kMustPlotToFile = 2 }
 Public Member Functions
 virtual ACPL_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 virtual ACPL_PORT const ACHAR *  | deviceName () const
 virtual ACPL_PORT unsigned long  | deviceType () const
 virtual ACPL_PORT const ACHAR *  | fullPath () const
 virtual ACPL_PORT void  | getCanonicalMediaNameList (AcArray< ACHAR * > &mediaList) const
 virtual ACPL_PORT Acad::ErrorStatus  | getDefaultFileExtension (const ACHAR *&pDefaultExtension) const
 virtual ACPL_PORT void  | getDescriptionFields (ACHAR *&pDriverName, ACHAR *&pLocationName, ACHAR *&pComment, ACHAR *&pPortName, ACHAR *&pServerName, ACHAR *&pTagLine) const
 virtual ACPL_PORT void  | getLocalMediaName (const ACHAR *pCanonicalMediaName, ACHAR *&pLocalMediaName) const
 virtual ACPL_PORT void  | getMediaBounds (const ACHAR *pCanonicalMediaName, AcGePoint2d &pageSize, AcGeBoundBlock2d &printableArea) const
 virtual ACPL_PORT unsigned long  | isCustomPossible (double width, double height, bool bIsDimensional, bool bIsSheet, int dpi, const ACHAR *pPC3Dir) const
 virtual ACPL_PORT bool  | isPlotToFile () const
 virtual ACPL_PORT Acad::ErrorStatus  | makeCustomMediaFromSizeDesc (HT_Media_Size *pSize, HT_Media_Description *pDesc, bool bSameDriver, bool bSavePC3, const ACHAR *pSourceEntry, const ACHAR *pSourceName, ACHAR *&pCanonicalSizeName, ACHAR *&pLocalizedSizeName, ACHAR *&pPMPPath, ACHAR *&pPC3Path, int dpi, double &scaleFactor)
 virtual ACPL_PORT bool  | matchMediaSize (double page_x, double page_y, double printable_w, double printable_h, AcDbLayout::PlotPaperUnits units, bool bIsSheet, int dpi, const ACHAR *pTargetCanonicalName, ACHAR *&pNearestSizeName, ACHAR *&pLocalizedName, double &scaleFactor)
 virtual ACPL_PORT unsigned int  | maxDeviceDPI () const
 virtual ACPL_PORT HT_Plot_Config *  | plotConfig () const
 virtual ACPL_PORT
 PlotToFileCapability  | plotToFileCapability () const
 virtual ACPL_PORT void  | refreshMediaNameList ()
 virtual ACPL_PORT bool  | saveToPC3 (const ACHAR *pPC3Name)
 virtual ACPL_PORT Acad::ErrorStatus  | setPlotToFile (bool bPlotToFile)
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
AcPlPlotConfig (HT_Plot_Config *pConfig, const ACHAR *pDevName, const ACHAR *pFullPath, unsigned long nDevType)
AcPlPlotConfig (const AcPlPlotConfig *pOther)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 Friends
 class  | AcPlPlotConfigManagerImp
 class  | AcPlPlotInfoImp
 class  | AcPlPlotInfoValidatorImp
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 The documentation for this class was generated from the following file:
acplplotconfig.h