Public Member Functions | Friends | List of all members
AcGiImageFileTexture Class Reference
AcGi Classes
  Inheritance diagram for AcGiImageFileTexture:
 Public Member Functions
AcGiImageFileTexture (void)
AcGiImageFileTexture (const AcGiImageFileTexture &texture)
ACRX_DECLARE_MEMBERS (AcGiImageFileTexture)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
AcGiImageFileTexture &  | operator= (const AcGiImageFileTexture &texture)
virtual bool  | operator== (const AcGiMaterialTexture &texture) const
virtual void  | setSourceFileName (const ACHAR *fileName)
virtual const ACHAR *  | sourceFileName (void) const
virtual  | ~AcGiImageFileTexture (void)
 Public Member Functions inherited from AcGiImageTexture
ACRX_DECLARE_MEMBERS (AcGiImageTexture)
 Public Member Functions inherited from AcGiMaterialTexture
ACRX_DECLARE_MEMBERS (AcGiMaterialTexture)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcGiImpImageFileTexture
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiImageFileTexture::AcGiImageFileTexture  |  ( |  void  |   | )
Warning
Not implemented!
 virtual AcGiImageFileTexture::~AcGiImageFileTexture  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 AcGiImageFileTexture::AcGiImageFileTexture  |  ( |  const AcGiImageFileTexture &  |  texture | )
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcGiImageFileTexture::copyFrom  |  ( |  const AcRxObject *  |  other | )
virtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 AcGiImageFileTexture& AcGiImageFileTexture::operator=  |  ( |  const AcGiImageFileTexture &  |  texture | )
Warning
Not implemented!
 virtual bool AcGiImageFileTexture::operator==  |  ( |  const AcGiMaterialTexture &  |  texture | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcGiMaterialTexture.
 virtual void AcGiImageFileTexture::setSourceFileName  |  ( |  const ACHAR *  |  fileName | )
virtual
Warning
Not implemented!
 virtual const ACHAR* AcGiImageFileTexture::sourceFileName  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acgimaterial.h