Public Member Functions | List of all members
AcDbLayoutManager Class Reference
AcDb Classes
  Inheritance diagram for AcDbLayoutManager:
 Public Member Functions
 virtual void  | addReactor (AcDbLayoutManagerReactor *newObj)=0
 virtual Acad::ErrorStatus  | cloneLayout (AcDbLayout *pLBTR, const ACHAR *newname, int newTabOrder=0)=0
 virtual Acad::ErrorStatus  | copyLayout (const ACHAR *copyname, const ACHAR *newname)=0
 virtual int  | countLayouts (AcDbDatabase *useDb=NULL)=0
 virtual Acad::ErrorStatus  | createLayout (const ACHAR *newname, AcDbObjectId &layoutId, AcDbObjectId &blockTableRecId, AcDbDatabase *pDatabase=NULL)=0
 virtual Acad::ErrorStatus  | deleteLayout (const ACHAR *delname)=0
 virtual const ACHAR *  | findActiveLayout (bool allowModel)=0
 virtual AcDbLayout *  | findLayoutNamed (const ACHAR *name, bool leaveRecordOpen=false)=0
 virtual AcDbObjectId  | getActiveLayoutBTRId ()=0
 virtual AcDbObjectId  | getNonRectVPIdFromClipId (AcDbObjectId clipId)=0
 virtual bool  | isVpnumClipped (int index)=0
 virtual void  | removeReactor (AcDbLayoutManagerReactor *delObj)=0
 virtual Acad::ErrorStatus  | renameLayout (const ACHAR *oldname, const ACHAR *newname)=0
 virtual Acad::ErrorStatus  | setCurrentLayout (const ACHAR *newname)=0
 virtual Acad::ErrorStatus  | setCurrentLayoutId (AcDbObjectId layoutId)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
AcDbLMgr.h