Public Types | Public Member Functions | List of all members
AcPlPlotErrorHandlerLock Class Reference
AcPl Classes
  Inheritance diagram for AcPlPlotErrorHandlerLock:
 Public Types
enum  | LockStatus { kLocked, kUnLocked }
 Public Member Functions
 ACPL_PORT  | AcPlPlotErrorHandlerLock (AcPlPlotErrorHandler *pAppErrHandler, const ACHAR *pAppName)
 ACPL_PORT const ACHAR *  | appName () const
 ACPL_PORT void  | getErrorHandler (AcPlPlotErrorHandler *&pAppErrHandler) const
 ACPL_PORT bool  | lock (AcPlPlotErrorHandler *pAppErrHandler, const ACHAR *pAppName)
 ACPL_PORT LockStatus  | status () const
 ACPL_PORT bool  | unLock (AcPlPlotErrorHandler *pAppErrHandler)
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 The documentation for this class was generated from the following file:
acplploterrorhandlerlock.h