Public Member Functions | List of all members
AcDbLongTransWorkSetIterator Class Reference
AcDb Classes
  Inheritance diagram for AcDbLongTransWorkSetIterator:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbLongTransWorkSetIterator)
 virtual bool  | curObjectIsErased () const =0
 virtual bool  | curObjectIsPrimary () const =0
 virtual bool  | curObjectIsRemoved () const =0
 virtual bool  | done ()=0
 virtual AcDbObjectId  | objectId () const =0
 virtual void  | start (bool incRemovedObjs=false, bool incSecondaryObjs=false)=0
 virtual void  | step ()=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbltrans.h