Public Member Functions | List of all members
AcApDocumentIterator Class Reference
AcAp Classes
  Inheritance diagram for AcApDocumentIterator:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcApDocumentIterator)
 virtual AcApDocument *  | document ()=0
 virtual bool  | done () const =0
 virtual void  | step ()=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acdocman.h