Public Types | Public Member Functions | Protected Member Functions | List of all members
AcDbTable Class Reference
AcDb Classes
  Inheritance diagram for AcDbTable:
 Public Types
enum  | TableStyleOverrides {
 kTitleSuppressed = 1, kHeaderSuppressed = 2, kFlowDirection = 3, kHorzCellMargin = 4,
 kVertCellMargin = 5, kTitleRowColor = 6, kHeaderRowColor = 7, kDataRowColor = 8,
 kTitleRowFillNone = 9, kHeaderRowFillNone = 10, kDataRowFillNone = 11, kTitleRowFillColor = 12,
 kHeaderRowFillColor = 13, kDataRowFillColor = 14, kTitleRowAlignment = 15, kHeaderRowAlignment = 16,
 kDataRowAlignment = 17, kTitleRowTextStyle = 18, kHeaderRowTextStyle = 19, kDataRowTextStyle = 20,
 kTitleRowTextHeight = 21, kHeaderRowTextHeight = 22, kDataRowTextHeight = 23, kTitleRowDataType = 24,
 kHeaderRowDataType = 25, kDataRowDataType = 26, kTitleHorzTopColor = 40, kTitleHorzInsideColor = 41,
 kTitleHorzBottomColor = 42, kTitleVertLeftColor = 43, kTitleVertInsideColor = 44, kTitleVertRightColor = 45,
 kHeaderHorzTopColor = 46, kHeaderHorzInsideColor = 47, kHeaderHorzBottomColor = 48, kHeaderVertLeftColor = 49,
 kHeaderVertInsideColor = 50, kHeaderVertRightColor = 51, kDataHorzTopColor = 52, kDataHorzInsideColor = 53,
 kDataHorzBottomColor = 54, kDataVertLeftColor = 55, kDataVertInsideColor = 56, kDataVertRightColor = 57,
 kTitleHorzTopLineWeight = 70, kTitleHorzInsideLineWeight = 71, kTitleHorzBottomLineWeight = 72, kTitleVertLeftLineWeight = 73,
 kTitleVertInsideLineWeight = 74, kTitleVertRightLineWeight = 75, kHeaderHorzTopLineWeight = 76, kHeaderHorzInsideLineWeight = 77,
 kHeaderHorzBottomLineWeight = 78, kHeaderVertLeftLineWeight = 79, kHeaderVertInsideLineWeight = 80, kHeaderVertRightLineWeight = 81,
 kDataHorzTopLineWeight = 82, kDataHorzInsideLineWeight = 83, kDataHorzBottomLineWeight = 84, kDataVertLeftLineWeight = 85,
 kDataVertInsideLineWeight = 86, kDataVertRightLineWeight = 87, kTitleHorzTopVisibility = 100, kTitleHorzInsideVisibility = 101,
 kTitleHorzBottomVisibility = 102, kTitleVertLeftVisibility = 103, kTitleVertInsideVisibility = 104, kTitleVertRightVisibility = 105,
 kHeaderHorzTopVisibility = 106, kHeaderHorzInsideVisibility = 107, kHeaderHorzBottomVisibility = 108, kHeaderVertLeftVisibility = 109,
 kHeaderVertInsideVisibility = 110, kHeaderVertRightVisibility = 111, kDataHorzTopVisibility = 112, kDataHorzInsideVisibility = 113,
 kDataHorzBottomVisibility = 114, kDataVertLeftVisibility = 115, kDataVertInsideVisibility = 116, kDataVertRightVisibility = 117,
 kCellAlignment = 130, kCellBackgroundFillNone = 131, kCellBackgroundColor = 132, kCellContentColor = 133,
 kCellTextStyle = 134, kCellTextHeight = 135, kCellTopGridColor = 136, kCellRightGridColor = 137,
 kCellBottomGridColor = 138, kCellLeftGridColor = 139, kCellTopGridLineWeight = 140, kCellRightGridLineWeight = 141,
 kCellBottomGridLineWeight = 142, kCellLeftGridLineWeight = 143, kCellTopVisibility = 144, kCellRightVisibility = 145,
 kCellBottomVisibility = 146, kCellLeftVisibility = 147, kCellDataType = 148
 }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbTable)
AcDbTable (const AcDbLinkedTableData *pTable, AcDb::TableCopyOption nCopyOption)
 virtual ADESK_DEPRECATED
 AcDb::CellAlignment  | alignment (AcDb::RowType type=AcDb::kDataRow) const
 virtual AcDb::CellAlignment  | alignment (int row, int col) const
 virtual AcGePoint3d  | attachmentPoint (int row, int col) const
 AcGePoint3d  | attachmentPoint (int row, int col, int content) const
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 virtual ADESK_DEPRECATED AcCmColor  | backgroundColor (AcDb::RowType type=AcDb::kDataRow) const
 virtual AcCmColor  | backgroundColor (int row, int col) const
 virtual ADESK_DEPRECATED double  | blockRotation (int row, int col) const
 virtual ADESK_DEPRECATED double  | blockScale (int row, int col) const
 virtual AcDbObjectId  | blockTableRecordId (int row, int col) const
 AcDbObjectId  | blockTableRecordId (int row, int col, int nContent) const
 AcDb::TableBreakFlowDirection  | breakFlowDirection (void) const
 double  | breakHeight (int nIndex) const
 AcGeVector3d  | breakOffset (int nIndex) const
 AcDb::TableBreakOption  | breakOption (void) const
 double  | breakSpacing (void) const
 bool  | canDelete (int nIndex, int nCount, bool bRow) const
 bool  | canInsert (int nIndex, bool bRow) const
 virtual bool  | castShadows () const
 AcDb::CellState  | cellState (int nRow, int nCol) const
 const ACHAR *  | cellStyle (int nRow, int nCol) const
 virtual bool  | cellStyleOverrides (int row, int col, AcDbIntArray &overrides) const
 virtual AcDb::CellType  | cellType (int row, int col) const
 void  | clearCellOverrides (int row, int column)
 virtual void  | clearSubSelection ()
 virtual ADESK_DEPRECATED void  | clearTableStyleOverrides (int options=0)
 virtual double  | columnWidth (int col) const
 virtual ADESK_DEPRECATED AcCmColor  | contentColor (AcDb::RowType type=AcDb::kDataRow) const
 virtual AcCmColor  | contentColor (int row, int col) const
 AcCmColor  | contentColor (int row, int col, int nContent) const
 AcDb::CellContentLayout  | contentLayout (int row, int col) const
 AcDb::CellContentType  | contentType (int nRow, int nCol) const
 AcDb::CellContentType  | contentType (int nRow, int nCol, int nIndex) const
 Acad::ErrorStatus  | copyFrom (const AcDbLinkedTableData *pSrc, AcDb::TableCopyOption nOption)
 Acad::ErrorStatus  | copyFrom (const AcDbLinkedTableData *pSrc, AcDb::TableCopyOption nOption, const AcCellRange &srcRange, const AcCellRange &targetRange, AcCellRange *pNewTargetRangeOut)
 Acad::ErrorStatus  | copyFrom (const AcDbTable *pSrc, AcDb::TableCopyOption nOption, const AcCellRange &srcRange, const AcCellRange &targetRange, AcCellRange *pNewTargetRangeOut)
 int  | createContent (int nRow, int nCol, int nIndex)
 Acad::ErrorStatus  | createTemplate (AcDbTableTemplate *&pTemplate, AcDb::TableCopyOption nCopyOption)
 AcString  | dataFormat (int row, int col) const
 AcString  | dataFormat (int row, int col, int nContent) const
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | deleteCellContent (int row, int col)
 virtual Acad::ErrorStatus  | deleteColumns (int col, int nCols=1)
 Acad::ErrorStatus  | deleteContent (int nRow, int nCol)
 Acad::ErrorStatus  | deleteContent (int nRow, int nCol, int nIndex)
 Acad::ErrorStatus  | deleteContent (const AcCellRange &range)
 virtual Acad::ErrorStatus  | deleteRows (int row, int nRows=1)
 virtual AcGeVector3d  | direction () const
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
 Acad::ErrorStatus  | enableBreak (bool bEnable)
 Acad::ErrorStatus  | enableMergeAll (int nRow, int nCol, bool bEnable)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const
 virtual AcDbObjectId  | fieldId (int row, int col) const
 AcDbObjectId  | fieldId (int row, int col, int nContent) const
 Acad::ErrorStatus  | fill (const AcCellRange &fillRange, const AcCellRange &srcRange, AcDb::TableFillOption nOption)
 virtual AcDb::FlowDirection  | flowDirection () const
 virtual ADESK_DEPRECATED const
 ACHAR *  | format (AcDb::RowType type)
 const ACHAR *  | format (int row, int col) const
 virtual Acad::ErrorStatus  | generateLayout ()
 virtual Acad::ErrorStatus  | getBlockAttributeValue (int row, int col, const AcDbObjectId &attdefId, ACHAR *&value) const
 Acad::ErrorStatus  | getBlockAttributeValue (int row, int col, int nContent, const AcDbObjectId &attdefId, ACHAR *&value) const
 virtual Acad::ErrorStatus  | getCellExtents (int row, int col, bool isOuterCell, AcGePoint3dArray &pts) const
 virtual Acad::ErrorStatus  | getCellExtents (int row, int col, double &cellWidth, double &cellHeight, bool bAdjustForMargins) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 const ACHAR *  | getColumnName (int nIndex) const
 int  | getCustomData (int nRow, int nCol) const
 Acad::ErrorStatus  | getCustomData (int nRow, int nCol, const ACHAR *pszKey, AcValue *pData) const
 AcDbObjectId  | getDataLink (int nRow, int nCol) const
 Acad::ErrorStatus  | getDataLink (int nRow, int nCol, AcDbDataLink *&pDataLink, AcDb::OpenMode mode) const
 int  | getDataLink (const AcCellRange *pRange, AcDbObjectIdArray &dataLinkIds) const
 AcCellRange  | getDataLinkRange (int nRow, int nCol) const
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | getDataType (AcValue::DataType &nDataType, AcValue::UnitType &nUnitType, AcDb::RowType type) const
 Acad::ErrorStatus  | getDataType (int row, int col, AcValue::DataType &nDataType, AcValue::UnitType &nUnitType) const
 Acad::ErrorStatus  | getDataType (int row, int col, int nContent, AcValue::DataType &nDataType, AcValue::UnitType &nUnitType) const
 AcString  | getFormula (int nRow, int nCol, int nContent) const
 virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const
 Acad::ErrorStatus  | getGridProperty (int nRow, int nCol, AcDb::GridLineType nGridLineType, AcGridProperty &gridProp) const
 virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &, AcDbIntArray &, AcDbIntArray &geomIds) const
 Acad::ErrorStatus  | getIndicatorSize (double &fWidth, double &fHeight) const
 AcDbTableIterator *  | getIterator (void) const
 AcDbTableIterator *  | getIterator (const AcCellRange *pRange, AcDb::TableIteratorOption nOption) const
 AcCellRange  | getMergeRange (int nRow, int nCol) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 AcDb::CellProperty  | getOverride (int nRow, int nCol, int nContent) const
 AcDb::GridProperty  | getOverride (int nRow, int nCol, AcDb::GridLineType nGridLineType) const
 virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const
 virtual Acad::ErrorStatus  | getSubSelection (int &rowMin, int &rowMax, int &colMin, int &colMax) const
 AcCellRange  | getSubSelection (void) const
 AcString  | getToolTip (int nRow, int nCol) const
 virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&ent) const
 virtual ADESK_DEPRECATED AcCmColor  | gridColor (AcDb::GridLineType gridlineType, AcDb::RowType type=AcDb::kDataRow) const
 virtual AcCmColor  | gridColor (int row, int col, AcDb::CellEdgeMask iEdge) const
 AcCmColor  | gridColor (int nRow, int nCol, AcDb::GridLineType nGridLineType) const
 double  | gridDoubleLineSpacing (int nRow, int nCol, AcDb::GridLineType nGridLineType) const
 AcDb::GridLineStyle  | gridLineStyle (int nRow, int nCol, AcDb::GridLineType nGridLineType) const
 AcDbObjectId  | gridLinetype (int nRow, int nCol, AcDb::GridLineType nGridLineType) const
 virtual ADESK_DEPRECATED
 AcDb::LineWeight  | gridLineWeight (AcDb::GridLineType gridlineType, AcDb::RowType type=AcDb::kDataRow) const
 virtual AcDb::LineWeight  | gridLineWeight (int row, int col, AcDb::CellEdgeMask iEdge) const
 AcDb::LineWeight  | gridLineWeight (int nRow, int nCol, AcDb::GridLineType nGridLineType) const
 virtual ADESK_DEPRECATED
 AcDb::Visibility  | gridVisibility (AcDb::GridLineType gridlineType, AcDb::RowType type=AcDb::kDataRow) const
 virtual AcDb::Visibility  | gridVisibility (int row, int col, AcDb::CellEdgeMask iEdge) const
 AcDb::Visibility  | gridVisibility (int nRow, int nCol, AcDb::GridLineType nGridLineType) const
 bool  | hasFormula (int nRow, int nCol, int nContent) const
 virtual bool  | hasSubSelection () const
 virtual double  | height () const
 virtual bool  | hitTest (const AcGePoint3d &wpt, const AcGeVector3d &wviewVec, double wxaper, double wyaper, int &resultRowIndex, int &resultColumnIndex)
 bool  | hitTest (const AcGePoint3d &wpt, const AcGeVector3d &wviewVec, double wxaper, double wyaper, int &resultRowIndex, int &resultColumnIndex, int &contentIndex, AcDb::TableHitItem &nItem)
 virtual ADESK_DEPRECATED double  | horzCellMargin () const
 virtual Acad::ErrorStatus  | insertColumns (int col, double width, int nCols=1)
 Acad::ErrorStatus  | insertColumnsAndInherit (int col, int nInheritFrom, int nNumCols)
 virtual Acad::ErrorStatus  | insertRows (int row, double height, int nRows=1)
 Acad::ErrorStatus  | insertRowsAndInherit (int nIndex, int nInheritFrom, int nNumRows)
 virtual ADESK_DEPRECATED bool  | isAutoScale (int row, int col) const
 bool  | isAutoScale (int row, int col, int nContent) const
 virtual ADESK_DEPRECATED bool  | isBackgroundColorNone (AcDb::RowType type=AcDb::kDataRow) const
 virtual bool  | isBackgroundColorNone (int row, int col) const
 bool  | isBreakEnabled (void) const
 bool  | isContentEditable (int nRow, int nCol) const
 bool  | isEmpty (int nRow, int nCol) const
 bool  | isFormatEditable (int nRow, int nCol) const
 virtual ADESK_DEPRECATED bool  | isHeaderSuppressed () const
 bool  | isLinked (int nRow, int nCol) const
 bool  | isMergeAllEnabled (int nRow, int nCol) const
 virtual bool  | isMergedCell (int row, int col, int *minRow=NULL, int *maxRow=NULL, int *minCol=NULL, int *maxCol=NULL) const
 bool  | isRegenerateTableSuppressed () const
 virtual ADESK_DEPRECATED bool  | isTitleSuppressed () const
 virtual void  | list () const
 double  | margin (int nRow, int nCol, AcDb::CellMargin nMargin) const
 virtual Acad::ErrorStatus  | mergeCells (int minRow, int maxRow, int minCol, int maxCol)
 virtual double  | minimumColumnWidth (int col) const
 virtual double  | minimumRowHeight (int row) const
 virtual double  | minimumTableHeight () const
 virtual double  | minimumTableWidth () const
 Acad::ErrorStatus  | moveContent (int nRow, int nCol, int nFromIndex, int nToIndex)
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &, const AcGeVector3d &)
 virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual Adesk::UInt32  | numColumns () const
 int  | numContents (int nRow, int nCol) const
 virtual Adesk::UInt32  | numRows () const
 virtual void  | objectClosed (const AcDbObjectId objId)
 virtual bool  | receiveShadows () const
 virtual Acad::ErrorStatus  | recomputeTableBlock (bool forceUpdate=true)
 Acad::ErrorStatus  | removeAllOverrides (int nRow, int nCol)
 Acad::ErrorStatus  | removeDataLink (int nRow, int nCol)
 Acad::ErrorStatus  | removeDataLink (void)
virtual bool  | reselectSubRegion (AcDbFullSubentPathArray &paths) const
 Acad::ErrorStatus  | resetValue (int row, int col)
 double  | rotation (void) const
 double  | rotation (int row, int col, int nContent) const
 virtual double  | rowHeight (int row) const
 virtual ADESK_DEPRECATED
 AcDb::RowType  | rowType (int row) const
 double  | scale (int row, int col, int nContent) const
virtual Acad::ErrorStatus  | select (const AcGePoint3d &wpt, const AcGeVector3d &wvwVec, const AcGeVector3d &wvwxVec, double wxaper, double wyaper, bool allowOutside, bool bInPickFirst, int &resultRowIndex, int &resultColumnIndex, AcDbFullSubentPathArray *pPaths=NULL) const
virtual Acad::ErrorStatus  | select_next_cell (int dir, int &resultRowIndex, int &resultColumnIndex, AcDbFullSubentPathArray *pPaths=NULL, bool bSupportTextCellOnly=true) const
 virtual Acad::ErrorStatus  | selectSubRegion (const AcGePoint3d &wpt1, const AcGePoint3d &wpt2, const AcGeVector3d &wvwVec, const AcGeVector3d &wvwxVec, double wxaper, double wyaper, AcDb::SelectType seltype, bool bIncludeCurrentSelection, bool bInPickFirst, int &rowMin, int &rowMax, int &colMin, int &colMax, AcDbFullSubentPathArray *pPaths=NULL) const
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setAlignment (AcDb::CellAlignment align, int rowTypes=AcDb::kAllRows)
 virtual Acad::ErrorStatus  | setAlignment (int row, int col, AcDb::CellAlignment align)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setAutoScale (int row, int col, bool autoFit)
 Acad::ErrorStatus  | setAutoScale (int row, int col, int nContent, bool autoFit)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setBackgroundColor (const AcCmColor &color, int rowTypes=AcDb::kAllRows)
 virtual Acad::ErrorStatus  | setBackgroundColor (int row, int col, const AcCmColor &color)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setBackgroundColorNone (bool value, int rowTypes=AcDb::kAllRows)
 virtual Acad::ErrorStatus  | setBackgroundColorNone (int row, int col, bool value)
 virtual Acad::ErrorStatus  | setBlockAttributeValue (int row, int col, const AcDbObjectId &attdefId, const ACHAR *value)
 Acad::ErrorStatus  | setBlockAttributeValue (int row, int col, int nContent, const AcDbObjectId &attdefId, const ACHAR *value)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setBlockRotation (int row, int col, double rotAng)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setBlockScale (int row, int col, double scale)
 virtual Acad::ErrorStatus  | setBlockTableRecordId (int row, int col, const AcDbObjectId &blkId, bool autoFit=false)
 Acad::ErrorStatus  | setBlockTableRecordId (int row, int col, int nContent, const AcDbObjectId &blkId, bool autoFit)
 Acad::ErrorStatus  | setBreakFlowDirection (AcDb::TableBreakFlowDirection nDir)
 Acad::ErrorStatus  | setBreakHeight (int nIndex, double fHeight)
 Acad::ErrorStatus  | setBreakOffset (int nIndex, const AcGeVector3d &vec)
 Acad::ErrorStatus  | setBreakOption (AcDb::TableBreakOption nOption)
 Acad::ErrorStatus  | setBreakSpacing (double fSpacing)
 virtual void  | setCastShadows (bool newVal)
 Acad::ErrorStatus  | setCellState (int nRow, int nCol, AcDb::CellState nLock)
 Acad::ErrorStatus  | setCellStyle (int nRow, int nCol, const ACHAR *pszCellStyle)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setCellType (int row, int col, AcDb::CellType type)
 Acad::ErrorStatus  | setColumnName (int nIndex, const ACHAR *pszName)
 virtual Acad::ErrorStatus  | setColumnWidth (int col, double width)
 virtual Acad::ErrorStatus  | setColumnWidth (double width)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setContentColor (const AcCmColor &color, int nRowType=AcDb::kAllRows)
 virtual Acad::ErrorStatus  | setContentColor (int row, int col, const AcCmColor &color)
 Acad::ErrorStatus  | setContentColor (int row, int col, int nContent, const AcCmColor &color)
 Acad::ErrorStatus  | setContentLayout (int row, int col, AcDb::CellContentLayout nLayout)
 Acad::ErrorStatus  | setCustomData (int nRow, int nCol, int nData)
 Acad::ErrorStatus  | setCustomData (int nRow, int nCol, const ACHAR *pszKey, const AcValue *pData)
 Acad::ErrorStatus  | setDataFormat (int row, int col, const ACHAR *pszFormat)
 Acad::ErrorStatus  | setDataFormat (int row, int col, int nContent, const ACHAR *pszFormat)
 Acad::ErrorStatus  | setDataLink (int nRow, int nCol, const AcDbObjectId &idDataLink, bool bUpdate)
 Acad::ErrorStatus  | setDataLink (const AcCellRange &range, const AcDbObjectId &idDataLink, bool bUpdate)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setDataType (AcValue::DataType nDataType, AcValue::UnitType nUnitType)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setDataType (AcValue::DataType nDataType, AcValue::UnitType nUnitType, int nRowTypes)
 Acad::ErrorStatus  | setDataType (int row, int col, AcValue::DataType nDataType, AcValue::UnitType nUnitType)
 Acad::ErrorStatus  | setDataType (int row, int col, int nContent, AcValue::DataType nDataType, AcValue::UnitType nUnitType)
 virtual Acad::ErrorStatus  | setDirection (const AcGeVector3d &horzVec)
 virtual Acad::ErrorStatus  | setFieldId (int row, int col, const AcDbObjectId &fieldId)
 virtual Acad::ErrorStatus  | setFieldId (int row, int col, const AcDbObjectId &fieldId, AcDb::CellOption nFlag)
 Acad::ErrorStatus  | setFieldId (int row, int col, int nContent, const AcDbObjectId &fieldId, AcDb::CellOption nFlag)
 virtual Acad::ErrorStatus  | setFlowDirection (AcDb::FlowDirection flow)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setFormat (const ACHAR *pszFormat)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setFormat (const ACHAR *pszFormat, int nRowTypes)
 ADESK_DEPRECATED Acad::ErrorStatus  | setFormat (int row, int col, const ACHAR *pszFormat)
 Acad::ErrorStatus  | setFormula (int nRow, int nCol, int nContent, const ACHAR *pszFormula)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setGridColor (const AcCmColor &color, int nBorders, int nRows)
 virtual Acad::ErrorStatus  | setGridColor (int row, int col, short nEdges, const AcCmColor &color)
 Acad::ErrorStatus  | setGridColor (int nRow, int nCol, AcDb::GridLineType nGridlineTypes, const AcCmColor &color)
 Acad::ErrorStatus  | setGridDoubleLineSpacing (int nRow, int nCol, AcDb::GridLineType nGridLineTypes, double fSpacing)
 Acad::ErrorStatus  | setGridLineStyle (int nRow, int nCol, AcDb::GridLineType nGridLineTypes, AcDb::GridLineStyle nLineStyle)
 Acad::ErrorStatus  | setGridLinetype (int nRow, int nCol, AcDb::GridLineType nGridLineTypes, const AcDbObjectId &idLinetype)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setGridLineWeight (AcDb::LineWeight lwt, int nBorders, int nRows)
 virtual Acad::ErrorStatus  | setGridLineWeight (int row, int col, short nEdges, AcDb::LineWeight value)
 Acad::ErrorStatus  | setGridLineWeight (int nRow, int nCol, AcDb::GridLineType nGridLineTypes, AcDb::LineWeight nLineWeight)
 Acad::ErrorStatus  | setGridProperty (int nRow, int nCol, AcDb::GridLineType nGridLineTypes, const AcGridProperty &gridProp)
 Acad::ErrorStatus  | setGridProperty (const AcCellRange &rangeIn, AcDb::GridLineType nGridLineTypes, const AcGridProperty &gridProp)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setGridVisibility (AcDb::Visibility visible, int nBorders, int nRows)
 virtual Acad::ErrorStatus  | setGridVisibility (int row, int col, short nEdges, AcDb::Visibility value)
 Acad::ErrorStatus  | setGridVisibility (int nRow, int nCol, AcDb::GridLineType nGridLineTypes, AcDb::Visibility nVisibility)
 virtual Acad::ErrorStatus  | setHeight (double height)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setHorzCellMargin (double gap)
 Acad::ErrorStatus  | setMargin (int nRow, int nCol, AcDb::CellMargin nMargins, double fMargin)
 virtual Acad::ErrorStatus  | setNormal (const AcGeVector3d &newVal)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setNumColumns (int nCols)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setNumRows (int nRows)
 Acad::ErrorStatus  | setOverride (int nRow, int nCol, int nContent, AcDb::CellProperty nOverride)
 Acad::ErrorStatus  | setOverride (int nRow, int nCol, AcDb::GridLineType nGridLineType, AcDb::GridProperty nOverride)
 virtual Acad::ErrorStatus  | setPosition (const AcGePoint3d &)
 virtual void  | setReceiveShadows (bool newVal)
 virtual void  | setRegen ()
 Acad::ErrorStatus  | setRotation (double fAngle)
 Acad::ErrorStatus  | setRotation (int row, int col, int nContent, double fAngle)
 virtual Acad::ErrorStatus  | setRowHeight (int row, double height)
 virtual Acad::ErrorStatus  | setRowHeight (double height)
 Acad::ErrorStatus  | setScale (int row, int col, int nContent, double scale)
 Acad::ErrorStatus  | setSize (int nRows, int nCols)
 virtual Acad::ErrorStatus  | setSubSelection (int rowMin, int rowMax, int colMin, int colMax)
 Acad::ErrorStatus  | setSubSelection (const AcCellRange &range)
 virtual Acad::ErrorStatus  | setTableStyle (const AcDbObjectId &id)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setTextHeight (double height, int rowTypes=AcDb::kAllRows)
 virtual Acad::ErrorStatus  | setTextHeight (int row, int col, double height)
 Acad::ErrorStatus  | setTextHeight (int row, int col, int nContent, double height)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setTextRotation (int row, int col, AcDb::RotationAngle rot)
 virtual Acad::ErrorStatus  | setTextString (int row, int col, const ACHAR *text)
 Acad::ErrorStatus  | setTextString (int row, int col, int nContent, const ACHAR *text)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setTextStyle (const AcDbObjectId &id, int rowTypes=AcDb::kAllRows)
 virtual Acad::ErrorStatus  | setTextStyle (int row, int col, const AcDbObjectId &id)
 Acad::ErrorStatus  | setTextStyle (int row, int col, int nContent, const AcDbObjectId &id)
 Acad::ErrorStatus  | setToolTip (int nRow, int nCol, const ACHAR *pszToolTip)
 Acad::ErrorStatus  | setValue (int row, int col, const AcValue &val)
 Acad::ErrorStatus  | setValue (int row, int col, LPCTSTR pszText, AcValue::ParseOption nOption)
 Acad::ErrorStatus  | setValue (int row, int col, int nContent, const AcValue &val)
 Acad::ErrorStatus  | setValue (int row, int col, int nContent, const AcValue &val, AcValue::ParseOption nOption)
 Acad::ErrorStatus  | setValue (int row, int col, int nContent, LPCTSTR pszText, AcValue::ParseOption nOption)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | setVertCellMargin (double gap)
 virtual Acad::ErrorStatus  | setWidth (double width)
 virtual Acad::ErrorStatus  | subClose ()
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | suppressHeaderRow (bool value)
 virtual void  | suppressInvisibleGrid (bool value)
 void  | suppressRegenerateTable (bool bSuppress)
 virtual ADESK_DEPRECATED
 Acad::ErrorStatus  | suppressTitleRow (bool value)
 virtual AcDbObjectId  | tableStyle () const
 virtual ADESK_DEPRECATED bool  | tableStyleOverrides (AcDbIntArray &overrides) const
 virtual ADESK_DEPRECATED double  | textHeight (AcDb::RowType type=AcDb::kDataRow) const
 virtual double  | textHeight (int row, int col) const
 double  | textHeight (int row, int col, int nContent) const
 virtual ADESK_DEPRECATED
 AcDb::RotationAngle  | textRotation (int row, int col) const
 virtual ACHAR *  | textString (int row, int col) const
 virtual Acad::ErrorStatus  | textString (int row, int col, AcValue::FormatOption nOption, AcString &sText) const
 AcString  | textString (int row, int col, int nContent) const
 Acad::ErrorStatus  | textString (int row, int col, int nContent, AcValue::FormatOption nOption, AcString &sText) const
 virtual const ACHAR *  | textStringConst (int row, int col) const
 virtual ADESK_DEPRECATED
 AcDbObjectId  | textStyle (AcDb::RowType type=AcDb::kDataRow) const
 virtual AcDbObjectId  | textStyle (int row, int col) const
 AcDbObjectId  | textStyle (int row, int col, int nContent) const
 virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | unmergeCells (int minRow, int maxRow, int minCol, int maxCol)
 Acad::ErrorStatus  | updateDataLink (int nRow, int nCol, AcDb::UpdateDirection nDir, AcDb::UpdateOption nOption)
 Acad::ErrorStatus  | updateDataLink (AcDb::UpdateDirection nDir, AcDb::UpdateOption nOption)
 AcValue  | value (int row, int col) const
 AcValue  | value (int row, int col, int nContent) const
 AcValue  | value (int row, int col, int nContent, AcValue::FormatOption nOption) const
 virtual ADESK_DEPRECATED double  | vertCellMargin () const
 virtual double  | width () const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *worldDraw)
 Public Member Functions inherited from AcDbBlockReference
ACDB_DECLARE_MEMBERS (AcDbBlockReference)
AcDbBlockReference (const AcGePoint3d &position, AcDbObjectId blockTableRec)
 Acad::ErrorStatus  | appendAttribute (AcDbAttribute *)
 Acad::ErrorStatus  | appendAttribute (AcDbObjectId &, AcDbAttribute *)
 AcDbObjectIterator *  | attributeIterator () const
 AcDbObjectId  | blockTableRecord () const
 AcGeMatrix3d  | blockTransform () const
 virtual Acad::ErrorStatus  | explodeToOwnerSpace () const
 Acad::ErrorStatus  | geomExtentsBestFit (AcDbExtents &extents, const AcGeMatrix3d &parentXform=AcGeMatrix3d::kIdentity) const
 virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const
 virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual void  | gripStatus (const AcDb::GripStat status)
 virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean highlightAll=Adesk::kFalse) const
 virtual Adesk::Boolean  | isPlanar () const
 AcGeMatrix3d  | nonAnnotationBlockTransform () const
 AcGeScale3d  | nonAnnotationScaleFactors () const
 AcGeVector3d  | normal () const
 Acad::ErrorStatus  | openAttribute (AcDbAttribute *&, AcDbObjectId, AcDb::OpenMode, bool openErasedOne=false)
 Acad::ErrorStatus  | openSequenceEnd (AcDbSequenceEnd *&, AcDb::OpenMode)
 AcGePoint3d  | position () const
 AcGeScale3d  | scaleFactors () const
 virtual Acad::ErrorStatus  | setBlockTableRecord (AcDbObjectId)
 virtual Acad::ErrorStatus  | setBlockTransform (const AcGeMatrix3d &)
 virtual Acad::ErrorStatus  | setScaleFactors (const AcGeScale3d &scale)
 virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &) const
 virtual Adesk::Boolean  | treatAsAcDbBlockRefForExplode () const
 virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &=kNullSubent, const Adesk::Boolean highlightAll=Adesk::kFalse) const
 virtual void  | viewportDraw (AcGiViewportDraw *mode)
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual Adesk::Boolean  | cloneMeForDragging ()
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual void  | dragStatus (const AcDb::DragStat status)
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable ()
 AcCmEntityColor  | entityColor () const
 virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual void  | getEcs (AcGeMatrix3d &retVal) const
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeFastTransform &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 ACHAR *  | plotStyleName () const
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual void  | setGsNode (AcGsNode *pNode)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | transformBy (const AcGeFastTransform &xform)
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 AcCmTransparency  | transparency () const
 AcDb::Visibility  | visibility () const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Member Function Documentation
 virtual bool AcDbTable::reselectSubRegion  |  ( |  AcDbFullSubentPathArray &  |  paths | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbTable::select  |  ( |  const AcGePoint3d &  |  wpt,
|  const AcGeVector3d &  |  wvwVec,
|  const AcGeVector3d &  |  wvwxVec,
|  double  |  wxaper,
|  double  |  wyaper,
|  bool  |  allowOutside,
|  bool  |  bInPickFirst,
|  int &  |  resultRowIndex,
|  int &  |  resultColumnIndex,
|  AcDbFullSubentPathArray *  |  pPaths = NULL
) |   |  const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbTable::select_next_cell  |  ( |  int  |  dir,
|  int &  |  resultRowIndex,
|  int &  |  resultColumnIndex,
|  AcDbFullSubentPathArray *  |  pPaths = NULL,
|  bool  |  bSupportTextCellOnly = true
) |   |  const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbtable.h