Public Member Functions | List of all members
AcPublishReactor Class Reference
  Inheritance diagram for AcPublishReactor:
 Public Member Functions
 virtual void  | OnAboutToBeginBackgroundPublishing (AcPublishBeforeJobInfo *pInfo)
 virtual void  | OnAboutToBeginPublishing (AcPublishBeginJobInfo *pInfo)
 virtual void  | OnAboutToEndPublishing (AcPublishReactorInfo *pInfo)
 virtual void  | OnAboutToMoveFile (AcPublishReactorInfo *pInfo)
 virtual void  | OnBeginAggregation (AcPublishAggregationInfo *pInfo)
 virtual void  | OnBeginPublishingSheet (AcPublishSheetInfo *pInfo)
 virtual void  | OnCancelledOrFailedPublishing (AcPublishReactorInfo *pInfo)
 virtual void  | OnEndPublish (AcPublishReactorInfo *pInfo)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
AcPublishReactors.h