Public Member Functions | List of all members
AcTransaction Class Reference
AcDb Classes
  Inheritance diagram for AcTransaction:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcTransaction)
 virtual Acad::ErrorStatus  | getAllObjects (AcDbVoidPtrArray &objs)=0
 virtual Acad::ErrorStatus  | getObject (AcDbObject *&obj, AcDbObjectId objectId, AcDb::OpenMode mode, bool openErasedObject=false)=0
 virtual Acad::ErrorStatus  | markObjectPageable (AcDbObject *pObject)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbtrans.h