Public Member Functions | List of all members
AcGiFaceData Class Reference
AcGi Classes
  Inheritance diagram for AcGiFaceData:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiFaceData)
 virtual short *  | colors () const
 virtual AcDbObjectId *  | layerIds () const
virtual AcGiMapper *  | mappers () const
virtual AcDbObjectId *  | materials () const
 virtual AcGeVector3d *  | normals () const
 virtual Adesk::LongPtr *  | selectionMarkers () const
 virtual void  | setColors (const short *colors)
 virtual void  | setLayers (const AcDbObjectId *layers)
virtual void  | setMappers (const AcGiMapper *mappers)
virtual void  | setMaterials (const AcDbObjectId *materials)
 virtual void  | setNormals (const AcGeVector3d *pNormals)
 virtual void  | setSelectionMarkers (const Adesk::LongPtr *pSelectionMarkers)
 virtual void  | setTrueColors (const AcCmEntityColor *colors)
 virtual void  | setVisibility (const Adesk::UInt8 *vis)
 virtual AcCmEntityColor *  | trueColors () const
 virtual Adesk::UInt8 *  | visibility () const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Member Function Documentation
 virtual AcGiMapper* AcGiFaceData::mappers  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcDbObjectId* AcGiFaceData::materials  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual void AcGiFaceData::setMappers  |  ( |  const AcGiMapper *  |  mappers | )
virtual
Warning
Not implemented!
 virtual void AcGiFaceData::setMaterials  |  ( |  const AcDbObjectId *  |  materials | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acgi.h