Public Member Functions | List of all members
AcDbEvalContext Class Reference
AcDb Classes
  Inheritance diagram for AcDbEvalContext:
 Public Member Functions
AcDbEvalContext ()
ACRX_DECLARE_MEMBERS (AcDbEvalContext)
virtual Acad::ErrorStatus  | getAt (AcDbEvalContextPair &pair) const
virtual void  | insertAt (const AcDbEvalContextPair &pair)
virtual AcDbEvalContextIterator *  | newIterator () const
virtual void  | removeAt (const ACHAR *szKey)
virtual  | ~AcDbEvalContext ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Constructor & Destructor Documentation
 AcDbEvalContext::AcDbEvalContext  |  ( |   | )
Warning
Not implemented!
 virtual AcDbEvalContext::~AcDbEvalContext  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcDbEvalContext::getAt  |  ( |  AcDbEvalContextPair &  |  pair | ) |   const
virtual
Warning
Not implemented!
 virtual void AcDbEvalContext::insertAt  |  ( |  const AcDbEvalContextPair &  |  pair | )
virtual
Warning
Not implemented!
 virtual AcDbEvalContextIterator* AcDbEvalContext::newIterator  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual void AcDbEvalContext::removeAt  |  ( |  const ACHAR *  |  szKey | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbeval.h