Public Types | Public Member Functions | List of all members
AcDbSection Class Reference
AcDb Classes
  Inheritance diagram for AcDbSection:
 Public Types
enum  | Height { kHeightAboveSectionLine = 0x1, kHeightBelowSectionLine = 0x2 }
enum  | State { kPlane = (0x1 << 0), kBoundary = (0x1 << 1), kVolume = (0x1 << 2) }
enum  | SubItem {
 kNone = 0, kSectionLine = (0x1 << 0), kSectionLineTop = (0x1 << 1), kSectionLineBottom = (0x1 << 2),
 kBackLine = (0x1 << 3), kBackLineTop = (0x1 << 4), kBackLineBottom = (0x1 << 5), kVerticalLineTop = (0x1 << 6),
 kVerticalLineBottom = (0x1 << 7)
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbSection)
ACDB_PORT  | AcDbSection (void)
ACDB_PORT  | AcDbSection (const AcGePoint3dArray &pts, const AcGeVector3d &verticalDir)
ACDB_PORT  | AcDbSection (const AcGePoint3dArray &pts, const AcGeVector3d &verticalDir, const AcGeVector3d &vecViewingDir)
ACDB_PORT Acad::ErrorStatus  | addVertex (int nInsertAt, const AcGePoint3d &pt)
ACDB_PORT Acad::ErrorStatus  | createJog (const AcGePoint3d &ptOnSection)
virtual ACDB_PORT Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
virtual ACDB_PORT Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
virtual ACDB_PORT Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
virtual ACDB_PORT Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
ACDB_PORT Acad::ErrorStatus  | enableLiveSection (bool bEnable)
ACDB_PORT Acad::ErrorStatus  | generateSectionGeometry (AcDbEntity *pEnt, AcArray< AcDbEntity * > &intBoundaryEnts, AcArray< AcDbEntity * > &intFillEnts, AcArray< AcDbEntity * > &backgroundEnts, AcArray< AcDbEntity * > &foregroundEnts, AcArray< AcDbEntity * > &curveTangencyEnts) const
ACDB_PORT Acad::ErrorStatus  | generateSectionGeometry (const AcArray< AcDbEntity * > &entset, AcArray< AcDbEntity * > &intBoundaryEnts, AcArray< AcDbEntity * > &intFillEnts, AcArray< AcDbEntity * > &backgroundEnts, AcArray< AcDbEntity * > &foregroundEnts, AcArray< AcDbEntity * > &curveTangencyEnts) const
virtual ACDB_PORT Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
virtual ACDB_PORT Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const
virtual ACDB_PORT Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
ACDB_PORT const ACHAR *  | getName (void) const
ACDB_PORT Acad::ErrorStatus  | getName (AcString &sName) const
ACDB_PORT Acad::ErrorStatus  | getName (ACHAR *&pszName) const
virtual ACDB_PORT Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
ACDB_PORT AcDbObjectId  | getSettings (void) const
ACDB_PORT Acad::ErrorStatus  | getSettings (AcDbSectionSettings *&pSettings, AcDb::OpenMode mode) const
ACDB_PORT Acad::ErrorStatus  | getVertex (int nIndex, AcGePoint3d &pt) const
ACDB_PORT Acad::ErrorStatus  | getVertices (AcGePoint3dArray &pts) const
ACDB_PORT double  | height (AcDbSection::Height nHeightType) const
ACDB_PORT bool  | hitTest (const AcGePoint3d &ptHit, int *pSegmentIndex, AcGePoint3d *ptOnSegment, AcDbSection::SubItem *pSubItem) const
ACDB_PORT AcCmColor  | indicatorFillColor (void) const
ACDB_PORT int  | indicatorTransparency (void) const
ACDB_PORT bool  | isLiveSectionEnabled (void) const
virtual ACDB_PORT void  | list (void) const
virtual ACDB_PORT Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
ACDB_PORT AcGeVector3d  | normal (void) const
ACDB_PORT int  | numVertices (void) const
ACDB_PORT Acad::ErrorStatus  | plane (AcGeVector3d &uAxis, AcGeVector3d &vAxis) const
ACDB_PORT Acad::ErrorStatus  | removeVertex (int nIndex)
ACDB_PORT Acad::ErrorStatus  | setHeight (AcDbSection::Height nHeightType, double fHeight)
ACDB_PORT Acad::ErrorStatus  | setIndicatorFillColor (const AcCmColor &color)
ACDB_PORT Acad::ErrorStatus  | setIndicatorTransparency (int nTransparency)
ACDB_PORT Acad::ErrorStatus  | setName (const ACHAR *pszName)
ACDB_PORT Acad::ErrorStatus  | setState (AcDbSection::State nState)
ACDB_PORT Acad::ErrorStatus  | setVertex (int nIndex, const AcGePoint3d &pt)
ACDB_PORT Acad::ErrorStatus  | setVerticalDirection (const AcGeVector3d &dir)
ACDB_PORT Acad::ErrorStatus  | setVertices (const AcGePoint3dArray &pts)
ACDB_PORT Acad::ErrorStatus  | setViewingDirection (const AcGeVector3d &dir)
ACDB_PORT AcDbSection::State  | state (void) const
virtual ACDB_PORT Acad::ErrorStatus  | subClose ()
virtual ACDB_PORT Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform)
ACDB_PORT AcGeVector3d  | verticalDirection (void) const
ACDB_PORT AcGeVector3d  | viewingDirection (void) const
virtual ACDB_PORT Adesk::Boolean  | worldDraw (AcGiWorldDraw *wd)
ACDB_PORT  | ~AcDbSection (void)
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual bool  | castShadows () const
 virtual Adesk::Boolean  | cloneMeForDragging ()
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual void  | dragStatus (const AcDb::DragStat status)
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable ()
 AcCmEntityColor  | entityColor () const
 virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const
 virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual void  | getEcs (AcGeMatrix3d &retVal) const
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeFastTransform &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const
 virtual void  | gripStatus (const AcDb::GripStat status)
 virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const
 virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Adesk::Boolean  | isPlanar () const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 ACHAR *  | plotStyleName () const
 virtual bool  | receiveShadows () const
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 virtual void  | setCastShadows (bool newVal)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual void  | setGsNode (AcGsNode *pNode)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual void  | setReceiveShadows (bool newVal)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &id) const
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | transformBy (const AcGeFastTransform &xform)
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 AcCmTransparency  | transparency () const
 virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual void  | viewportDraw (AcGiViewportDraw *mode)
 AcDb::Visibility  | visibility () const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Constructor & Destructor Documentation
 ACDB_PORT AcDbSection::AcDbSection  |  ( |  void  |   | )
Warning
Not implemented!
 ACDB_PORT AcDbSection::AcDbSection  |  ( |  const AcGePoint3dArray &  |  pts,
|  const AcGeVector3d &  |  verticalDir
)
Warning
Not implemented!
 ACDB_PORT AcDbSection::AcDbSection  |  ( |  const AcGePoint3dArray &  |  pts,
|  const AcGeVector3d &  |  verticalDir,
|  const AcGeVector3d &  |  vecViewingDir
)
Warning
Not implemented!
 ACDB_PORT AcDbSection::~AcDbSection  |  ( |  void  |   | )
Warning
Not implemented!
Member Function Documentation
 ACDB_PORT Acad::ErrorStatus AcDbSection::addVertex  |  ( |  int  |  nInsertAt,
|  const AcGePoint3d &  |  pt
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::createJog  |  ( |  const AcGePoint3d &  |  ptOnSection | )
Warning
Not implemented!
 virtual ACDB_PORT Acad::ErrorStatus AcDbSection::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual ACDB_PORT Acad::ErrorStatus AcDbSection::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual ACDB_PORT Acad::ErrorStatus AcDbSection::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual ACDB_PORT Acad::ErrorStatus AcDbSection::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 ACDB_PORT Acad::ErrorStatus AcDbSection::enableLiveSection  |  ( |  bool  |  bEnable | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::generateSectionGeometry  |  ( |  AcDbEntity *  |  pEnt,
|  AcArray< AcDbEntity * > &  |  intBoundaryEnts,
|  AcArray< AcDbEntity * > &  |  intFillEnts,
|  AcArray< AcDbEntity * > &  |  backgroundEnts,
|  AcArray< AcDbEntity * > &  |  foregroundEnts,
|  AcArray< AcDbEntity * > &  |  curveTangencyEnts
) |   |  const
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::generateSectionGeometry  |  ( |  const AcArray< AcDbEntity * > &  |  entset,
|  AcArray< AcDbEntity * > &  |  intBoundaryEnts,
|  AcArray< AcDbEntity * > &  |  intFillEnts,
|  AcArray< AcDbEntity * > &  |  backgroundEnts,
|  AcArray< AcDbEntity * > &  |  foregroundEnts,
|  AcArray< AcDbEntity * > &  |  curveTangencyEnts
) |   |  const
Warning
Not implemented!
 virtual ACDB_PORT Acad::ErrorStatus AcDbSection::getClassID  |  ( |  CLSID *  |  pClsid | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual ACDB_PORT Acad::ErrorStatus AcDbSection::getGeomExtents  |  ( |  AcDbExtents &  |  extents | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual ACDB_PORT Acad::ErrorStatus AcDbSection::getGripPoints  |  ( |  AcDbGripDataPtrArray &  |  grips,
|  const double  |  curViewUnitSize,
|  const int  |  gripSize,
|  const AcGeVector3d &  |  curViewDir,
|  const int  |  bitflags
) |   |  const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 ACDB_PORT const ACHAR* AcDbSection::getName  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::getName  |  ( |  AcString &  |  sName | ) |   const
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::getName  |  ( |  ACHAR *&  |  pszName | ) |   const
Warning
Not implemented!
 virtual ACDB_PORT Acad::ErrorStatus AcDbSection::getOsnapPoints  |  ( |  AcDb::OsnapMode  |  osnapMode,
|  Adesk::GsMarker  |  gsSelectionMark,
|  const AcGePoint3d &  |  pickPoint,
|  const AcGePoint3d &  |  lastPoint,
|  const AcGeMatrix3d &  |  viewXform,
|  AcGePoint3dArray &  |  snapPoints,
|  AcDbIntArray &  |  geomIds
) |   |  const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 ACDB_PORT AcDbObjectId AcDbSection::getSettings  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::getSettings  |  ( |  AcDbSectionSettings *&  |  pSettings,
|  AcDb::OpenMode  |  mode
) |   |  const
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::getVertex  |  ( |  int  |  nIndex,
|  AcGePoint3d &  |  pt
) |   |  const
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::getVertices  |  ( |  AcGePoint3dArray &  |  pts | ) |   const
Warning
Not implemented!
 ACDB_PORT double AcDbSection::height  |  ( |  AcDbSection::Height  |  nHeightType | ) |   const
Warning
Not implemented!
 ACDB_PORT bool AcDbSection::hitTest  |  ( |  const AcGePoint3d &  |  ptHit,
|  int *  |  pSegmentIndex,
|  AcGePoint3d *  |  ptOnSegment,
|  AcDbSection::SubItem *  |  pSubItem
) |   |  const
Warning
Not implemented!
 ACDB_PORT AcCmColor AcDbSection::indicatorFillColor  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 ACDB_PORT int AcDbSection::indicatorTransparency  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 ACDB_PORT bool AcDbSection::isLiveSectionEnabled  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 virtual ACDB_PORT void AcDbSection::list  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual ACDB_PORT Acad::ErrorStatus AcDbSection::moveGripPointsAt  |  ( |  const AcDbVoidPtrArray &  |  gripAppData,
|  const AcGeVector3d &  |  offset,
|  const int  |  bitflags
)
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 ACDB_PORT AcGeVector3d AcDbSection::normal  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 ACDB_PORT int AcDbSection::numVertices  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::plane  |  ( |  AcGeVector3d &  |  uAxis,
|  AcGeVector3d &  |  vAxis
) |   |  const
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::removeVertex  |  ( |  int  |  nIndex | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::setHeight  |  ( |  AcDbSection::Height  |  nHeightType,
|  double  |  fHeight
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::setIndicatorFillColor  |  ( |  const AcCmColor &  |  color | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::setIndicatorTransparency  |  ( |  int  |  nTransparency | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::setName  |  ( |  const ACHAR *  |  pszName | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::setState  |  ( |  AcDbSection::State  |  nState | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::setVertex  |  ( |  int  |  nIndex,
|  const AcGePoint3d &  |  pt
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::setVerticalDirection  |  ( |  const AcGeVector3d &  |  dir | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::setVertices  |  ( |  const AcGePoint3dArray &  |  pts | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSection::setViewingDirection  |  ( |  const AcGeVector3d &  |  dir | )
Warning
Not implemented!
 ACDB_PORT AcDbSection::State AcDbSection::state  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 virtual ACDB_PORT Acad::ErrorStatus AcDbSection::subClose  |  ( |   | )
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual ACDB_PORT Acad::ErrorStatus AcDbSection::transformBy  |  ( |  const AcGeMatrix3d &  |  xform | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 ACDB_PORT AcGeVector3d AcDbSection::verticalDirection  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 ACDB_PORT AcGeVector3d AcDbSection::viewingDirection  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 virtual ACDB_PORT Adesk::Boolean AcDbSection::worldDraw  |  ( |  AcGiWorldDraw *  |  wd | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 The documentation for this class was generated from the following file:
DbSection.h