Public Member Functions | Protected Member Functions | Friends | List of all members
AcApLongTransactionReactor Class Reference
  Inheritance diagram for AcApLongTransactionReactor:
 Public Member Functions
 virtual void  | abortLongTransaction (AcDbLongTransaction &)
ACRX_DECLARE_MEMBERS (AcApLongTransactionReactor)
 virtual void  | beginCheckIn (AcDbLongTransaction &)
 virtual void  | beginCheckOut (AcDbLongTransaction &, AcDbObjectIdArray &originList)
 virtual void  | endCheckIn (AcDbLongTransaction &)
 virtual void  | endCheckOut (AcDbLongTransaction &)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 Acad::ErrorStatus  | veto ()
 Friends
 class  | AcApImpLongTransactionManager
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
lngtrans.h