Public Member Functions | List of all members
AcGiViewportDraw Class Reference
AcGi Classes
  Inheritance diagram for AcGiViewportDraw:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiViewportDraw)
 virtual AcGiViewportGeometry &  | geometry () const =0
 virtual Adesk::Boolean  | isValidId (const Adesk::ULongPtr acgiId) const =0
 virtual Adesk::UInt32  | sequenceNumber () const =0
 virtual AcGiViewport &  | viewport () const =0
 virtual AcDbObjectId  | viewportObjectId () const =0
 Public Member Functions inherited from AcGiCommonDraw
ACRX_DECLARE_MEMBERS (AcGiCommonDraw)
 virtual AcGiContext *  | context ()=0
 virtual double  | deviation (const AcGiDeviationType, const AcGePoint3d &) const =0
 virtual Adesk::Boolean  | isDragging () const =0
 virtual Adesk::UInt32  | numberOfIsolines () const =0
 virtual AcGiGeometry *  | rawGeometry () const =0
 virtual Adesk::Boolean  | regenAbort () const =0
 virtual AcGiRegenType  | regenType () const =0
 virtual bool  | secondaryCall () const
 virtual AcGiSubEntityTraits &  | subEntityTraits () const =0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acgi.h