Public Member Functions | Friends | List of all members
AcDbWblockCloneFiler Class Reference
AcDb Classes
  Inheritance diagram for AcDbWblockCloneFiler:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbWblockCloneFiler)
 virtual Acad::ErrorStatus  | addReferences (AcDbIdRefQueue &)
 virtual AcDb::FilerType  | filerType () const
 virtual bool  | getNextHardObject (AcDbObjectId &id)
 virtual bool  | moreHardObjects () const
 virtual bool  | usesReferences () const
 Public Member Functions inherited from AcDbDeepCloneFiler
ACRX_DECLARE_MEMBERS (AcDbDeepCloneFiler)
 virtual AcDbFilerController &  | controller () const
 virtual Acad::ErrorStatus  | filerStatus () const
 virtual bool  | getNextOwnedObject (AcDbObjectId &id)
 virtual bool  | moreOwnedObjects () const
 virtual Acad::ErrorStatus  | readAcDbHandle (AcDbHandle *)
 virtual Acad::ErrorStatus  | readAddress (void **)
 virtual Acad::ErrorStatus  | readBChunk (ads_binary *)
 virtual Acad::ErrorStatus  | readBool (bool *)
 virtual Acad::ErrorStatus  | readBoolean (Adesk::Boolean *)
 virtual Acad::ErrorStatus  | readBytes (void *, Adesk::UInt32)
 virtual Acad::ErrorStatus  | readDouble (double *)
 virtual Acad::ErrorStatus  | readHardOwnershipId (AcDbHardOwnershipId *)
 virtual Acad::ErrorStatus  | readHardPointerId (AcDbHardPointerId *)
 virtual Acad::ErrorStatus  | readInt16 (Adesk::Int16 *)
 virtual Acad::ErrorStatus  | readInt32 (Adesk::Int32 *)
 virtual Acad::ErrorStatus  | readInt64 (Adesk::Int64 *)
 virtual Acad::ErrorStatus  | readInt8 (Adesk::Int8 *)
 virtual Acad::ErrorStatus  | readPoint2d (AcGePoint2d *)
 virtual Acad::ErrorStatus  | readPoint3d (AcGePoint3d *)
 virtual Acad::ErrorStatus  | readScale3d (AcGeScale3d *)
 virtual Acad::ErrorStatus  | readSoftOwnershipId (AcDbSoftOwnershipId *)
 virtual Acad::ErrorStatus  | readSoftPointerId (AcDbSoftPointerId *)
 virtual Acad::ErrorStatus  | readString (ACHAR **)
 virtual Acad::ErrorStatus  | readString (AcString &)
 virtual Acad::ErrorStatus  | readUInt16 (Adesk::UInt16 *)
 virtual Acad::ErrorStatus  | readUInt32 (Adesk::UInt32 *)
 virtual Acad::ErrorStatus  | readUInt64 (Adesk::UInt64 *)
 virtual Acad::ErrorStatus  | readUInt8 (Adesk::UInt8 *)
 virtual Acad::ErrorStatus  | readVector2d (AcGeVector2d *)
 virtual Acad::ErrorStatus  | readVector3d (AcGeVector3d *)
 virtual void  | resetFilerStatus ()
 virtual Acad::ErrorStatus  | seek (long offset, int method)
 virtual void  | setFilerStatus (Acad::ErrorStatus)
 virtual long  | tell () const
 virtual Acad::ErrorStatus  | writeAcDbHandle (const AcDbHandle &)
 virtual Acad::ErrorStatus  | writeAddress (const void *)
 virtual Acad::ErrorStatus  | writeBChunk (const ads_binary &)
 virtual Acad::ErrorStatus  | writeBool (bool)
 virtual Acad::ErrorStatus  | writeBoolean (Adesk::Boolean)
 virtual Acad::ErrorStatus  | writeBytes (const void *, Adesk::UInt32)
 virtual Acad::ErrorStatus  | writeDouble (double)
 virtual Acad::ErrorStatus  | writeHardOwnershipId (const AcDbHardOwnershipId &)
 virtual Acad::ErrorStatus  | writeHardPointerId (const AcDbHardPointerId &)
 virtual Acad::ErrorStatus  | writeInt16 (Adesk::Int16)
 virtual Acad::ErrorStatus  | writeInt32 (Adesk::Int32)
 virtual Acad::ErrorStatus  | writeInt64 (Adesk::Int64)
 virtual Acad::ErrorStatus  | writeInt8 (Adesk::Int8)
 virtual Acad::ErrorStatus  | writePoint2d (const AcGePoint2d &)
 virtual Acad::ErrorStatus  | writePoint3d (const AcGePoint3d &)
 virtual Acad::ErrorStatus  | writeScale3d (const AcGeScale3d &)
 virtual Acad::ErrorStatus  | writeSoftOwnershipId (const AcDbSoftOwnershipId &)
 virtual Acad::ErrorStatus  | writeSoftPointerId (const AcDbSoftPointerId &)
 virtual Acad::ErrorStatus  | writeString (const ACHAR *)
 virtual Acad::ErrorStatus  | writeString (const AcString &)
 virtual Acad::ErrorStatus  | writeUInt16 (Adesk::UInt16)
 virtual Acad::ErrorStatus  | writeUInt32 (Adesk::UInt32)
 virtual Acad::ErrorStatus  | writeUInt64 (Adesk::UInt64)
 virtual Acad::ErrorStatus  | writeUInt8 (Adesk::UInt8)
 virtual Acad::ErrorStatus  | writeVector2d (const AcGeVector2d &)
 virtual Acad::ErrorStatus  | writeVector3d (const AcGeVector3d &)
 Public Member Functions inherited from AcDbDwgFiler
ACRX_DECLARE_MEMBERS (AcDbDwgFiler)
 virtual Acad::ErrorStatus  | dwgVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &) const
 virtual AcDbAuditInfo *  | getAuditInfo () const
 Acad::ErrorStatus  | readChar (Adesk::Int8 *p)
 Acad::ErrorStatus  | readItem (AcDbHardOwnershipId *)
 Acad::ErrorStatus  | readItem (AcDbSoftOwnershipId *)
 Acad::ErrorStatus  | readItem (AcDbHardPointerId *)
 Acad::ErrorStatus  | readItem (AcDbSoftPointerId *)
 Acad::ErrorStatus  | readItem (ACHAR **)
 Acad::ErrorStatus  | readItem (ads_binary *)
 Acad::ErrorStatus  | readItem (AcDbHandle *)
 Acad::ErrorStatus  | readItem (Adesk::Int32 *)
 Acad::ErrorStatus  | readItem (Adesk::Int16 *)
 Acad::ErrorStatus  | readItem (Adesk::Int8 *)
 Acad::ErrorStatus  | readItem (Adesk::UInt32 *)
 Acad::ErrorStatus  | readItem (Adesk::UInt16 *)
 Acad::ErrorStatus  | readItem (Adesk::UInt8 *)
 Acad::ErrorStatus  | readItem (Adesk::Boolean *)
 Acad::ErrorStatus  | readItem (bool *)
 Acad::ErrorStatus  | readItem (double *)
 Acad::ErrorStatus  | readItem (AcGePoint2d *)
 Acad::ErrorStatus  | readItem (AcGePoint3d *)
 Acad::ErrorStatus  | readItem (AcGeVector2d *)
 Acad::ErrorStatus  | readItem (AcGeVector3d *)
 Acad::ErrorStatus  | readItem (AcGeScale3d *)
 Acad::ErrorStatus  | readItem (void *, Adesk::UInt32)
 Acad::ErrorStatus  | readItem (void **)
 Acad::ErrorStatus  | writeChar (Adesk::Int8 c)
 Acad::ErrorStatus  | writeItem (const AcDbHardOwnershipId &)
 Acad::ErrorStatus  | writeItem (const AcDbSoftOwnershipId &)
 Acad::ErrorStatus  | writeItem (const AcDbHardPointerId &)
 Acad::ErrorStatus  | writeItem (const AcDbSoftPointerId &)
 Acad::ErrorStatus  | writeItem (const ACHAR *)
 Acad::ErrorStatus  | writeItem (const ads_binary &)
 Acad::ErrorStatus  | writeItem (const AcDbHandle &)
 Acad::ErrorStatus  | writeItem (Adesk::Int32)
 Acad::ErrorStatus  | writeItem (Adesk::Int16)
 Acad::ErrorStatus  | writeItem (Adesk::Int8)
 Acad::ErrorStatus  | writeItem (Adesk::UInt32)
 Acad::ErrorStatus  | writeItem (Adesk::UInt16)
 Acad::ErrorStatus  | writeItem (Adesk::UInt8)
 Acad::ErrorStatus  | writeItem (Adesk::Boolean)
 Acad::ErrorStatus  | writeItem (bool)
 Acad::ErrorStatus  | writeItem (double)
 Acad::ErrorStatus  | writeItem (const AcGePoint2d &)
 Acad::ErrorStatus  | writeItem (const AcGePoint3d &)
 Acad::ErrorStatus  | writeItem (const AcGeVector2d &)
 Acad::ErrorStatus  | writeItem (const AcGeVector3d &)
 Acad::ErrorStatus  | writeItem (const AcGeScale3d &)
 Acad::ErrorStatus  | writeItem (const void *, Adesk::UInt32)
 Acad::ErrorStatus  | writeItem (const void *)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Protected Member Functions inherited from AcDbDeepCloneFiler
AcDbDeepCloneFiler (AcDbSystemInternals *)
 The documentation for this class was generated from the following file:
dbcfilrs.h