Public Member Functions | Public Attributes | Static Public Attributes | Friends | List of all members
AcGeVector2d Class Reference
AcGe Classes
 Public Member Functions
AcGeVector2d (const AcGeVector2d &vec)
AcGeVector2d (double x, double y)
 double  | angle () const
 double  | angleTo (const AcGeVector2d &vec) const
 double  | dotProduct (const AcGeVector2d &vec) const
 Adesk::Boolean  | isCodirectionalTo (const AcGeVector2d &vec, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isCodirectionalTo (const AcGeVector2d &vec, const AcGeTol &tol, AcGeError &flag) const
 bool  | isEqualTo (const AcGeVector2d &vec, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isParallelTo (const AcGeVector2d &vec, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isParallelTo (const AcGeVector2d &vec, const AcGeTol &tol, AcGeError &flag) const
 Adesk::Boolean  | isPerpendicularTo (const AcGeVector2d &vec, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isPerpendicularTo (const AcGeVector2d &vec, const AcGeTol &tol, AcGeError &flag) const
 Adesk::Boolean  | isUnitLength (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isZeroLength (const AcGeTol &tol=AcGeContext::gTol) const
 double  | length () const
 double  | lengthSqrd () const
 AcGeVector2d &  | mirror (const AcGeVector2d &line)
 AcGeVector2d &  | negate ()
 AcGeVector2d  | normal (const AcGeTol &tol=AcGeContext::gTol) const
 AcGeVector2d &  | normalize (const AcGeTol &tol=AcGeContext::gTol)
 AcGeVector2d &  | normalize (const AcGeTol &tol, AcGeError &flag)
operator AcGeMatrix2d () const
 bool  | operator!= (const AcGeVector2d &vec) const
 AcGeVector2d  | operator* (double scl) const
 AcGeVector2d &  | operator*= (double scl)
 AcGeVector2d  | operator+ (const AcGeVector2d &vec) const
 AcGeVector2d &  | operator+= (const AcGeVector2d &vec)
 AcGeVector2d  | operator- (const AcGeVector2d &vec) const
 AcGeVector2d  | operator- () const
 AcGeVector2d &  | operator-= (const AcGeVector2d &vec)
 AcGeVector2d  | operator/ (double scl) const
 AcGeVector2d &  | operator/= (double scl)
 bool  | operator== (const AcGeVector2d &vec) const
 double  | operator[] (unsigned int i) const
 double &  | operator[] (unsigned int i)
 AcGeVector2d  | perpVector () const
 AcGeVector2d &  | rotateBy (double angle)
 AcGeVector2d &  | set (double x, double y)
 AcGeVector2d &  | setToProduct (const AcGeMatrix2d &mat, const AcGeVector2d &vec)
 AcGeVector2d &  | setToProduct (const AcGeVector2d &vec, double scl)
 AcGeVector2d &  | setToSum (const AcGeVector2d &vec1, const AcGeVector2d &vec2)
 AcGeVector2d &  | transformBy (const AcGeMatrix2d &leftSide)
 Public Attributes
 double  | x
 double  | y
 Static Public Attributes
 static const AcGeVector2d  | kIdentity
 static const AcGeVector2d  | kXAxis
 static const AcGeVector2d  | kYAxis
 Friends
 GE_DLLEXPIMPORT AcGeVector2d  | operator* (const AcGeMatrix2d &mat, const AcGeVector2d &vec)
 GE_DLLEXPIMPORT AcGeVector2d  | operator* (double scl, const AcGeVector2d &vec)
 The documentation for this class was generated from the following file:
gevec2d.h