Public Member Functions | List of all members
AcGiEdgeData Class Reference
AcGi Classes
  Inheritance diagram for AcGiEdgeData:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiEdgeData)
 virtual short *  | colors () const
 virtual AcDbObjectId *  | layerIds () const
 virtual AcDbObjectId *  | linetypeIds () const
 virtual Adesk::LongPtr *  | selectionMarkers () const
 virtual void  | setColors (const short *colors)
 virtual void  | setLayers (const AcDbObjectId *layers)
 virtual void  | setLineTypes (const AcDbObjectId *linetypes)
 virtual void  | setSelectionMarkers (const Adesk::LongPtr *pSelectionMarkers)
 virtual void  | setTrueColors (const AcCmEntityColor *colors)
 virtual void  | setVisibility (const Adesk::UInt8 *pVisibility)
 virtual AcCmEntityColor *  | trueColors () const
 virtual Adesk::UInt8 *  | visibility () const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acgi.h