Public Member Functions | List of all members
AcGePointOnSurface Class Reference
AcGe Classes
  Inheritance diagram for AcGePointOnSurface:
 Public Member Functions
AcGePointOnSurface (const AcGeSurface &surf)
AcGePointOnSurface (const AcGeSurface &surf, const AcGePoint2d &param)
AcGePointOnSurface (const AcGePointOnSurface &src)
 AcGeVector2d  | inverseTangentVector (const AcGeVector3d &vec) const
 AcGeVector2d  | inverseTangentVector (const AcGeVector3d &vec, const AcGePoint2d &param)
 AcGeVector2d  | inverseTangentVector (const AcGeVector3d &vec, const AcGeSurface &surf, const AcGePoint2d &param)
 AcGeVector3d  | mixedPartial () const
 AcGeVector3d  | mixedPartial (const AcGePoint2d &param)
 AcGeVector3d  | mixedPartial (const AcGeSurface &surf, const AcGePoint2d &param)
 AcGeVector3d  | normal () const
 AcGeVector3d  | normal (const AcGePoint2d &param)
 AcGeVector3d  | normal (const AcGeSurface &surf, const AcGePoint2d &param)
 AcGePointOnSurface &  | operator= (const AcGePointOnSurface &src)
 AcGePoint2d  | parameter () const
 AcGePoint3d  | point () const
 AcGePoint3d  | point (const AcGePoint2d &param)
 AcGePoint3d  | point (const AcGeSurface &surf, const AcGePoint2d &param)
 AcGePointOnSurface &  | setParameter (const AcGePoint2d &param)
 AcGePointOnSurface &  | setSurface (const AcGeSurface &surf)
 const AcGeSurface *  | surface () const
 AcGeVector3d  | tangentVector (const AcGeVector2d &vec) const
 AcGeVector3d  | tangentVector (const AcGeVector2d &vec, const AcGePoint2d &param)
 AcGeVector3d  | tangentVector (const AcGeVector2d &vec, const AcGeSurface &vecSurf, const AcGePoint2d &param)
 AcGeVector3d  | uDeriv (int order) const
 AcGeVector3d  | uDeriv (int order, const AcGePoint2d &param)
 AcGeVector3d  | uDeriv (int order, const AcGeSurface &surf, const AcGePoint2d &param)
 AcGeVector3d  | vDeriv (int order) const
 AcGeVector3d  | vDeriv (int order, const AcGePoint2d &param)
 AcGeVector3d  | vDeriv (int order, const AcGeSurface &surf, const AcGePoint2d &param)
 Public Member Functions inherited from AcGePointEnt3d
operator AcGePoint3d () const
 AcGePointEnt3d &  | operator= (const AcGePointEnt3d &pnt)
 AcGePoint3d  | point3d () const
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGePointEnt3d
AcGePointEnt3d (const AcGePointEnt3d &)
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
geponsrf.h