Public Types | Public Member Functions | List of all members
AcGiFaceStyle Class Reference
AcGi Classes
  Inheritance diagram for AcGiFaceStyle:
 Public Types
enum  | FaceColorMode {
 kNoColorMode, kObjectColor, kBackgroundColor, kMono,
 kTint, kDesaturate
 }
enum  | FaceModifier { kNoFaceModifiers = 0, kOpacity = 1, kSpecular = 2 }
enum  | LightingModel { kInvisible, kConstant, kPhong, kGooch }
enum  | LightingQuality { kNoLighting, kPerFaceLighting, kPerVertexLighting, kPerPixelLighting }
 Public Member Functions
AcGiFaceStyle (void)
AcGiFaceStyle (const AcGiFaceStyle &style)
ACRX_DECLARE_MEMBERS (AcGiFaceStyle)
virtual FaceColorMode  | faceColorMode (void) const
virtual unsigned long  | faceModifiers (void) const
virtual bool  | isFaceModifierFlagSet (FaceModifier flag) const
virtual LightingModel  | lightingModel (void) const
virtual LightingQuality  | lightingQuality (void) const
virtual const AcCmColor &  | monoColor (void) const
virtual AcCmColor &  | monoColor (void)
virtual double  | opacityLevel (void) const
virtual AcGiFaceStyle &  | operator= (const AcGiFaceStyle &style)
virtual bool  | operator== (const AcGiFaceStyle &style) const
virtual void  | set (const AcGiFaceStyle &style)
virtual void  | setFaceColorMode (FaceColorMode mode)
virtual void  | setFaceModifierFlag (FaceModifier flag, bool bEnable)
virtual void  | setFaceModifiers (unsigned long nModifiers)
virtual void  | setLightingModel (LightingModel lightingModel)
virtual void  | setLightingQuality (LightingQuality lightingQuality)
virtual void  | setMonoColor (const AcCmColor &color, bool bEnableMode)
virtual void  | setOpacityLevel (double nLevel, bool bEnableModifier)
virtual void  | setSpecularAmount (double nAmount, bool bEnableModifier)
virtual double  | specularAmount (void) const
virtual  | ~AcGiFaceStyle (void)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiFaceStyle::AcGiFaceStyle  |  ( |  void  |   | )
Warning
Not implemented!
 AcGiFaceStyle::AcGiFaceStyle  |  ( |  const AcGiFaceStyle &  |  style | )
Warning
Not implemented!
 virtual AcGiFaceStyle::~AcGiFaceStyle  |  ( |  void  |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual FaceColorMode AcGiFaceStyle::faceColorMode  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual unsigned long AcGiFaceStyle::faceModifiers  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcGiFaceStyle::isFaceModifierFlagSet  |  ( |  FaceModifier  |  flag | ) |   const
virtual
Warning
Not implemented!
 virtual LightingModel AcGiFaceStyle::lightingModel  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual LightingQuality AcGiFaceStyle::lightingQuality  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual const AcCmColor& AcGiFaceStyle::monoColor  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcCmColor& AcGiFaceStyle::monoColor  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 virtual double AcGiFaceStyle::opacityLevel  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcGiFaceStyle& AcGiFaceStyle::operator=  |  ( |  const AcGiFaceStyle &  |  style | )
virtual
Warning
Not implemented!
 virtual bool AcGiFaceStyle::operator==  |  ( |  const AcGiFaceStyle &  |  style | ) |   const
virtual
Warning
Not implemented!
 virtual void AcGiFaceStyle::set  |  ( |  const AcGiFaceStyle &  |  style | )
virtual
Warning
Not implemented!
 virtual void AcGiFaceStyle::setFaceColorMode  |  ( |  FaceColorMode  |  mode | )
virtual
Warning
Not implemented!
 virtual void AcGiFaceStyle::setFaceModifierFlag  |  ( |  FaceModifier  |  flag,
|  bool  |  bEnable
)
virtual
Warning
Not implemented!
 virtual void AcGiFaceStyle::setFaceModifiers  |  ( |  unsigned long  |  nModifiers | )
virtual
Warning
Not implemented!
 virtual void AcGiFaceStyle::setLightingModel  |  ( |  LightingModel  |  lightingModel | )
virtual
Warning
Not implemented!
 virtual void AcGiFaceStyle::setLightingQuality  |  ( |  LightingQuality  |  lightingQuality | )
virtual
Warning
Not implemented!
 virtual void AcGiFaceStyle::setMonoColor  |  ( |  const AcCmColor &  |  color,
|  bool  |  bEnableMode
)
virtual
Warning
Not implemented!
 virtual void AcGiFaceStyle::setOpacityLevel  |  ( |  double  |  nLevel,
|  bool  |  bEnableModifier
)
virtual
Warning
Not implemented!
 virtual void AcGiFaceStyle::setSpecularAmount  |  ( |  double  |  nAmount,
|  bool  |  bEnableModifier
)
virtual
Warning
Not implemented!
 virtual double AcGiFaceStyle::specularAmount  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acgivisualstyle.h