Public Member Functions | Protected Member Functions | Friends | List of all members
AcApDocManagerReactor Class Reference
AcAp Classes
  Inheritance diagram for AcApDocManagerReactor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcApDocManagerReactor)
 virtual void  | documentActivated (AcApDocument *pActivatedDoc)
 virtual void  | documentActivationModified (bool bActivation)
 virtual void  | documentBecameCurrent (AcApDocument *)
 virtual void  | documentCreateCanceled (AcApDocument *pDocCreateCancelled)
 virtual void  | documentCreated (AcApDocument *pDocCreating)
 virtual void  | documentCreateStarted (AcApDocument *pDocCreating)
 virtual void  | documentDestroyed (const ACHAR *fileName)
 virtual void  | documentLockModeChanged (AcApDocument *, AcAp::DocLockMode myPreviousMode, AcAp::DocLockMode myCurrentMode, AcAp::DocLockMode currentMode, const ACHAR *pGlobalCmdName)
 virtual void  | documentLockModeChangeVetoed (AcApDocument *, const ACHAR *pGlobalCmdName)
 virtual void  | documentLockModeWillChange (AcApDocument *, AcAp::DocLockMode myCurrentMode, AcAp::DocLockMode myNewMode, AcAp::DocLockMode currentMode, const ACHAR *pGlobalCmdName)
 virtual void  | documentToBeActivated (AcApDocument *pActivatingDoc)
 virtual void  | documentToBeDeactivated (AcApDocument *pDeActivatedDoc)
 virtual void  | documentToBeDestroyed (AcApDocument *pDocToDestroy)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 Acad::ErrorStatus  | veto ()
 Friends
 class  | AcApDocImpManager
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acdocman.h