Public Member Functions | Protected Member Functions | List of all members
AcGeNurbSurface Class Reference
AcGe Classes
  Inheritance diagram for AcGeNurbSurface:
 Public Member Functions
AcGeNurbSurface (int degreeU, int degreeV, int propsInU, int propsInV, int numControlPointsInU, int numControlPointsInV, const AcGePoint3d controlPoints[], const double weights[], const AcGeKnotVector &uKnots, const AcGeKnotVector &vKnots, const AcGeTol &tol=AcGeContext::gTol)
AcGeNurbSurface (const AcGeNurbSurface &nurb)
 void  | computeUIsoLine (double U, AcGeNurbCurve3d &isoline) const
 void  | computeVIsoLine (double V, AcGeNurbCurve3d &isoline) const
 int  | degreeInU () const
 int  | degreeInV () const
 void  | getControlPoints (AcGePoint3dArray &points) const
 void  | getDefinition (int &degreeU, int &degreeV, int &propsInU, int &propsInV, int &numControlPointsInU, int &numControlPointsInV, AcGePoint3dArray &controlPoints, AcGeDoubleArray &weights, AcGeKnotVector &uKnots, AcGeKnotVector &vKnots) const
 void  | getUKnots (AcGeKnotVector &uKnots) const
 void  | getVKnots (AcGeKnotVector &vKnots) const
 Adesk::Boolean  | getWeights (AcGeDoubleArray &weights) const
 Adesk::Boolean  | isPeriodicInU (double &) const
 Adesk::Boolean  | isPeriodicInV (double &) const
 Adesk::Boolean  | isRationalInU () const
 Adesk::Boolean  | isRationalInV () const
 int  | loc (int i, int j) const
 int  | numControlPointsInU () const
 int  | numControlPointsInV () const
 int  | numKnotsInU () const
 int  | numKnotsInV () const
 AcGeNurbSurface &  | operator= (const AcGeNurbSurface &nurb)
 AcGeNurbSurface &  | set (int degreeU, int degreeV, int propsInU, int propsInV, int numControlPointsInU, int numControlPointsInV, const AcGePoint3d controlPoints[], const double weights[], const AcGeKnotVector &uKnots, const AcGeKnotVector &vKnots, const AcGeTol &tol=AcGeContext::gTol)
 void  | setControlPoints (AcGePoint3dArray &points)
 void  | setdegreeInU (int)
 void  | setdegreeInV (int)
 void  | setnumControlPointsInU (int)
 void  | setnumControlPointsInV (int)
 void  | setsingularityInU (int)
 void  | setsingularityInV (int)
 void  | setUknots (AcGeKnotVector &uKnots)
 void  | setVknots (AcGeKnotVector &vKnots)
 void  | setWeights (AcGeDoubleArray &weights)
 int  | singularityInU () const
 int  | singularityInV () const
 Public Member Functions inherited from AcGeSurface
 AcGePoint3d  | closestPointTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param, int derivOrd, AcGeVector3dArray &derivatives) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param, int derivOrd, AcGeVector3dArray &derivatives, AcGeVector3d &normal) const
 void  | getClosestPointTo (const AcGePoint3d &pnt, AcGePointOnSurface &result, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getEnvelope (AcGeInterval &intrvlX, AcGeInterval &intrvlY) const
 Adesk::Boolean  | isClosedInU (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isClosedInV (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isNormalReversed () const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, AcGePoint2d &paramPoint, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeSurface &  | operator= (const AcGeSurface &otherSurface)
 AcGePoint2d  | paramOf (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeSurface &  | reverseNormal ()
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Protected Member Functions
 void  | calculateNURBSProperties ()
 Protected Member Functions inherited from AcGeSurface
AcGeSurface (const AcGeSurface &)
 Protected Member Functions inherited from AcGeEntity3d
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Additional Inherited Members
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
genurbsf.h