Public Member Functions | Public Attributes | Static Public Attributes | Friends | List of all members
AcGeScale2d Class Reference
AcGe Classes
 Public Member Functions
AcGeScale2d (const AcGeScale2d &src)
AcGeScale2d (double factor)
AcGeScale2d (double xFactor, double yFactor)
 AcGeScale2d &  | extractScale (const AcGeMatrix2d &mat)
 void  | getMatrix (AcGeMatrix2d &mat) const
 AcGeScale2d  | inverse () const
 AcGeScale2d &  | invert ()
 bool  | isEqualTo (const AcGeScale2d &scaleVec, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isProportional (const AcGeTol &tol=AcGeContext::gTol) const
operator AcGeMatrix2d () const
operator AcGeScale3d () const
 bool  | operator!= (const AcGeScale2d &sclVec) const
 AcGeScale2d  | operator* (const AcGeScale2d &sclVec) const
 AcGeScale2d  | operator* (double s) const
 AcGeScale2d &  | operator*= (const AcGeScale2d &scl)
 AcGeScale2d &  | operator*= (double s)
 bool  | operator== (const AcGeScale2d &sclVec) const
 double  | operator[] (unsigned int i) const
 double &  | operator[] (unsigned int i)
 AcGeScale2d &  | postMultBy (const AcGeScale2d &rightSide)
 AcGeScale2d &  | preMultBy (const AcGeScale2d &leftSide)
 AcGeScale2d &  | removeScale (AcGeMatrix2d &mat)
 AcGeScale2d &  | set (double sc0, double sc1)
 AcGeScale2d &  | setToProduct (const AcGeScale2d &sclVec1, const AcGeScale2d &sclVec2)
 AcGeScale2d &  | setToProduct (const AcGeScale2d &sclVec, double s)
 Public Attributes
 double  | sx
 double  | sy
 Static Public Attributes
 static const AcGeScale2d  | kIdentity
 Friends
 GE_DLLEXPIMPORT AcGeScale2d  | operator* (double, const AcGeScale2d &scl)
 The documentation for this class was generated from the following file:
gescl2d.h