Public Member Functions | List of all members
AcCmComplexColor Class Reference
AcCm Classes
  Inheritance diagram for AcCmComplexColor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcCmComplexColor)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 virtual Adesk::UInt8  | blue () const
 virtual Adesk::UInt32  | color () const
 virtual Adesk::UInt16  | colorIndex () const
 virtual
 AcCmEntityColor::ColorMethod  | colorMethod () const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *)
 virtual void  | decReference ()
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 virtual Acad::ErrorStatus  | getDescription (ACHAR *&desc) const
 virtual Acad::ErrorStatus  | getExplanation (ACHAR *&expl) const
 virtual Adesk::UInt8  | green () const
 virtual AcCmComplexColor *  | incReference ()
 virtual bool  | isByACI () const
 virtual bool  | isByBlock () const
 virtual bool  | isByColor () const
 virtual bool  | isByLayer () const
 virtual bool  | isByPen () const
 virtual bool  | isForeground () const
 virtual Adesk::UInt16  | penIndex () const
 virtual Adesk::UInt8  | red () const
 virtual Acad::ErrorStatus  | setBlue (Adesk::UInt8 blue)
 virtual Acad::ErrorStatus  | setColor (Adesk::UInt32 color)
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 colorIndex)
 virtual Acad::ErrorStatus  | setColorMethod (AcCmEntityColor::ColorMethod eColorMethod)
 virtual Acad::ErrorStatus  | setGreen (Adesk::UInt8 green)
 virtual Acad::ErrorStatus  | setPenIndex (Adesk::UInt16 penIndex)
 virtual Acad::ErrorStatus  | setRed (Adesk::UInt8 red)
 virtual Acad::ErrorStatus  | setRGB (Adesk::UInt8 red, Adesk::UInt8 green, Adesk::UInt8 blue)
 Public Member Functions inherited from AcDbXObject
ACRX_DECLARE_MEMBERS (AcDbXObject)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler) const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbmain.h