Public Types | Public Member Functions | List of all members
AcDbDxfFiler Class Reference
AcDb Classes
  Inheritance diagram for AcDbDxfFiler:
 Public Types
enum  | { kDfltPrec = -1, kMaxPrec = 16 }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbDxfFiler)
 virtual bool  | atEmbeddedObjectStart ()
 virtual bool  | atEndOfObject ()
 virtual bool  | atEOF ()
 virtual bool  | atExtendedData ()
 virtual bool  | atSubclassData (const ACHAR *)
 AcDbFilerController &  | controller () const
 virtual AcDbDatabase *  | database () const =0
 virtual Acad::ErrorStatus  | dwgVersion (AcDb::AcDbDwgVersion &, AcDb::MaintenanceReleaseVersion &) const
 virtual double  | elevation () const
 virtual const ACHAR *  | errorMessage () const
 virtual Acad::ErrorStatus  | filerStatus () const =0
 virtual AcDb::FilerType  | filerType () const =0
 virtual void  | haltAtClassBoundries (bool)
 virtual bool  | includesDefaultValues () const =0
 virtual bool  | isModifyingExistingObject () const
 virtual int  | precision () const
 virtual Acad::ErrorStatus  | pushBackItem ()
 Acad::ErrorStatus  | readItem (resbuf *pItem)
 virtual Acad::ErrorStatus  | readResBuf (resbuf *)
 virtual void  | resetFilerStatus ()=0
 virtual int  | rewindFiler ()=0
 virtual Acad::ErrorStatus  | setError (Acad::ErrorStatus, const ACHAR *,...)
 virtual Acad::ErrorStatus  | setError (const ACHAR *,...)
 virtual void  | setPrecision (int prec)
 virtual double  | thickness () const
 virtual Acad::ErrorStatus  | writeAcDbHandle (AcDb::DxfCode, const AcDbHandle &)=0
 virtual Acad::ErrorStatus  | writeBChunk (AcDb::DxfCode, const ads_binary &)=0
 virtual Acad::ErrorStatus  | writeBool (AcDb::DxfCode, bool)=0
 virtual Acad::ErrorStatus  | writeBoolean (AcDb::DxfCode, Adesk::Boolean)=0
 Acad::ErrorStatus  | writeChar (AcDb::DxfCode c, Adesk::Int8 n)
 virtual Acad::ErrorStatus  | writeDouble (AcDb::DxfCode, double, int=kDfltPrec)=0
 virtual Acad::ErrorStatus  | writeEmbeddedObjectStart ()
 virtual Acad::ErrorStatus  | writeInt16 (AcDb::DxfCode, Adesk::Int16)=0
 virtual Acad::ErrorStatus  | writeInt32 (AcDb::DxfCode, Adesk::Int32)=0
 virtual Acad::ErrorStatus  | writeInt64 (AcDb::DxfCode, Adesk::Int64)=0
 virtual Acad::ErrorStatus  | writeInt8 (AcDb::DxfCode, Adesk::Int8)=0
 Acad::ErrorStatus  | writeItem (const resbuf &pItem)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, const AcDbObjectId &)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, const ACHAR *)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, const ads_binary &)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, const AcDbHandle &)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, Adesk::Int64)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, Adesk::Int32)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, Adesk::Int16)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, Adesk::Int8)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, Adesk::UInt64)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, Adesk::UInt32)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, Adesk::UInt16)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, Adesk::UInt8)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, Adesk::Boolean)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, bool)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, double, int=kDfltPrec)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, const AcGePoint2d &, int=kDfltPrec)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, const AcGePoint3d &, int=kDfltPrec)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, const AcGeVector2d &, int=kDfltPrec)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, const AcGeVector3d &, int=kDfltPrec)
 Acad::ErrorStatus  | writeItem (AcDb::DxfCode, const AcGeScale3d &, int=kDfltPrec)
 virtual Acad::ErrorStatus  | writeObjectId (AcDb::DxfCode, const AcDbObjectId &)=0
 virtual Acad::ErrorStatus  | writePoint2d (AcDb::DxfCode, const AcGePoint2d &, int=kDfltPrec)=0
 virtual Acad::ErrorStatus  | writePoint3d (AcDb::DxfCode, const AcGePoint3d &, int=kDfltPrec)=0
 virtual Acad::ErrorStatus  | writeResBuf (const resbuf &)
 virtual Acad::ErrorStatus  | writeScale3d (AcDb::DxfCode, const AcGeScale3d &, int=kDfltPrec)=0
 virtual Acad::ErrorStatus  | writeString (AcDb::DxfCode, const ACHAR *)=0
 virtual Acad::ErrorStatus  | writeString (AcDb::DxfCode, const AcString &)=0
 virtual Acad::ErrorStatus  | writeUInt16 (AcDb::DxfCode, Adesk::UInt16)=0
 virtual Acad::ErrorStatus  | writeUInt32 (AcDb::DxfCode, Adesk::UInt32)=0
 virtual Acad::ErrorStatus  | writeUInt64 (AcDb::DxfCode, Adesk::UInt64)=0
 virtual Acad::ErrorStatus  | writeUInt8 (AcDb::DxfCode, Adesk::UInt8)=0
 virtual Acad::ErrorStatus  | writeVector2d (AcDb::DxfCode, const AcGeVector2d &, int=kDfltPrec)=0
 virtual Acad::ErrorStatus  | writeVector3d (AcDb::DxfCode, const AcGeVector3d &, int=kDfltPrec)=0
 virtual Acad::ErrorStatus  | writeXDataStart ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbfiler.h