Public Member Functions | List of all members
AcGeCurveCurveInt2d Class Reference
AcGe Classes
  Inheritance diagram for AcGeCurveCurveInt2d:
 Public Member Functions
AcGeCurveCurveInt2d (const AcGeCurve2d &curve1, const AcGeCurve2d &curve2, const AcGeTol &tol=AcGeContext::gTol)
AcGeCurveCurveInt2d (const AcGeCurve2d &curve1, const AcGeCurve2d &curve2, const AcGeInterval &range1, const AcGeInterval &range2, const AcGeTol &tol=AcGeContext::gTol)
AcGeCurveCurveInt2d (const AcGeCurveCurveInt2d &src)
 void  | changeCurveOrder ()
 const AcGeCurve2d *  | curve1 () const
 const AcGeCurve2d *  | curve2 () const
 void  | getIntConfigs (int intNum, AcGe::AcGeXConfig &config1wrt2, AcGe::AcGeXConfig &config2wrt1) const
 void  | getIntParams (int intNum, double &param1, double &param2) const
 void  | getIntRanges (AcGeInterval &range1, AcGeInterval &range2) const
 void  | getOverlapRanges (int overlapNum, AcGeInterval &range1, AcGeInterval &range2) const
 void  | getPointOnCurve1 (int intNum, AcGePointOnCurve2d &) const
 void  | getPointOnCurve2 (int intNum, AcGePointOnCurve2d &) const
 AcGePoint2d  | intPoint (int intNum) const
 double  | intPointTol (int intNum) const
 Adesk::Boolean  | isTangential (int intNum) const
 Adesk::Boolean  | isTransversal (int intNum) const
 int  | numIntPoints () const
 AcGeCurveCurveInt2d &  | operator= (const AcGeCurveCurveInt2d &src)
 AcGeCurveCurveInt2d &  | orderWrt1 ()
 AcGeCurveCurveInt2d &  | orderWrt2 ()
 int  | overlapCount () const
 Adesk::Boolean  | overlapDirection () const
 AcGeCurveCurveInt2d &  | set (const AcGeCurve2d &curve1, const AcGeCurve2d &curve2, const AcGeTol &tol=AcGeContext::gTol)
 AcGeCurveCurveInt2d &  | set (const AcGeCurve2d &curve1, const AcGeCurve2d &curve2, const AcGeInterval &range1, const AcGeInterval &range2, const AcGeTol &tol=AcGeContext::gTol)
 AcGeTol  | tolerance () const
 Public Member Functions inherited from AcGeEntity2d
 AcGeEntity2d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity2d &entity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity2d &  | mirror (const AcGeLine2d &line)
 Adesk::Boolean  | operator!= (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | operator= (const AcGeEntity2d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | rotateBy (double angle, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | scaleBy (double scaleFactor, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | transformBy (const AcGeMatrix2d &xfm)
 AcGeEntity2d &  | translateBy (const AcGeVector2d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeEntity2d
AcGeEntity2d (const AcGeEntity2d &)
AcGeEntity2d (AcGeImpEntity3d &, int)
AcGeEntity2d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 Protected Attributes inherited from AcGeEntity2d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
gecint2d.h