Public Member Functions | Protected Attributes | Friends | List of all members
AcFdFieldEngine Class Reference
AcFd Classes
  Inheritance diagram for AcFdFieldEngine:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcFdFieldEngine)
 ACDB_PORT int  | evaluatorLoaderCount (void) const
 ACDB_PORT AcFdFieldEvaluator *  | findEvaluator (AcDbField *pField, const ACHAR *&pszEvalId)
 ACDB_PORT AcFdFieldEvaluator *  | getEvaluator (const ACHAR *pszEvalId)
 ACDB_PORT
 AcFdFieldEvaluatorLoader *  | getEvaluatorLoader (int iIndex)
 ACDB_PORT Acad::ErrorStatus  | registerEvaluatorLoader (AcFdFieldEvaluatorLoader *pLoader)
 ACDB_PORT Acad::ErrorStatus  | unregisterEvaluatorLoader (AcFdFieldEvaluatorLoader *pLoader)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Attributes
 void *  | mpImpObj
 Friends
 class  | AcFdSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
AcField.h