Public Member Functions | List of all members
AcGiTextStyle Class Reference
AcGi Classes
  Inheritance diagram for AcGiTextStyle:
 Public Member Functions
AcGiTextStyle (const ACHAR *fontName, const ACHAR *bigFontName, const double textSize, const double xScale, const double obliqueAngle, const double trPercent, const Adesk::Boolean isBackward, const Adesk::Boolean isUpsideDown, const Adesk::Boolean isVertical, const Adesk::Boolean isOverlined, const Adesk::Boolean isUnderlined, const Adesk::Boolean isStrikethrough=false, const ACHAR *styleName=NULL)
ACRX_DECLARE_MEMBERS (AcGiTextStyle)
 virtual const ACHAR *  | bigFontFileName () const
 virtual AcGePoint2d  | extents (const ACHAR *pStr, const Adesk::Boolean penups, const int len, const Adesk::Boolean raw, AcGiWorldDraw *ctxt=NULL) const
 virtual Acad::ErrorStatus  | extentsBox (const ACHAR *pStr, const Adesk::Boolean penups, const int len, const Adesk::Boolean raw, AcGePoint2d &extMin, AcGePoint2d &extMax, AcGiWorldDraw *ctxt=NULL) const
 virtual const ACHAR *  | fileName () const
 virtual Acad::ErrorStatus  | font (ACHAR *&pTypeface, Adesk::Boolean &bold, Adesk::Boolean &italic, int &charset, int &pitchAndFamily) const
 virtual Adesk::Boolean  | isBackward () const
 virtual Adesk::Boolean  | isOverlined () const
 virtual Adesk::Boolean  | isStrikethrough () const
 virtual Adesk::Boolean  | isUnderlined () const
 virtual Adesk::Boolean  | isUpsideDown () const
 virtual Adesk::Boolean  | isVertical () const
 virtual int  | loadStyleRec () const
 virtual double  | obliquingAngle () const
 virtual bool  | preLoaded () const
 virtual void  | setBackward (const Adesk::Boolean isBackward)
 virtual void  | setBigFontFileName (const ACHAR *bigFontFileName)
 virtual void  | setFileName (const ACHAR *fontName)
 virtual Acad::ErrorStatus  | setFont (const ACHAR *pTypeface, Adesk::Boolean bold, Adesk::Boolean italic, int charset, int pitchAndFamily)
 virtual void  | setObliquingAngle (const double obliquingAngle)
 virtual void  | setOverlined (const Adesk::Boolean isOverlined)
 virtual void  | setPreLoaded (bool)
 virtual Acad::ErrorStatus  | setStyleName (const ACHAR *)
 virtual void  | setTextSize (const double size)
 virtual void  | setTrackingPercent (const double trPercent)
 virtual void  | setTrackKerning (double trackPercent) const
 virtual void  | setUnderlined (const Adesk::Boolean isUnderlined)
 virtual void  | setUpsideDown (const Adesk::Boolean isUpsideDown)
 virtual void  | setVertical (const Adesk::Boolean isVertical)
 virtual void  | setXScale (const double xScale)
 virtual const ACHAR *  | styleName () const
 virtual double  | textSize () const
 virtual double  | trackingPercent () const
 virtual double  | xScale () const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acgi.h