Public Member Functions | List of all members
AcGeClipBoundary2d Class Reference
AcGe Classes
  Inheritance diagram for AcGeClipBoundary2d:
 Public Member Functions
AcGeClipBoundary2d (const AcGePoint2d &cornerA, const AcGePoint2d &cornerB)
AcGeClipBoundary2d (const AcGePoint2dArray &clipBoundary)
AcGeClipBoundary2d (const AcGeClipBoundary2d &src)
 AcGe::ClipError  | clipPolygon (const AcGePoint2dArray &rawVertices, AcGePoint2dArray &clippedVertices, AcGe::ClipCondition &clipCondition, AcGeIntArray *pClippedSegmentSourceLabel=0) const
 AcGe::ClipError  | clipPolyline (const AcGePoint2dArray &rawVertices, AcGePoint2dArray &clippedVertices, AcGe::ClipCondition &clipCondition, AcGeIntArray *pClippedSegmentSourceLabel=0) const
 AcGeClipBoundary2d &  | operator= (const AcGeClipBoundary2d &crvInt)
 AcGe::ClipError  | set (const AcGePoint2d &cornerA, const AcGePoint2d &cornerB)
 AcGe::ClipError  | set (const AcGePoint2dArray &clipBoundary)
 Public Member Functions inherited from AcGeEntity2d
 AcGeEntity2d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity2d &entity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity2d &  | mirror (const AcGeLine2d &line)
 Adesk::Boolean  | operator!= (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | operator= (const AcGeEntity2d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | rotateBy (double angle, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | scaleBy (double scaleFactor, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | transformBy (const AcGeMatrix2d &xfm)
 AcGeEntity2d &  | translateBy (const AcGeVector2d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeEntity2d
AcGeEntity2d (const AcGeEntity2d &)
AcGeEntity2d (AcGeImpEntity3d &, int)
AcGeEntity2d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 Protected Attributes inherited from AcGeEntity2d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
geclip2d.h