Public Types | Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
AcDbHostApplicationServices Class Reference
AcDb Classes
  Inheritance diagram for AcDbHostApplicationServices:
 Public Types
enum  | FindFileHint {
 kDefault = 0, kFontFile, kCompiledShapeFile, kTrueTypeFontFile,
 kEmbeddedImageFile, kXRefDrawing, kPatternFile, kARXApplication,
 kFontMapFile, kUnderlayFile
 }
enum  | ModelerFlavor { kModelerFull = 0, kModelerRegionsOnly = 1, kModelerObjectsOnly = 2 }
enum  | PasswordOptions { kPasswordOptionDefault = 0, kPasswordOptionUpperCase = 1, kPasswordOptionIsExternalReference = 2 }
enum  | RemapFileContext { kDrawingOpen, kXrefResolution, kRasterResolution, kAfterXrefResolution }
 Public Member Functions
 virtual Adesk::Boolean  | _entToWorldTransform (double normal[3], flagmat *tran)
 void *  | acadInternalGetvar (const ACHAR *name)
 virtual AcadInternalServices *  | acadInternalServices ()
AcDbHostApplicationServices (int createGlobals=1)
ACRX_DECLARE_MEMBERS (AcDbHostApplicationServices)
 virtual void  | alert (const ACHAR *string) const
 virtual void  | auditPrintReport (AcDbAuditInfo *pAuditInfo, const ACHAR *line, int both) const
 virtual bool  | cacheSymbolIndices () const
 virtual const ACHAR *  | companyName ()
 virtual AcDbGlobals *  | createWorkingGlobals ()
 virtual AcDbUndoController *  | defaultUndoController ()
 virtual void  | displayChar (ACHAR c) const
 virtual void  | displayString (const ACHAR *string, int count) const
 virtual Adesk::Boolean  | doFullCRCCheck ()
 virtual void  | drawOleOwnerDrawItem (COleClientItem *pItem, Adesk::LongPtr hdc, long left, long top, long right, long bottom)
 virtual void  | enableMessageDisplay (Adesk::Boolean)
 virtual void  | fatalError (const ACHAR *format,...)
 virtual Acad::ErrorStatus  | findFile (ACHAR *pcFullPathOut, int nBufferLength, const ACHAR *pcFilename, AcDbDatabase *pDb=NULL, AcDbHostApplicationServices::FindFileHint hint=kDefault)=0
 virtual ACHAR *  | getAlternateFontName () const
 virtual const ACHAR *  | getColorBookLocation () const
 virtual void  | getDefaultPlotCfgInfo (ACHAR *plotDeviceName, ACHAR *plotStyleName)
 virtual const ACHAR *  | getEnv (const ACHAR *var)
 virtual ACHAR *  | getFontMapFileName () const
 virtual Acad::ErrorStatus  | getLocalRootFolder (const ACHAR *&folder)
 virtual ModelerFlavor  | getModelerFlavor () const
 virtual Acad::ErrorStatus  | getNewOleClientItem (COleClientItem *&pItem)
virtual bool  | getPassword (const ACHAR *dwgName, PasswordOptions options, wchar_t *password, const size_t bufSize)
 AcPwdCache *  | getPasswordCache () const
 virtual Acad::ErrorStatus  | getRegisteredFileMapClients (AcArray< const ACHAR * > &clients)
 virtual Acad::ErrorStatus  | getRegisteredSelectFileClients (AcArray< const ACHAR * > &clients)
 virtual LCID  | getRegistryProductLCID ()
 virtual const ACHAR *  | getRegistryProductRootKey ()
 virtual Acad::ErrorStatus  | getRemoteFile (const ACHAR *pszURL, ACHAR *pszLocalFile, Adesk::Boolean bIgnoreCache=Adesk::kFalse) const
 virtual Acad::ErrorStatus  | getRoamableRootFolder (const ACHAR *&folder)
 virtual Adesk::Boolean  | getSubstituteFont (ACHAR **pFileName, ACHAR *prompt, int type, int fontAlt)
 code_page_id  | getSystemCodePage () const
 virtual unsigned int  | getTempPath (Adesk::UInt32 lBufferSize, ACHAR *pcBuffer)
 virtual Adesk::Boolean  | isRemoteFile (const ACHAR *pszLocalFile, ACHAR *pszURL) const
 virtual Adesk::Boolean  | isURL (const ACHAR *pszURL) const
 virtual Adesk::Boolean  | launchBrowserDialog (ACHAR *pszSelectedURL, const ACHAR *pszDialogTitle, const ACHAR *pszOpenButtonCaption, const ACHAR *pszStartURL, const ACHAR *pszRegistryRootKey=0, Adesk::Boolean bOpenButtonAlwaysEnabled=Adesk::kFalse) const
 virtual AcDbLayoutManager *  | layoutManager () const
 virtual bool  | loadApp (const ACHAR *appName, AcadApp::LoadReasons why, bool printit, bool asCmd)
 virtual Acad::ErrorStatus  | mapFile (ACHAR *&newName, const ACHAR *filename, int context, void *pReserved)
 virtual void  | missingCryptoProviderMsg ()
 virtual ClipBoundaryArray *  | newClipBoundaryArray ()
 virtual
 AcDbAbstractClipBoundaryDefinition *  | newClipBoundaryPolygonal ()
 virtual
 AcDbAbstractClipBoundaryDefinition *  | newClipBoundaryRectangular ()
 virtual
 AcDbHostApplicationProgressMeter *  | newProgressMeter ()
 virtual AcDbPlotSettingsValidator *  | plotSettingsValidator () const
 virtual const ACHAR *  | primaryClientForMapFileCallback ()
 virtual const ACHAR *  | primaryClientForSelectFileCallback ()
 virtual const ProdIdCode  | prodcode ()
 virtual const ACHAR *  | product ()
 virtual const ACHAR *  | program ()
 virtual Acad::ErrorStatus  | putRemoteFile (const ACHAR *pszURL, const ACHAR *pszLocalFile) const
 virtual Adesk::Boolean  | readyToDisplayMessages ()
 virtual Acad::ErrorStatus  | registerMapFileCallback (const ACHAR *appName, REMAPPROC proc, bool unRegister=false, bool asPrimary=false)
 virtual Acad::ErrorStatus  | registerMapFileNotification (const ACHAR *appName, MAPFILENOTIFYPROC, bool unRegister=false)
 virtual Acad::ErrorStatus  | registerSelectFileCallback (const ACHAR *appName, SELECTFILEPROC proc, bool unRegister=false, bool asPrimary=false)
 virtual const ACHAR *  | releaseMajorMinorString ()
 virtual int  | releaseMajorVersion ()
 virtual int  | releaseMinorVersion ()
 virtual void  | reportUnhandledArxException (const _EXCEPTION_POINTERS *pExcPtrs, const ACHAR *pAppName)
 virtual Acad::ErrorStatus  | selectFile (short *userCancel, ACHAR *&chosenPath, void *h, const int nFlags, const ACHAR *prompt, const ACHAR *dir, const ACHAR *name, const ACHAR *type, int *pnChoice, bool *pbReadOnly, const ACHAR *pszWSTags, void *pReserved)
 virtual Acad::ErrorStatus  | serializeOleItem (COleClientItem *pItem, CArchive *)
 void  | setDefaultUndoController (AcDbUndoController *pUndoCtrl)
 virtual bool  | setMapFlag (bool setIt)
 void  | setSystemCodePage (code_page_id)
 void  | setWorkingAppSysvars (AcDbAppSystemVariables *pSysvars)
 void  | setWorkingDatabase (AcDbDatabase *pDatabase)
 void  | setWorkingGlobals (AcDbGlobals *pGlobals)
 void  | setWorkingProgressMeter (AcDbHostApplicationProgressMeter *pNewMeter)
 void  | setWorkingTransactionManager (AcDbTransactionManager *pTM)
 virtual Acad::ErrorStatus  | signingComplete (Acad::ErrorStatus es, const ACHAR *msg, bool *result)
 virtual bool  | supportsMultiRedo () const
 virtual void  | terminateScript ()
 virtual void  | usedPasswordFromCacheMsg (const ACHAR *dwgName)
 virtual Adesk::Boolean  | userBreak (bool updCtrlsWhenEnteringIdle=true) const
 virtual const ACHAR *  | versionString ()
 AcDbAppSystemVariables *  | workingAppSysvars () const
 AcDbDatabase *  | workingDatabase () const
 AcDbGlobals *  | workingGlobals () const
 virtual AcDbTransactionManager *  | workingTransactionManager ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 void  | acadInternalSetvar (const ACHAR *name, void *var)
 Acad::ErrorStatus  | mapInetStatusToAcadStatus (const AcadInet::Status status) const
 Protected Attributes
 void *  | mp_sessionVars
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Member Function Documentation
 virtual bool AcDbHostApplicationServices::getPassword  |  ( |  const ACHAR *  |  dwgName,
|  PasswordOptions  |  options,
|  wchar_t *  |  password,
|  const size_t  |  bufSize
)
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbapserv.h