Public Types | Public Member Functions | List of all members
AcGiShadowParameters Class Reference
AcGi Classes
  Inheritance diagram for AcGiShadowParameters:
 Public Types
enum  | ShadowType { kShadowsRayTraced = 0, kShadowMaps, kAreaSampled }
 Public Member Functions
AcGiShadowParameters ()
ACRX_DECLARE_MEMBERS (AcGiShadowParameters)
bool  | operator== (const AcGiShadowParameters &params) const
virtual bool  | setShadowMapSize (Adesk::UInt16 sz)
virtual bool  | setShadowMapSoftness (Adesk::UInt8 soft)
virtual void  | setShadowsOn (bool on)
virtual void  | setShadowType (ShadowType typ)
virtual Adesk::UInt16  | shadowMapSize () const
virtual Adesk::UInt8  | shadowMapSoftness () const
virtual bool  | shadowsOn () const
virtual ShadowType  | shadowType () const
virtual  | ~AcGiShadowParameters ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiShadowParameters::AcGiShadowParameters  |  ( |   | )
Warning
Not implemented!
 virtual AcGiShadowParameters::~AcGiShadowParameters  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 bool AcGiShadowParameters::operator==  |  ( |  const AcGiShadowParameters &  |  params | ) |   const
Warning
Not implemented!
 virtual bool AcGiShadowParameters::setShadowMapSize  |  ( |  Adesk::UInt16  |  sz | )
virtual
Warning
Not implemented!
 virtual bool AcGiShadowParameters::setShadowMapSoftness  |  ( |  Adesk::UInt8  |  soft | )
virtual
Warning
Not implemented!
 virtual void AcGiShadowParameters::setShadowsOn  |  ( |  bool  |  on | )
virtual
Warning
Not implemented!
 virtual void AcGiShadowParameters::setShadowType  |  ( |  ShadowType  |  typ | )
virtual
Warning
Not implemented!
 virtual Adesk::UInt16 AcGiShadowParameters::shadowMapSize  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual Adesk::UInt8 AcGiShadowParameters::shadowMapSoftness  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcGiShadowParameters::shadowsOn  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual ShadowType AcGiShadowParameters::shadowType  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcGiLightTraits.h