Public Member Functions | List of all members
AcDbObjectContextInterface Class Reference
AcDb Classes
  Inheritance diagram for AcDbObjectContextInterface:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbObjectContextInterface)
 virtual Acad::ErrorStatus  | addContext (AcDbObject *pObject, const AcDbObjectContext &context) const =0
 virtual bool  | hasContext (const AcDbObject *pObject, const AcDbObjectContext &context) const =0
 virtual Acad::ErrorStatus  | removeContext (AcDbObject *pObject, const AcDbObjectContext &context) const =0
 virtual bool  | supportsCollection (const AcDbObject *pObject, const AcString &collectionName) const =0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbObjectContextInterface.h