Public Types | Public Member Functions | List of all members
AcDbAbstractViewTableRecord Class Reference
AcDb Classes
  Inheritance diagram for AcDbAbstractViewTableRecord:
 Public Types
enum  | RenderMode {
 k2DOptimized, kWireframe, kHiddenLine, kFlatShaded,
 kGouraudShaded, kFlatShadedWithWireframe, kGouraudShadedWithWireframe
 }
 Public Types inherited from AcDbSymbolTableRecord
 typedef AcDbSymbolTable  | TableType
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbAbstractViewTableRecord)
AcCmColor  | ambientLightColor () const
 double  | backClipDistance () const
 bool  | backClipEnabled () const
const AcDbObjectId &  | background () const
AcDbObjectId &  | background ()
double  | brightness () const
 AcGePoint2d  | centerPoint () const
double  | contrast () const
AcGiViewportTraits::DefaultLightingType  | defaultLightingType () const
 double  | elevation () const
 bool  | frontClipAtEye () const
 double  | frontClipDistance () const
 bool  | frontClipEnabled () const
 Acad::ErrorStatus  | getUcs (AcGePoint3d &origin, AcGeVector3d &xAxis, AcGeVector3d &yAxis) const
 double  | height () const
bool  | isDefaultLightingOn () const
 bool  | isUcsOrthographic (AcDb::OrthographicView &view) const
 bool  | isViewOrthographic (AcDb::OrthographicView &view) const
 double  | lensLength () const
 bool  | perspectiveEnabled () const
 RenderMode  | renderMode () const
Acad::ErrorStatus  | setAmbientLightColor (const AcCmColor &clr)
 void  | setBackClipDistance (double distance)
 void  | setBackClipEnabled (bool enabled)
Acad::ErrorStatus  | setBackground (const AcDbObjectId &backgroundId)
Acad::ErrorStatus  | setBrightness (double)
 void  | setCenterPoint (const AcGePoint2d &)
Acad::ErrorStatus  | setContrast (double)
Acad::ErrorStatus  | setDefaultLightingOn (bool on)
Acad::ErrorStatus  | setDefaultLightingType (AcGiViewportTraits::DefaultLightingType typ)
 Acad::ErrorStatus  | setElevation (double elev)
 void  | setFrontClipAtEye (bool atEye)
 void  | setFrontClipDistance (double distance)
 void  | setFrontClipEnabled (bool enabled)
 void  | setHeight (double height)
 void  | setLensLength (double length)
 void  | setPerspectiveEnabled (bool enabled)
 void  | setRenderMode (RenderMode mode)
Acad::ErrorStatus  | setSun (AcDbObjectId &retId, AcDbObject *pSun)
 void  | setTarget (const AcGePoint3d &target)
Acad::ErrorStatus  | setToneOperatorParameters (const AcGiToneOperatorParameters &params)
 Acad::ErrorStatus  | setUcs (const AcGePoint3d &origin, const AcGeVector3d &xAxis, const AcGeVector3d &yAxis)
 Acad::ErrorStatus  | setUcs (AcDb::OrthographicView view)
 Acad::ErrorStatus  | setUcs (const AcDbObjectId &ucsId)
 Acad::ErrorStatus  | setUcsToWorld ()
 void  | setViewDirection (const AcGeVector3d &viewDirection)
 Acad::ErrorStatus  | setViewDirection (AcDb::OrthographicView view)
 void  | setViewTwist (double angle)
Acad::ErrorStatus  | setVisualStyle (const AcDbObjectId &visualStyleId)
 void  | setWidth (double width)
 AcDbObjectId  | sunId () const
 AcGePoint3d  | target () const
Acad::ErrorStatus  | toneOperatorParameters (AcGiToneOperatorParameters &params) const
 AcDbObjectId  | ucsName () const
 AcGeVector3d  | viewDirection () const
 double  | viewTwist () const
AcDbObjectId  | visualStyle () const
 double  | width () const
 Public Member Functions inherited from AcDbSymbolTableRecord
ACDB_DECLARE_MEMBERS (AcDbSymbolTableRecord)
 Acad::ErrorStatus  | getName (ACHAR *&pName) const
 Acad::ErrorStatus  | getName (AcString &sName) const
 Acad::ErrorStatus  | getName (const ACHAR *&pName) const
 bool  | isDependent () const
 bool  | isResolved () const
 Acad::ErrorStatus  | setName (const ACHAR *pName)
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual AcGsNode *  | gsNode () const
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 virtual void  | setGsNode (AcGsNode *pNode)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual void  | viewportDraw (AcGiViewportDraw *pVd)
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Member Function Documentation
 AcCmColor AcDbAbstractViewTableRecord::ambientLightColor  |  ( |   | ) |   const
Warning
Not implemented!
 const AcDbObjectId& AcDbAbstractViewTableRecord::background  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId& AcDbAbstractViewTableRecord::background  |  ( |   | )
Warning
Not implemented!
 double AcDbAbstractViewTableRecord::brightness  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbAbstractViewTableRecord::contrast  |  ( |   | ) |   const
Warning
Not implemented!
 AcGiViewportTraits::DefaultLightingType AcDbAbstractViewTableRecord::defaultLightingType  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbAbstractViewTableRecord::isDefaultLightingOn  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbAbstractViewTableRecord::setAmbientLightColor  |  ( |  const AcCmColor &  |  clr | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAbstractViewTableRecord::setBackground  |  ( |  const AcDbObjectId &  |  backgroundId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAbstractViewTableRecord::setBrightness  |  ( |  double  |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAbstractViewTableRecord::setContrast  |  ( |  double  |   | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAbstractViewTableRecord::setDefaultLightingOn  |  ( |  bool  |  on | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAbstractViewTableRecord::setDefaultLightingType  |  ( |  AcGiViewportTraits::DefaultLightingType  |  typ | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAbstractViewTableRecord::setSun  |  ( |  AcDbObjectId &  |  retId,
|  AcDbObject *  |  pSun
)
Warning
Not implemented!
Reimplemented in AcDbViewTableRecord.
 Acad::ErrorStatus AcDbAbstractViewTableRecord::setToneOperatorParameters  |  ( |  const AcGiToneOperatorParameters &  |  params | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAbstractViewTableRecord::setVisualStyle  |  ( |  const AcDbObjectId &  |  visualStyleId | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbAbstractViewTableRecord::toneOperatorParameters  |  ( |  AcGiToneOperatorParameters &  |  params | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbAbstractViewTableRecord::visualStyle  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbsymtb.h