Public Member Functions | Protected Member Functions | List of all members
AcGeSplineEnt2d Class Reference
AcGe Classes
  Inheritance diagram for AcGeSplineEnt2d:
 Public Member Functions
 int  | continuityAtKnot (int idx, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint2d  | controlPointAt (int idx) const
 int  | degree () const
 double  | endParam () const
 AcGePoint2d  | endPoint () const
 Adesk::Boolean  | hasFitData () const
 Adesk::Boolean  | isRational () const
 double  | knotAt (int idx) const
 const AcGeKnotVector &  | knots () const
 int  | numControlPoints () const
 int  | numKnots () const
 AcGeSplineEnt2d &  | operator= (const AcGeSplineEnt2d &spline)
 int  | order () const
 AcGeSplineEnt2d &  | setControlPointAt (int idx, const AcGePoint2d &pnt)
 AcGeSplineEnt2d &  | setKnotAt (int idx, double val)
 double  | startParam () const
 AcGePoint2d  | startPoint () const
 Public Member Functions inherited from AcGeCurve2d
 Adesk::Boolean  | area (double startParam, double endParam, double &value, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeBoundBlock2d  | boundBlock () const
 AcGeBoundBlock2d  | boundBlock (const AcGeInterval &range) const
 AcGePoint2d  | closestPointTo (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint2d  | closestPointTo (const AcGeCurve2d &curve2d, AcGePoint2d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGePoint2d &pnt, const AcGeTol &=AcGeContext::gTol) const
 double  | distanceTo (const AcGeCurve2d &, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint2d  | evalPoint (double param) const
 AcGePoint2d  | evalPoint (double param, int numDeriv, AcGeVector2dArray &derivArray) const
 Adesk::Boolean  | explode (AcGeVoidPointerArray &explodedCurves, AcGeIntArray &newExplodedCurve, const AcGeInterval *intrvl=NULL) const
 void  | getClosestPointTo (const AcGePoint2d &pnt, AcGePointOnCurve2d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getClosestPointTo (const AcGeCurve2d &curve2d, AcGePointOnCurve2d &pntOnThisCrv, AcGePointOnCurve2d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getInterval (AcGeInterval &intrvl) const
 void  | getInterval (AcGeInterval &intrvl, AcGePoint2d &start, AcGePoint2d &end) const
 void  | getLocalClosestPoints (const AcGePoint2d &point, AcGePointOnCurve2d &approxPnt, const AcGeInterval *nbhd=0, const AcGeTol &=AcGeContext::gTol) const
 void  | getLocalClosestPoints (const AcGeCurve2d &otherCurve, AcGePointOnCurve2d &approxPntOnThisCrv, AcGePointOnCurve2d &approxPntOnOtherCrv, const AcGeInterval *nbhd1=0, const AcGeInterval *nbhd2=0, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | getNormalPoint (const AcGePoint2d &pnt, AcGePointOnCurve2d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getSamplePoints (double fromParam, double toParam, double approxEps, AcGePoint2dArray &pointArray, AcGeDoubleArray &paramArray) const
 void  | getSamplePoints (int numSample, AcGePoint2dArray &) const
 void  | getSplitCurves (double param, AcGeCurve2d *&piece1, AcGeCurve2d *&piece2) const
 void  | getTrimmedOffset (double distance, AcGeVoidPointerArray &offsetCurveList, AcGe::OffsetCrvExtType extensionType=AcGe::kFillet, const AcGeTol &=AcGeContext::gTol) const
 Adesk::Boolean  | hasEndPoint (AcGePoint2d &endPoint) const
 Adesk::Boolean  | hasStartPoint (AcGePoint2d &startPoint) const
 Adesk::Boolean  | isClosed (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isDegenerate (AcGe::EntityId &degenerateType, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isDegenerate (AcGeEntity2d *&pConvertedEntity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isLinear (AcGeLine2d &line, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint2d &pnt, double &param, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (double param, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isPeriodic (double &period) const
 double  | length (double fromParam, double toParam, double tol=AcGeContext::gTol.equalPoint()) const
 AcGeCurve2d &  | operator= (const AcGeCurve2d &curve)
 AcGeBoundBlock2d  | orthoBoundBlock () const
 AcGeBoundBlock2d  | orthoBoundBlock (const AcGeInterval &range) const
 double  | paramAtLength (double datumParam, double length, Adesk::Boolean posParamDir=Adesk::kTrue, double tol=AcGeContext::gTol.equalPoint()) const
 double  | paramOf (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeCurve2d &  | reverseParam ()
 AcGeCurve2d &  | setInterval ()
 Adesk::Boolean  | setInterval (const AcGeInterval &intrvl)
 Public Member Functions inherited from AcGeEntity2d
 AcGeEntity2d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity2d &entity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 AcGeEntity2d &  | mirror (const AcGeLine2d &line)
 Adesk::Boolean  | operator!= (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | operator= (const AcGeEntity2d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | rotateBy (double angle, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | scaleBy (double scaleFactor, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | transformBy (const AcGeMatrix2d &xfm)
 AcGeEntity2d &  | translateBy (const AcGeVector2d &translateVec)
 AcGe::EntityId  | type () const
 Protected Member Functions
AcGeSplineEnt2d (const AcGeSplineEnt2d &)
 Protected Member Functions inherited from AcGeCurve2d
AcGeCurve2d (const AcGeCurve2d &)
 Protected Member Functions inherited from AcGeEntity2d
AcGeEntity2d (const AcGeEntity2d &)
AcGeEntity2d (AcGeImpEntity3d &, int)
AcGeEntity2d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 Additional Inherited Members
 Protected Attributes inherited from AcGeEntity2d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
gesent2d.h