Public Member Functions | List of all members
AcGiLinetypeEngine Class Reference
AcGi Classes
  Inheritance diagram for AcGiLinetypeEngine:
 Public Member Functions
AcGiLinetypeEngine ()
ACRX_DECLARE_MEMBERS (AcGiLinetypeEngine)
virtual Acad::ErrorStatus  | tessellate (bool bIsArc, bool bIsCircle, const Adesk::UInt32 nPoints, const AcGePoint3d *pVertexList, AcGiWorldDraw *pWorldDraw, const AcDbObjectId linetypeId, double linetypeScale, const AcGeVector3d *pNormal)
virtual Acad::ErrorStatus  | tessellate (bool bIsArc, bool bIsCircle, const Adesk::UInt32 nPoints, const AcGePoint3d *pVertexList, AcGiViewportDraw *pViewportDraw, const AcDbObjectId linetypeId, double linetypeScale, const AcGeVector3d *pNormal)
virtual Acad::ErrorStatus  | tessellate (const AcGeCircArc3d &arcSeg, const AcGeMatrix3d &ecsMat, double startWidth, double endWidth, AcGiCommonDraw *pDraw, const AcDbObjectId linetypeId, double linetypeScale, double thick)
virtual Acad::ErrorStatus  | tessellate (const AcGeLineSeg3d &lineSeg, const AcGeMatrix3d &ecsMat, double startWidth, double endWidth, AcGiCommonDraw *pDraw, const AcDbObjectId linetypeId, double linetypeScale)
virtual  | ~AcGiLinetypeEngine ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiLinetypeEngine::AcGiLinetypeEngine  |  ( |   | )
Warning
Not implemented!
 virtual AcGiLinetypeEngine::~AcGiLinetypeEngine  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcGiLinetypeEngine::tessellate  |  ( |  bool  |  bIsArc,
|  bool  |  bIsCircle,
|  const Adesk::UInt32  |  nPoints,
|  const AcGePoint3d *  |  pVertexList,
|  AcGiWorldDraw *  |  pWorldDraw,
|  const AcDbObjectId  |  linetypeId,
|  double  |  linetypeScale,
|  const AcGeVector3d *  |  pNormal
)
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGiLinetypeEngine::tessellate  |  ( |  bool  |  bIsArc,
|  bool  |  bIsCircle,
|  const Adesk::UInt32  |  nPoints,
|  const AcGePoint3d *  |  pVertexList,
|  AcGiViewportDraw *  |  pViewportDraw,
|  const AcDbObjectId  |  linetypeId,
|  double  |  linetypeScale,
|  const AcGeVector3d *  |  pNormal
)
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGiLinetypeEngine::tessellate  |  ( |  const AcGeCircArc3d &  |  arcSeg,
|  const AcGeMatrix3d &  |  ecsMat,
|  double  |  startWidth,
|  double  |  endWidth,
|  AcGiCommonDraw *  |  pDraw,
|  const AcDbObjectId  |  linetypeId,
|  double  |  linetypeScale,
|  double  |  thick
)
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGiLinetypeEngine::tessellate  |  ( |  const AcGeLineSeg3d &  |  lineSeg,
|  const AcGeMatrix3d &  |  ecsMat,
|  double  |  startWidth,
|  double  |  endWidth,
|  AcGiCommonDraw *  |  pDraw,
|  const AcDbObjectId  |  linetypeId,
|  double  |  linetypeScale
)
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
linetypeengine.h