Public Member Functions | List of all members
AcGeSurfSurfInt Class Reference
AcGe Classes
  Inheritance diagram for AcGeSurfSurfInt:
 Public Member Functions
AcGeSurfSurfInt (const AcGeSurface &srf1, const AcGeSurface &srf2, const AcGeTol &tol=AcGeContext::gTol)
AcGeSurfSurfInt (const AcGeSurfSurfInt &src)
 int  | getDimension (int intNum, AcGe::AcGeIntersectError &err) const
 void  | getIntConfigs (int intNum, AcGe::ssiConfig &surf1Left, AcGe::ssiConfig &surf1Right, AcGe::ssiConfig &surf2Left, AcGe::ssiConfig &surf2Right, AcGe::ssiType &intType, int &dim, AcGe::AcGeIntersectError &err) const
 void  | getIntPointParams (int intNum, AcGePoint2d &param1, AcGePoint2d &param2, AcGe::AcGeIntersectError &err) const
 AcGe::ssiType  | getType (int intNum, AcGe::AcGeIntersectError &err) const
 AcGeCurve3d *  | intCurve (int intNum, Adesk::Boolean isExternal, AcGe::AcGeIntersectError &err) const
 AcGeCurve2d *  | intParamCurve (int num, Adesk::Boolean isExternal, Adesk::Boolean isFirst, AcGe::AcGeIntersectError &err) const
 AcGePoint3d  | intPoint (int intNum, AcGe::AcGeIntersectError &err) const
 int  | numResults (AcGe::AcGeIntersectError &err) const
 AcGeSurfSurfInt &  | operator= (const AcGeSurfSurfInt &crvInt)
 AcGeSurfSurfInt &  | set (const AcGeSurface &srf1, const AcGeSurface &srf2, const AcGeTol &tol=AcGeContext::gTol)
 const AcGeSurface *  | surface1 () const
 const AcGeSurface *  | surface2 () const
 AcGeTol  | tolerance () const
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeEntity3d
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
gessint.h