Public Member Functions | Friends | List of all members
AcDbEvalContextIterator Class Reference
AcDb Classes
  Inheritance diagram for AcDbEvalContextIterator:
 Public Member Functions
AcDbEvalContextIterator ()
ACRX_DECLARE_MEMBERS (AcDbEvalContextIterator)
virtual AcDbEvalContextPair  | contextPair () const
virtual bool  | done () const
virtual bool  | next ()
virtual void  | start ()
virtual  | ~AcDbEvalContextIterator ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpEvalContext
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Constructor & Destructor Documentation
 AcDbEvalContextIterator::AcDbEvalContextIterator  |  ( |   | )
Warning
Not implemented!
 virtual AcDbEvalContextIterator::~AcDbEvalContextIterator  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual AcDbEvalContextPair AcDbEvalContextIterator::contextPair  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcDbEvalContextIterator::done  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcDbEvalContextIterator::next  |  ( |   | )
virtual
Warning
Not implemented!
 virtual void AcDbEvalContextIterator::start  |  ( |   | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbeval.h