Public Member Functions | Friends | List of all members
AcGiWoodTexture Class Reference
AcGi Classes
  Inheritance diagram for AcGiWoodTexture:
 Public Member Functions
AcGiWoodTexture (void)
AcGiWoodTexture (const AcGiWoodTexture &texture)
ACRX_DECLARE_MEMBERS (AcGiWoodTexture)
virtual double  | axialNoise (void) const
virtual const AcGiMaterialColor &  | color1 (void) const
virtual const AcGiMaterialColor &  | color2 (void) const
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
virtual double  | grainThickness (void) const
AcGiWoodTexture &  | operator= (const AcGiWoodTexture &texture)
virtual bool  | operator== (const AcGiMaterialTexture &texture) const
virtual double  | radialNoise (void) const
virtual void  | setAxialNoise (double axialNoise)
virtual void  | setColor1 (const AcGiMaterialColor &woodColor1)
virtual void  | setColor2 (const AcGiMaterialColor &woodColor2)
virtual void  | setGrainThickness (double grainThickness)
virtual void  | setRadialNoise (double radialNoise)
virtual  | ~AcGiWoodTexture (void)
 Public Member Functions inherited from AcGiProceduralTexture
ACRX_DECLARE_MEMBERS (AcGiProceduralTexture)
 Public Member Functions inherited from AcGiMaterialTexture
ACRX_DECLARE_MEMBERS (AcGiMaterialTexture)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcGiImpWoodTexture
 Additional Inherited Members
 Public Types inherited from AcGiProceduralTexture
enum  | Type { kWood = 0, kMarble, kGeneric }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiWoodTexture::AcGiWoodTexture  |  ( |  void  |   | )
Warning
Not implemented!
 virtual AcGiWoodTexture::~AcGiWoodTexture  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 AcGiWoodTexture::AcGiWoodTexture  |  ( |  const AcGiWoodTexture &  |  texture | )
Warning
Not implemented!
Member Function Documentation
 virtual double AcGiWoodTexture::axialNoise  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual const AcGiMaterialColor& AcGiWoodTexture::color1  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual const AcGiMaterialColor& AcGiWoodTexture::color2  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGiWoodTexture::copyFrom  |  ( |  const AcRxObject *  |  other | )
virtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 virtual double AcGiWoodTexture::grainThickness  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 AcGiWoodTexture& AcGiWoodTexture::operator=  |  ( |  const AcGiWoodTexture &  |  texture | )
Warning
Not implemented!
 virtual bool AcGiWoodTexture::operator==  |  ( |  const AcGiMaterialTexture &  |  texture | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcGiMaterialTexture.
 virtual double AcGiWoodTexture::radialNoise  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual void AcGiWoodTexture::setAxialNoise  |  ( |  double  |  axialNoise | )
virtual
Warning
Not implemented!
 virtual void AcGiWoodTexture::setColor1  |  ( |  const AcGiMaterialColor &  |  woodColor1 | )
virtual
Warning
Not implemented!
 virtual void AcGiWoodTexture::setColor2  |  ( |  const AcGiMaterialColor &  |  woodColor2 | )
virtual
Warning
Not implemented!
 virtual void AcGiWoodTexture::setGrainThickness  |  ( |  double  |  grainThickness | )
virtual
Warning
Not implemented!
 virtual void AcGiWoodTexture::setRadialNoise  |  ( |  double  |  radialNoise | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acgimaterial.h