Public Member Functions | List of all members
AcTransactionReactor Class Reference
AcDb Classes
  Inheritance diagram for AcTransactionReactor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcTransactionReactor)
 virtual void  | endCalledOnOutermostTransaction (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | objectIdSwapped (const AcDbObject *pTransResObj, const AcDbObject *pOtherObj, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | transactionAborted (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | transactionAboutToAbort (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | transactionAboutToEnd (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | transactionAboutToStart (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | transactionEnded (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 virtual void  | transactionStarted (int &numTransactions, AcDbTransactionManager *transactionManagerPtr)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbtrans.h