Public Member Functions | List of all members
AcCmDialogColor Class Reference
AcCm Classes
  Inheritance diagram for AcCmDialogColor:
 Public Member Functions
AcCmDialogColor ()
AcCmDialogColor (const AcCmDialogColor &other)
AcCmDialogColor (const AcCmColorBase &other)
virtual Adesk::UInt8  | blue () const
virtual const ACHAR *  | bookName (void) const
virtual Adesk::UInt32  | color () const
virtual Adesk::UInt16  | colorIndex () const
virtual
 AcCmEntityColor::ColorMethod  | colorMethod () const
virtual const ACHAR *  | colorName (void) const
virtual const ACHAR *  | colorNameForDisplay (void)
virtual Adesk::UInt8  | green () const
virtual bool  | hasBookName (void) const
virtual bool  | hasColorName (void) const
virtual bool  | isByACI () const
virtual bool  | isByBlock () const
virtual bool  | isByColor () const
virtual bool  | isByLayer () const
virtual bool  | isByPen () const
virtual bool  | isForeground () const
bool  | operator!= (const AcCmDialogColor &color) const
bool  | operator!= (const AcCmColorBase &color) const
AcCmDialogColor &  | operator= (const AcCmDialogColor &inputColor)
AcCmDialogColor &  | operator= (const AcCmColorBase &inputColor)
bool  | operator== (const AcCmDialogColor &color) const
bool  | operator== (const AcCmColorBase &color) const
virtual Adesk::UInt16  | penIndex () const
virtual Adesk::UInt8  | red () const
virtual Acad::ErrorStatus  | setBlue (Adesk::UInt8 blue)
virtual Acad::ErrorStatus  | setColor (Adesk::UInt32 color)
virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 colorIndex)
virtual Acad::ErrorStatus  | setColorMethod (AcCmEntityColor::ColorMethod eColorMethod)
virtual Acad::ErrorStatus  | setGreen (Adesk::UInt8 green)
virtual Acad::ErrorStatus  | setNames (const ACHAR *colorName, const ACHAR *bookName=NULL)
virtual Acad::ErrorStatus  | setPenIndex (Adesk::UInt16 penIndex)
virtual Acad::ErrorStatus  | setRed (Adesk::UInt8 red)
virtual Acad::ErrorStatus  | setRGB (Adesk::UInt8 red, Adesk::UInt8 green, Adesk::UInt8 blue)
virtual  | ~AcCmDialogColor ()
Constructor & Destructor Documentation
 AcCmDialogColor::AcCmDialogColor  |  ( |   | )
Warning
Not implemented!
 AcCmDialogColor::AcCmDialogColor  |  ( |  const AcCmDialogColor &  |  other | )
Warning
Not implemented!
 AcCmDialogColor::AcCmDialogColor  |  ( |  const AcCmColorBase &  |  other | )
Warning
Not implemented!
 virtual AcCmDialogColor::~AcCmDialogColor  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual Adesk::UInt8 AcCmDialogColor::blue  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual const ACHAR* AcCmDialogColor::bookName  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Adesk::UInt32 AcCmDialogColor::color  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Adesk::UInt16 AcCmDialogColor::colorIndex  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual AcCmEntityColor::ColorMethod AcCmDialogColor::colorMethod  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual const ACHAR* AcCmDialogColor::colorName  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual const ACHAR* AcCmDialogColor::colorNameForDisplay  |  ( |  void  |   | )
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Adesk::UInt8 AcCmDialogColor::green  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual bool AcCmDialogColor::hasBookName  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual bool AcCmDialogColor::hasColorName  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual bool AcCmDialogColor::isByACI  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual bool AcCmDialogColor::isByBlock  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual bool AcCmDialogColor::isByColor  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual bool AcCmDialogColor::isByLayer  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual bool AcCmDialogColor::isByPen  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual bool AcCmDialogColor::isForeground  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 bool AcCmDialogColor::operator!=  |  ( |  const AcCmDialogColor &  |  color | ) |   const
Warning
Not implemented!
 bool AcCmDialogColor::operator!=  |  ( |  const AcCmColorBase &  |  color | ) |   const
Warning
Not implemented!
 AcCmDialogColor& AcCmDialogColor::operator=  |  ( |  const AcCmDialogColor &  |  inputColor | )
Warning
Not implemented!
 AcCmDialogColor& AcCmDialogColor::operator=  |  ( |  const AcCmColorBase &  |  inputColor | )
Warning
Not implemented!
 bool AcCmDialogColor::operator==  |  ( |  const AcCmDialogColor &  |  color | ) |   const
Warning
Not implemented!
 bool AcCmDialogColor::operator==  |  ( |  const AcCmColorBase &  |  color | ) |   const
Warning
Not implemented!
 virtual Adesk::UInt16 AcCmDialogColor::penIndex  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Adesk::UInt8 AcCmDialogColor::red  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Acad::ErrorStatus AcCmDialogColor::setBlue  |  ( |  Adesk::UInt8  |  blue | )
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Acad::ErrorStatus AcCmDialogColor::setColor  |  ( |  Adesk::UInt32  |  color | )
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Acad::ErrorStatus AcCmDialogColor::setColorIndex  |  ( |  Adesk::UInt16  |  colorIndex | )
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Acad::ErrorStatus AcCmDialogColor::setColorMethod  |  ( |  AcCmEntityColor::ColorMethod  |  eColorMethod | )
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Acad::ErrorStatus AcCmDialogColor::setGreen  |  ( |  Adesk::UInt8  |  green | )
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Acad::ErrorStatus AcCmDialogColor::setNames  |  ( |  const ACHAR *  |  colorName,
|  const ACHAR *  |  bookName = NULL
)
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Acad::ErrorStatus AcCmDialogColor::setPenIndex  |  ( |  Adesk::UInt16  |  penIndex | )
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Acad::ErrorStatus AcCmDialogColor::setRed  |  ( |  Adesk::UInt8  |  red | )
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 virtual Acad::ErrorStatus AcCmDialogColor::setRGB  |  ( |  Adesk::UInt8  |  red,
|  Adesk::UInt8  |  green,
|  Adesk::UInt8  |  blue
)
virtual
Warning
Not implemented!
Implements AcCmColorBase.
 The documentation for this class was generated from the following file:
dbcolor.h