Public Types | Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CAcUiTrueColorComboBox Class Reference
MFC Classes
  Inheritance diagram for CAcUiTrueColorComboBox:
 Public Types
enum  | ColorTableIndex {
 kCargoOption1 = 0, kCargoOption2 = 1, kCargoStockItem1 = 2, kCargoStockItem2 = 3,
 kCargoStockItem3 = 4, kCargoStockItem4 = 5, kCargoStockItem5 = 6, kCargoStockItem6 = 7,
 kCargoStockItem7 = 8, kIndexOfFirstMRUItem = 9, kCargoOther1 = -1, kCargoOther2 = -2,
 kLastIndex = ACUI_TRUECOLOR_COMBOBOX_TABLE_SIZE-1
 }
 Public Member Functions
 int  | AddColorToMRU (const AcCmColor &color)
 void  | AddItems ()
 int  | AddItemToList (LPCTSTR name, int index, INT_PTR cargo)
 int  | AddItemToMRU (LPCTSTR name, int cargo)
 int  | FindItemByColor (const AcCmColor &color)
 const AcCmColor &  | GetBlockColor ()
 DWORD  | getColorByCargo (int cargo)
 DWORD  | getColorData (AcCmColor color)
 virtual COLORREF  | GetColorFromIndex (int colorIndex)
 int  | GetColorIndex (COLORREF color)
 void  | GetCurrentItemColor (AcCmColor &color)
 void  | SetBlockColor (const AcCmColor &color)
 Public Member Functions inherited from CAcUiMRUComboBox
 int  | AddItemToList (LPCTSTR name, INT_PTR cargo)
 virtual BOOL  | Create (DWORD dwStyle, const RECT &rect, CWnd *pParentWnd, UINT nID)
 virtual void  | DrawItem (LPDRAWITEMSTRUCT lpDrawItemStruct)
 virtual int  | ExtraWidth ()
 int  | FindItemByCargo (INT_PTR cargo)
 int  | GetCargoOption1 ()
 int  | GetCargoOption2 ()
 virtual void  | GetContentExtent (LPCTSTR text, int &width, int &height)
 INT_PTR  | GetCurrentItemCargo ()
 INT_PTR  | GetItemCargo (int item)
 virtual BOOL  | GetItemColors (DRAWITEMSTRUCT &dis, COLORREF &fgColor, COLORREF &bgColor, COLORREF &fillColor)
 LOGPALETTE *  | GetLogPalette ()
 HPALETTE  | GetPalette ()
 BOOL  | GetUseByBlock ()
 BOOL  | GetUseByLayer ()
 BOOL  | GetUseOption1 ()
 BOOL  | GetUseOption2 ()
 BOOL  | GetUseOther ()
 BOOL  | GetUseOther1 ()
 BOOL  | GetUseOther2 ()
 BOOL  | GetUseWindows ()
 virtual int  | ImageWidth ()
 int  | InsertItemInList (int index, LPCTSTR name, INT_PTR cargo)
 int  | ItemHeight ()
 virtual void  | MeasureItem (LPMEASUREITEMSTRUCT lpMeasureItemStruct)
 void  | RecalcHeight ()
 void  | RemoveItemFromMRU (int cargo)
 void  | SetCargoOption1 (int cargo)
 void  | SetCargoOption2 (int cargo)
 void  | SetLastSelection (int sel)
 void  | SetLogPalette (LOGPALETTE *logPalette)
 void  | SetPalette (HPALETTE hPalette)
 void  | SetUseByBlock (BOOL use)
 void  | SetUseByLayer (BOOL use)
 void  | SetUseOption1 (BOOL use)
 void  | SetUseOption2 (BOOL use)
 void  | SetUseOther (BOOL use)
 void  | SetUseOther1 (BOOL use)
 void  | SetUseOther2 (BOOL use)
 void  | SetUseWindows (BOOL use)
 Public Member Functions inherited from CAcUiComboBox
 CAcUiEdit *  | AcUiEditBox ()
 void  | Convert ()
 BOOL  | ConvertData (CString &x)
 void  | SetRange (double vMin, double vMax)
 BOOL  | Validate ()
 ACUI_ERROR_CODE  | ValidateData (CString &x)
 Public Member Functions inherited from CAdUiComboBox
 CWnd *  | GetAdUiParent ()
 CAdUiEdit *  | GetEditBox ()
 void  | GetLBString (int nIndex, CString &rString)
 CAdUiListBox *  | GetListBox ()
 DWORD  | GetStyleMask ()
 void  | GetTextExtent (LPCTSTR text, int &width, int &height)
 CString  | GetToolTipText (void) const
 BOOL  | IsOwnerDraw ()
 BOOL  | IsStatic ()
 BOOL  | IsStyleMaskSet (DWORD mask)
 void  | SetAdUiParent (CWnd *w)
 void  | SetEditBox (CAdUiEdit *control, BOOL autoDelete)
 void  | SetListBox (CAdUiListBox *control, BOOL autoDelete)
void  | SetStyleMask (DWORD mask)
 BOOL  | SetToolTipText (const CString &sText)
 Protected Member Functions
 virtual void  | DrawItemImage (CDC &dc, CRect &r, INT_PTR cargo)
 bool  | GetCurrentLayerColor (AcCmColor &color)
 BOOL  | GetOtherColor (AcCmColor &defaultColor, const AcCmColor &layerColor, BOOL enableMetaColors)
 virtual BOOL  | GetOtherName (BOOL isOther2, CString &name)
 BOOL  | GetWindowsColor (AcCmColor &color)
 void  | initAcCmColorTable (void)
 virtual COLORREF  | LookupColor (int colorIndex, LOGPALETTE *logPalette)
 virtual void  | OnAddItems ()
 afx_msg void  | OnDrawItem (int nIDCtl, LPDRAWITEMSTRUCT lpDrawItemStruct)
 virtual BOOL  | OnSelectOther (BOOL isOther2, int curSel, int &newSel)
 void  | RGBFill (CDC &dc, CRect &rFill)
 Protected Member Functions inherited from CAcUiMRUComboBox
virtual int  | CalcItemHeight ()
 void  | CreateAndSelectPalette (LPDRAWITEMSTRUCT lpDrawItemStruct, CDC *dc)
void  | DrawItemImageFromCargo (CDC *dc, CRect &r, int i)
 void  | DrawTextAndFocusRect (LPDRAWITEMSTRUCT lpDrawItemStruct, CDC *dc, CRect &rItem, int i, COLORREF &fgColor, COLORREF &bgColor)
 BOOL  | FindCargoInMRU (int cargo)
 int  | GenerateCargoFromMRU (int seed)
 virtual BOOL  | GetOptionName (BOOL isOption2, CString &name)
 afx_msg BOOL  | OnCloseUp ()
 virtual void  | OnComboBoxInit ()
 afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
 afx_msg BOOL  | OnDropDown ()
 virtual BOOL  | OnGetTipRect (CRect &r)
 afx_msg BOOL  | OnSelEndOk ()
 virtual void  | PreSubclassWindow ()
 void  | ResetAndRestorePalette (CDC *dc, int savedState)
 void  | SelectOther (BOOL isOther2)
 void  | SetupForImageDraw (LPDRAWITEMSTRUCT lpDrawItemStruct, CDC *dc, CRect &rItem, CRect &rImage, COLORREF &fgColor, COLORREF &bgColor)
 virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Protected Attributes
 AcCmColor *  | m_AcCmColorTable [ACUI_TRUECOLOR_COMBOBOX_TABLE_SIZE]
 AcCmColor  | m_blockColor
 int  | m_cargoOther1
 int  | m_cargoOther2
 int  | m_nextAcCmColorTableIndex
 Protected Attributes inherited from CAcUiMRUComboBox
 BOOL  | m_bIsDynamicCreation: 1
 BOOL  | m_bOther1Selected: 1
 BOOL  | m_bOther2Selected: 1
 BOOL  | m_bUseOption1: 1
 BOOL  | m_bUseOption2: 1
 BOOL  | m_bUseOther1: 1
 BOOL  | m_bUseOther2: 1
 int  | m_cargoOption1
 int  | m_cargoOption2
 HPALETTE  | m_hPalette
 int  | m_itemHeight
 int  | m_lastSelection
 LOGPALETTE *  | m_logPalette
 int  | m_mruCargo [ACUI_MAX_COMBOBOX_MRU]
 int  | m_mruLen
 CString  | m_mruName [ACUI_MAX_COMBOBOX_MRU]
 CPalette *  | m_pOldPalette
 The documentation for this class was generated from the following file:
acuiComboBox.h