Public Member Functions | List of all members
AcDbSun Class Reference
AcDb Classes
  Inheritance diagram for AcDbSun:
 Public Member Functions
AcDbSun ()
ACRX_DECLARE_MEMBERS (AcDbSun)
virtual double  | altitude () const
virtual double  | azimuth () const
virtual const AcDbDate &  | dateTime () const
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
virtual AcGiDrawable *  | drawable ()
virtual DrawableType  | drawableType () const
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
virtual AcGsNode *  | gsNode () const
virtual double  | intensity () const
virtual bool  | isDayLightSavingsOn () const
virtual bool  | isOn () const
virtual Acad::ErrorStatus  | setAltitude (double altitude)
virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
virtual Acad::ErrorStatus  | setAzimuth (double azimuth)
virtual Acad::ErrorStatus  | setDateTime (const AcDbDate &datetime)
virtual Acad::ErrorStatus  | setDayLightSavingsOn (bool value)
virtual void  | setGsNode (AcGsNode *gsnode)
virtual Acad::ErrorStatus  | setIntensity (double intensity)
virtual Acad::ErrorStatus  | setOn (bool value)
virtual void  | setShadowParameters (const AcGiShadowParameters &params)
Acad::ErrorStatus  | setSkyParameters (const AcGiSkyParameters &params)
virtual Acad::ErrorStatus  | setSunColor (const AcCmColor &color)
virtual void  | setSunDirection (const AcGeVector3d &sundir)
virtual const
 AcGiShadowParameters &  | shadowParameters () const
Acad::ErrorStatus  | skyParameters (AcGiSkyParameters &params) const
virtual const AcCmColor &  | sunColor () const
virtual const AcGeVector3d &  | sunDirection () const
~AcDbSun ()
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual void  | viewportDraw (AcGiViewportDraw *pVd)
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependantGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Constructor & Destructor Documentation
 AcDbSun::AcDbSun  |  ( |   | )
Warning
Not implemented!
 AcDbSun::~AcDbSun  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 virtual double AcDbSun::altitude  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual double AcDbSun::azimuth  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual const AcDbDate& AcDbSun::dateTime  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbSun::decomposeForSave  |  ( |  AcDb::AcDbDwgVersion  |  ver,
|  AcDbObject *&  |  replaceObj,
|  AcDbObjectId &  |  replaceId,
|  Adesk::Boolean &  |  exchangeXData
)
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual AcGiDrawable* AcDbSun::drawable  |  ( |   | )
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual DrawableType AcDbSun::drawableType  |  ( |   | ) |   const
inlinevirtual
Warning
Not implemented!
Reimplemented from AcGiDrawable.
 virtual Acad::ErrorStatus AcDbSun::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual Acad::ErrorStatus AcDbSun::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual Acad::ErrorStatus AcDbSun::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual Acad::ErrorStatus AcDbSun::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual AcGsNode* AcDbSun::gsNode  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual double AcDbSun::intensity  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcDbSun::isDayLightSavingsOn  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcDbSun::isOn  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbSun::setAltitude  |  ( |  double  |  altitude | )
virtual
Warning
Not implemented!
 virtual Adesk::UInt32 AcDbSun::setAttributes  |  ( |  AcGiDrawableTraits *  |  pTraits | )
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual Acad::ErrorStatus AcDbSun::setAzimuth  |  ( |  double  |  azimuth | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbSun::setDateTime  |  ( |  const AcDbDate &  |  datetime | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbSun::setDayLightSavingsOn  |  ( |  bool  |  value | )
virtual
Warning
Not implemented!
 virtual void AcDbSun::setGsNode  |  ( |  AcGsNode *  |  gsnode | )
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual Acad::ErrorStatus AcDbSun::setIntensity  |  ( |  double  |  intensity | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbSun::setOn  |  ( |  bool  |  value | )
virtual
Warning
Not implemented!
 virtual void AcDbSun::setShadowParameters  |  ( |  const AcGiShadowParameters &  |  params | )
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcDbSun::setSkyParameters  |  ( |  const AcGiSkyParameters &  |  params | )
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbSun::setSunColor  |  ( |  const AcCmColor &  |  color | )
virtual
Warning
Not implemented!
 virtual void AcDbSun::setSunDirection  |  ( |  const AcGeVector3d &  |  sundir | )
virtual
Warning
Not implemented!
 virtual const AcGiShadowParameters& AcDbSun::shadowParameters  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcDbSun::skyParameters  |  ( |  AcGiSkyParameters &  |  params | ) |   const
Warning
Not implemented!
 virtual const AcCmColor& AcDbSun::sunColor  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual const AcGeVector3d& AcDbSun::sunDirection  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbSun.h