Public Types | Public Member Functions | List of all members
AcGiVertexData Class Reference
AcGi Classes
  Inheritance diagram for AcGiVertexData:
 Public Types
enum  | MapChael { kAllChaels, kMapChaels }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiVertexData)
 AcGePoint3d *  | mappingCoords (MapChael mapChael) const
 virtual AcGeVector3d *  | normals () const
 virtual AcGiOrientationType  | orientationFlag () const
 void  | setMappingCoords (MapChael mapChael, const AcGePoint3d *pCoords)
 virtual void  | setNormals (const AcGeVector3d *pNormals)
 virtual void  | setOrientationFlag (const AcGiOrientationType oflag)
 virtual void  | setTrueColors (const AcCmEntityColor *colors)
 virtual AcCmEntityColor *  | trueColors () const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acgi.h