Public Member Functions | List of all members
AcEdInputPointFilter Class Reference
AcEd Classes
  Inheritance diagram for AcEdInputPointFilter:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcEdInputPointFilter)
 virtual Acad::ErrorStatus  | processInputPoint (bool &changedPoint, AcGePoint3d &newPoint, bool &displayOsnapGlyph, bool &changedTooltipStr, ACHAR *&newTooltipString, bool &retry, AcGiViewportDraw *drawContext, AcApDocument *document, bool pointComputed, int history, const AcGePoint3d &lastPoint, const AcGePoint3d &rawPoint, const AcGePoint3d &grippedPoint, const AcGePoint3d &cartesianSnappedPoint, const AcGePoint3d &osnappedPoint, AcDb::OsnapMask osnapMask, const AcArray< AcDbCustomOsnapMode * > &customOsnapModes, AcDb::OsnapMask osnapOverrides, const AcArray< AcDbCustomOsnapMode * > &customOsnapOverrides, const AcArray< AcDbObjectId > &pickedEntities, const AcArray< AcDbObjectIdArray, AcArrayObjectCopyReallocator< AcDbObjectIdArray > > &nestedPickedEntities, const AcArray< Adesk::GsMarker > &gsSelectionMark, const AcArray< AcDbObjectId > &keyPointEntities, const AcArray< AcDbObjectIdArray, AcArrayObjectCopyReallocator< AcDbObjectIdArray > > &nestedKeyPointEntities, const AcArray< Adesk::GsMarker > &keyPointGsSelectionMark, const AcArray< AcGeCurve3d * > &alignmentPaths, const AcGePoint3d &computedPoint, const ACHAR *tooltipString)=0
 virtual AcEdInputPointFilter *  | revokeInputFilter (AcEdInputPointFilter *revokedFilter)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acedinpt.h