Public Member Functions | List of all members
AcPlPlotConfigInfo Class Reference
AcPl Classes
  Inheritance diagram for AcPlPlotConfigInfo:
 Public Member Functions
ACPL_DECLARE_MEMBERS (AcPlPlotConfigInfo)
 ACPL_PORT  | AcPlPlotConfigInfo (const ACHAR *pDevName, const ACHAR *pFullPath, DeviceType devType)
 ACPL_PORT  | AcPlPlotConfigInfo (const AcPlPlotConfigInfo &copy)
 ACPL_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 ACPL_PORT const ACHAR *  | deviceName () const
 ACPL_PORT DeviceType  | deviceType () const
 ACPL_PORT const ACHAR *  | fullPath () const
 ACPL_PORT const
 AcPlPlotConfigInfo &  | operator= (const AcPlPlotConfigInfo &src)
 ACPL_PORT void  | setDeviceName (const ACHAR *pDevName)
 ACPL_PORT void  | setDeviceType (DeviceType devType)
 ACPL_PORT void  | setFullPath (const ACHAR *pPath)
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 The documentation for this class was generated from the following file:
acplplotconfigmgr.h