Public Member Functions | List of all members
AcRxDictionary Class Reference
  Inheritance diagram for AcRxDictionary:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcRxDictionary)
 virtual AcRxObject *  | at (const ACHAR *key) const =0
 virtual AcRxObject *  | at (Adesk::UInt32 id) const =0
 virtual Adesk::Boolean  | atKeyAndIdPut (const ACHAR *newKey, Adesk::UInt32 id, AcRxObject *pObject)=0
 AcRxObject *  | atPut (const ACHAR *key, AcRxObject *pObject)
 virtual AcRxObject *  | atPut (const ACHAR *key, AcRxObject *pObject, Adesk::UInt32 &retId)=0
 virtual AcRxObject *  | atPut (Adesk::UInt32 id, AcRxObject *pObject)=0
 virtual Adesk::Boolean  | deletesObjects () const =0
 virtual Adesk::Boolean  | has (const ACHAR *entryName) const =0
 virtual Adesk::Boolean  | has (Adesk::UInt32 id) const =0
 virtual Adesk::UInt32  | idAt (const ACHAR *key) const =0
 virtual Adesk::Boolean  | isCaseSensitive () const =0
 virtual Adesk::Boolean  | isSorted () const =0
 virtual const ACHAR *  | keyAt (Adesk::UInt32 id) const =0
 virtual AcRxDictionaryIterator *  | newIterator (AcRx::DictIterType type=AcRx::kDictSorted)=0
 virtual Adesk::UInt32  | numEntries () const =0
 virtual AcRxObject *  | remove (const ACHAR *key)=0
 virtual AcRxObject *  | remove (Adesk::UInt32 id)=0
 virtual Adesk::Boolean  | resetKey (const ACHAR *oldKey, const ACHAR *newKey)=0
 virtual Adesk::Boolean  | resetKey (Adesk::UInt32 id, const ACHAR *newKey)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
rxdict.h