Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcFdFieldEvaluator Class Reference
AcFd Classes
  Inheritance diagram for AcFdFieldEvaluator:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcFdFieldEvaluator)
 virtual ACDB_PORT Acad::ErrorStatus  | compile (AcDbField *pField, AcDbDatabase *pDb, AcFdFieldResult *pResult)
 virtual ACDB_PORT Acad::ErrorStatus  | evaluate (AcDbField *pField, int nContext, AcDbDatabase *pDb, AcFdFieldResult *pResult)
virtual ACDB_PORT const ACHAR *  | evaluatorId (void) const
virtual ACDB_PORT const ACHAR *  | evaluatorId (AcDbField *pField)
virtual ACDB_PORT Acad::ErrorStatus  | format (AcDbField *pField, ACHAR *&pszValue)
 virtual ACDB_PORT Acad::ErrorStatus  | initialize (AcDbField *pField)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
AcFdFieldEvaluator (void *)
 Protected Attributes
 void *  | mpImpObj
 Friends
 class  | AcFdSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Member Function Documentation
 virtual ACDB_PORT const ACHAR* AcFdFieldEvaluator::evaluatorId  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual ACDB_PORT const ACHAR* AcFdFieldEvaluator::evaluatorId  |  ( |  AcDbField *  |  pField | )
virtual
Warning
Not implemented!
 virtual ACDB_PORT Acad::ErrorStatus AcFdFieldEvaluator::format  |  ( |  AcDbField *  |  pField,
|  ACHAR *&  |  pszValue
)
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcField.h