Public Member Functions | List of all members
AcGeCurveSurfInt Class Reference
AcGe Classes
  Inheritance diagram for AcGeCurveSurfInt:
 Public Member Functions
AcGeCurveSurfInt (const AcGeCurve3d &crv, const AcGeSurface &srf, const AcGeTol &tol=AcGeContext::gTol)
AcGeCurveSurfInt (const AcGeCurveSurfInt &src)
 const AcGeCurve3d *  | curve () const
 void  | getIntConfigs (int intNum, AcGe::csiConfig &lower, AcGe::csiConfig &higher, Adesk::Boolean &smallAngle, AcGeIntersectError &err) const
 void  | getIntParams (int intNum, double &param1, AcGePoint2d &param2, AcGeIntersectError &err) const
 void  | getPointOnCurve (int intNum, AcGePointOnCurve3d &, AcGeIntersectError &err) const
 void  | getPointOnSurface (int intNum, AcGePointOnSurface &, AcGeIntersectError &err) const
 AcGePoint3d  | intPoint (int intNum, AcGeIntersectError &err) const
 int  | numIntPoints (AcGeIntersectError &err) const
 AcGeCurveSurfInt &  | operator= (const AcGeCurveSurfInt &crvInt)
 AcGeCurveSurfInt &  | set (const AcGeCurve3d &cvr, const AcGeSurface &srf, const AcGeTol &tol=AcGeContext::gTol)
 const AcGeSurface *  | surface () const
 AcGeTol  | tolerance () const
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeEntity3d
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
gecsint.h