Public Member Functions | Static Public Member Functions | List of all members
AcRxObject Class Reference
Inherited by Ac3dDwfNavTreeNode, AcadAppInfo, AcApDocManager, AcApDocManagerReactor, AcApDocument, AcApDocumentIterator, AcApLongTransactionManager, AcApLongTransactionReactor, AcDbAlignment, AcDbAnnotativeObjectPE, AcDbAuditRecreatePE, AcDbCustomOsnapInfo, AcDbDatabase, AcDbDatabaseReactor, AcDbDatabaseSummaryInfo, AcDbDataCell, AcDbDataColumn, AcDbDataLinkManager, AcDbDictionaryIterator, AcDbDoubleClickEdit, AcDbDwgFiler, AcDbDxfFiler, AcDbDynamicUCSPE, AcDbEntityHyperlinkPE, AcDbEvalContext, AcDbEvalContextIterator, AcDbEvalVariant, AcDbGroupIterator, AcDbHostApplicationServices, AcDbIdMapping, AcDbIdMappingIter, AcDbInterferencePE, AcDbLayerStateManager, AcDbLayerStateManagerReactor, AcDbLayoutManager, AcDbLayoutManagerReactor, AcDbLongTransWorkSetIterator, AcDbMatchProperties, AcDbObjectContext, AcDbObjectContextCollection, AcDbObjectContextCollectionIterator, AcDbObjectContextInterface, AcDbObjectContextManager, AcDbObjectIterator, AcDbObjectReactor, AcDbPaperOrientationPE, AcDbPointRef, AcDbSelectGrip, AcDbTransactionManager, AcDbXObject, AcDbXrecordIterator, AcDMMReactor, AcEdCommand, AcEdCommandIterator, AcEdCommandStack, AcEdInputPointFilter, AcEdInputPointMonitor, AcEdJig, AcEdUIContext, AcFdFieldEngine, AcFdFieldEvaluator, AcFdFieldEvaluatorLoader, AcFdFieldReactor, AcFdFieldResult, AcGiCommonDraw, AcGiContext, AcGiContextualColors, AcGiDisplayStyle, AcGiDrawable, AcGiEdgeData, AcGiEdgeStyle, AcGiFaceData, AcGiFaceStyle, AcGiGeometry, AcGiLightAttenuation, AcGiLinetypeEngine, AcGiMapper, AcGiMaterialColor, AcGiMaterialMap, AcGiMaterialTexture, AcGiShadowParameters, AcGiSkyParameters, AcGiSubEntityTraits, AcGiTextStyle, AcGiToneOperatorParameters, AcGiVariant, AcGiVertexData, AcGiViewport, AcGiVisualStyle, AcLyLayerFilter, AcPlObject, AcPlPlotReactor, AcPublishReactor, AcPublishUIReactor, AcRxDictionary, AcRxDLinkerReactor, AcRxDynamicLinker, AcRxEvent, AcRxEventReactor, AcRxIterator, AcRxProtocolReactor, AcRxProtocolReactorIterator, AcRxProtocolReactorList, AcRxProtocolReactorListIterator, AcRxProtocolReactorManager, AcRxService, AcTransaction, AcTransactionReactor, AcValue, OPMPerInstancePropertyExtension, OPMPerInstancePropertyExtensionFactory, OPMPerInstancePropertySources, OPMPropertyExtension, and OPMPropertyExtensionFactory.
 Public Member Functions
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following files:
rxobject.h
rxclass.h