Public Member Functions | List of all members
AcEdInputPointManager Class Reference
AcEd Classes
 Public Member Functions
 virtual Acad::ErrorStatus  | addInputContextReactor (AcEdInputContextReactor *pReactor)=0
 virtual Acad::ErrorStatus  | addPointMonitor (AcEdInputPointMonitor *pMonitor)=0
 virtual Acad::ErrorStatus  | addSubSelectFilter (AcEdSubSelectFilter *pSSSubFilter)=0
 virtual AcEdInputPointFilter *  | currentPointFilter () const =0
 virtual Acad::ErrorStatus  | disableSystemCursorGraphics ()=0
 virtual Acad::ErrorStatus  | enableSystemCursorGraphics ()=0
 virtual int  | forcedPickCount () const =0
 virtual int  | mouseHasMoved () const =0
 virtual Acad::ErrorStatus  | registerPointFilter (AcEdInputPointFilter *pFilter)=0
 virtual Acad::ErrorStatus  | removeInputContextReactor (AcEdInputContextReactor *pReact)=0
 virtual Acad::ErrorStatus  | removePointMonitor (AcEdInputPointMonitor *pMonitor)=0
 virtual Acad::ErrorStatus  | removeSubSelectFilter (AcEdSubSelectFilter *pSSSubFilter)=0
 virtual Acad::ErrorStatus  | revokePointFilter ()=0
 virtual int  | systemCursorDisableCount () const =0
 virtual Acad::ErrorStatus  | turnOffForcedPick ()=0
 virtual Acad::ErrorStatus  | turnOffSubentityWindowSelection ()=0
 virtual Acad::ErrorStatus  | turnOnForcedPick ()=0
 virtual Acad::ErrorStatus  | turnOnSubentityWindowSelection ()=0
 The documentation for this class was generated from the following file:
acedinpt.h