Public Member Functions | List of all members
AcFdFieldResult Class Reference
AcFd Classes
  Inheritance diagram for AcFdFieldResult:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcFdFieldResult)
virtual ACDB_PORT Acad::ErrorStatus  | setEvaluationStatus (int nStatus, int dwErrCode=0, const ACHAR *pszMsg=NULL)
virtual ACDB_PORT Acad::ErrorStatus  | setFieldValue (const AcValue *pValue)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Member Function Documentation
 virtual ACDB_PORT Acad::ErrorStatus AcFdFieldResult::setEvaluationStatus  |  ( |  int  |  nStatus,
|  int  |  dwErrCode = 0,
|  const ACHAR *  |  pszMsg = NULL
)
virtual
Warning
Not implemented!
 virtual ACDB_PORT Acad::ErrorStatus AcFdFieldResult::setFieldValue  |  ( |  const AcValue *  |  pValue | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcField.h