Public Types | Public Member Functions | List of all members
AcDbMatchProperties Class Reference
AcDb Classes
  Inheritance diagram for AcDbMatchProperties:
 Public Types
enum  | Flags {
 kColorFlag = 0x1, kLayerFlag = 0x2, kLtypeFlag = 0x4, kThicknessFlag = 0x8,
 kLtscaleFlag = 0x10, kTextFlag = 0x20, kDimensionFlag = 0x40, kHatchFlag = 0x80,
 kLweightFlag = 0x100, kPlotstylenameFlag = 0x200, kPolylineFlag = 0x400, kViewportFlag = 0x800,
 kTableFlag = 0x1000, kMaterialFlag = 0x2000, kShadowDisplayFlag = 0x4000, kMultileaderFlag = 0x8000,
 kSetAllFlagsOn = 0xFFFF
 }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbMatchProperties)
 virtual void  | copyProperties (AcDbEntity *pSrcEntity, AcDbEntity *pTrgEntity, unsigned int flag) const =0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbmatch.h