Public Member Functions | List of all members
AcGeExternalBoundedSurface Class Reference
AcGe Classes
  Inheritance diagram for AcGeExternalBoundedSurface:
 Public Member Functions
AcGeExternalBoundedSurface (void *surfaceDef, AcGe::ExternalEntityKind surfaceKind, Adesk::Boolean makeCopy=Adesk::kTrue)
AcGeExternalBoundedSurface (const AcGeExternalBoundedSurface &)
 AcGe::ExternalEntityKind  | externalSurfaceKind () const
 void  | getBaseSurface (AcGeSurface *&surfaceDef) const
 void  | getBaseSurface (AcGeExternalSurface &unboundedSurfaceDef) const
 void  | getContours (int &numContours, AcGeCurveBoundary *&curveBoundaries) const
 void  | getExternalSurface (void *&surfaceDef) const
 Adesk::Boolean  | isCone () const
 Adesk::Boolean  | isCylinder () const
 Adesk::Boolean  | isDefined () const
 Adesk::Boolean  | isExternalSurface () const
 Adesk::Boolean  | isNurbs () const
 Adesk::Boolean  | isOwnerOfSurface () const
 Adesk::Boolean  | isPlane () const
 Adesk::Boolean  | isSphere () const
 Adesk::Boolean  | isTorus () const
 int  | numContours () const
 AcGeExternalBoundedSurface &  | operator= (const AcGeExternalBoundedSurface &)
 AcGeExternalBoundedSurface &  | set (void *surfaceDef, AcGe::ExternalEntityKind surfaceKind, Adesk::Boolean makeCopy=Adesk::kTrue)
 AcGeExternalBoundedSurface &  | setToOwnSurface ()
 Public Member Functions inherited from AcGeSurface
 AcGePoint3d  | closestPointTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param, int derivOrd, AcGeVector3dArray &derivatives) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param, int derivOrd, AcGeVector3dArray &derivatives, AcGeVector3d &normal) const
 void  | getClosestPointTo (const AcGePoint3d &pnt, AcGePointOnSurface &result, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getEnvelope (AcGeInterval &intrvlX, AcGeInterval &intrvlY) const
 Adesk::Boolean  | isClosedInU (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isClosedInV (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isNormalReversed () const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, AcGePoint2d &paramPoint, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeSurface &  | operator= (const AcGeSurface &otherSurface)
 AcGePoint2d  | paramOf (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeSurface &  | reverseNormal ()
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeSurface
AcGeSurface (const AcGeSurface &)
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
gexbndsf.h