Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcGeEntity3d Class Reference
AcGe Classes
  Inheritance diagram for AcGeEntity3d:
 Public Member Functions
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Protected Member Functions
AcGeEntity3d (const AcGeEntity3d &)
AcGeEntity3d (AcGeImpEntity3d &, int)
AcGeEntity3d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d &, int) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d *) const
 AcGeEntity3d *  | newEntity3d (AcGeImpEntity3d &, int) const
 Protected Attributes
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 Friends
 class  | AcGeImpEntity3d
 The documentation for this class was generated from the following file:
geent3d.h