Public Types | Public Member Functions | Protected Attributes | List of all members
AcPlPlotInfoValidator Class Reference
AcPl Classes
  Inheritance diagram for AcPlPlotInfoValidator:
 Public Types
enum  | eCustomSizeResult {
 ePossible = 0x0000, eMustCreatePC3 = 0x0001, eRotationRequired = 0x0002, ePC3DirReadOnly = 0x0004,
 ePMPDirReadOnly = 0x0008, ePMPDirMissing = 0x0010, eUnknownErrPMPDir = 0x0020, ePC3FileReadOnly = 0x0040,
 eSizeTooBig = 0x0080, eException = 0x0100, eUnknownErrPC3File = 0x0200, eUnknownErrPMPFile = 0x0400,
 ePMPFileReadOnly = 0x0800, eWidthAndHeightMustBePositive = 0x1000, eDeviceLoadFailed = 0x2000
 }
enum  | MatchingPolicy { kMatchDisabled = 1, kMatchEnabled, kMatchEnabledCustom, kMatchEnabledTmpCustom }
 Public Member Functions
ACPL_DECLARE_MEMBERS (AcPlPlotInfoValidator)
 ACPL_PORT unsigned int  | dimensionalWeight () const
 virtual ACPL_PORT unsigned long  | isCustomPossible (AcPlPlotInfo &info) const
 ACPL_PORT MatchingPolicy  | matchingPolicy () const
 ACPL_PORT unsigned int  | mediaBoundsWeight () const
 ACPL_PORT unsigned int  | mediaGroupWeight () const
 ACPL_PORT unsigned int  | mediaMatchingThreshold () const
 ACPL_PORT unsigned int  | printableBoundsWeight () const
 ACPL_PORT void  | setDimensionalWeight (unsigned int weight=DEFAULT_DIMENSIONAL_WEIGHT)
 ACPL_PORT void  | setMediaBoundsWeight (unsigned int weight=DEFAULT_MEDIA_BOUNDS_WEIGHT)
 ACPL_PORT void  | setMediaGroupWeight (unsigned int weight=DEFAULT_MEDIA_GROUP_WEIGHT)
 ACPL_PORT void  | setMediaMatchingPolicy (MatchingPolicy policy)
 ACPL_PORT void  | setMediaMatchingThreshold (unsigned int threshold=DEFAULT_THRESHOLD)
 ACPL_PORT void  | setPrintableBoundsWeight (unsigned int weight=DEFAULT_PRINTABLE_BOUNDS_WEIGHT)
 ACPL_PORT void  | setSheetDimensionalWeight (unsigned int weight=DEFAULT_SHEET_DIMENSIONAL_WEIGHT)
 ACPL_PORT void  | setSheetMediaGroupWeight (unsigned int weight=DEFAULT_SHEET_MEDIA_GROUP_WEIGHT)
 ACPL_PORT unsigned int  | sheetDimensionalWeight () const
 ACPL_PORT unsigned int  | sheetMediaGroupWeight () const
 virtual ACPL_PORT Acad::ErrorStatus  | validate (AcPlPlotInfo &info)
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Attributes
 unsigned int  | m_dimensionalWeight
 MatchingPolicy  | m_matchingPolicy
 unsigned int  | m_matchingThreshold
 unsigned int  | m_mediaBoundsWeight
 unsigned int  | m_mediaGroupWeight
 unsigned int  | m_printableBoundsWeight
 unsigned int  | m_sheetDimensionalWeight
 unsigned int  | m_sheetMediaGroupWeight
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 The documentation for this class was generated from the following file:
acplplotinfovalidator.h