Public Member Functions | List of all members
CAcGradientThumbnailEngine Class Reference
Misc Classes
 Public Member Functions
 virtual Acad::ErrorStatus  | gradientThumbnailsDrawBitmap (int gradientNumber, HDC hDC, int xPos, int yPos)=0
 virtual Acad::ErrorStatus  | gradientThumbnailsRender (void)=0
 virtual Acad::ErrorStatus  | gradientThumbnailsSetRotation (double angle)=0
 virtual Acad::ErrorStatus  | gradientThumbnailsSetShift (bool bShifted)=0
 virtual Acad::ErrorStatus  | gradientThumbnailsSetStartColor (AcCmEntityColor startColor)=0
 virtual Acad::ErrorStatus  | gradientThumbnailsSetStopColor (AcCmEntityColor stopColor)=0
 The documentation for this class was generated from the following file:
AcGradThumbEng.h