Public Member Functions | List of all members
OPMPropertyExtensionFactory Class Reference
OPM Classes
  Inheritance diagram for OPMPropertyExtensionFactory:
 Public Member Functions
ACRX_DECLARE_MEMBERS (OPMPropertyExtensionFactory)
 virtual OPMPropertyExtension *  | CreateOPMCommandProtocol (const ACHAR *pGlobalCommand, LONG lReserved=NULL)=0
 virtual OPMPropertyExtension *  | CreateOPMObjectProtocol (AcRxClass *pClass, LONG lReserved=NULL)=0
 virtual BOOL  | GetOPMManager (const ACHAR *pGlobalCommand, IPropertyManager **pManager)=0
 virtual LONG  | GetPropertyClassArray (AcRxClass *pClass, IDynamicProperty **pPropertyArray)=0
 virtual LONG  | GetPropertyClassArray (AcRxClass *pClass, IUnknown **pPropertyArray)=0
 virtual BOOL  | GetPropertyCount (AcRxClass *pClass, LONG *pPropCount)=0
 virtual BOOL  | GetPropertyCountEx (AcRxClass *pClass, LONG *pPropCount)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dynprops.h