Public Types | Public Member Functions | List of all members
AcGiMaterialTraits Class Reference
AcGi Classes
  Inheritance diagram for AcGiMaterialTraits:
 Public Types
enum  | ChannelFlags {
 kNone = 0x00000, kUseDiffuse = 0x00001, kUseSpecular = 0x00002, kUseReflection = 0x00004,
 kUseOpacity = 0x00008, kUseBump = 0x00010, kUseRefraction = 0x00020, kUseNormalMap = 0x00040,
 kUseAll
 }
enum  | IlluminationModel { kBlinnShader = 0, kMetalShader }
enum  | Mode { kRealistic = 0, kAdvanced }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiMaterialTraits)
 virtual void  | ambient (AcGiMaterialColor &color) const =0
 virtual void  | bump (AcGiMaterialMap &map) const =0
 virtual ChannelFlags  | channelFlags () const =0
 virtual void  | diffuse (AcGiMaterialColor &color, AcGiMaterialMap &map) const =0
 virtual IlluminationModel  | illuminationModel () const =0
 virtual Mode  | mode () const =0
 virtual void  | opacity (double &dPercentage, AcGiMaterialMap &map) const =0
 virtual void  | reflection (AcGiMaterialMap &map) const =0
 virtual double  | reflectivity () const =0
 virtual void  | refraction (double &dIndex, AcGiMaterialMap &map) const =0
 virtual double  | selfIllumination () const =0
 virtual void  | setAmbient (const AcGiMaterialColor &color)=0
 virtual void  | setBump (const AcGiMaterialMap &map)=0
 virtual void  | setChannelFlags (ChannelFlags flags)=0
 virtual void  | setDiffuse (const AcGiMaterialColor &color, const AcGiMaterialMap &map)=0
 virtual void  | setIlluminationModel (IlluminationModel model)=0
 virtual void  | setMode (Mode value)=0
 virtual void  | setOpacity (double dPercentage, const AcGiMaterialMap &map)=0
 virtual void  | setReflection (const AcGiMaterialMap &map)=0
 virtual void  | setReflectivity (double value)=0
 virtual void  | setRefraction (double dIndex, const AcGiMaterialMap &map)=0
 virtual void  | setSelfIllumination (double value)=0
 virtual void  | setSpecular (const AcGiMaterialColor &color, const AcGiMaterialMap &map, double dGloss)=0
 virtual void  | setTranslucence (double value)=0
 virtual void  | specular (AcGiMaterialColor &color, AcGiMaterialMap &map, double &dGloss) const =0
 virtual double  | translucence () const =0
 Public Member Functions inherited from AcGiNonEntityTraits
ACRX_DECLARE_MEMBERS (AcGiNonEntityTraits)
virtual void  | addLight (const AcDbObjectId &id)
virtual Adesk::UInt16  | color (void) const
virtual AcGiFillType  | fillType (void) const
virtual AcDbObjectId  | layerId (void) const
virtual AcDbObjectId  | lineTypeId (void) const
virtual double  | lineTypeScale (void) const
virtual AcDb::LineWeight  | lineWeight (void) const
virtual AcDbObjectId  | materialId (void) const
virtual bool  | selectionGeom (void) const
virtual void  | setColor (const Adesk::UInt16 color)
virtual void  | setFillType (const AcGiFillType fillType)
virtual void  | setLayer (const AcDbObjectId layerId)
virtual void  | setLineType (const AcDbObjectId linetypeId)
virtual void  | setLineTypeScale (double dScale)
virtual void  | setLineWeight (const AcDb::LineWeight lw)
virtual void  | setMaterial (const AcDbObjectId matId)
virtual void  | setSelectionGeom (bool bSelectionflag)
virtual void  | setSelectionMarker (const Adesk::LongPtr markerId)
virtual void  | setThickness (double thickness)
virtual void  | setTrueColor (const AcCmEntityColor &color)
virtual void  | setupForEntity (AcDbEntity *pEntity)
virtual double  | thickness (void) const
virtual AcCmEntityColor  | trueColor (void) const
 Public Member Functions inherited from AcGiDrawableTraits
ACRX_DECLARE_MEMBERS (AcGiDrawableTraits)
 Public Member Functions inherited from AcGiSubEntityTraits
ACRX_DECLARE_MEMBERS (AcGiSubEntityTraits)
 virtual Adesk::UInt32  | drawFlags (void) const
 virtual Acad::ErrorStatus  | edgeStyleOverride (AcGiEdgeStyleMask &mask, AcGiEdgeStyle &edgeStyle) const
 virtual AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &idResult) const
 virtual const AcGiMapper *  | mapper (void) const
 virtual bool  | sectionable (void) const
 virtual Acad::ErrorStatus  | setDrawFlags (Adesk::UInt32 flags)
 virtual Acad::ErrorStatus  | setEdgeStyleOverride (AcGiEdgeStyleMask mask, const AcGiEdgeStyle &edgeStyle)
 virtual void  | setMapper (const AcGiMapper *mapper)
 virtual void  | setPlotStyleName (AcDb::PlotStyleNameType type, const AcDbObjectId &id=AcDbObjectId::kNull)
 virtual void  | setSectionable (bool bSectionable)
 virtual Acad::ErrorStatus  | setShadowFlags (ShadowFlags flags)
 virtual void  | setVisualStyle (const AcDbObjectId visualStyleId)
 virtual ShadowFlags  | shadowFlags (void) const
 virtual AcDbObjectId  | visualStyle (void) const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Protected Types inherited from AcGiDrawableTraits
enum  | LayerFlags { kNone = 0x00, kOff = 0x01, kFrozen = 0x02, kZero = 0x04 }
 Protected Member Functions inherited from AcGiDrawableTraits
 virtual void  | setLayerFlags (Adesk::UInt8 flags)
 The documentation for this class was generated from the following file:
acgimaterial.h