Public Types | Public Member Functions | List of all members
AcadAppInfo Class Reference
Misc Classes
  Inheritance diagram for AcadAppInfo:
 Public Types
enum  | CmdStatus { kNoAction = 0, kRetry = 1, kShowMsg = 2, kNoModule = 3 }
 typedef AcadAppInfo::CmdStatus(*  | LoaderFunPtr )(void *)
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcadAppInfo)
const ACHAR *  | appDesc () const
bool  | appImplements (const ACHAR *) const
const ACHAR *  | appName () const
 AcadApp::ErrorStatus  | delFromRegistry (bool bObjDbx=false)
 AcadApp::LoadReasons  | loadReason ()
 bool  | managed () const
const ACHAR *  | moduleName () const
 AcadApp::ErrorStatus  | readFromRegistry ()
 AcadAppInfo::CmdStatus  | runAppLoader ()
void  | setAppDesc (const ACHAR *)
 void  | setAppLoader (LoaderFunPtr)
void  | setAppName (const ACHAR *)
 void  | setLoadReason (AcadApp::LoadReasons)
 void  | setManaged (bool bManaged)
void  | setModuleName (const ACHAR *)
 AcadApp::ErrorStatus  | status () const
AcadApp::ErrorStatus  | writeCommandNameToRegistry (const ACHAR *globalCmdName, const ACHAR *localCmdName)
AcadApp::ErrorStatus  | writeGroupNameToRegistry (const ACHAR *group)
 AcadApp::ErrorStatus  | writeToRegistry (bool bObjDbx=false, bool skipHKLM=false)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Member Function Documentation
 const ACHAR* AcadAppInfo::appDesc  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcadAppInfo::appImplements  |  ( |  const ACHAR *  |   | ) |   const
Warning
Not implemented!
 const ACHAR* AcadAppInfo::appName  |  ( |   | ) |   const
Warning
Not implemented!
 const ACHAR* AcadAppInfo::moduleName  |  ( |   | ) |   const
Warning
Not implemented!
 void AcadAppInfo::setAppDesc  |  ( |  const ACHAR *  |   | )
Warning
Not implemented!
 void AcadAppInfo::setAppName  |  ( |  const ACHAR *  |   | )
Warning
Not implemented!
 void AcadAppInfo::setModuleName  |  ( |  const ACHAR *  |   | )
Warning
Not implemented!
 AcadApp::ErrorStatus AcadAppInfo::writeCommandNameToRegistry  |  ( |  const ACHAR *  |  globalCmdName,
|  const ACHAR *  |  localCmdName
)
Warning
Not implemented!
 AcadApp::ErrorStatus AcadAppInfo::writeGroupNameToRegistry  |  ( |  const ACHAR *  |  group | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
appinfo.h