Public Member Functions | List of all members
AcDbCustomOsnapInfo Class Reference
AcDb Classes
  Inheritance diagram for AcDbCustomOsnapInfo:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbCustomOsnapInfo)
 virtual Acad::ErrorStatus  | getOsnapInfo (AcDbEntity *pickedObject, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcArray< AcGePoint3d > &snapPoints, AcDbIntArray &geomIdsForPts, AcArray< AcGeCurve3d * > &snapCurves, AcDbIntArray &geomIdsForLines)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbosnap.h