Public Member Functions | Friends | List of all members
AcDbObjectContextManager Class Reference
AcDb Classes
  Inheritance diagram for AcDbObjectContextManager:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbObjectContextManager)
AcDbObjectContextCollection *const  | contextCollection (const AcString &collectionName) const
Acad::ErrorStatus  | registerContextCollection (const AcString &collectionName, AcDbObjectContextCollection *pCollection)
Acad::ErrorStatus  | unregisterContextCollection (const AcString &collectionName)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbContextDataSubManager
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Member Function Documentation
 AcDbObjectContextCollection* const AcDbObjectContextManager::contextCollection  |  ( |  const AcString &  |  collectionName | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbObjectContextManager::registerContextCollection  |  ( |  const AcString &  |  collectionName,
|  AcDbObjectContextCollection *  |  pCollection
)
Warning
Not implemented!
 Acad::ErrorStatus AcDbObjectContextManager::unregisterContextCollection  |  ( |  const AcString &  |  collectionName | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbObjectContextManager.h