Public Member Functions | Public Attributes | List of all members
AcGiColorRGBA Class Reference
AcGi Classes
 Public Member Functions
AcGiColorRGBA (double r, double g, double b, double a)
 Public Attributes
 double  | alpha
 double  | blue
 double  | green
 double  | red
 The documentation for this class was generated from the following file:
acgi.h