Public Types | Public Member Functions | List of all members
AcGiDisplayStyle Class Reference
AcGi Classes
  Inheritance diagram for AcGiDisplayStyle:
 Public Types
enum  | DisplaySettings {
 kNone = 0, kBackgrounds = 1, kLighting = 2, kMaterials = 4,
 kTextures = 8
 }
enum  | ShadowType { kShadowsNone, kShadowsGroundPlane, kShadowsFull, kShadowsFullAndGround }
 Public Member Functions
AcGiDisplayStyle (void)
AcGiDisplayStyle (const AcGiDisplayStyle &style)
ACRX_DECLARE_MEMBERS (AcGiDisplayStyle)
virtual double  | brightness (void) const
virtual unsigned long  | displaySettings (void) const
virtual bool  | isDisplaySettingsFlagSet (DisplaySettings flag) const
virtual AcGiDisplayStyle &  | operator= (const AcGiDisplayStyle &style)
virtual bool  | operator== (const AcGiDisplayStyle &style) const
virtual void  | set (const AcGiDisplayStyle &style)
virtual void  | setBrightness (double value)
virtual void  | setDisplaySettings (unsigned long nSettings)
virtual void  | setDisplaySettingsFlag (DisplaySettings flag, bool bEnable)
virtual void  | setShadowType (ShadowType type)
virtual ShadowType  | shadowType (void) const
virtual  | ~AcGiDisplayStyle (void)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiDisplayStyle::AcGiDisplayStyle  |  ( |  void  |   | )
Warning
Not implemented!
 AcGiDisplayStyle::AcGiDisplayStyle  |  ( |  const AcGiDisplayStyle &  |  style | )
Warning
Not implemented!
 virtual AcGiDisplayStyle::~AcGiDisplayStyle  |  ( |  void  |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual double AcGiDisplayStyle::brightness  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual unsigned long AcGiDisplayStyle::displaySettings  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcGiDisplayStyle::isDisplaySettingsFlagSet  |  ( |  DisplaySettings  |  flag | ) |   const
virtual
Warning
Not implemented!
 virtual AcGiDisplayStyle& AcGiDisplayStyle::operator=  |  ( |  const AcGiDisplayStyle &  |  style | )
virtual
Warning
Not implemented!
 virtual bool AcGiDisplayStyle::operator==  |  ( |  const AcGiDisplayStyle &  |  style | ) |   const
virtual
Warning
Not implemented!
 virtual void AcGiDisplayStyle::set  |  ( |  const AcGiDisplayStyle &  |  style | )
virtual
Warning
Not implemented!
 virtual void AcGiDisplayStyle::setBrightness  |  ( |  double  |  value | )
virtual
Warning
Not implemented!
 virtual void AcGiDisplayStyle::setDisplaySettings  |  ( |  unsigned long  |  nSettings | )
virtual
Warning
Not implemented!
 virtual void AcGiDisplayStyle::setDisplaySettingsFlag  |  ( |  DisplaySettings  |  flag,
|  bool  |  bEnable
)
virtual
Warning
Not implemented!
 virtual void AcGiDisplayStyle::setShadowType  |  ( |  ShadowType  |  type | )
virtual
Warning
Not implemented!
 virtual ShadowType AcGiDisplayStyle::shadowType  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acgivisualstyle.h