Public Member Functions | Friends | List of all members
AcGiMarbleTexture Class Reference
AcGi Classes
  Inheritance diagram for AcGiMarbleTexture:
 Public Member Functions
AcGiMarbleTexture (void)
AcGiMarbleTexture (const AcGiMarbleTexture &texture)
ACRX_DECLARE_MEMBERS (AcGiMarbleTexture)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
AcGiMarbleTexture &  | operator= (const AcGiMarbleTexture &texture)
virtual bool  | operator== (const AcGiMaterialTexture &texture) const
virtual void  | setStoneColor (const AcGiMaterialColor &stoneColor)
virtual void  | setVeinColor (const AcGiMaterialColor &veinColor)
virtual void  | setVeinSpacing (double veinSpacing)
virtual void  | setVeinWidth (double veinWidth)
virtual const AcGiMaterialColor &  | stoneColor (void) const
virtual const AcGiMaterialColor &  | veinColor (void) const
virtual double  | veinSpacing (void) const
virtual double  | veinWidth (void) const
virtual  | ~AcGiMarbleTexture (void)
 Public Member Functions inherited from AcGiProceduralTexture
ACRX_DECLARE_MEMBERS (AcGiProceduralTexture)
 Public Member Functions inherited from AcGiMaterialTexture
ACRX_DECLARE_MEMBERS (AcGiMaterialTexture)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcGiImpMarbleTexture
 Additional Inherited Members
 Public Types inherited from AcGiProceduralTexture
enum  | Type { kWood = 0, kMarble, kGeneric }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiMarbleTexture::AcGiMarbleTexture  |  ( |  void  |   | )
Warning
Not implemented!
 virtual AcGiMarbleTexture::~AcGiMarbleTexture  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 AcGiMarbleTexture::AcGiMarbleTexture  |  ( |  const AcGiMarbleTexture &  |  texture | )
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcGiMarbleTexture::copyFrom  |  ( |  const AcRxObject *  |  other | )
virtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 AcGiMarbleTexture& AcGiMarbleTexture::operator=  |  ( |  const AcGiMarbleTexture &  |  texture | )
Warning
Not implemented!
 virtual bool AcGiMarbleTexture::operator==  |  ( |  const AcGiMaterialTexture &  |  texture | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcGiMaterialTexture.
 virtual void AcGiMarbleTexture::setStoneColor  |  ( |  const AcGiMaterialColor &  |  stoneColor | )
virtual
Warning
Not implemented!
 virtual void AcGiMarbleTexture::setVeinColor  |  ( |  const AcGiMaterialColor &  |  veinColor | )
virtual
Warning
Not implemented!
 virtual void AcGiMarbleTexture::setVeinSpacing  |  ( |  double  |  veinSpacing | )
virtual
Warning
Not implemented!
 virtual void AcGiMarbleTexture::setVeinWidth  |  ( |  double  |  veinWidth | )
virtual
Warning
Not implemented!
 virtual const AcGiMaterialColor& AcGiMarbleTexture::stoneColor  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual const AcGiMaterialColor& AcGiMarbleTexture::veinColor  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual double AcGiMarbleTexture::veinSpacing  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 virtual double AcGiMarbleTexture::veinWidth  |  ( |  void  |   | ) |   const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acgimaterial.h