Public Member Functions | List of all members
AcPlPlotEngine Class Reference
AcPl Classes
 Public Member Functions
 virtual Acad::ErrorStatus  | beginDocument (AcPlPlotInfo &plotInfo, const ACHAR *pDocname, void *pParams=NULL, long nCopies=1, bool bPlotToFile=false, const ACHAR *pFileName=NULL)
 virtual Acad::ErrorStatus  | beginGenerateGraphics (void *pParams=NULL)
 virtual Acad::ErrorStatus  | beginGenerateGraphics (AcViewport *&pViewport, void *pParams=NULL)
 virtual Acad::ErrorStatus  | beginPage (AcPlPlotPageInfo &pageInfo, AcPlPlotInfo &plotInfo, bool bLastPage, void *pParams=NULL)
 virtual Acad::ErrorStatus  | beginPlot (AcPlPlotProgress *pPlotProgress, void *pParams=NULL)
 virtual void  | destroy ()
 virtual Acad::ErrorStatus  | endDocument (void *pParams=NULL)
 virtual Acad::ErrorStatus  | endGenerateGraphics (void *pParams=NULL)
 virtual Acad::ErrorStatus  | endPage (void *pParams=NULL)
 virtual Acad::ErrorStatus  | endPlot (void *pParams=NULL)
 virtual bool  | isBackgroundPackaging () const
 The documentation for this class was generated from the following file:
acplplotengine.h