Public Member Functions | Friends | List of all members
AcDbXrecordIterator Class Reference
AcDb Classes
  Inheritance diagram for AcDbXrecordIterator:
 Public Member Functions
AcDbXrecordIterator (const AcDbXrecord *pXrecord)
ACRX_DECLARE_MEMBERS (AcDbXrecordIterator)
 int  | curRestype () const
 bool  | done () const
 Acad::ErrorStatus  | getCurResbuf (resbuf &outItem, AcDbDatabase *db) const
 Acad::ErrorStatus  | next ()
 void  | start ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpXrecord
 class  | AcDbXrecord
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbxrecrd.h