Public Member Functions | List of all members
AcDbLayerStateManagerReactor Class Reference
AcDb Classes
  Inheritance diagram for AcDbLayerStateManagerReactor:
 Public Member Functions
 virtual void  | abortLayerStateDelete (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
 virtual void  | abortLayerStateRename (const ACHAR *oldLayerStateName, const ACHAR *newLayerStateName)
 virtual void  | abortLayerStateRestore (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
ACRX_DECLARE_MEMBERS (AcDbLayerStateManagerReactor)
 virtual void  | layerStateCompareFailed (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
 virtual void  | layerStateCreated (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
 virtual void  | layerStateDeleted (const ACHAR *layerStateName)
 virtual void  | layerStateRenamed (const ACHAR *oldLayerStateName, const ACHAR *newLayerStateName)
 virtual void  | layerStateRestored (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
 virtual void  | layerStateToBeDeleted (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
 virtual void  | layerStateToBeRenamed (const ACHAR *oldLayerStateName, const ACHAR *newLayerStateName)
 virtual void  | layerStateToBeRestored (const ACHAR *layerStateName, const AcDbObjectId &layerStateId)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dblstate.h