Public Member Functions | Protected Member Functions | List of all members
AcLyLayerGroup Class Reference
AcLy Classes
  Inheritance diagram for AcLyLayerGroup:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcLyLayerGroup)
 virtual Acad::ErrorStatus  | addLayerId (const AcDbObjectId &id)
 virtual const AcDbObjectIdArray &  | layerIds () const
 virtual Acad::ErrorStatus  | removeLayerId (const AcDbObjectId &id)
 Public Member Functions inherited from AcLyLayerFilter
ACRX_DECLARE_MEMBERS (AcLyLayerFilter)
 virtual Acad::ErrorStatus  | addNested (AcLyLayerFilter *filter)
 virtual bool  | allowDelete () const
 virtual bool  | allowNested () const
 virtual bool  | allowRename () const
 virtual bool  | compareTo (const AcLyLayerFilter *pOther) const
 virtual bool  | dynamicallyGenerated () const
 virtual bool  | filter (AcDbLayerTableRecord *layer) const
 virtual const ACHAR *  | filterExpression () const
 virtual const AcLyBoolExpr *  | filterExpressionTree () const
 virtual Acad::ErrorStatus  | generateNested ()
 virtual Acad::ErrorStatus  | getImages (HIMAGELIST &imageList, Adesk::UInt32 &normalImage, Adesk::UInt32 &selected) const
 virtual const AcArray
 < AcLyLayerFilter * > &  | getNestedFilters () const
 virtual bool  | isIdFilter () const
 virtual bool  | isProxy () const
 virtual const ACHAR *  | name () const
 virtual AcLyLayerFilter *  | parent () const
 virtual Acad::ErrorStatus  | readFrom (AcDbDxfFiler *filer)
 virtual Acad::ErrorStatus  | removeNested (AcLyLayerFilter *filter)
 virtual Acad::ErrorStatus  | setFilterExpression (const ACHAR *expr)
 virtual Acad::ErrorStatus  | setName (const ACHAR *)
 virtual DialogResult  | showEditor ()
 virtual Acad::ErrorStatus  | writeTo (AcDbDxfFiler *pFiler) const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
AcLyLayerGroup (AcLySystemInternals *)
 Protected Member Functions inherited from AcLyLayerFilter
AcLyLayerFilter (AcLySystemInternals *)
 Additional Inherited Members
 Public Types inherited from AcLyLayerFilter
enum  | DialogResult { kOk = 0, kCancel = 1, kUseDefault = 2 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 The documentation for this class was generated from the following file:
acly.h