Public Types | Public Member Functions | List of all members
AcGiWebLightTraits Class Reference
AcGi Classes
  Inheritance diagram for AcGiWebLightTraits:
 Public Types
enum  | WebFileType { kTypeC = 1, kTypeB = 2, kTypeA = 3 }
enum  | WebSymmetry { kNoSymmetry = 0, kSingleSymmetry = 1, kDoubleSymmetry = 2, kAxialSymmetry = 3 }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiWebLightTraits)
 virtual void  | setWebFile (const ACHAR *webFile)=0
 virtual void  | setWebFileType (WebFileType type)=0
 virtual void  | setWebFlux (double flux) const =0
 virtual void  | setWebHorzAng90to270 (bool bIs90to270)=0
 virtual void  | setWebRotation (AcGeVector3d rotation)=0
 virtual void  | setWebSymmetry (WebSymmetry symmetry)=0
 virtual void  | webFile (AcString &webFile) const =0
 virtual WebFileType  | webFileType (void) const =0
 virtual double  | webFlux () const =0
 virtual bool  | webHorzAng90to270 (void) const =0
 virtual void  | webRotation (AcGeVector3d &rotation) const =0
 virtual WebSymmetry  | webSymmetry (void) const =0
 Public Member Functions inherited from AcGiPointLightTraits2
ACRX_DECLARE_MEMBERS (AcGiPointLightTraits2)
 virtual bool  | hasTarget (void) const =0
 virtual void  | lampColor (AcGiColorRGB &rgbColor) const =0
 virtual double  | physicalIntensity () const =0
 virtual void  | setHasTarget (bool bHasTarget)=0
 virtual void  | setLampColor (const AcGiColorRGB &rgbColor)=0
 virtual void  | setPhysicalIntensity (double physicalIntensity)=0
 virtual void  | setShadowParameters (const AcGiShadowParameters2 &params)=0
 virtual void  | setTargetLocation (const AcGePoint3d &loc)=0
 virtual void  | shadowParameters (AcGiShadowParameters2 &params) const =0
 virtual AcGePoint3d  | targetLocation () const =0
 Public Member Functions inherited from AcGiPointLightTraits
ACRX_DECLARE_MEMBERS (AcGiPointLightTraits)
 virtual void  | lightAttenuation (AcGiLightAttenuation &atten) const =0
 virtual AcGePoint3d  | position () const =0
 virtual void  | setAttenuation (const AcGiLightAttenuation &atten)=0
 virtual void  | setPosition (const AcGePoint3d &pos)=0
 Public Member Functions inherited from AcGiStandardLightTraits
ACRX_DECLARE_MEMBERS (AcGiStandardLightTraits)
 virtual double  | intensity () const =0
 virtual AcCmColor  | lightColor () const =0
 virtual void  | setIntensity (double inten)=0
 virtual void  | setLightColor (const AcCmColor &color)=0
 virtual void  | setShadowParameters (const AcGiShadowParameters &params)=0
 virtual void  | shadowParameters (AcGiShadowParameters &params) const =0
 Public Member Functions inherited from AcGiLightTraits
ACRX_DECLARE_MEMBERS (AcGiLightTraits)
 virtual bool  | isOn () const =0
 virtual void  | setOn (bool on)=0
 Public Member Functions inherited from AcGiNonEntityTraits
ACRX_DECLARE_MEMBERS (AcGiNonEntityTraits)
virtual void  | addLight (const AcDbObjectId &id)
virtual Adesk::UInt16  | color (void) const
virtual AcGiFillType  | fillType (void) const
virtual AcDbObjectId  | layerId (void) const
virtual AcDbObjectId  | lineTypeId (void) const
virtual double  | lineTypeScale (void) const
virtual AcDb::LineWeight  | lineWeight (void) const
virtual AcDbObjectId  | materialId (void) const
virtual bool  | selectionGeom (void) const
virtual void  | setColor (const Adesk::UInt16 color)
virtual void  | setFillType (const AcGiFillType fillType)
virtual void  | setLayer (const AcDbObjectId layerId)
virtual void  | setLineType (const AcDbObjectId linetypeId)
virtual void  | setLineTypeScale (double dScale)
virtual void  | setLineWeight (const AcDb::LineWeight lw)
virtual void  | setMaterial (const AcDbObjectId matId)
virtual void  | setSelectionGeom (bool bSelectionflag)
virtual void  | setSelectionMarker (const Adesk::LongPtr markerId)
virtual void  | setThickness (double thickness)
virtual void  | setTrueColor (const AcCmEntityColor &color)
virtual void  | setupForEntity (AcDbEntity *pEntity)
virtual double  | thickness (void) const
virtual AcCmEntityColor  | trueColor (void) const
 Public Member Functions inherited from AcGiDrawableTraits
ACRX_DECLARE_MEMBERS (AcGiDrawableTraits)
 Public Member Functions inherited from AcGiSubEntityTraits
ACRX_DECLARE_MEMBERS (AcGiSubEntityTraits)
 virtual Adesk::UInt32  | drawFlags (void) const
 virtual Acad::ErrorStatus  | edgeStyleOverride (AcGiEdgeStyleMask &mask, AcGiEdgeStyle &edgeStyle) const
 virtual AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &idResult) const
 virtual const AcGiMapper *  | mapper (void) const
 virtual bool  | sectionable (void) const
 virtual Acad::ErrorStatus  | setDrawFlags (Adesk::UInt32 flags)
 virtual Acad::ErrorStatus  | setEdgeStyleOverride (AcGiEdgeStyleMask mask, const AcGiEdgeStyle &edgeStyle)
 virtual void  | setMapper (const AcGiMapper *mapper)
 virtual void  | setPlotStyleName (AcDb::PlotStyleNameType type, const AcDbObjectId &id=AcDbObjectId::kNull)
 virtual void  | setSectionable (bool bSectionable)
 virtual Acad::ErrorStatus  | setShadowFlags (ShadowFlags flags)
 virtual void  | setVisualStyle (const AcDbObjectId visualStyleId)
 virtual ShadowFlags  | shadowFlags (void) const
 virtual AcDbObjectId  | visualStyle (void) const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Protected Types inherited from AcGiDrawableTraits
enum  | LayerFlags { kNone = 0x00, kOff = 0x01, kFrozen = 0x02, kZero = 0x04 }
 Protected Member Functions inherited from AcGiDrawableTraits
 virtual void  | setLayerFlags (Adesk::UInt8 flags)
 The documentation for this class was generated from the following file:
AcGiLightTraits.h