Public Member Functions | List of all members
AcApProfileManager Class Reference
AcAp Classes
 Public Member Functions
 virtual void  | addReactor (AcApProfileManagerReactor *)=0
 virtual Acad::ErrorStatus  | FixedProfileStorage (AcApProfileStorage *&pStore, BOOL bCreateIfNotExists=TRUE)=0
 virtual Acad::ErrorStatus  | ProfileCopy (const ACHAR *newProfileName, const ACHAR *oldProfileName, const ACHAR *newProfileDesc)=0
 virtual Acad::ErrorStatus  | ProfileDelete (const ACHAR *strProfileName)=0
 virtual Acad::ErrorStatus  | ProfileExport (const ACHAR *strProfileName, const ACHAR *exportFileName)=0
 virtual Acad::ErrorStatus  | ProfileImport (const ACHAR *strProfileName, const ACHAR *importFileName, const ACHAR *profileDescription, Adesk::Boolean bImportPathInfo)=0
 virtual int  | ProfileListNames (AcApProfileNameArray &nameList)=0
 virtual void  | ProfileRegistryKey (ACHAR *&strRegProfileKey, const ACHAR *strProfileName)=0
 virtual Acad::ErrorStatus  | ProfileRename (const ACHAR *newProfileName, const ACHAR *oldProfileName, const ACHAR *newProfileDesc)=0
 virtual Acad::ErrorStatus  | ProfileReset (const ACHAR *strProfileName)=0
 virtual Acad::ErrorStatus  | ProfileSetCurrent (const ACHAR *strProfileName)=0
 virtual Acad::ErrorStatus  | ProfileStorage (AcApProfileStorage *&pStore, const ACHAR *strProfileName, BOOL bCreateIfNotExists=TRUE)=0
 virtual void  | removeReactor (AcApProfileManagerReactor *)=0
 The documentation for this class was generated from the following file:
acprofile.h