Public Member Functions | List of all members
AcPlPlotPageInfo Class Reference
AcPl Classes
  Inheritance diagram for AcPlPlotPageInfo:
 Public Member Functions
 ACPL_PORT long  | entityCount () const
 ACPL_PORT long  | gradientCount () const
 ACPL_PORT long  | oleObjectCount () const
 ACPL_PORT long  | rasterCount () const
 ACPL_PORT long  | shadedViewportType () const
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 The documentation for this class was generated from the following file:
acplplotengine.h