Public Types | Public Member Functions | Protected Member Functions | List of all members
AcDbMLeaderStyle Class Reference
AcDb Classes
  Inheritance diagram for AcDbMLeaderStyle:
 Public Types
enum  | BlockConnectionType { kConnectExtents = 0, kConnectBase = 1 }
enum  | ContentType { kNoneContent = 0, kBlockContent = 1, kMTextContent = 2, kToleranceContent = 3 }
enum  | DrawLeaderOrderType { kDrawLeaderHeadFirst = 0, kDrawLeaderTailFirst = 1 }
enum  | DrawMLeaderOrderType { kDrawContentFirst = 0, kDrawLeaderFirst = 1 }
enum  | LeaderDirectionType {
 kUnknownLeader = 0, kLeftLeader = 1, kRightLeader = 2, kTopLeader = 3,
 kBottomLeader = 4
 }
enum  | LeaderType { kInVisibleLeader = 0, kStraightLeader = 1, kSplineLeader = 2 }
enum  | SegmentAngleType {
 kAny = 0, k15 = 1, k30 = 2, k45 = 3,
 k60 = 4, k90 = 6, kHorz = 12
 }
enum  | TextAlignmentType { kLeftAlignment = 0, kCenterAlignment = 1, kRightAlignment = 2 }
enum  | TextAngleType { kInsertAngle = 0, kHorizontalAngle = 1, kAlwaysRightReadingAngle = 2 }
enum  | TextAttachmentDirection { kAttachmentHorizontal = 0, kAttachmentVertical = 1 }
enum  | TextAttachmentType {
 kAttachmentTopOfTop = 0, kAttachmentMiddleOfTop = 1, kAttachmentMiddle = 2, kAttachmentMiddleOfBottom = 3,
 kAttachmentBottomOfBottom = 4, kAttachmentBottomLine = 5, kAttachmentBottomOfTopLine = 6, kAttachmentBottomOfTop = 7,
 kAttachmentAllLine = 8, kAttachmentCenter = 9, kAttachmentLinedCenter = 10
 }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbMLeaderStyle)
double  | alignSpace () const
bool  | annotative () const
 double  | arrowSize () const
AcDbObjectId  | arrowSymbolId () const
virtual Adesk::UInt32  | bitFlags () const
AcCmColor  | blockColor () const
BlockConnectionType  | blockConnectionType () const
AcDbObjectId  | blockId () const
double  | blockRotation () const
AcGeScale3d  | blockScale () const
double  | breakSize () const
 ContentType  | contentType () const
 AcDbMText *  | defaultMText () const
 virtual const ACHAR *  | description (void) const
 double  | doglegLength () const
 DrawLeaderOrderType  | drawLeaderOrderType () const
 DrawMLeaderOrderType  | drawMLeaderOrderType () const
 bool  | enableBlockRotation () const
 bool  | enableBlockScale () const
 bool  | enableDogleg () const
 bool  | enableFrameText () const
 bool  | enableLanding () const
 bool  | extendLeaderToText () const
 SegmentAngleType  | firstSegmentAngleConstraint () const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 virtual Acad::ErrorStatus  | getName (ACHAR *&pszName) const
 double  | landingGap () const
 AcCmColor  | leaderLineColor () const
 LeaderType  | leaderLineType () const
 AcDbObjectId  | leaderLineTypeId () const
 AcDb::LineWeight  | leaderLineWeight () const
 int  | maxLeaderSegmentsPoints () const
 bool  | overwritePropChanged () const
 Acad::ErrorStatus  | postMLeaderStyleToDb (AcDbDatabase *pDb, const ACHAR *styleName, AcDbObjectId &mleaderStyleId)
 double  | scale () const
 SegmentAngleType  | secondSegmentAngleConstraint () const
 Acad::ErrorStatus  | setAlignSpace (double alignSpace)
 Acad::ErrorStatus  | setAnnotative (bool isAnnotative)
Acad::ErrorStatus  | setArrowSize (double arrowSize)
 Acad::ErrorStatus  | setArrowSymbolId (const ACHAR *name)
 Acad::ErrorStatus  | setArrowSymbolId (AcDbObjectId arrowSymbolId)
 virtual Acad::ErrorStatus  | setBitFlags (Adesk::UInt32 flags)
 Acad::ErrorStatus  | setBlockColor (const AcCmColor &blockColor)
 Acad::ErrorStatus  | setBlockConnectionType (BlockConnectionType blockConnectionType)
 Acad::ErrorStatus  | setBlockId (const ACHAR *name)
 Acad::ErrorStatus  | setBlockId (AcDbObjectId blockId)
 Acad::ErrorStatus  | setBlockRotation (double rotation)
 Acad::ErrorStatus  | setBlockScale (const AcGeScale3d &scale)
 Acad::ErrorStatus  | setBreakSize (double size)
 Acad::ErrorStatus  | setContentType (ContentType contentType)
 Acad::ErrorStatus  | setDefaultMText (const AcDbMText *defaultMText)
 virtual Acad::ErrorStatus  | setDescription (const ACHAR *pszDescription)
 Acad::ErrorStatus  | setDoglegLength (double doglegLength)
 Acad::ErrorStatus  | setDrawLeaderOrderType (DrawLeaderOrderType drawLeaderOrderType)
 Acad::ErrorStatus  | setDrawMLeaderOrderType (DrawMLeaderOrderType drawMLeaderOrderType)
 Acad::ErrorStatus  | setEnableBlockRotation (bool enableBlockRotation)
 Acad::ErrorStatus  | setEnableBlockScale (bool enableBlockScale)
 Acad::ErrorStatus  | setEnableDogleg (bool enableDogleg)
 Acad::ErrorStatus  | setEnableFrameText (bool enableFrameText)
 Acad::ErrorStatus  | setEnableLanding (bool enableLanding)
 Acad::ErrorStatus  | setExtendLeaderToText (bool value)
 Acad::ErrorStatus  | setFirstSegmentAngleConstraint (SegmentAngleType angle)
 Acad::ErrorStatus  | setLandingGap (double landingGap)
 Acad::ErrorStatus  | setLeaderLineColor (const AcCmColor &leaderLineColor)
 Acad::ErrorStatus  | setLeaderLineType (LeaderType leaderLineType)
 Acad::ErrorStatus  | setLeaderLineTypeId (AcDbObjectId leaderLineTypeId)
 Acad::ErrorStatus  | setLeaderLineWeight (AcDb::LineWeight leaderLineWeight)
 Acad::ErrorStatus  | setMaxLeaderSegmentsPoints (int maxLeaderSegmentsPoints)
 virtual Acad::ErrorStatus  | setName (const ACHAR *pszName)
 Acad::ErrorStatus  | setScale (double scale)
 Acad::ErrorStatus  | setSecondSegmentAngleConstraint (SegmentAngleType angle)
 Acad::ErrorStatus  | setTextAlignAlwaysLeft (bool bAlwaysLeft)
 Acad::ErrorStatus  | setTextAlignmentType (TextAlignmentType textAlignmentType)
 Acad::ErrorStatus  | setTextAngleType (TextAngleType textAngleType)
 Acad::ErrorStatus  | setTextAttachmentDirection (AcDbMLeaderStyle::TextAttachmentDirection textAttachmentDirection)
 Acad::ErrorStatus  | setTextAttachmentType (TextAttachmentType textAttachmentType, LeaderDirectionType leaderDirection)
 Acad::ErrorStatus  | setTextAttachmentType (TextAttachmentType textAttachmentType)
 Acad::ErrorStatus  | setTextColor (const AcCmColor &textColor)
 Acad::ErrorStatus  | setTextHeight (double textHeight)
 Acad::ErrorStatus  | setTextStyleId (AcDbObjectId textStyleId)
 bool  | textAlignAlwaysLeft () const
 TextAlignmentType  | textAlignmentType () const
 TextAngleType  | textAngleType () const
 TextAttachmentDirection  | textAttachmentDirection () const
 TextAttachmentType  | textAttachmentType (LeaderDirectionType leaderDirection) const
 TextAttachmentType  | textAttachmentType () const
AcCmColor  | textColor () const
 double  | textHeight () const
 AcDbObjectId  | textStyleId () const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual AcGsNode *  | gsNode () const
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 virtual void  | setGsNode (AcGsNode *pNode)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual void  | viewportDraw (AcGiViewportDraw *pVd)
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Member Function Documentation
 double AcDbMLeaderStyle::alignSpace  |  ( |   | ) |   const
Warning
Not implemented!
 bool AcDbMLeaderStyle::annotative  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbMLeaderStyle::arrowSymbolId  |  ( |   | ) |   const
Warning
Not implemented!
 virtual Adesk::UInt32 AcDbMLeaderStyle::bitFlags  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 AcCmColor AcDbMLeaderStyle::blockColor  |  ( |   | ) |   const
Warning
Not implemented!
 BlockConnectionType AcDbMLeaderStyle::blockConnectionType  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbObjectId AcDbMLeaderStyle::blockId  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbMLeaderStyle::blockRotation  |  ( |   | ) |   const
Warning
Not implemented!
 AcGeScale3d AcDbMLeaderStyle::blockScale  |  ( |   | ) |   const
Warning
Not implemented!
 double AcDbMLeaderStyle::breakSize  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbMLeaderStyle::setArrowSize  |  ( |  double  |  arrowSize | )
Warning
Not implemented!
 AcCmColor AcDbMLeaderStyle::textColor  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbmleaderstyle.h