Public Types | Public Member Functions | List of all members
AcDbSectionSettings Class Reference
AcDb Classes
  Inheritance diagram for AcDbSectionSettings:
 Public Types
enum  | Generation {
 kSourceAllObjects = (0x1 << 0), kSourceSelectedObjects = (0x1 << 1), kDestinationNewBlock = (0x1 << 4), kDestinationReplaceBlock = (0x1 << 5),
 kDestinationFile = (0x1 << 6)
 }
enum  | Geometry {
 kIntersectionBoundary = (0x1 << 0), kIntersectionFill = (0x1 << 1), kBackgroundGeometry = (0x1 << 2), kForegroundGeometry = (0x1 << 3),
 kCurveTangencyLines = (0x1 << 4)
 }
enum  | SectionType { kLiveSection = (0x1 << 0), k2dSection = (0x1 << 1), k3dSection = (0x1 << 2) }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbSectionSettings)
AcDbSectionSettings ()
ACDB_PORT AcCmColor  | color (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT
 AcDbSectionSettings::SectionType  | currentSectionType (void) const
ACDB_PORT AcDbObjectId  | destinationBlock (AcDbSectionSettings::SectionType nSecType) const
ACDB_PORT const ACHAR *  | destinationFile (AcDbSectionSettings::SectionType nSecType) const
ACDB_PORT bool  | divisionLines (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT int  | edgeTransparency (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT int  | faceTransparency (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT
 AcDbSectionSettings::Generation  | generationOptions (AcDbSectionSettings::SectionType nSecType) const
virtual ACDB_PORT Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
ACDB_PORT Acad::ErrorStatus  | getHatchPattern (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, AcDbHatch::HatchPatternType &nPatternType, const ACHAR *&pszPatternName) const
ACDB_PORT Acad::ErrorStatus  | getSourceObjects (AcDbSectionSettings::SectionType nSecType, AcDbObjectIdArray &ids) const
ACDB_PORT double  | hatchAngle (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT double  | hatchScale (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT double  | hatchSpacing (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT bool  | hatchVisibility (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT bool  | hiddenLine (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT const ACHAR *  | layer (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT const ACHAR *  | linetype (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT double  | linetypeScale (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT AcDb::LineWeight  | lineWeight (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT const ACHAR *  | plotStyleName (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
ACDB_PORT Acad::ErrorStatus  | reset (void)
ACDB_PORT Acad::ErrorStatus  | reset (AcDbSectionSettings::SectionType nSecType)
ACDB_PORT Acad::ErrorStatus  | setColor (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, const AcCmColor &color)
ACDB_PORT Acad::ErrorStatus  | setCurrentSectionType (AcDbSectionSettings::SectionType nSecType)
ACDB_PORT Acad::ErrorStatus  | setDestinationBlock (AcDbSectionSettings::SectionType nSecType, const AcDbObjectId &id)
ACDB_PORT Acad::ErrorStatus  | setDestinationFile (AcDbSectionSettings::SectionType nSecType, const ACHAR *pszFileName)
ACDB_PORT Acad::ErrorStatus  | setDivisionLines (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, bool bShow)
ACDB_PORT Acad::ErrorStatus  | setEdgeTransparency (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, int nTransparency)
ACDB_PORT Acad::ErrorStatus  | setFaceTransparency (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, int nTransparency)
ACDB_PORT Acad::ErrorStatus  | setGenerationOptions (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Generation nOptions)
ACDB_PORT Acad::ErrorStatus  | setHatchAngle (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, double fAngle)
ACDB_PORT Acad::ErrorStatus  | setHatchPattern (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, AcDbHatch::HatchPatternType nPatternType, const ACHAR *pszPatternName)
ACDB_PORT Acad::ErrorStatus  | setHatchScale (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, double fScale)
ACDB_PORT Acad::ErrorStatus  | setHatchSpacing (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, double fSpacing)
ACDB_PORT Acad::ErrorStatus  | setHatchVisibility (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, bool bVisible)
ACDB_PORT Acad::ErrorStatus  | setHiddenLine (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, bool bHiddenLine)
ACDB_PORT Acad::ErrorStatus  | setLayer (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, const ACHAR *pszLayer)
ACDB_PORT Acad::ErrorStatus  | setLinetype (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, const ACHAR *pszLinetype)
ACDB_PORT Acad::ErrorStatus  | setLinetypeScale (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, double fScale)
ACDB_PORT Acad::ErrorStatus  | setLineWeight (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, AcDb::LineWeight nLineWeight)
ACDB_PORT Acad::ErrorStatus  | setPlotStyleName (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, const ACHAR *pszPlotStyleName)
ACDB_PORT Acad::ErrorStatus  | setSourceObjects (AcDbSectionSettings::SectionType nSecType, const AcDbObjectIdArray &ids)
ACDB_PORT Acad::ErrorStatus  | setVisibility (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry, bool bVisible)
ACDB_PORT bool  | visibility (AcDbSectionSettings::SectionType nSecType, AcDbSectionSettings::Geometry nGeometry) const
~AcDbSectionSettings ()
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual AcGsNode *  | gsNode () const
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 virtual void  | setGsNode (AcGsNode *pNode)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual void  | viewportDraw (AcGiViewportDraw *pVd)
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Constructor & Destructor Documentation
 AcDbSectionSettings::AcDbSectionSettings  |  ( |   | )
Warning
Not implemented!
 AcDbSectionSettings::~AcDbSectionSettings  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 ACDB_PORT AcCmColor AcDbSectionSettings::color  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT AcDbSectionSettings::SectionType AcDbSectionSettings::currentSectionType  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 ACDB_PORT AcDbObjectId AcDbSectionSettings::destinationBlock  |  ( |  AcDbSectionSettings::SectionType  |  nSecType | ) |   const
Warning
Not implemented!
 ACDB_PORT const ACHAR* AcDbSectionSettings::destinationFile  |  ( |  AcDbSectionSettings::SectionType  |  nSecType | ) |   const
Warning
Not implemented!
 ACDB_PORT bool AcDbSectionSettings::divisionLines  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT int AcDbSectionSettings::edgeTransparency  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT int AcDbSectionSettings::faceTransparency  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT AcDbSectionSettings::Generation AcDbSectionSettings::generationOptions  |  ( |  AcDbSectionSettings::SectionType  |  nSecType | ) |   const
Warning
Not implemented!
 virtual ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::getClassID  |  ( |  CLSID *  |  pClsid | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::getHatchPattern  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  AcDbHatch::HatchPatternType &  |  nPatternType,
|  const ACHAR *&  |  pszPatternName
) |   |  const
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::getSourceObjects  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbObjectIdArray &  |  ids
) |   |  const
Warning
Not implemented!
 ACDB_PORT double AcDbSectionSettings::hatchAngle  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT double AcDbSectionSettings::hatchScale  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT double AcDbSectionSettings::hatchSpacing  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT bool AcDbSectionSettings::hatchVisibility  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT bool AcDbSectionSettings::hiddenLine  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT const ACHAR* AcDbSectionSettings::layer  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT const ACHAR* AcDbSectionSettings::linetype  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT double AcDbSectionSettings::linetypeScale  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT AcDb::LineWeight AcDbSectionSettings::lineWeight  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT const ACHAR* AcDbSectionSettings::plotStyleName  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::reset  |  ( |  void  |   | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::reset  |  ( |  AcDbSectionSettings::SectionType  |  nSecType | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setColor  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  const AcCmColor &  |  color
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setCurrentSectionType  |  ( |  AcDbSectionSettings::SectionType  |  nSecType | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setDestinationBlock  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  const AcDbObjectId &  |  id
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setDestinationFile  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  const ACHAR *  |  pszFileName
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setDivisionLines  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  bool  |  bShow
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setEdgeTransparency  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  int  |  nTransparency
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setFaceTransparency  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  int  |  nTransparency
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setGenerationOptions  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Generation  |  nOptions
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setHatchAngle  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  double  |  fAngle
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setHatchPattern  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  AcDbHatch::HatchPatternType  |  nPatternType,
|  const ACHAR *  |  pszPatternName
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setHatchScale  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  double  |  fScale
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setHatchSpacing  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  double  |  fSpacing
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setHatchVisibility  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  bool  |  bVisible
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setHiddenLine  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  bool  |  bHiddenLine
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setLayer  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  const ACHAR *  |  pszLayer
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setLinetype  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  const ACHAR *  |  pszLinetype
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setLinetypeScale  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  double  |  fScale
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setLineWeight  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  AcDb::LineWeight  |  nLineWeight
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setPlotStyleName  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  const ACHAR *  |  pszPlotStyleName
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setSourceObjects  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  const AcDbObjectIdArray &  |  ids
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus AcDbSectionSettings::setVisibility  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry,
|  bool  |  bVisible
)
Warning
Not implemented!
 ACDB_PORT bool AcDbSectionSettings::visibility  |  ( |  AcDbSectionSettings::SectionType  |  nSecType,
|  AcDbSectionSettings::Geometry  |  nGeometry
) |   |  const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
DbSection.h