Public Member Functions | List of all members
AcGiMaterialTexture Class Reference
AcGi Classes
  Inheritance diagram for AcGiMaterialTexture:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiMaterialTexture)
 virtual bool  | operator== (const AcGiMaterialTexture &texture) const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acgimaterial.h