Public Member Functions | List of all members
AcEdSelectionSetService Class Reference
AcEd Classes
 Public Member Functions
 virtual Acad::ErrorStatus  | add (resbuf *ssnameXList, const AcDbFullSubentPath *pPath=NULL, const AcDbObjectId *pEntselSubent=NULL)=0
 virtual Acad::ErrorStatus  | addSubentity (resbuf *ssnameXList, const AcDbFullSubentPath &subEntity)=0
 virtual Acad::ErrorStatus  | highlight (int subSelectionIndex, const AcDbFullSubentPath &path)=0
 virtual Acad::ErrorStatus  | remove (int index)=0
 virtual Acad::ErrorStatus  | removeSubentity (int entityIndex, int subEntityIndex)=0
 virtual Acad::ErrorStatus  | ssNameSubentities (bool bIsSubSelectionIndex, int index, AcDbFullSubentPathArray &subEntities)=0
 virtual Acad::ErrorStatus  | ssNameSubentityX (bool bIsSubSelectionIndex, int index, int subentityIndex, resbuf *&result)=0
 virtual Acad::ErrorStatus  | ssNameX (bool bIsSubSelectionIndex, int index, resbuf *&result)=0
 The documentation for this class was generated from the following file:
acssgetfilter.h