Public Types | Public Member Functions | Static Public Attributes | List of all members
AcGiMaterialMap Class Reference
AcGi Classes
  Inheritance diagram for AcGiMaterialMap:
 Public Types
enum  | Filter { kFilterDefault = 0, kFilterNone }
enum  | Source { kScene = 0, kFile, kProcedural }
 Public Member Functions
AcGiMaterialMap (const AcGiMaterialMap &matMap)
ACRX_DECLARE_MEMBERS (AcGiMaterialMap)
 virtual double  | blendFactor (void) const
 ACGIMAT_IMPEXP Filter  | filter (void) const
 virtual const AcGiMapper &  | mapper (void) const
 AcGiMaterialMap &  | operator= (const AcGiMaterialMap &matMap)
 bool  | operator== (const AcGiMaterialMap &matMap) const
 virtual void  | set (const AcGiMaterialMap &matMap)
 virtual void  | setBlendFactor (double blendFactor)
 ACGIMAT_IMPEXP Acad::ErrorStatus  | setFilter (Filter filter)
 virtual void  | setMapper (const AcGiMapper &mapper)
 virtual void  | setSource (Source source)
 virtual ADESK_DEPRECATED void  | setSourceFileName (const ACHAR *fileName)
 virtual void  | setTexture (const AcGiMaterialTexture *pTexture)
 virtual Source  | source (void) const
 virtual ADESK_DEPRECATED const
 ACHAR *  | sourceFileName (void) const
 virtual const AcGiMaterialTexture *  | texture (void) const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Attributes
 static ACGIMAT_IMPEXP const
 AcGiMaterialMap  | kNull
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acgimaterial.h