Public Types | Public Member Functions | Protected Attributes | List of all members
AcGiShadowParameters2 Class Reference
AcGi Classes
  Inheritance diagram for AcGiShadowParameters2:
 Public Types
enum  | ExtendedLightShape {
 kLinear = 0, kRectangle, kDisk, kCylinder,
 kSphere
 }
 Public Types inherited from AcGiShadowParameters
enum  | ShadowType { kShadowsRayTraced = 0, kShadowMaps, kAreaSampled }
 Public Member Functions
AcGiShadowParameters2 (void)
AcGiShadowParameters2 (const AcGiShadowParameters &params)
ACRX_DECLARE_MEMBERS (AcGiShadowParameters2)
virtual double  | extendedLightLength () const
virtual double  | extendedLightRadius () const
virtual ExtendedLightShape  | extendedLightShape () const
virtual double  | extendedLightWidth () const
bool  | operator== (const AcGiShadowParameters2 &params) const
virtual bool  | setExtendedLightLength (double length)
virtual bool  | setExtendedLightRadius (double radius)
virtual bool  | setExtendedLightShape (ExtendedLightShape shape)
virtual bool  | setExtendedLightWidth (double width)
virtual bool  | setShadowSamples (Adesk::UInt16 samples)
virtual void  | setShapeVisibility (bool visible)
virtual Adesk::UInt16  | shadowSamples () const
virtual bool  | shapeVisibility () const
virtual  | ~AcGiShadowParameters2 (void)
 Public Member Functions inherited from AcGiShadowParameters
AcGiShadowParameters ()
ACRX_DECLARE_MEMBERS (AcGiShadowParameters)
bool  | operator== (const AcGiShadowParameters &params) const
virtual bool  | setShadowMapSize (Adesk::UInt16 sz)
virtual bool  | setShadowMapSoftness (Adesk::UInt8 soft)
virtual void  | setShadowsOn (bool on)
virtual void  | setShadowType (ShadowType typ)
virtual Adesk::UInt16  | shadowMapSize () const
virtual Adesk::UInt8  | shadowMapSoftness () const
virtual bool  | shadowsOn () const
virtual ShadowType  | shadowType () const
virtual  | ~AcGiShadowParameters ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Attributes
 bool  | mbShapeVisibility
 double  | mExtLightLength
 double  | mExtLightRadius
 ExtendedLightShape  | mExtLightShape
 double  | mExtLightWidth
 Adesk::UInt16  | mShadowSamples
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiShadowParameters2::AcGiShadowParameters2  |  ( |  void  |   | )
Warning
Not implemented!
 AcGiShadowParameters2::AcGiShadowParameters2  |  ( |  const AcGiShadowParameters &  |  params | )
explicit
Warning
Not implemented!
 virtual AcGiShadowParameters2::~AcGiShadowParameters2  |  ( |  void  |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual double AcGiShadowParameters2::extendedLightLength  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual double AcGiShadowParameters2::extendedLightRadius  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual ExtendedLightShape AcGiShadowParameters2::extendedLightShape  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual double AcGiShadowParameters2::extendedLightWidth  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 bool AcGiShadowParameters2::operator==  |  ( |  const AcGiShadowParameters2 &  |  params | ) |   const
Warning
Not implemented!
 virtual bool AcGiShadowParameters2::setExtendedLightLength  |  ( |  double  |  length | )
virtual
Warning
Not implemented!
 virtual bool AcGiShadowParameters2::setExtendedLightRadius  |  ( |  double  |  radius | )
virtual
Warning
Not implemented!
 virtual bool AcGiShadowParameters2::setExtendedLightShape  |  ( |  ExtendedLightShape  |  shape | )
virtual
Warning
Not implemented!
 virtual bool AcGiShadowParameters2::setExtendedLightWidth  |  ( |  double  |  width | )
virtual
Warning
Not implemented!
 virtual bool AcGiShadowParameters2::setShadowSamples  |  ( |  Adesk::UInt16  |  samples | )
virtual
Warning
Not implemented!
 virtual void AcGiShadowParameters2::setShapeVisibility  |  ( |  bool  |  visible | )
virtual
Warning
Not implemented!
 virtual Adesk::UInt16 AcGiShadowParameters2::shadowSamples  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcGiShadowParameters2::shapeVisibility  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcGiLightTraits.h