Public Member Functions | Friends | List of all members
AcDbDataColumn Class Reference
AcDb Classes
  Inheritance diagram for AcDbDataColumn:
 Public Member Functions
AcDbDataColumn (const AcDbDataColumn &rCol)
AcDbDataColumn (const AcDbDataCell::CellType type, const ACHAR *pColName=NULL)
ACRX_DECLARE_MEMBERS (AcDbDataColumn)
 virtual Acad::ErrorStatus  | appendCell (const AcDbDataCell &cell)
 virtual const ACHAR *  | columnName () const
 virtual AcDbDataCell::CellType  | columnType () const
 virtual Acad::ErrorStatus  | getCellAt (Adesk::UInt32 index, AcDbDataCell &outCell) const
 virtual Acad::ErrorStatus  | getIndexAtCell (const AcDbDataCell &cell, Adesk::UInt32 &index) const
 virtual Adesk::UInt32  | growLength () const
 virtual Acad::ErrorStatus  | insertCellAt (Adesk::UInt32 index, const AcDbDataCell &cell)
 virtual Adesk::UInt32  | numCells () const
 virtual AcDbDataColumn &  | operator= (const AcDbDataColumn &col)
 virtual Adesk::UInt32  | physicalLength () const
 virtual Acad::ErrorStatus  | removeCellAt (Adesk::UInt32 index)
 virtual Acad::ErrorStatus  | setCellAt (Adesk::UInt32 index, const AcDbDataCell &cell)
 virtual Acad::ErrorStatus  | setColumnName (const ACHAR *pName)
 virtual Acad::ErrorStatus  | setColumnType (AcDbDataCell::CellType type)
 virtual Acad::ErrorStatus  | setGrowLength (Adesk::UInt32 n)
 virtual Acad::ErrorStatus  | setPhysicalLength (Adesk::UInt32 n)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpDataColumn
 class  | AcDbSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbDataTable.h