Public Types | Public Member Functions | List of all members
AcEdJig Class Reference
AcEd Classes
  Inheritance diagram for AcEdJig:
 Public Types
enum  | CursorType {
 kNoSpecialCursor = -1, kCrosshair = 0, kRectCursor, kRubberBand,
 kNotRotated, kTargetBox, kRotatedCrosshair, kCrosshairNoRotate,
 kInvisible, kEntitySelect, kParallelogram, kEntitySelectNoPersp,
 kPkfirstOrGrips, kCrosshairDashed
 }
enum  | DragStatus {
 kModeless = -17, kNoChange = -6, kCancel = -4, kOther = -3,
 kNull = -1, kNormal = 0, kKW1, kKW2,
 kKW3, kKW4, kKW5, kKW6,
 kKW7, kKW8, kKW9
 }
enum  | UserInputControls {
 kGovernedByOrthoMode = 0x0001, kNullResponseAccepted = 0x0002, kDontEchoCancelForCtrlC = 0x0004, kDontUpdateLastPoint = 0x0008,
 kNoDwgLimitsChecking = 0x0010, kNoZeroResponseAccepted = 0x0020, kNoNegativeResponseAccepted = 0x0040, kAccept3dCoordinates = 0x0080,
 kAcceptMouseUpAsPoint = 0x0100, kAnyBlankTerminatesInput = 0x0200, kInitialBlankTerminatesInput = 0x0400, kAcceptOtherInputString = 0x0800,
 kGovernedByUCSDetect = 0x1000, kNoZDirectionOrtho = 0x2000
 }
 Public Member Functions
 DragStatus  | acquireAngle (double &ang)
 DragStatus  | acquireAngle (double &ang, const AcGePoint3d &basePnt)
 DragStatus  | acquireDist (double &dist)
 DragStatus  | acquireDist (double &dist, const AcGePoint3d &basePnt)
 DragStatus  | acquirePoint (AcGePoint3d &)
 DragStatus  | acquirePoint (AcGePoint3d &, const AcGePoint3d &basePnt)
 DragStatus  | acquireString (ACHAR *str)
ACRX_DECLARE_MEMBERS (AcEdJig)
 AcDbObjectId  | append ()
 virtual AcDbDimDataPtrArray *  | dimData (const double dimScale)
 const ACHAR *  | dispPrompt ()
 DragStatus  | drag ()
 virtual AcDbEntity *  | entity () const
 const ACHAR *  | keywordList ()
 virtual DragStatus  | sampler ()
 virtual Acad::ErrorStatus  | setDimValue (const AcDbDimData *dimData, const double dimValue)
 void  | setDispPrompt (const ACHAR *,...)
 void  | setKeywordList (const ACHAR *)
 void  | setSpecialCursorType (CursorType)
 void  | setUserInputControls (AcEdJig::UserInputControls)
 AcEdJig::CursorType  | specialCursorType ()
 virtual Adesk::Boolean  | update ()
 AcEdJig::UserInputControls  | userInputControls ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbjig.h