Public Types | Public Member Functions | List of all members
AcPlPlotInfo Class Reference
AcPl Classes
  Inheritance diagram for AcPlPlotInfo:
 Public Types
enum  | MergeStatus {
 kNoChanges = 0x00000000, kPlotCfgName = 0x00000001, kPlotPaperMargins = 0x00000002, kPlotPaperSize = 0x00000004,
 kCanonicalMediaName = 0x00000008, kPlotOrigin = 0x00000010, kPlotPaperUnits = 0x00000020, kPlotViewportBorders = 0x00000040,
 kPlotPlotStyles = 0x00000080, kShowPlotStyles = 0x00000100, kPlotRotation = 0x00000200, kPlotCentered = 0x00000400,
 kPlotHidden = 0x00000800, kShadePlot = 0x00001000, kShadePlotResLevel = 0x00002000, kShadePlotCustomDPI = 0x00004000,
 kPlotType = 0x00008000, kPlotWindowArea = 0x00010000, kPlotViewName = 0x00020000, kScale = 0x00040000,
 kCurrentStlyeSheet = 0x00080000, kScaleLineWeights = 0x00100000, kPrintLineWeights = 0x00200000, kDrawViewportsFirst = 0x00400000
 }
 Public Member Functions
ACPL_DECLARE_MEMBERS (AcPlPlotInfo)
 ACPL_PORT Acad::ErrorStatus  | copyFrom (const AcRxObject *pOther)
 ACPL_PORT const AcPlPlotConfig *  | deviceOverride () const
 ACPL_PORT bool  | isCompatibleDocument (const AcPlPlotInfo *pOtherInfo) const
 ACPL_PORT bool  | isValidated () const
 ACPL_PORT AcDbObjectId  | layout () const
 ACPL_PORT unsigned long  | mergeStatus () const
 ACPL_PORT const AcDbPlotSettings *  | overrideSettings () const
 ACPL_PORT void  | setDeviceOverride (const AcPlPlotConfig *pconf)
 ACPL_PORT void  | setLayout (AcDbObjectId &layoutId)
 ACPL_PORT void  | setOverrideSettings (const AcDbPlotSettings *pOverrides)
 ACPL_PORT void  | setValidatedConfig (const AcPlPlotConfig *pConfig)
 ACPL_PORT Acad::ErrorStatus  | setValidatedSettings (const AcDbPlotSettings *pValidatedSettings)
 ACPL_PORT const AcPlPlotConfig *  | validatedConfig () const
 ACPL_PORT const AcDbPlotSettings *  | validatedSettings () const
 Public Member Functions inherited from AcPlObject
ACRX_DECLARE_MEMBERS (AcPlObject)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 Protected Member Functions inherited from AcPlObject
AcPlObject (AcPlSystemInternals *)
 The documentation for this class was generated from the following file:
acplplotinfo.h