Public Member Functions | List of all members
AcEdCommandStack Class Reference
AcEd Classes
  Inheritance diagram for AcEdCommandStack:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcEdCommandStack)
 virtual Acad::ErrorStatus  | addCommand (const ACHAR *cmdGroupName, const ACHAR *cmdGlobalName, const ACHAR *cmdLocalName, Adesk::Int32 commandFlags, AcRxFunctionPtr FunctionAddr, AcEdUIContext *UIContext=NULL, int fcode=-1, HINSTANCE hResourceHandle=NULL, AcEdCommand **cmdPtrRet=NULL)=0
 virtual bool  | atPut (const ACHAR *cmdGroupName, AcRxDictionary *&cmdsGlobal, AcRxDictionary *&cmdsLocal)=0
 virtual AcEdCommandIterator *  | iterator ()=0
 virtual AcEdCommand *  | lookupCmd (const ACHAR *cmdName, bool globalFlag)=0
 virtual AcEdCommand *  | lookupCmd (const ACHAR *cmdName, bool globalFlag, bool allGroupsFlag)=0
 virtual AcEdCommand *  | lookupCmd (const ACHAR *cmdName, bool globalFlag, bool allGroupsFlag, bool skipUndefed)=0
 virtual AcEdCommand *  | lookupCmd2 (const ACHAR *cmdName, bool globalFlag, bool allGroupsFlag, int skipFlags, bool match=false)=0
 virtual AcEdCommand *  | lookupGlobalCmd (const ACHAR *cmdName)=0
 virtual AcEdCommand *  | lookupLocalCmd (const ACHAR *cmdName)=0
 virtual Acad::ErrorStatus  | popGroupToTop (const ACHAR *cmdGroupName)=0
 virtual Acad::ErrorStatus  | removeCmd (const ACHAR *cmdGroupName, const ACHAR *cmdGlobalName)=0
 virtual Acad::ErrorStatus  | removeGroup (const ACHAR *groupName)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
accmd.h