Public Member Functions | List of all members
AcDbDataLinkManager Class Reference
AcDb Classes
  Inheritance diagram for AcDbDataLinkManager:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbDataLinkManager)
 ACDB_PORT Acad::ErrorStatus  | addDataLink (AcDbDataLink *pDataLink)
 ACDB_PORT Acad::ErrorStatus  | addDataLink (AcDbDataLink *pDataLink, AcDbObjectId &idDataLink)
 ACDB_PORT Acad::ErrorStatus  | createDataLink (const ACHAR *pszAdapterId, const ACHAR *pszName, const ACHAR *pszDescription, const ACHAR *pszConnectionString, AcDbObjectId &idDataLink)
 ACDB_PORT int  | dataLinkCount (void) const
 ACDB_PORT Acad::ErrorStatus  | getDataLink (const ACHAR *pszName, AcDbObjectId &idDataLink) const
 ACDB_PORT Acad::ErrorStatus  | getDataLink (const ACHAR *pszName, AcDbDataLink *&pDataLink, AcDb::OpenMode mode) const
 ACDB_PORT int  | getDataLink (AcDbObjectIdArray &dataLinks) const
 Acad::ErrorStatus  | removeDataLink (const ACHAR *pszKey, AcDbObjectId &idDataLink)
 ACDB_PORT Acad::ErrorStatus  | removeDataLink (const AcDbObjectId &idDataLink)
 ACDB_PORT Acad::ErrorStatus  | update (const AcDbObjectIdArray &dataIds, AcDb::UpdateDirection nDir, AcDb::UpdateOption nOption)
 ACDB_PORT Acad::ErrorStatus  | update (AcDb::UpdateDirection nDir, AcDb::UpdateOption nOption)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
DbDataLink.h