Classes | Public Member Functions | Static Public Member Functions | Public Attributes | Protected Attributes | List of all members
AcadToolImpl< TT, T, pclsid, szToolName, szToolImage, piid, plibid > Class Template Reference
Misc Classes
 Classes
struct  | TOOL_MAP_ENTRY
 Public Member Functions
 BOOL  | AddChildNode (MSXML::IXMLDOMNode *pNode, LPCWSTR pszChildNodeName, short nNodeType, MSXML::IXMLDOMNode **ppChild)
 STDMETHOD()  | BeginEdit ()
 STDMETHOD()  | BeginMultipleEdit (VARIANT tools, VARIANT stockToolIds)
 AcTcTool *  | CreateCommandToolATC (AcTcPackage *pPalette, LPWSTR szToolName, LPCWSTR szBitmapName, LPWSTR macroString)
 AcTcTool *  | CreateFlyoutToolATC (AcTcPackage *pPalette, AcTcPackage *pShapePackage, LPCWSTR szToolNameOverride=NULL)
 AcTcPalette *  | CreatePaletteATC (AcTcCatalog *pCatalog, LPWSTR szPaletteName)
 AcTcPackage *  | CreateShapeCatalogATC (LPWSTR szShapeName)
 AcTcCatalog *  | CreateStockToolATC (LPWSTR szCatalogName)
 STDMETHOD()  | CreateTool (IUnknown **ppTool)
 AcTcTool *  | CreateToolATC (AcTcPackage *pPalette, LPCWSTR szToolNameOverride=NULL, LPCWSTR szToolImageOverride=NULL, BOOL bImageFile=FALSE)
 STDMETHOD()  | Customize (int nContextFlag, DWORD_PTR hMenu, UINT idCmdFirst, UINT idCmdLast, GUID *pPaletteId, DWORD *pFlag)
 STDMETHOD()  | DoModal (BSTR *propValueString, AcDbObjectIdArray *ObjectIdArray)
 STDMETHOD()  | DragEnter (IDataObject __RPC_FAR *pDataObj, DWORD grfKeyState, POINTL pt, DWORD __RPC_FAR *pdwEffect)
 STDMETHOD()  | DragLeave (void)
 STDMETHOD()  | DragOver (DWORD grfKeyState, POINTL pt, DWORD __RPC_FAR *pdwEffect)
 STDMETHOD()  | Drop (IDataObject __RPC_FAR *pDataObj, DWORD grfKeyState, POINTL pt, DWORD __RPC_FAR *pdwEffect)
 STDMETHOD()  | dropCallback (AcDbEntity *pEntity)
 STDMETHOD()  | Dropped (BSTR bstrUrl)
 STDMETHOD()  | Edit (IUnknown *pProp, LONG_PTR hWndParent, VARIANT_BOOL *pRet)
 STDMETHOD()  | Editable (DISPID dispID, BOOL __RPC_FAR *bEditable)
 STDMETHOD()  | EndEdit (VARIANT_BOOL bEditCancelled)
 STDMETHOD()  | EndMultipleEdit (VARIANT tools, VARIANT stockToolIds, VARIANT_BOOL bEditCancelled)
 STDMETHOD()  | Execute (LONG_PTR lFlag, DWORD_PTR hWnd, DWORD point, DWORD dwKeyState)
 STDMETHOD()  | executeCallback ()
 STDMETHOD()  | get_Color (VARIANT *pVar)
 STDMETHOD()  | get_EditMode (long *pVal)
 STDMETHOD()  | get_Flyout (BSTR *pVar)
 STDMETHOD()  | get_Layer (BSTR *pVal)
 BOOL  | GetAttribute (MSXML::IXMLDOMNode *pNode, LPCWSTR pszAttName, MSXML::IXMLDOMAttribute **ppChild)
 BOOL  | GetAttributeValue (MSXML::IXMLDOMNode *pNode, LPCWSTR pszAttName, VARIANT &var)
 BOOL  | GetAttributeValue (MSXML::IXMLDOMNode *pNode, LPCWSTR pszAttName, long &lValue)
 BOOL  | GetAttributeValue (MSXML::IXMLDOMNode *pNode, LPCWSTR pszAttName, LPWSTR pszValue)
 BOOL  | GetAttributeValue (MSXML::IXMLDOMNode *pNode, LPCWSTR pszAttName, short &sValue)
 BOOL  | GetAttributeValue (MSXML::IXMLDOMNode *pNode, LPCWSTR pszAttName, double &fValue)
 BOOL  | GetChildNode (MSXML::IXMLDOMNode *pNode, LPCWSTR pszNodeName, MSXML::IXMLDOMNode **ppChild)
 BOOL  | GetChildNodeValue (MSXML::IXMLDOMNode *pNode, LPCWSTR pszNodeName, LPWSTR pszValue)
 BOOL  | GetClipInfo (COleDataObject *pDataObject, ClipboardInfo *pClipboardInfo)
 STDMETHOD()  | GetCommandString (UINT idCmd, BSTR *pbstrHelpText)
 STDMETHOD()  | GetContextMenu (INT_PTR nContextFlag, DWORD_PTR hMenu, UINT idCmdFirst, UINT idCmdLast, DWORD_PTR *pFlag)
 AcTcPackage *  | GetCustomShapePackage (AcTcCatalog *pCatalog, LPCWSTR szPackageName)
 AcTcPackage *  | GetCustomShapePackage (AcTcCatalog *pCatalog, GUID szPackageID)
 STDMETHOD()  | GetData (VARIANT *pObjUnkArray, VARIANT *pDynUnkArray)
 STDMETHOD()  | GetDisplayName (DISPID dispID, BSTR *propName)
 STDMETHOD()  | GetDisplayString (DISPID dispID, BSTR *pbstr)
 STDMETHOD()  | GetDragDropContextInfo (IUnknown *pIUnknown, BSTR *pbstrText, DWORD *pFlag)
 STDMETHOD()  | GetDropTarget (IUnknown **ppDropTarget)
 STDMETHOD()  | GetEllipsisBitMap (VARIANT varId, IUnknown __RPC_FAR *__RPC_FAR *pBitMap)
 BOOL  | GetFlyoutTool (AcTcTool *&pFlyoutTool)
 STDMETHOD()  | GetMenuHelp (UINT idCmd, BSTR *pbstrHelpText)
 STDMETHOD()  | GetPredefinedStrings (DISPID dispID, CALPOLESTR *pcaStringsOut, CADWORD *pcaCookiesOut)
 STDMETHOD()  | GetPredefinedValue (DISPID dispID, DWORD dwCookie, VARIANT *pVarOut)
 virtual HRESULT  | GetPropertyTypeInfo ()
 STDMETHOD()  | GetPropHelpProc (VARIANT varId, LONG __RPC_FAR *pHelpProc)
 STDMETHOD()  | GetStockTool (IUnknown **ppToolClass)
 IAcadToolProperties *  | GetThisToolsProperties ()
 STDMETHOD()  | GetToolProperties (IUnknown **pToolProp)
 HRESULT  | GetToolProperty (int index, VARIANT &vValue)
 BOOL  | GetUnknownArrays (int nCount, IUnknown **pObjUnkArray, VARIANT *pStatUnkArray, VARIANT *pDynPMUnkArrays)
 STDMETHOD()  | GetUnspecifiedString (VARIANT, BSTR *str)
 BOOL  | GuidFromString (LPWSTR pszGuid, GUID &id)
 STDMETHOD()  | InvokeCommand (UINT idCmd, DWORD_PTR hWnd)
 STDMETHOD()  | InvokeMenuCommand (UINT idCmd, GUID *pPaletteId, DWORD_PTR hWnd, DWORD *pFlag)
 STDMETHOD()  | IsUnspecifiedAllowed (VARIANT varId, VARIANT_BOOL *pVal)
 STDMETHOD()  | IsValueUnspecified (VARIANT varId, VARIANT_BOOL *pVal)
 STDMETHOD()  | Load (IUnknown *pXmlElement)
 STDMETHOD()  | LoadFromFlyout (IUnknown *pXmlElement)
 virtual BOOL  | LoadPropertyValue (MSXML::IXMLDOMNode *pNode, int index)
 STDMETHOD()  | MapPropertyToPage (DISPID dispID, CLSID *pCLSID)
 STDMETHOD()  | MultipleEdit (VARIANT tools, VARIANT stockToolIds, LONG_PTR hWndParent, VARIANT_BOOL *pRet)
 STDMETHOD()  | New ()
 STDMETHOD()  | put_Color (VARIANT pVar)
 STDMETHOD()  | put_Flyout (BSTR var)
 STDMETHOD()  | put_Layer (BSTR newVal)
 HRESULT  | PutToolProperty (int index, VARIANT vValue)
 STDMETHOD()  | Refreshed (BSTR bstrUrl)
 BOOL  | RemoveChildren (MSXML::IXMLDOMNode *pNode)
 STDMETHOD()  | Save (IUnknown *pXmlElement)
 virtual BOOL  | SavePropertyValue (MSXML::IXMLDOMNode *pNode, int index)
 BOOL  | SetAttributeValue (MSXML::IXMLDOMNode *pNode, LPCWSTR pszAttName, double fValue)
 BOOL  | SetAttributeValue (MSXML::IXMLDOMNode *pNode, LPCWSTR pszAttName, long lValue)
 BOOL  | SetAttributeValue (MSXML::IXMLDOMNode *pNode, LPCWSTR pszAttName, VARIANT &var)
 BOOL  | SetAttributeValue (MSXML::IXMLDOMNode *pNode, LPCWSTR pszAttName, LPWSTR pszValue)
 STDMETHOD()  | SetEditorWindow (LONG_PTR hWndEditor, IUnknown *pPropInspector)
 STDMETHOD()  | SetFlyoutTools (VARIANT *pFlyoutToolIds)
 STDMETHOD()  | SetToolProperties (IUnknown *pProp)
 STDMETHOD()  | SetUnspecified (VARIANT varId, VARIANT_BOOL bIsUnspecified)
 STDMETHOD()  | ShowProperty (DISPID dispID, BOOL *pShow)
 CComBSTR  | StringFromGuid (const GUID &id)
 STDMETHOD()  | UpdateImage (void)
 STDMETHOD()  | ValidateEditChanges ()
 Static Public Member Functions
 static PER_PROP_DISP_ENTRY *  | GetPerPropDisplayArray ()
 Public Attributes
 DISPID  | dispColor
 DISPID  | dispFlyout
 DISPID  | dispLayer
 bool  | m_bFlyout
 AcCmColor  | m_Color
 GUID  | m_CurrentShapeId
 GUID  | m_FlyoutPackageId
 WCHAR  | m_FlyoutTools [64]
 HWND  | m_hWndEditWindow
 CComPtr< IAcadToolProperties >  | m_pToolProp
 WCHAR  | m_szLayer [512]
 Protected Attributes
 BOOL  | m_bColorUnspecified
 BOOL  | m_bLayerUnspecified
 HWND  | m_hPreviewWnd
 AcArray< TOOL_MAP_ENTRY >  | m_ToolMap
 CLIPFORMAT  | mcfAutoCAD
 The documentation for this class was generated from the following file:
AcadToolImpl.h