Public Member Functions | List of all members
AcGsManager Class Reference
AcGi Classes
 Public Member Functions
 virtual AcGsDevice *  | createAutoCADDevice (HWND hWnd)=0
 virtual AcGsModel *  | createAutoCADModel (void)=0
 virtual AcGsDevice *  | createAutoCADOffScreenDevice ()=0
 virtual AcGsView *  | createAutoCADView (AcGiDrawable *drawable)=0
 virtual AcGsView *  | createAutoCADViewport (AcDbViewportTableRecord *vp)=0
 virtual void  | destroyAutoCADDevice (AcGsDevice *device)=0
 virtual void  | destroyAutoCADModel (AcGsModel *model)=0
 virtual void  | destroyAutoCADView (AcGsView *view)=0
 virtual AcGsModel *  | getDBModel (void)=0
 virtual AcGsClassFactory *  | getGSClassFactory (void)=0
 virtual AcGsDevice *  | getGUIDevice (void)=0
 The documentation for this class was generated from the following file:
AcGsManager.h