Classes | Public Types | Public Member Functions | List of all members
AcCmTransparency Class Reference
AcCm Classes
 Classes
union  | AM
 Public Types
enum  | { kTransparencyByLayer = (unsigned long)kByLayer, kTransparencyByBlock = (unsigned long)kByBlock, kTransparencySolid = ((unsigned long)(kByAlpha | (0xff << 24))), kTransparencyClear = (unsigned long)kByAlpha }
enum  | transparencyMethod { kByLayer = 0, kByBlock, kByAlpha, kErrorValue }
 Public Member Functions
AcCmTransparency (const AcCmTransparency &other)
 Adesk::UInt8  | alpha (void) const
 bool  | isByAlpha (void) const
 bool  | isByBlock (void) const
 bool  | isByLayer (void) const
 bool  | isClear (void) const
 bool  | isSolid (void) const
 bool  | operator!= (const AcCmTransparency &other) const
 AcCmTransparency &  | operator= (const AcCmTransparency &other)
 bool  | operator== (const AcCmTransparency &other) const
 void  | serializeIn (Adesk::UInt32)
 Adesk::UInt32  | serializeOut (void) const
 void  | setAlpha (Adesk::UInt8 alpha)
 void  | setMethod (transparencyMethod method)
 The documentation for this class was generated from the following file:
dbcolor.h