Public Types | Public Member Functions | Static Public Member Functions | List of all members
AcDbMText Class Reference
AcDb Classes
  Inheritance diagram for AcDbMText:
 Public Types
enum  | AttachmentPoint {
 kTopLeft = 1, kTopCenter = 2, kTopRight = 3, kMiddleLeft = 4,
 kMiddleCenter = 5, kMiddleRight = 6, kBottomLeft = 7, kBottomCenter = 8,
 kBottomRight = 9, kBaseLeft = 10, kBaseCenter = 11, kBaseRight = 12,
 kBaseAlign = 13, kBottomAlign = 14, kMiddleAlign = 15, kTopAlign = 16,
 kBaseFit = 17, kBottomFit = 18, kMiddleFit = 19, kTopFit = 20,
 kBaseMid = 21, kBottomMid = 22, kMiddleMid = 23, kTopMid = 24
 }
enum  | ColumnType { kNoColumns, kStaticColumns, kDynamicColumns }
enum  | FlowDirection {
 kLtoR = 1, kRtoL = 2, kTtoB = 3, kBtoT = 4,
 kByStyle = 5
 }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbMText)
 double  | actualHeight (AcGiWorldDraw *ctxt=NULL) const
 double  | actualWidth () const
 double  | ascent () const
 AttachmentPoint  | attachment () const
 bool  | backgroundFillOn () const
 ACHAR *  | contents () const
 Acad::ErrorStatus  | convertFieldToText ()
 int  | correctSpelling ()
 double  | descent () const
 AcGeVector3d  | direction () const
 void  | explodeFragments (AcDbMTextEnum, void *, AcGiWorldDraw *ctxt=NULL) const
 FlowDirection  | flowDirection () const
 Acad::ErrorStatus  | getBackgroundFillColor (AcCmColor &color) const
 Acad::ErrorStatus  | getBackgroundScaleFactor (double &scale) const
 Acad::ErrorStatus  | getBackgroundTransparency (AcCmTransparency &transp) const
 void  | getBoundingPoints (AcGePoint3dArray &) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 Acad::ErrorStatus  | getColumnAutoHeight (bool &) const
 Acad::ErrorStatus  | getColumnCount (int &) const
 Acad::ErrorStatus  | getColumnFlowReversed (bool &) const
 Acad::ErrorStatus  | getColumnGutterWidth (double &) const
 Acad::ErrorStatus  | getColumnHeight (int, double &) const
 Acad::ErrorStatus  | getColumnType (ColumnType &) const
 Acad::ErrorStatus  | getColumnWidth (double &) const
 void  | getEcs (AcGeMatrix3d &retVal) const
 double  | height () const
 double  | lineSpacingFactor () const
 AcDb::LineSpacingStyle  | lineSpacingStyle () const
 AcGePoint3d  | location () const
 AcGeVector3d  | normal () const
 Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 double  | rotation () const
 Acad::ErrorStatus  | setAttachment (AttachmentPoint)
 Acad::ErrorStatus  | setAttachmentMovingLocation (AttachmentPoint)
 Acad::ErrorStatus  | setBackgroundFill (bool enable)
 Acad::ErrorStatus  | setBackgroundFillColor (const AcCmColor &color)
 Acad::ErrorStatus  | setBackgroundScaleFactor (const double scale)
 Acad::ErrorStatus  | setBackgroundTransparency (const AcCmTransparency &transp)
 Acad::ErrorStatus  | setColumnAutoHeight (bool)
 Acad::ErrorStatus  | setColumnCount (int)
 Acad::ErrorStatus  | setColumnFlowReversed (bool)
 Acad::ErrorStatus  | setColumnGutterWidth (double)
 Acad::ErrorStatus  | setColumnHeight (int, double)
 Acad::ErrorStatus  | setColumnType (ColumnType)
 Acad::ErrorStatus  | setColumnWidth (double)
 int  | setContents (const ACHAR *)
 int  | setContentsRTF (const ACHAR *)
 Acad::ErrorStatus  | setDirection (const AcGeVector3d &)
 Acad::ErrorStatus  | setDynamicColumns (double width, double gutter, bool auto_height)
 Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 Acad::ErrorStatus  | setFlowDirection (FlowDirection)
 Acad::ErrorStatus  | setHeight (double)
 Acad::ErrorStatus  | setLineSpacingFactor (double dFactor)
 Acad::ErrorStatus  | setLineSpacingStyle (AcDb::LineSpacingStyle eStyle)
 Acad::ErrorStatus  | setLocation (const AcGePoint3d &)
 Acad::ErrorStatus  | setNormal (const AcGeVector3d &)
 Acad::ErrorStatus  | setRotation (double)
 Acad::ErrorStatus  | setStaticColumns (double width, double gutter, int count)
 Acad::ErrorStatus  | setTextHeight (double)
 Acad::ErrorStatus  | setTextStyle (AcDbObjectId)
 Acad::ErrorStatus  | setUseBackgroundColor (bool enable)
 Acad::ErrorStatus  | setUseWordBreak (bool bEnable)
 Acad::ErrorStatus  | setWidth (double)
 ACHAR *  | text () const
 double  | textHeight () const
 AcDbObjectId  | textStyle () const
 bool  | useBackgroundColorOn () const
 bool  | useWordBreak () const
 double  | width () const
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual bool  | castShadows () const
 virtual Adesk::Boolean  | cloneMeForDragging ()
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual void  | dragStatus (const AcDb::DragStat status)
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable ()
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 AcCmEntityColor  | entityColor () const
 virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const
 virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeFastTransform &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const
 virtual void  | gripStatus (const AcDb::GripStat status)
 virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const
 virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Adesk::Boolean  | isPlanar () const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 virtual void  | list () const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 ACHAR *  | plotStyleName () const
 virtual bool  | receiveShadows () const
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 virtual void  | setCastShadows (bool newVal)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual void  | setGsNode (AcGsNode *pNode)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual void  | setReceiveShadows (bool newVal)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &id) const
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | transformBy (const AcGeFastTransform &xform)
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 AcCmTransparency  | transparency () const
 virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual void  | viewportDraw (AcGiViewportDraw *mode)
 AcDb::Visibility  | visibility () const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *mode)
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
 static const ACHAR *const  | alignChange ()
 static const ACHAR *const  | blockBegin ()
 static const ACHAR *const  | blockEnd ()
 static const ACHAR *const  | colorChange ()
 static const ACHAR *const  | fontChange ()
 static const ACHAR *const  | heightChange ()
 static const ACHAR *const  | lineBreak ()
 static const ACHAR *const  | nonBreakSpace ()
 static const ACHAR *const  | obliqueChange ()
 static const ACHAR *const  | overlineOff ()
 static const ACHAR *const  | overlineOn ()
 static const ACHAR *const  | paragraphBreak ()
 static const ACHAR *const  | stackStart ()
 static const ACHAR *const  | strikethroughOff ()
 static const ACHAR *const  | strikethroughOn ()
 static const ACHAR *const  | trackChange ()
 static const ACHAR *const  | underlineOff ()
 static const ACHAR *const  | underlineOn ()
 static const ACHAR *const  | widthChange ()
 The documentation for this class was generated from the following file:
dbmtext.h