Public Types | Public Member Functions | Static Public Member Functions | List of all members
AcDbLayerTableRecord Class Reference
AcDb Classes
  Inheritance diagram for AcDbLayerTableRecord:
 Public Types
enum  | { kDxfLayerPlotBit = AcDb::kDxfBool }
 typedef AcDbLayerTable  | TableType
 Public Types inherited from AcDbSymbolTableRecord
 typedef AcDbSymbolTable  | TableType
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbLayerTableRecord)
 AcCmColor  | color () const
 AcCmColor  | color (const AcDbObjectId &viewportId, bool &isOverride) const
 ACHAR *  | description () const
 AcGiDrawable *  | drawable ()
 AcCmEntityColor  | entityColor (void) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 AcGsNode *  | gsNode () const
 bool  | hasAnyOverrides () const
 bool  | hasOverrides (const AcDbObjectId &viewportId) const
 bool  | isFrozen () const
 bool  | isHidden () const
 bool  | isInUse () const
 bool  | isLocked () const
 bool  | isOff () const
 bool  | isPlottable () const
 bool  | isReconciled () const
 AcDbObjectId  | linetypeObjectId () const
 AcDbObjectId  | linetypeObjectId (const AcDbObjectId &viewportId, bool &isOverride) const
 AcDb::LineWeight  | lineWeight () const
 AcDb::LineWeight  | lineWeight (const AcDbObjectId &viewportId, bool &isOverride) const
 AcDbObjectId  | materialId () const
 ACHAR *  | plotStyleName () const
 ACHAR *  | plotStyleName (const AcDbObjectId &viewportId, bool &isOverride) const
 AcDbObjectId  | plotStyleNameId () const
 AcDbObjectId  | plotStyleNameId (const AcDbObjectId &viewportId, bool &isOverride) const
 Acad::ErrorStatus  | removeAllOverrides ()
 Acad::ErrorStatus  | removeColorOverride (const AcDbObjectId &viewportId)
 Acad::ErrorStatus  | removeLinetypeOverride (const AcDbObjectId &viewportId)
 Acad::ErrorStatus  | removeLineWeightOverride (const AcDbObjectId &viewportId)
 Acad::ErrorStatus  | removePlotStyleOverride (const AcDbObjectId &viewportId)
 Acad::ErrorStatus  | removeViewportOverrides (const AcDbObjectId &viewportId)
 Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 void  | setColor (const AcCmColor &color)
 Acad::ErrorStatus  | setColor (const AcCmColor &color, const AcDbObjectId &viewportId)
 Acad::ErrorStatus  | setDescription (const ACHAR *description)
 void  | setGsNode (AcGsNode *pNode)
 Acad::ErrorStatus  | setIsFrozen (bool frozen)
 Acad::ErrorStatus  | setIsHidden (bool on)
 void  | setIsLocked (bool locked)
 void  | setIsOff (bool off)
 Acad::ErrorStatus  | setIsPlottable (bool plot)
 Acad::ErrorStatus  | setIsReconciled (bool bReconcile=true)
 void  | setLinetypeObjectId (AcDbObjectId id)
 Acad::ErrorStatus  | setLinetypeObjectId (const AcDbObjectId &id, const AcDbObjectId &viewportId)
 Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight weight)
 Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight weight, const AcDbObjectId &viewportId)
 Acad::ErrorStatus  | setMaterialId (AcDbObjectId id)
 Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName)
 Acad::ErrorStatus  | setPlotStyleName (const AcDbObjectId &newId)
 Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, const AcDbObjectId &viewportId)
 Acad::ErrorStatus  | setPlotStyleName (const AcDbObjectId &newId, const AcDbObjectId &viewportId)
 Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans)
 void  | setVPDFLT (bool frozen)
 AcCmTransparency  | transparency (void) const
 void  | viewportDraw (AcGiViewportDraw *pVd)
 bool  | VPDFLT () const
 Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 Public Member Functions inherited from AcDbSymbolTableRecord
ACDB_DECLARE_MEMBERS (AcDbSymbolTableRecord)
 Acad::ErrorStatus  | getName (ACHAR *&pName) const
 Acad::ErrorStatus  | getName (AcString &sName) const
 Acad::ErrorStatus  | getName (const ACHAR *&pName) const
 bool  | isDependent () const
 bool  | isResolved () const
 Acad::ErrorStatus  | setName (const ACHAR *pName)
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
 static bool  | isHidden (AcDbObjectId)
 static bool  | isReconciled (const AcDbObjectId &id)
 The documentation for this class was generated from the following file:
dbsymtb.h