Public Member Functions | List of all members
AcEdCommand Class Reference
AcEd Classes
  Inheritance diagram for AcEdCommand:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcEdCommand)
 virtual void *  | commandApp () const =0
 virtual Adesk::Int32  | commandFlags () const =0
 virtual void  | commandUndef (bool undefIt)=0
 virtual AcRxFunctionPtr  | functionAddr () const =0
 virtual void  | functionAddr (AcRxFunctionPtr fhdl)=0
 virtual int  | functionCode () const =0
 virtual void  | functionCode (int fcode)=0
 virtual const ACHAR *  | globalName () const =0
 virtual const ACHAR *  | localName () const =0
 virtual const HINSTANCE  | resourceHandle () const =0
 virtual AcEdUIContext *  | UIContext () const =0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
accmd.h