Public Types | Public Member Functions | Protected Member Functions | List of all members
AcDbDimAssoc Class Reference
AcDb Classes
  Inheritance diagram for AcDbDimAssoc:
 Public Types
enum  | { kMaxPointRefs = 4 }
enum  | AssocFlags { kFirstPointRef = 1, kSecondPointRef = 2, kThirdPointRef = 4, kFourthPointRef = 8 }
enum  | PointType {
 kXline1Point = 0, kXline2Point = 1, kOriginPoint = 0, kDefiningPoint = 1,
 kXline1Start = 0, kXline1End = 1, kXline2Start = 2, kXline2End = 3,
 kVertexPoint = 2, kChordPoint = 0, kCenterPoint = 1, kFarChordPoint = 1,
 kOverrideCenterPoint = 2, kAngLineStart = 2, kJogPoint = 3, kAngLineEnd = 3,
 kLeaderPoint = 0
 }
enum  | RotatedDimType { kUnknown = 0, kParallel = 1, kPerpendicular = 2 }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbDimAssoc)
 Acad::ErrorStatus  | addToDimensionReactor (bool isAdd=true)
 Acad::ErrorStatus  | addToPointRefReactor ()
 bool  | assocFlag (int ptType) const
 int  | assocFlag (void)
 AcDbObjectId  | dimObjId () const
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *)
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *) const
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *)
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *) const
 Acad::ErrorStatus  | getDimAssocGeomIds (AcDbObjectIdArray &geomIds) const
 bool  | hasOopsWatcher (void) const
 bool  | isAllGeomErased () const
 bool  | isTransSpatial () const
 virtual void  | modifiedGraphics (const AcDbEntity *pObj)
 const AcDbPointRef *  | pointRef (int ptType) const
 Acad::ErrorStatus  | post (AcDbObjectId dimId, AcDbObjectId &dimAssocId, bool isActive=true)
 Acad::ErrorStatus  | removeAssociativity (bool force=true)
 void  | removeOopsWatcher (void)
 Acad::ErrorStatus  | removePointRef (int ptType)
 Acad::ErrorStatus  | restoreAssocFromOopsWatcher (void)
 RotatedDimType  | rotatedDimType () const
 Acad::ErrorStatus  | setAssocFlag (int ptType, bool value)
 void  | setAssocFlag (int assocFlg)
 Acad::ErrorStatus  | setDimObjId (const AcDbObjectId &dimId)
 Acad::ErrorStatus  | setPointRef (int ptType, AcDbPointRef *ptRef)
 Acad::ErrorStatus  | setRotatedDimType (RotatedDimType dimType)
 Acad::ErrorStatus  | setTransSpatial (bool value)
 Acad::ErrorStatus  | startCmdWatcher ()
 Acad::ErrorStatus  | startOopsWatcher (bool bAddAll=true)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 Acad::ErrorStatus  | updateAssociativity (const AcDbObjectIdArray &ids)
 Acad::ErrorStatus  | updateDimension (bool update=true, bool skipReactors=false)
 void  | updateDueToMirror (bool wasInMirror)
 Acad::ErrorStatus  | updateFillet (const AcDbObjectIdArray &ids)
 Acad::ErrorStatus  | updateSubentPath (AcDbIdMapping &idMap)
 Acad::ErrorStatus  | updateXrefSubentPath ()
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual AcGsNode *  | gsNode () const
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 virtual void  | setGsNode (AcGsNode *pNode)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual void  | viewportDraw (AcGiViewportDraw *pVd)
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 Acad::ErrorStatus  | calculate2LineAngDimArcLocation (const AcGePoint3d *kpOldPts, const AcGePoint3d &kOldArcPt, const AcGePoint3d &kOldTextPt, const AcGePoint3d *kpNewPts, const AcGeVector3d &kNormal, AcGePoint3d &newArcPt, AcGePoint3d &newTextPt)
 Acad::ErrorStatus  | calculate3PointAngDimArcLocation (const AcGePoint3d *kpOldPts, const AcGePoint3d &kOldArcPt, const AcGePoint3d &kOldTextPt, const AcGePoint3d *kpNewPts, const AcGeVector3d &normal, AcGePoint3d &newArcPt, AcGePoint3d &newTextPt)
 bool  | isPointBetweenRays (const AcGePoint3d &vertex, const AcGePoint3d &firstPt, const AcGePoint3d &secondPt, const AcGePoint3d &angPt, const AcGeVector3d &normal)
 Acad::ErrorStatus  | removeDimExtDict (void)
 Acad::ErrorStatus  | setPointRefReactor (int ptType, bool isAdd=true)
 Acad::ErrorStatus  | updateDimension (AcDbRotatedDimension *pRotDim, AcGePoint3d *pNewPts, bool bUpdate=true)
 Acad::ErrorStatus  | updateDimension (AcDbAlignedDimension *pAlnDim, AcGePoint3d *pNewPts, bool bUpdate=true)
 Acad::ErrorStatus  | updateDimension (AcDbRadialDimension *pRadDim, AcGePoint3d *pNewPts, bool bUpdate=true)
 Acad::ErrorStatus  | updateDimension (AcDbRadialDimensionLarge *pRadDimLarge, AcGePoint3d *pNewPts, bool bUpdate=true)
 Acad::ErrorStatus  | updateDimension (AcDbDiametricDimension *pDiaDim, AcGePoint3d *pNewPts, bool bUpdate=true)
 Acad::ErrorStatus  | updateDimension (AcDb2LineAngularDimension *pA2Dim, AcGePoint3d *pNewPts, bool bUpdate=true)
 Acad::ErrorStatus  | updateDimension (AcDb3PointAngularDimension *pA3Dim, AcGePoint3d *pNewPts, bool bUpdate=true)
 Acad::ErrorStatus  | updateDimension (AcDbOrdinateDimension *pOrdDim, AcGePoint3d *pNewPts, bool bUpdate=true)
 Acad::ErrorStatus  | updateDimension (AcDbArcDimension *pArcDim, AcGePoint3d *pNewPts, bool bUpdate=true)
 Acad::ErrorStatus  | updateDimension (AcDbLeader *pLeader, AcGePoint3d *pNewPts, bool bUpdate=true)
 Acad::ErrorStatus  | updateDimension (AcDbMLeader *pMLeader, AcGePoint3d *pNewPts, bool bUpdate=true)
 Acad::ErrorStatus  | updateDimLineAndTextLocation (AcDbRotatedDimension *pAlnDim, const AcGePoint3d *kpOldPts, const AcGePoint3d *kpNewPts)
 Acad::ErrorStatus  | updateDimLineAndTextLocation (AcDbAlignedDimension *pAlnDim, const AcGePoint3d *pOldPts, const AcGePoint3d *pNewPts)
 Acad::ErrorStatus  | updateDimLineAndTextLocation (AcDb2LineAngularDimension *pA2Dim, const AcGePoint3d *pOldPts, const AcGePoint3d *pNewPts)
 Acad::ErrorStatus  | updateDimLineAndTextLocation (AcDb3PointAngularDimension *pA3Dim, const AcGePoint3d *pOldPts, const AcGePoint3d *pNewPts)
 Acad::ErrorStatus  | updateDimLineAndTextLocation (AcDbArcDimension *pArcDim, const AcGePoint3d *kpOldPts, const AcGePoint3d *kpNewPts)
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 The documentation for this class was generated from the following file:
dbdimassoc.h