Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
AcGeMatrix2d Class Reference
AcGe Classes
 Public Member Functions
AcGeMatrix2d (const AcGeMatrix2d &src)
 double  | det () const
 void  | getCoordSystem (AcGePoint2d &origin, AcGeVector2d &e0, AcGeVector2d &e1) const
 AcGeMatrix2d  | inverse () const
 AcGeMatrix2d &  | invert ()
 Adesk::Boolean  | isConformal (double &scale, double &angle, Adesk::Boolean &isMirror, AcGeVector2d &reflex) const
 bool  | isEqualTo (const AcGeMatrix2d &mat, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isScaledOrtho (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isSingular (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isUniScaledOrtho (const AcGeTol &tol=AcGeContext::gTol) const
 bool  | operator!= (const AcGeMatrix2d &mat) const
 double  | operator() (unsigned int, unsigned int) const
 double &  | operator() (unsigned int, unsigned int)
 AcGeMatrix2d  | operator* (const AcGeMatrix2d &mat) const
 AcGeMatrix2d &  | operator*= (const AcGeMatrix2d &mat)
 bool  | operator== (const AcGeMatrix2d &mat) const
 AcGeMatrix2d &  | postMultBy (const AcGeMatrix2d &rightSide)
 AcGeMatrix2d &  | preMultBy (const AcGeMatrix2d &leftSide)
 double  | scale (void)
 AcGeMatrix2d &  | setCoordSystem (const AcGePoint2d &origin, const AcGeVector2d &e0, const AcGeVector2d &e1)
 AcGeMatrix2d &  | setToAlignCoordSys (const AcGePoint2d &fromOrigin, const AcGeVector2d &fromE0, const AcGeVector2d &fromE1, const AcGePoint2d &toOrigin, const AcGeVector2d &toE0, const AcGeVector2d &toE1)
 AcGeMatrix2d &  | setToIdentity ()
 AcGeMatrix2d &  | setToMirroring (const AcGePoint2d &pnt)
 AcGeMatrix2d &  | setToMirroring (const AcGeLine2d &line)
 AcGeMatrix2d &  | setToProduct (const AcGeMatrix2d &mat1, const AcGeMatrix2d &mat2)
 AcGeMatrix2d &  | setToRotation (double angle, const AcGePoint2d &center=AcGePoint2d::kOrigin)
 AcGeMatrix2d &  | setToScaling (double scaleAll, const AcGePoint2d &center=AcGePoint2d::kOrigin)
 AcGeMatrix2d &  | setToTranslation (const AcGeVector2d &vec)
 AcGeMatrix2d &  | setTranslation (const AcGeVector2d &vec)
 AcGeVector2d  | translation () const
 AcGeMatrix2d  | transpose () const
 AcGeMatrix2d &  | transposeIt ()
 Static Public Member Functions
 static AcGeMatrix2d  | alignCoordSys (const AcGePoint2d &fromOrigin, const AcGeVector2d &fromE0, const AcGeVector2d &fromE1, const AcGePoint2d &toOrigin, const AcGeVector2d &toE0, const AcGeVector2d &toE1)
 static AcGeMatrix2d  | mirroring (const AcGePoint2d &pnt)
 static AcGeMatrix2d  | mirroring (const AcGeLine2d &line)
 static AcGeMatrix2d  | rotation (double angle, const AcGePoint2d &center=AcGePoint2d::kOrigin)
 static AcGeMatrix2d  | scaling (double scaleAll, const AcGePoint2d &center=AcGePoint2d::kOrigin)
 static AcGeMatrix2d  | translation (const AcGeVector2d &vec)
 Public Attributes
 double  | entry [3][3]
 Static Public Attributes
 static const AcGeMatrix2d  | kIdentity
 The documentation for this class was generated from the following file:
gemat2d.h