Public Member Functions | List of all members
AcApLayoutManager Class Reference
AcAp Classes
  Inheritance diagram for AcApLayoutManager:
 Public Member Functions
 virtual Adesk::Boolean  | createViewports ()=0
 virtual const ACHAR *  | findActiveTab ()=0
 virtual Acad::ErrorStatus  | getClipBoundaryElaboration (AcDbObjectId clipId, AcGePoint2dArray *&clipBoundary)=0
 virtual ACHAR *  | getNextNewLayoutName (AcDbDatabase *useDb=NULL)=0
 virtual int  | pageSetup (AcDbObjectId layoutBTRId=AcDbObjectId::kNull, void *pParent=NULL, Adesk::Boolean isPageSetupDlg=TRUE)=0
 virtual Acad::ErrorStatus  | pointInViewports (const AcGePoint3d &pickPt, AcDbObjectIdArray &viewports)=0
 virtual void  | setCreateViewports (Adesk::Boolean createViewports)=0
 virtual void  | setDefaultPlotConfig (AcDbObjectId layoutBTRId)=0
 virtual void  | setShowPageSetup (Adesk::Boolean showPageSetupDlg)=0
 virtual void  | setShowPaperBackground (Adesk::Boolean showPaperBackground)=0
 virtual void  | setShowPaperMargins (Adesk::Boolean showPaperMargins)=0
 virtual void  | setShowPrintBorder (Adesk::Boolean showPrintBorder)=0
 virtual void  | setShowTabs (Adesk::Boolean showTabs)=0
 virtual Adesk::Boolean  | showPageSetup ()=0
 virtual Adesk::Boolean  | showPaperBackground ()=0
 virtual Adesk::Boolean  | showPaperMargins ()=0
 virtual Adesk::Boolean  | showPrintBorder ()=0
 virtual Adesk::Boolean  | showTabs ()=0
 virtual void  | updateCurrentPaper (Adesk::Boolean zoomToPaper=FALSE)=0
 virtual void  | updateLayoutTabs ()=0
 Public Member Functions inherited from AcDbLayoutManager
 virtual void  | addReactor (AcDbLayoutManagerReactor *newObj)=0
 virtual Acad::ErrorStatus  | cloneLayout (AcDbLayout *pLBTR, const ACHAR *newname, int newTabOrder=0)=0
 virtual Acad::ErrorStatus  | copyLayout (const ACHAR *copyname, const ACHAR *newname)=0
 virtual int  | countLayouts (AcDbDatabase *useDb=NULL)=0
 virtual Acad::ErrorStatus  | createLayout (const ACHAR *newname, AcDbObjectId &layoutId, AcDbObjectId &blockTableRecId, AcDbDatabase *pDatabase=NULL)=0
 virtual Acad::ErrorStatus  | deleteLayout (const ACHAR *delname)=0
 virtual const ACHAR *  | findActiveLayout (bool allowModel)=0
 virtual AcDbLayout *  | findLayoutNamed (const ACHAR *name, bool leaveRecordOpen=false)=0
 virtual AcDbObjectId  | getActiveLayoutBTRId ()=0
 virtual AcDbObjectId  | getNonRectVPIdFromClipId (AcDbObjectId clipId)=0
 virtual bool  | isVpnumClipped (int index)=0
 virtual void  | removeReactor (AcDbLayoutManagerReactor *delObj)=0
 virtual Acad::ErrorStatus  | renameLayout (const ACHAR *oldname, const ACHAR *newname)=0
 virtual Acad::ErrorStatus  | setCurrentLayout (const ACHAR *newname)=0
 virtual Acad::ErrorStatus  | setCurrentLayoutId (AcDbObjectId layoutId)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
AcApLMgr.h