Public Types | Public Member Functions | Friends | List of all members
AcDbLight Class Reference
AcDb Classes
  Inheritance diagram for AcDbLight:
 Public Types
enum  | LampColorPreset {
 kD65White = 0, kFluorescent, kCoolWhite, kWhiteFluorescent,
 kDaylightFluorescent, kIncandescent, kXenon, kHalogen,
 kQuartz, kMetalHalide, kMercury, kPhosphorMercury,
 kHighPressureSodium, kLowPressureSodium, kCustom
 }
enum  | LampColorType { kKelvin = 0, kPreset }
enum  | PhysicalIntensityMethod { kPeakIntensity = 0, kFlux, kIlluminance }
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
 Public Member Functions
AcDbLight ()
ACRX_DECLARE_MEMBERS (AcDbLight)
virtual bool  | castShadows () const
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwner, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
virtual AcGiDrawable::DrawableType  | drawableType () const
virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
virtual double  | falloffAngle () const
virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const
virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const
bool  | hasTarget () const
virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &subId, const Adesk::Boolean highlightAll) const
virtual double  | hotspotAngle () const
double  | illuminanceDistance () const
virtual double  | intensity () const
virtual bool  | isOn () const
virtual bool  | isPlottable () const
AcDbLight::LampColorPreset  | lampColorPreset () const
Acad::ErrorStatus  | lampColorRGB (AcGiColorRGB &rgbColor) const
double  | lampColorTemp () const
AcDbLight::LampColorType  | lampColorType () const
virtual const
 AcGiLightAttenuation &  | lightAttenuation () const
virtual const AcCmColor &  | lightColor () const
virtual const AcGeVector3d &  | lightDirection () const
virtual AcGiDrawable::DrawableType  | lightType () const
virtual void  | list () const
virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
virtual const AcString &  | name () const
double  | physicalIntensity () const
AcDbLight::PhysicalIntensityMethod  | physicalIntensityMethod () const
virtual const AcGePoint3d &  | position () const
virtual bool  | receiveShadows () const
Acad::ErrorStatus  | resultingColor (AcCmColor &rgbColor) const
virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
virtual void  | setCastShadows (bool newVal)
Acad::ErrorStatus  | setHasTarget (bool hasTarget)
virtual Acad::ErrorStatus  | setHotspotAndFalloff (double hotspot, double falloff)
Acad::ErrorStatus  | setIlluminanceDistance (double distance)
virtual Acad::ErrorStatus  | setIntensity (double intensity)
virtual Acad::ErrorStatus  | setIsPlottable (bool plot)
Acad::ErrorStatus  | setLampColorPreset (AcDbLight::LampColorPreset colorPreset)
Acad::ErrorStatus  | setLampColorRGB (AcGiColorRGB rgbColor)
Acad::ErrorStatus  | setLampColorTemp (double colorTemp)
Acad::ErrorStatus  | setLampColorType (AcDbLight::LampColorType colorType)
virtual void  | setLightAttenuation (const AcGiLightAttenuation &params)
virtual Acad::ErrorStatus  | setLightColor (const AcCmColor &color)
virtual Acad::ErrorStatus  | setLightDirection (const AcGeVector3d &lightvec)
virtual Acad::ErrorStatus  | setLightType (AcGiDrawable::DrawableType type)
virtual Acad::ErrorStatus  | setName (const AcString &name)
virtual Acad::ErrorStatus  | setOn (bool value)
Acad::ErrorStatus  | setPhysicalIntensity (double physicalIntensity)
Acad::ErrorStatus  | setPhysicalIntensityMethod (AcDbLight::PhysicalIntensityMethod method)
virtual Acad::ErrorStatus  | setPosition (const AcGePoint3d &pos)
virtual void  | setReceiveShadows (bool newVal)
virtual void  | setShadowParameters (const AcGiShadowParameters &params)
Acad::ErrorStatus  | setShadowParameters (const AcGiShadowParameters2 &params)
virtual Acad::ErrorStatus  | setTargetLocation (const AcGePoint3d &newVal)
Acad::ErrorStatus  | setWebFile (const ACHAR *webFile)
Acad::ErrorStatus  | setWebRotation (AcGeVector3d rotation)
virtual const
 AcGiShadowParameters &  | shadowParameters () const
Acad::ErrorStatus  | shadowParameters (AcGiShadowParameters2 &params) const
virtual Acad::ErrorStatus  | subClose ()
virtual const AcGePoint3d &  | targetLocation () const
virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform)
virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &subId, const Adesk::Boolean highlightAll) const
virtual void  | viewportDraw (AcGiViewportDraw *mode)
virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary) const
Acad::ErrorStatus  | webFile (AcString &webFile) const
Acad::ErrorStatus  | webRotation (AcGeVector3d &rotation) const
virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *mode)
~AcDbLight ()
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual Adesk::Boolean  | cloneMeForDragging ()
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual void  | dragStatus (const AcDb::DragStat status)
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable ()
 AcCmEntityColor  | entityColor () const
 virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const
 virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual void  | getEcs (AcGeMatrix3d &retVal) const
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeFastTransform &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual void  | gripStatus (const AcDb::GripStat status)
 virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Adesk::Boolean  | isPlanar () const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 ACHAR *  | plotStyleName () const
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual void  | setGsNode (AcGsNode *pNode)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &id) const
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | transformBy (const AcGeFastTransform &xform)
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 AcCmTransparency  | transparency () const
 AcDb::Visibility  | visibility () const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Friends
 class  | AcDbImpLight
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Constructor & Destructor Documentation
 AcDbLight::AcDbLight  |  ( |   | )
Warning
Not implemented!
 AcDbLight::~AcDbLight  |  ( |   | )
Warning
Not implemented!
Member Function Documentation
 virtual bool AcDbLight::castShadows  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbLight::copyFrom  |  ( |  const AcRxObject *  |  other | )
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual Acad::ErrorStatus AcDbLight::decomposeForSave  |  ( |  AcDb::AcDbDwgVersion  |  ver,
|  AcDbObject *&  |  replaceObj,
|  AcDbObjectId &  |  replaceId,
|  Adesk::Boolean &  |  exchangeXData
)
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual Acad::ErrorStatus AcDbLight::deepClone  |  ( |  AcDbObject *  |  pOwner,
|  AcDbObject *&  |  pClonedObject,
|  AcDbIdMapping &  |  idMap,
|  Adesk::Boolean  |  isPrimary = true
) |   |  const
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual AcGiDrawable::DrawableType AcDbLight::drawableType  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcGiDrawable.
 virtual Acad::ErrorStatus AcDbLight::dwgInFields  |  ( |  AcDbDwgFiler *  |  pFiler | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbLight::dwgOutFields  |  ( |  AcDbDwgFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbLight::dxfInFields  |  ( |  AcDbDxfFiler *  |  pFiler | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbLight::dxfOutFields  |  ( |  AcDbDxfFiler *  |  pFiler | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual double AcDbLight::falloffAngle  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::getClassID  |  ( |  CLSID *  |  pClsid | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbLight::getGeomExtents  |  ( |  AcDbExtents &  |  extents | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbLight::getGripPoints  |  ( |  AcDbGripDataPtrArray &  |  grips,
|  const double  |  curViewUnitSize,
|  const int  |  gripSize,
|  const AcGeVector3d &  |  curViewDir,
|  const int  |  bitflags
) |   |  const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbLight::getOsnapPoints  |  ( |  AcDb::OsnapMode  |  osnapMode,
|  Adesk::GsMarker  |  gsSelectionMark,
|  const AcGePoint3d &  |  pickPoint,
|  const AcGePoint3d &  |  lastPoint,
|  const AcGeMatrix3d &  |  viewXform,
|  AcGePoint3dArray &  |  snapPoints,
|  AcDbIntArray &  |  geomIds
) |   |  const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbLight::getOsnapPoints  |  ( |  AcDb::OsnapMode  |  osnapMode,
|  Adesk::GsMarker  |  gsSelectionMark,
|  const AcGePoint3d &  |  pickPoint,
|  const AcGePoint3d &  |  lastPoint,
|  const AcGeMatrix3d &  |  viewXform,
|  AcGePoint3dArray &  |  snapPoints,
|  AcDbIntArray &  |  geomIds,
|  const AcGeMatrix3d &  |  insertionMat
) |   |  const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbLight::getTransformedCopy  |  ( |  const AcGeMatrix3d &  |  xform,
|  AcDbEntity *&  |  pEnt
) |   |  const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 bool AcDbLight::hasTarget  |  ( |   | ) |   const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::highlight  |  ( |  const AcDbFullSubentPath &  |  subId,
|  const Adesk::Boolean  |  highlightAll
) |   |  const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual double AcDbLight::hotspotAngle  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 double AcDbLight::illuminanceDistance  |  ( |   | ) |   const
Warning
Not implemented!
 virtual double AcDbLight::intensity  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcDbLight::isOn  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcDbLight::isPlottable  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 AcDbLight::LampColorPreset AcDbLight::lampColorPreset  |  ( |   | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::lampColorRGB  |  ( |  AcGiColorRGB &  |  rgbColor | ) |   const
Warning
Not implemented!
 double AcDbLight::lampColorTemp  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbLight::LampColorType AcDbLight::lampColorType  |  ( |   | ) |   const
Warning
Not implemented!
 virtual const AcGiLightAttenuation& AcDbLight::lightAttenuation  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual const AcCmColor& AcDbLight::lightColor  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual const AcGeVector3d& AcDbLight::lightDirection  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual AcGiDrawable::DrawableType AcDbLight::lightType  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual void AcDbLight::list  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbLight::moveGripPointsAt  |  ( |  const AcDbVoidPtrArray &  |  gripAppData,
|  const AcGeVector3d &  |  offset,
|  const int  |  bitflags
)
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual const AcString& AcDbLight::name  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 double AcDbLight::physicalIntensity  |  ( |   | ) |   const
Warning
Not implemented!
 AcDbLight::PhysicalIntensityMethod AcDbLight::physicalIntensityMethod  |  ( |   | ) |   const
Warning
Not implemented!
 virtual const AcGePoint3d& AcDbLight::position  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcDbLight::receiveShadows  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 Acad::ErrorStatus AcDbLight::resultingColor  |  ( |  AcCmColor &  |  rgbColor | ) |   const
Warning
Not implemented!
 virtual Adesk::UInt32 AcDbLight::setAttributes  |  ( |  AcGiDrawableTraits *  |  pTraits | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual void AcDbLight::setCastShadows  |  ( |  bool  |  newVal | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 Acad::ErrorStatus AcDbLight::setHasTarget  |  ( |  bool  |  hasTarget | )
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::setHotspotAndFalloff  |  ( |  double  |  hotspot,
|  double  |  falloff
)
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::setIlluminanceDistance  |  ( |  double  |  distance | )
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::setIntensity  |  ( |  double  |  intensity | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::setIsPlottable  |  ( |  bool  |  plot | )
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::setLampColorPreset  |  ( |  AcDbLight::LampColorPreset  |  colorPreset | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::setLampColorRGB  |  ( |  AcGiColorRGB  |  rgbColor | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::setLampColorTemp  |  ( |  double  |  colorTemp | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::setLampColorType  |  ( |  AcDbLight::LampColorType  |  colorType | )
Warning
Not implemented!
 virtual void AcDbLight::setLightAttenuation  |  ( |  const AcGiLightAttenuation &  |  params | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::setLightColor  |  ( |  const AcCmColor &  |  color | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::setLightDirection  |  ( |  const AcGeVector3d &  |  lightvec | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::setLightType  |  ( |  AcGiDrawable::DrawableType  |  type | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::setName  |  ( |  const AcString &  |  name | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::setOn  |  ( |  bool  |  value | )
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::setPhysicalIntensity  |  ( |  double  |  physicalIntensity | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::setPhysicalIntensityMethod  |  ( |  AcDbLight::PhysicalIntensityMethod  |  method | )
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::setPosition  |  ( |  const AcGePoint3d &  |  pos | )
virtual
Warning
Not implemented!
 virtual void AcDbLight::setReceiveShadows  |  ( |  bool  |  newVal | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual void AcDbLight::setShadowParameters  |  ( |  const AcGiShadowParameters &  |  params | )
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::setShadowParameters  |  ( |  const AcGiShadowParameters2 &  |  params | )
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::setTargetLocation  |  ( |  const AcGePoint3d &  |  newVal | )
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::setWebFile  |  ( |  const ACHAR *  |  webFile | )
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::setWebRotation  |  ( |  AcGeVector3d  |  rotation | )
Warning
Not implemented!
 virtual const AcGiShadowParameters& AcDbLight::shadowParameters  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::shadowParameters  |  ( |  AcGiShadowParameters2 &  |  params | ) |   const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::subClose  |  ( |   | )
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 virtual const AcGePoint3d& AcDbLight::targetLocation  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDbLight::transformBy  |  ( |  const AcGeMatrix3d &  |  xform | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbLight::unhighlight  |  ( |  const AcDbFullSubentPath &  |  subId,
|  const Adesk::Boolean  |  highlightAll
) |   |  const
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual void AcDbLight::viewportDraw  |  ( |  AcGiViewportDraw *  |  mode | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 virtual Acad::ErrorStatus AcDbLight::wblockClone  |  ( |  AcRxObject *  |  pOwnerObject,
|  AcDbObject *&  |  pClonedObject,
|  AcDbIdMapping &  |  idMap,
|  Adesk::Boolean  |  isPrimary
) |   |  const
virtual
Warning
Not implemented!
Reimplemented from AcDbObject.
 Acad::ErrorStatus AcDbLight::webFile  |  ( |  AcString &  |  webFile | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcDbLight::webRotation  |  ( |  AcGeVector3d &  |  rotation | ) |   const
Warning
Not implemented!
 virtual Adesk::Boolean AcDbLight::worldDraw  |  ( |  AcGiWorldDraw *  |  mode | )
virtual
Warning
Not implemented!
Reimplemented from AcDbEntity.
 The documentation for this class was generated from the following file:
dbLight.h