Public Member Functions | List of all members
AcGeCone Class Reference
AcGe Classes
  Inheritance diagram for AcGeCone:
 Public Member Functions
AcGeCone (double cosineAngle, double sineAngle, const AcGePoint3d &baseOrigin, double baseRadius, const AcGeVector3d &axisOfSymmetry)
AcGeCone (double cosineAngle, double sineAngle, const AcGePoint3d &baseOrigin, double baseRadius, const AcGeVector3d &axisOfSymmetry, const AcGeVector3d &refAxis, const AcGeInterval &height, double startAngle, double endAngle)
AcGeCone (const AcGeCone &cone)
 AcGePoint3d  | apex () const
 AcGeVector3d  | axisOfSymmetry () const
 AcGePoint3d  | baseCenter () const
 double  | baseRadius () const
 void  | getAngles (double &start, double &end) const
 void  | getHalfAngle (double &cosineAngle, double &sineAngle) const
 void  | getHeight (AcGeInterval &range) const
 double  | halfAngle () const
 double  | heightAt (double u) const
 Adesk::Boolean  | intersectWith (const AcGeLinearEnt3d &linEnt, int &intn, AcGePoint3d &p1, AcGePoint3d &p2, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isClosed (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOuterNormal () const
 AcGeCone &  | operator= (const AcGeCone &cone)
 AcGeVector3d  | refAxis () const
 AcGeCone &  | set (double cosineAngle, double sineAngle, const AcGePoint3d &baseCenter, double baseRadius, const AcGeVector3d &axisOfSymmetry)
 AcGeCone &  | set (double cosineAngle, double sineAngle, const AcGePoint3d &baseCenter, double baseRadius, const AcGeVector3d &axisOfSymmetry, const AcGeVector3d &refAxis, const AcGeInterval &height, double startAngle, double endAngle)
 AcGeCone &  | setAngles (double startAngle, double endAngle)
 AcGeCone &  | setBaseRadius (double radius)
 AcGeCone &  | setHeight (const AcGeInterval &height)
 Public Member Functions inherited from AcGeSurface
 AcGePoint3d  | closestPointTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param, int derivOrd, AcGeVector3dArray &derivatives) const
 AcGePoint3d  | evalPoint (const AcGePoint2d &param, int derivOrd, AcGeVector3dArray &derivatives, AcGeVector3d &normal) const
 void  | getClosestPointTo (const AcGePoint3d &pnt, AcGePointOnSurface &result, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getEnvelope (AcGeInterval &intrvlX, AcGeInterval &intrvlY) const
 Adesk::Boolean  | isClosedInU (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isClosedInV (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isNormalReversed () const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, AcGePoint2d &paramPoint, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeSurface &  | operator= (const AcGeSurface &otherSurface)
 AcGePoint2d  | paramOf (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeSurface &  | reverseNormal ()
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Additional Inherited Members
 Protected Member Functions inherited from AcGeSurface
AcGeSurface (const AcGeSurface &)
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
gecone.h