Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcGeEntity2d Class Reference
AcGe Classes
  Inheritance diagram for AcGeEntity2d:
 Public Member Functions
 AcGeEntity2d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity2d &entity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 Adesk::Boolean  | isOn (const AcGePoint2d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity2d &  | mirror (const AcGeLine2d &line)
 Adesk::Boolean  | operator!= (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | operator= (const AcGeEntity2d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity2d &entity) const
 AcGeEntity2d &  | rotateBy (double angle, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | scaleBy (double scaleFactor, const AcGePoint2d &wrtPoint=AcGePoint2d::kOrigin)
 AcGeEntity2d &  | transformBy (const AcGeMatrix2d &xfm)
 AcGeEntity2d &  | translateBy (const AcGeVector2d &translateVec)
 AcGe::EntityId  | type () const
 Protected Member Functions
AcGeEntity2d (const AcGeEntity2d &)
AcGeEntity2d (AcGeImpEntity3d &, int)
AcGeEntity2d (AcGeImpEntity3d *)
 AcGeEntity2d *  | newEntity2d (AcGeImpEntity3d *) const
 Protected Attributes
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 Friends
 class  | AcGeEntity3d
 class  | AcGeImpEntity3d
 The documentation for this class was generated from the following file:
geent2d.h