Public Types | Public Member Functions | List of all members
AcDbField Class Reference
AcDb Classes
  Inheritance diagram for AcDbField:
 Public Types
enum  | EvalContext {
 kOpen = (0x1 << 0), kSave = (0x1 << 1), kPlot = (0x1 << 2), kEtransmit = (0x1 << 3),
 kRegen = (0x1 << 4), kDemand = (0x1 << 5), kPreview = (0x1 << 6), kPlotPreview = (0x1 << 7)
 }
enum  | EvalOption {
 kDisable = 0, kOnOpen = (0x1 << 0), kOnSave = (0x1 << 1), kOnPlot = (0x1 << 2),
 kOnEtransmit = (0x1 << 3), kOnRegen = (0x1 << 4), kOnDemand = (0x1 << 5), kAutomatic
 }
enum  | EvalStatus {
 kNotYetEvaluated = (0x1 << 0), kSuccess = (0x1 << 1), kEvaluatorNotFound = (0x1 << 2), kSyntaxError = (0x1 << 3),
 kInvalidCode = (0x1 << 4), kInvalidContext = (0x1 << 5), kOtherError = (0x1 << 6)
 }
enum  | FieldCodeFlag {
 kFieldCode = (0x1 << 0), kEvaluatedText = (0x1 << 1), kEvaluatedChildren = (0x1 << 2), kObjectReference = (0x1 << 3),
 kAddMarkers = (0x1 << 4), kEscapeBackslash = (0x1 << 5), kStripOptions = (0x1 << 6), kPreserveFields = (0x1 << 7),
 kTextField = (0x1 << 8), kPreserveOptions = (0x1 << 9), kDetachChildren = (0x1 << 10), kChildObjectReference = (0x1 << 11),
 kForExpression = (0x1 << 12)
 }
enum  | FilingOption { kSkipFilingResult = (0x1 << 0) }
enum  | State {
 kInitialized = (0x1 << 0), kCompiled = (0x1 << 1), kModified = (0x1 << 2), kEvaluated = (0x1 << 3),
 kHasCache = (0x1 << 4), kHasFormattedString = (0x1 << 5)
 }
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbField)
 ACDB_PORT  | AcDbField (const ACHAR *pszFieldCode, bool bTextField=false)
 ACDB_PORT int  | childCount (void) const
Acad::ErrorStatus  | convertToTextField (void)
 ACDB_PORT AcValue::DataType  | dataType (void) const
 virtual ACDB_PORT Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 virtual ACDB_PORT Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 virtual ACDB_PORT Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 virtual ACDB_PORT Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 ACDB_PORT Acad::ErrorStatus  | evaluate (int nContext, AcDbDatabase *pDb, int *pNumFound=NULL, int *pNumEvaluated=NULL)
 ACDB_PORT AcDbField::EvalOption  | evaluationOption (void) const
 ACDB_PORT AcDbField::EvalStatus  | evaluationStatus (int *pnErrCode=NULL, ACHAR **pszErrMsg=NULL) const
 ACDB_PORT const ACHAR *  | evaluatorId (void) const
 ACDB_PORT AcDbField::FilingOption  | filingOption (void) const
 ACDB_PORT Acad::ErrorStatus  | getChild (int iIndex, AcDbField *&pField, AcDb::OpenMode mode)
 ACDB_PORT Acad::ErrorStatus  | getData (const ACHAR *pszKey, AcValue *pData) const
 ACDB_PORT const ACHAR *  | getFieldCode (AcDbField::FieldCodeFlag nFlag, AcArray< AcDbField * > *pChildFields=NULL, AcDb::OpenMode mode=AcDb::kForRead) const
 ACDB_PORT Acad::ErrorStatus  | getFieldCode (ACHAR *&pszFieldCode, AcDbField::FieldCodeFlag nFlag, AcArray< AcDbField * > *pChildFields=NULL, AcDb::OpenMode mode=AcDb::kForRead) const
 ACDB_PORT const ACHAR *  | getFormat (void) const
 ACDB_PORT Acad::ErrorStatus  | getFormat (ACHAR *&pszFormat) const
 ACDB_PORT Acad::ErrorStatus  | getHyperlink (AcHyperlink &hlink) const
 ACDB_PORT Acad::ErrorStatus  | getHyperlink (ACHAR **pszName, ACHAR **pszDescription, ACHAR **pszSubLocation, ACHAR **pszDisplayString, long *pFlag) const
 ACDB_PORT const ACHAR *  | getValue (void) const
 ACDB_PORT Acad::ErrorStatus  | getValue (ACHAR *&pszValue) const
 ACDB_PORT Acad::ErrorStatus  | getValue (AcValue &value) const
 ACDB_PORT Acad::ErrorStatus  | getValue (AcFdFieldValue &value) const
 ACDB_PORT bool  | hasHyperlink (void) const
bool  | isTextField (void) const
 ACDB_PORT Acad::ErrorStatus  | postInDatabase (AcDbDatabase *pDb)
 ACDB_PORT Acad::ErrorStatus  | removeHyperlink (void)
 ACDB_PORT Acad::ErrorStatus  | setData (const ACHAR *pszKey, const AcValue *pData)
 ACDB_PORT Acad::ErrorStatus  | setData (const ACHAR *pszKey, const AcValue *pData, bool bRecursive)
 ACDB_PORT Acad::ErrorStatus  | setEvaluationOption (AcDbField::EvalOption nEvalOption)
 ACDB_PORT Acad::ErrorStatus  | setEvaluatorId (const ACHAR *pszEvaluatorId)
 ACDB_PORT Acad::ErrorStatus  | setFieldCode (const ACHAR *pszFieldCode, AcDbField::FieldCodeFlag nFlag=(AcDbField::FieldCodeFlag) 0, AcDbFieldArray *pChildFields=NULL)
 ACDB_PORT Acad::ErrorStatus  | setFilingOption (AcDbField::FilingOption nOption)
 ACDB_PORT Acad::ErrorStatus  | setFormat (const ACHAR *pszFormat)
 ACDB_PORT Acad::ErrorStatus  | setHyperlink (const AcHyperlink &hlink)
 ACDB_PORT Acad::ErrorStatus  | setHyperlink (const ACHAR *pszName, const ACHAR *pszDescription, const ACHAR *pszSubLocation=NULL)
 ACDB_PORT Acad::ErrorStatus  | setHyperlink (const ACHAR *pszName, const ACHAR *pszDescription, const ACHAR *pszSubLocation, long lFlag)
 ACDB_PORT Acad::ErrorStatus  | setInObject (AcDbObject *pObj, const ACHAR *pszPropName)
 ACDB_PORT AcDbField::State  | state (void) const
 virtual ACDB_PORT Acad::ErrorStatus  | subClose ()
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual AcGsNode *  | gsNode () const
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 virtual void  | setGsNode (AcGsNode *pNode)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual void  | viewportDraw (AcGiViewportDraw *pVd)
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Member Function Documentation
 Acad::ErrorStatus AcDbField::convertToTextField  |  ( |  void  |   | )
Warning
Not implemented!
 bool AcDbField::isTextField  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
DbField.h