Classes | Public Types | Public Member Functions | Static Public Member Functions | List of all members
AcGiVariant Class Reference
AcGi Classes
  Inheritance diagram for AcGiVariant:
 Classes
class  | EnumType
 Public Types
enum  | VariantType {
 kUndefined = 0, kBoolean, kInt, kDouble,
 kColor, kString, kTable
 }
 Public Member Functions
AcGiVariant (void)
AcGiVariant (const AcGiVariant &value)
AcGiVariant (bool)
AcGiVariant (long)
AcGiVariant (double)
AcGiVariant (const AcCmColor &)
AcGiVariant (const ACHAR *)
ACRX_DECLARE_MEMBERS (AcGiVariant)
bool  | asBoolean () const
ACDB_PORT char  | asChar () const
AcCmColor  | asColor () const
double  | asDouble () const
ACDB_PORT EnumType  | asEnum () const
ACDB_PORT float  | asFloat () const
int  | asInt () const
ACDB_PORT long  | asLong () const
ACDB_PORT short  | asShort () const
AcString  | asString () const
ACDB_PORT unsigned char  | asUchar () const
ACDB_PORT unsigned int  | asUint () const
ACDB_PORT unsigned long  | asUlong () const
ACDB_PORT unsigned short  | asUshort () const
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
void  | deleteElem (ACHAR *const)
Acad::ErrorStatus  | getElem (ACHAR *const, AcGiVariant &value) const
const AcGiVariant *  | getElem (ACHAR *const) const
Acad::ErrorStatus  | getElemAt (const int, ACHAR *&, AcGiVariant &) const
AcGiVariant *  | getElemAt (const int, ACHAR *&) const
int  | getElemCount () const
AcGiVariant &  | operator= (const AcGiVariant &value)
virtual bool  | operator== (const AcGiVariant &value) const
void  | set (bool)
void  | set (long)
void  | set (double)
void  | set (const AcCmColor &)
void  | set (const ACHAR *)
void  | setElem (ACHAR *const, const AcGiVariant &)
VariantType  | type () const
virtual  | ~AcGiVariant (void)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
static bool  | isEquivalent (AcGiVariant *, AcGiVariant *)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiVariant::AcGiVariant  |  ( |  void  |   | )
Warning
Not implemented!
 virtual AcGiVariant::~AcGiVariant  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 AcGiVariant::AcGiVariant  |  ( |  const AcGiVariant &  |  value | )
Warning
Not implemented!
 AcGiVariant::AcGiVariant  |  ( |  bool  |   | )
Warning
Not implemented!
 AcGiVariant::AcGiVariant  |  ( |  long  |   | )
Warning
Not implemented!
 AcGiVariant::AcGiVariant  |  ( |  double  |   | )
Warning
Not implemented!
 AcGiVariant::AcGiVariant  |  ( |  const AcCmColor &  |   | )
Warning
Not implemented!
 AcGiVariant::AcGiVariant  |  ( |  const ACHAR *  |   | )
Warning
Not implemented!
Member Function Documentation
 bool AcGiVariant::asBoolean  |  ( |   | ) |   const
Warning
Not implemented!
 ACDB_PORT char AcGiVariant::asChar  |  ( |   | ) |   const
Warning
Not implemented!
 AcCmColor AcGiVariant::asColor  |  ( |   | ) |   const
Warning
Not implemented!
 double AcGiVariant::asDouble  |  ( |   | ) |   const
Warning
Not implemented!
 ACDB_PORT EnumType AcGiVariant::asEnum  |  ( |   | ) |   const
Warning
Not implemented!
 ACDB_PORT float AcGiVariant::asFloat  |  ( |   | ) |   const
Warning
Not implemented!
 int AcGiVariant::asInt  |  ( |   | ) |   const
Warning
Not implemented!
 ACDB_PORT long AcGiVariant::asLong  |  ( |   | ) |   const
Warning
Not implemented!
 ACDB_PORT short AcGiVariant::asShort  |  ( |   | ) |   const
Warning
Not implemented!
 AcString AcGiVariant::asString  |  ( |   | ) |   const
Warning
Not implemented!
 ACDB_PORT unsigned char AcGiVariant::asUchar  |  ( |   | ) |   const
Warning
Not implemented!
 ACDB_PORT unsigned int AcGiVariant::asUint  |  ( |   | ) |   const
Warning
Not implemented!
 ACDB_PORT unsigned long AcGiVariant::asUlong  |  ( |   | ) |   const
Warning
Not implemented!
 ACDB_PORT unsigned short AcGiVariant::asUshort  |  ( |   | ) |   const
Warning
Not implemented!
 virtual Acad::ErrorStatus AcGiVariant::copyFrom  |  ( |  const AcRxObject *  |  other | )
virtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 void AcGiVariant::deleteElem  |  ( |  ACHAR *  |  const | )
Warning
Not implemented!
 Acad::ErrorStatus AcGiVariant::getElem  |  ( |  ACHAR *  |  const,
|  AcGiVariant &  |  value
) |   |  const
Warning
Not implemented!
 const AcGiVariant* AcGiVariant::getElem  |  ( |  ACHAR *  |  const | ) |   const
Warning
Not implemented!
 Acad::ErrorStatus AcGiVariant::getElemAt  |  ( |  const int  |  ,
|  ACHAR *&  |  ,
|  AcGiVariant &
) |   |  const
Warning
Not implemented!
 AcGiVariant* AcGiVariant::getElemAt  |  ( |  const int  |  ,
|  ACHAR *&
) |   |  const
Warning
Not implemented!
 int AcGiVariant::getElemCount  |  ( |   | ) |   const
Warning
Not implemented!
 static bool AcGiVariant::isEquivalent  |  ( |  AcGiVariant *  |  ,
|  AcGiVariant *
)
static
Warning
Not implemented!
 AcGiVariant& AcGiVariant::operator=  |  ( |  const AcGiVariant &  |  value | )
Warning
Not implemented!
 virtual bool AcGiVariant::operator==  |  ( |  const AcGiVariant &  |  value | ) |   const
virtual
Warning
Not implemented!
 void AcGiVariant::set  |  ( |  bool  |   | )
Warning
Not implemented!
 void AcGiVariant::set  |  ( |  long  |   | )
Warning
Not implemented!
 void AcGiVariant::set  |  ( |  double  |   | )
Warning
Not implemented!
 void AcGiVariant::set  |  ( |  const AcCmColor &  |   | )
Warning
Not implemented!
 void AcGiVariant::set  |  ( |  const ACHAR *  |   | )
Warning
Not implemented!
 void AcGiVariant::setElem  |  ( |  ACHAR *  |  const,
|  const AcGiVariant &
)
Warning
Not implemented!
 VariantType AcGiVariant::type  |  ( |   | ) |   const
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acgi.h