Public Member Functions | List of all members
AcRxDynamicLinker Class Reference
  Inheritance diagram for AcRxDynamicLinker:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcRxDynamicLinker)
 virtual void  | addReactor (AcRxDLinkerReactor *newReactor)=0
 virtual void *  | getSymbolAddress (const ACHAR *serviceName, const char *symbol) const =0
 virtual bool  | initListedModules (const ACHAR *fileName)=0
 virtual bool  | isAppBusy (const ACHAR *modulename) const =0
 virtual bool  | isApplicationLocked (const ACHAR *modulename) const =0
 virtual bool  | isAppMDIAware (const ACHAR *modulename) const =0
 virtual bool  | loadApp (const ACHAR *appName, AcadApp::LoadReasons al, bool printit, bool asCmd=false)=0
 virtual bool  | loadModule (const ACHAR *fileName, bool printit, bool asCmd=false)=0
 virtual bool  | lockApplication (void *appId) const =0
 virtual const ACHAR *  | ProductKey () const =0
 virtual Adesk::UInt32  | ProductLcid () const =0
 virtual bool  | registerAppMDIAware (void *appId) const =0
 virtual bool  | registerAppNotMDIAware (void *appId) const =0
 virtual AcRxObject *  | registerService (const ACHAR *serviceName, AcRxService *serviceObj)=0
 virtual void  | removeReactor (AcRxDLinkerReactor *oldReactor)=0
 virtual void  | setAppBusy (const ACHAR *modulename, bool bBusyFlag) const =0
 virtual bool  | unloadApp (const ACHAR *appName, bool asCmd=false)=0
 virtual bool  | unloadModule (const ACHAR *fileName, bool asCmd=false)=0
 virtual bool  | unlockApplication (void *appId) const =0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
rxdlinkr.h