Public Types | Public Member Functions | List of all members
AcApDocument Class Reference
AcAp Classes
  Inheritance diagram for AcApDocument:
 Public Types
enum  | SaveFormat {
 kUnknown = -1, kR12_dxf = 1, kR13_dwg = 4, kR13_dxf = 5,
 kR14_dwg = 8, kR14_dxf = 9, k2000_dwg = 12, k2000_dxf = 13,
 k2000_Template = 14, k2000_Standard = 15, k2000_xml = 16, k2004_dwg = 24,
 k2004_dxf = 25, k2004_Template = 26, k2004_Standard = 27, k2007_dwg = 36,
 k2007_dxf = 37, k2007_Template = 38, k2007_Standard = 39, k2010_dwg = 48,
 k2010_dxf = 49, k2010_Template = 50, k2010_Standard = 51, k2013_dwg = 60,
 k2013_dxf = 61, k2013_Template = 62, k2013_Standard = 63, kNative = k2013_dwg,
 kNative = k2013_dwg, kR15_dwg = k2000_dwg, kR15_dxf = k2000_dxf, kR15_Template = k2000_Template,
 kR15_Standard = k2000_Standard, kR15_xml = k2000_xml, kR18_dwg = k2004_dwg, kR18_dxf = k2004_dxf,
 kR18_Template = k2004_Template, kR18_Standard = k2004_Standard, kR21_dwg = k2007_dwg, kR21_dxf = k2007_dxf,
 kR21_Template = k2007_Template, kR21_Standard = k2007_Standard, kR24_dwg = k2010_dwg, kR24_dxf = k2010_dxf,
 kR24_Template = k2010_Template, kR24_Standard = k2010_Standard, kR27_dwg = k2013_dwg, kR27_dxf = k2013_dxf,
 kR27_Template = k2013_Template, kR27_Standard = k2013_Standard
 }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcApDocument)
 virtual CDocument *  | cDoc () const =0
 virtual void *  | contextPtr () const =0
 virtual AcDbDatabase *  | database () const =0
 virtual const ACHAR *  | docTitle () const =0
 virtual AcApStatusBar *  | drawingStatusBar () const =0
 virtual const ACHAR *  | fileName () const =0
 virtual SaveFormat  | formatForSave () const =0
 virtual int  | GetCountOfLispList () const =0
 virtual IDispatch *  | GetIDispatch (bool bAddRef)=0
 virtual AcLispAppInfo *  | GetItemOfLispList (int nIndex) const =0
 virtual AcEdInputPointManager *  | inputPointManager ()=0
 virtual bool  | isQuiescent () const =0
 virtual bool  | isReadOnly () const =0
 virtual AcAp::DocLockMode  | lockMode (bool bIncludeMyLocks=false) const =0
 virtual AcAp::DocLockMode  | myLockMode () const =0
 Acad::ErrorStatus  | popDbmod ()
 void  | pushDbmod ()
 virtual AcTransactionManager *  | transactionManager () const =0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acdocman.h