Public Types | Public Member Functions | Protected Member Functions | List of all members
AcDbBlockTableRecord Class Reference
AcDb Classes
  Inheritance diagram for AcDbBlockTableRecord:
 Public Types
enum  | BlockScaling { kAny, kUniform }
 typedef AcArray< Adesk::UInt8 >  | PreviewIcon
 typedef AcDbBlockTable  | TableType
 Public Types inherited from AcDbSymbolTableRecord
 typedef AcDbSymbolTable  | TableType
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbBlockTableRecord)
 Acad::ErrorStatus  | addAnnoScalestoBlkRefs (const bool bScale=false)
 Acad::ErrorStatus  | appendAcDbEntity (AcDbEntity *pEntity)
 Acad::ErrorStatus  | appendAcDbEntity (AcDbObjectId &pOutputId, AcDbEntity *pEntity)
 virtual Acad::ErrorStatus  | assumeOwnershipOf (AcArray< AcDbObjectId > entitiesToMove)
 AcDb::UnitsValue  | blockInsertUnits () const
 AcDbBlockTableRecord::BlockScaling  | blockScaling () const
 Acad::ErrorStatus  | comments (ACHAR *&pString) const
 Acad::ErrorStatus  | comments (const ACHAR *&pString) const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 AcGiDrawable *  | drawable ()
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *filer) const
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *filer) const
 bool  | explodable () const
 Acad::ErrorStatus  | getBlockReferenceIds (AcDbObjectIdArray &ids, bool bDirectOnly=true, bool bForceValidity=false) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 Acad::ErrorStatus  | getErasedBlockReferenceIds (AcDbObjectIdArray &)
 AcDbObjectId  | getLayoutId () const
 Acad::ErrorStatus  | getPreviewIcon (PreviewIcon &previewIcon) const
 Acad::ErrorStatus  | getSortentsTable (AcDbSortentsTable *&pSortents, AcDb::OpenMode openMode, bool createIfNecessary=false)
 AcGsNode *  | gsNode () const
 bool  | hasAttributeDefinitions () const
 bool  | hasPreviewIcon () const
 bool  | isAnonymous () const
 bool  | isFromExternalReference () const
 bool  | isFromOverlayReference () const
 bool  | isLayout () const
 bool  | isUnloaded () const
 Acad::ErrorStatus  | newBlockReferenceIdIterator (AcDbBlockReferenceIdIterator *&pIter) const
 Acad::ErrorStatus  | newIterator (AcDbBlockTableRecordIterator *&pIterator, bool atBeginning=true, bool skipDeleted=true) const
 Acad::ErrorStatus  | openBlockBegin (AcDbBlockBegin *&pBlockBegin, AcDb::OpenMode openMode)
 Acad::ErrorStatus  | openBlockEnd (AcDbBlockEnd *&pBlockEnd, AcDb::OpenMode openMode)
 AcGePoint3d  | origin () const
 Acad::ErrorStatus  | pathName (ACHAR *&pPath) const
 Acad::ErrorStatus  | pathName (const ACHAR *&pPath) const
 Acad::ErrorStatus  | postProcessAnnotativeBTR (int &stripCnt, const bool bqueryOnly=false, const bool bScale=true)
 Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 Acad::ErrorStatus  | setBlockInsertUnits (AcDb::UnitsValue insunits)
 Acad::ErrorStatus  | setBlockScaling (AcDbBlockTableRecord::BlockScaling blockScaling)
 Acad::ErrorStatus  | setComments (const ACHAR *pString)
 Acad::ErrorStatus  | setExplodable (bool bExplodable)
 void  | setGsNode (AcGsNode *pNode)
 Acad::ErrorStatus  | setIsUnloaded (bool isUnloaded)
 Acad::ErrorStatus  | setLayoutId (AcDbObjectId)
 Acad::ErrorStatus  | setOrigin (const AcGePoint3d &pt)
 Acad::ErrorStatus  | setPathName (const ACHAR *pathStr)
 Acad::ErrorStatus  | setPreviewIcon (const PreviewIcon &previewIcon)
 void  | viewportDraw (AcGiViewportDraw *pVd)
 Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 AcDbDatabase *  | xrefDatabase (bool incUnres=false) const
 AcDb::XrefStatus  | xrefStatus () const
 Public Member Functions inherited from AcDbSymbolTableRecord
ACDB_DECLARE_MEMBERS (AcDbSymbolTableRecord)
 Acad::ErrorStatus  | getName (ACHAR *&pName) const
 Acad::ErrorStatus  | getName (AcString &sName) const
 Acad::ErrorStatus  | getName (const ACHAR *&pName) const
 bool  | isDependent () const
 bool  | isResolved () const
 Acad::ErrorStatus  | setName (const ACHAR *pName)
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual Acad::ErrorStatus  | subGetClassID (CLSID *pClsid) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 The documentation for this class was generated from the following file:
dbsymtb.h