Public Member Functions | List of all members
AcPublishBeginJobInfo Class Reference
 Public Member Functions
 virtual const AcPlDSDData *  | GetDSDData ()=0
 virtual AcPlPlotLogger *  | GetPlotLogger ()=0
 virtual const AcNameValuePairVec  | GetPrivateData (const ACHAR *sectionName)=0
 virtual bool  | JobWillPublishInBackground ()=0
 virtual bool  | WritePrivateSection (const ACHAR *sectionName, const AcNameValuePairVec nameValuePairVec)=0
 The documentation for this class was generated from the following file:
AcPublishReactors.h