Public Member Functions | List of all members
AcGsNode Class Reference
 Public Member Functions
 virtual AcGiDrawable *  | drawable (void) const =0
 virtual void  | setDrawableNull (void)=0
 The documentation for this class was generated from the following file:
gs.h