Public Member Functions | List of all members
AcDb3dSolid Class Reference
AcDb Classes
  Inheritance diagram for AcDb3dSolid:
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDb3dSolid)
virtual void *  | body () const
 virtual Acad::ErrorStatus  | booleanOper (AcDb::BoolOperType operation, AcDb3dSolid *solid)
 virtual Acad::ErrorStatus  | chamferEdges (const AcArray< AcDbSubentId * > &edgeSubentIds, const AcDbSubentId &baseFaceSubentId, double baseDist, double otherDist)
 virtual Acad::ErrorStatus  | checkInterference (const AcDb3dSolid *otherSolid, Adesk::Boolean createNewSolid, Adesk::Boolean &solidsInterfere, AcDb3dSolid *&commonVolumeSolid) const
 virtual Acad::ErrorStatus  | cleanBody ()
virtual Acad::ErrorStatus  | convertToBrepAtSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual Acad::ErrorStatus  | copyEdge (const AcDbSubentId &subentId, AcDbEntity *&newEntity)
 virtual Acad::ErrorStatus  | copyFace (const AcDbSubentId &subentId, AcDbEntity *&newEntity)
 virtual Acad::ErrorStatus  | createBox (double xLen, double yLen, double zLen)
 virtual Acad::ErrorStatus  | createExtrudedSolid (AcDbEntity *pSweepEnt, const AcGeVector3d &directionVec, AcDbSweepOptions &sweepOptions)
 virtual Acad::ErrorStatus  | createExtrudedSolid (AcDbEntity *pSweepEnt, const AcDbSubentId &faceSubentId, const AcGeVector3d &directionVec, AcDbSweepOptions &sweepOptions)
 virtual Acad::ErrorStatus  | createExtrudedSolid (AcDbEntity *pSweepEnt, const AcDbSubentId &faceSubentId, double height, AcDbSweepOptions &sweepOptions)
 virtual Acad::ErrorStatus  | createFrustum (double height, double xRadius, double yRadius, double topXRadius)
 virtual Acad::ErrorStatus  | createLoftedSolid (AcArray< AcDbEntity * > &crossSectionCurves, AcArray< AcDbEntity * > &guideCurves, AcDbEntity *pPathCurve, AcDbLoftOptions &loftOptions)
 virtual Acad::ErrorStatus  | createPyramid (double height, int sides, double radius, double topRadius=0.0)
 virtual Acad::ErrorStatus  | createRevolvedSolid (AcDbEntity *pRevEnt, const AcGePoint3d &axisPnt, const AcGeVector3d &axisDir, double revAngle, double startAngle, AcDbRevolveOptions &revolveOptions)
 virtual Acad::ErrorStatus  | createRevolvedSolid (AcDbEntity *pRevEnt, const AcDbSubentId &faceSubentId, const AcGePoint3d &axisPnt, const AcGeVector3d &axisDir, double revAngle, double startAngle, AcDbRevolveOptions &revolveOptions)
 virtual Acad::ErrorStatus  | createSphere (double radius)
 virtual Acad::ErrorStatus  | createSweptSolid (AcDbEntity *pSweepEnt, AcDbEntity *pPathEnt, AcDbSweepOptions &sweepOptions)
 virtual Acad::ErrorStatus  | createSweptSolid (AcDbEntity *pSweepEnt, const AcDbSubentId &faceSubentId, AcDbEntity *pPathEnt, AcDbSweepOptions &sweepOptions)
 virtual Acad::ErrorStatus  | createTorus (double majorRadius, double minorRadius)
 virtual Acad::ErrorStatus  | createWedge (double xLen, double yLen, double zLen)
 virtual Acad::ErrorStatus  | extrude (const AcDbRegion *region, double height, double taperAngle=0.0)
 virtual Acad::ErrorStatus  | extrudeAlongPath (const AcDbRegion *region, const AcDbCurve *path, double taperAngle=0.0)
 virtual Acad::ErrorStatus  | extrudeFaces (const AcArray< AcDbSubentId * > &faceSubentIds, double height, double taper)
 virtual Acad::ErrorStatus  | extrudeFacesAlongPath (const AcArray< AcDbSubentId * > &faceSubentIds, const AcDbCurve *path)
 virtual Acad::ErrorStatus  | filletEdges (const AcArray< AcDbSubentId * > &edgeSubentIds, const AcGeDoubleArray &radius, const AcGeDoubleArray &startSetback, const AcGeDoubleArray &endSetback)
 virtual Acad::ErrorStatus  | getArea (double &area) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 virtual Acad::ErrorStatus  | getGsMarkersAtSubentPath (const AcDbFullSubentPath &subPath, AcArray< Adesk::GsMarker > &gsMarkers) const
 virtual Acad::ErrorStatus  | getMassProp (double &volume, AcGePoint3d &centroid, double momInertia[3], double prodInertia[3], double prinMoments[3], AcGeVector3d prinAxes[3], double radiiGyration[3], AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | getSection (const AcGePlane &plane, AcDbRegion *&sectionRegion) const
 virtual Acad::ErrorStatus  | getSlice (const AcGePlane &plane, Adesk::Boolean getNegHalfToo, AcDb3dSolid *&negHalfSolid)
 virtual Acad::ErrorStatus  | getSlice (AcDbSurface *pSurface, bool bGetNegHalfToo, AcDb3dSolid *&pNegHalfSolid)
 virtual Acad::ErrorStatus  | getSubentColor (const AcDbSubentId &subentId, AcCmColor &color) const
 virtual Acad::ErrorStatus  | getSubentMaterial (const AcDbSubentId &subentId, AcDbObjectId &matId) const
 virtual Acad::ErrorStatus  | getSubentMaterialMapper (const AcDbSubentId &subentId, AcGiMapper &mapper) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeMatrix3d &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual Acad::ErrorStatus  | imprintEntity (const AcDbEntity *pEntity)
virtual AcDbSubentId  | internalSubentId (void *ent) const
virtual void *  | internalSubentPtr (const AcDbSubentId &id) const
 virtual Adesk::Boolean  | isNull () const
 virtual void  | list () const
 virtual Adesk::UInt32  | numChanges () const
 virtual Acad::ErrorStatus  | offsetBody (double offsetDistance)
 virtual Acad::ErrorStatus  | offsetFaces (const AcArray< AcDbSubentId * > &faceSubentIds, double offsetDistance)
 virtual bool  | recordHistory () const
 virtual Acad::ErrorStatus  | removeFaces (const AcArray< AcDbSubentId * > &faceSubentIds)
 virtual Acad::ErrorStatus  | revolve (const AcDbRegion *region, const AcGePoint3d &axisPoint, const AcGeVector3d &axisDir, double angleOfRevolution)
 virtual Acad::ErrorStatus  | separateBody (AcArray< AcDb3dSolid * > &newSolids)
virtual Acad::ErrorStatus  | setBody (const void *modelerBody)
 virtual Acad::ErrorStatus  | setRecordHistory (bool bRecord)
 virtual Acad::ErrorStatus  | setShowHistory (bool bShow)
 virtual Acad::ErrorStatus  | setSubentColor (const AcDbSubentId &subentId, const AcCmColor &color)
 virtual Acad::ErrorStatus  | setSubentMaterial (const AcDbSubentId &subentId, AcDbObjectId matId)
 virtual Acad::ErrorStatus  | setSubentMaterialMapper (const AcDbSubentId &subentId, const AcGiMapper &mapper)
 virtual Acad::ErrorStatus  | shellBody (const AcArray< AcDbSubentId * > &faceSubentIds, double offsetDistance)
 virtual bool  | showHistory () const
virtual Acad::ErrorStatus  | stlOut (const ACHAR *fileName, Adesk::Boolean asciiFormat) const
 virtual AcDbEntity *  | subentPtr (const AcDbFullSubentPath &id) const
 virtual Acad::ErrorStatus  | taperFaces (const AcArray< AcDbSubentId * > &faceSubentIds, const AcGePoint3d &basePoint, const AcGeVector3d &draftVector, double draftAngle)
 virtual Acad::ErrorStatus  | transformFaces (const AcArray< AcDbSubentId * > &faceSubentIds, const AcGeMatrix3d &matrix)
 virtual void  | viewportDraw (AcGiViewportDraw *pVpDraw)
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 Public Member Functions inherited from AcDbEntity
ACDB_DECLARE_MEMBERS (AcDbEntity)
 virtual Acad::ErrorStatus  | addSubentPaths (const AcDbFullSubentPathArray &newPaths)
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 AcDbObjectId  | blockId () const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 Acad::ErrorStatus  | boundingBoxIntersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker, Adesk::GsMarker otherGsMarker) const
 virtual bool  | castShadows () const
 virtual Adesk::Boolean  | cloneMeForDragging ()
 virtual AcDb::CollisionType  | collisionType () const
 AcCmColor  | color () const
 Adesk::UInt16  | colorIndex () const
 virtual Acad::ErrorStatus  | deleteSubentPaths (const AcDbFullSubentPathArray &paths)
 virtual void  | dragStatus (const AcDb::DragStat status)
 Acad::ErrorStatus  | draw ()
 virtual AcGiDrawable *  | drawable ()
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 AcCmEntityColor  | entityColor () const
 virtual Acad::ErrorStatus  | explode (AcDbVoidPtrArray &entitySet) const
 virtual Acad::ErrorStatus  | getCompoundObjectTransform (AcGeMatrix3d &xMat) const
 virtual void  | getEcs (AcGeMatrix3d &retVal) const
 virtual Acad::ErrorStatus  | getGeomExtents (AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | getGripEntityUCS (const void *pGripAppData, AcGeVector3d &normalVec, AcGePoint3d &origin, AcGeVector3d &xAxis) const
 virtual Acad::ErrorStatus  | getGripPoints (AcGePoint3dArray &gripPoints, AcDbIntArray &osnapModes, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getGripPoints (AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | getGripPointsAtSubentPath (const AcDbFullSubentPath &path, AcDbGripDataPtrArray &grips, const double curViewUnitSize, const int gripSize, const AcGeVector3d &curViewDir, const int bitflags) const
 virtual Acad::ErrorStatus  | getMaterialMapper (AcGiMapper &mapper) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeMatrix3d &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | getOsnapPoints (AcDb::OsnapMode osnapMode, Adesk::GsMarker gsSelectionMark, const AcGePoint3d &pickPoint, const AcGePoint3d &lastPoint, const AcGeFastTransform &viewXform, AcGePoint3dArray &snapPoints, AcDbIntArray &geomIds, const AcGeMatrix3d &insertionMat) const
 virtual Acad::ErrorStatus  | getPlane (AcGePlane &, AcDb::Planarity &) const
 AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &id) const
 virtual Acad::ErrorStatus  | getStretchPoints (AcGePoint3dArray &stretchPoints) const
 virtual Acad::ErrorStatus  | getSubentClassId (const AcDbFullSubentPath &path, CLSID *clsId) const
 virtual Acad::ErrorStatus  | getSubentPathGeomExtents (const AcDbFullSubentPath &path, AcDbExtents &extents) const
 virtual Acad::ErrorStatus  | getSubentPathsAtGsMarker (AcDb::SubentType type, Adesk::GsMarker gsMark, const AcGePoint3d &pickPoint, const AcGeFastTransform &viewXform, int &numPaths, AcDbFullSubentPath *&subentPaths, int numInserts=0, AcDbObjectId *entAndInsertStack=NULL) const
 virtual Acad::ErrorStatus  | getTransformedCopy (const AcGeMatrix3d &xform, AcDbEntity *&pEnt) const
 virtual void  | gripStatus (const AcDb::GripStat status)
 virtual AcGsNode *  | gsNode () const
 virtual bool  | hideMeForDragging () const
 virtual Acad::ErrorStatus  | highlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Acad::ErrorStatus  | intersectWith (const AcDbEntity *pEnt, AcDb::Intersect intType, const AcGePlane &projPlane, AcGePoint3dArray &points, Adesk::GsMarker thisGsMarker=0, Adesk::GsMarker otherGsMarker=0) const
 virtual Adesk::Boolean  | isPlanar () const
 ACHAR *  | layer () const
 AcDbObjectId  | layerId () const
 ACHAR *  | linetype () const
 AcDbObjectId  | linetypeId () const
 double  | linetypeScale () const
 AcDb::LineWeight  | lineWeight () const
 ACHAR *  | material () const
 AcDbObjectId  | materialId () const
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 virtual Acad::ErrorStatus  | moveGripPointsAt (const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | moveGripPointsAtSubentPaths (const AcDbFullSubentPathArray &paths, const AcDbVoidPtrArray &gripAppData, const AcGeVector3d &offset, const int bitflags)
 virtual Acad::ErrorStatus  | moveStretchPointsAt (const AcDbIntArray &indices, const AcGeVector3d &offset)
 ACHAR *  | plotStyleName () const
 virtual bool  | receiveShadows () const
 void  | recordGraphicsModified (Adesk::Boolean setModified=true)
 virtual void  | saveAs (AcGiWorldDraw *mode, AcDb::SaveType st)
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 virtual void  | setCastShadows (bool newVal)
 virtual Acad::ErrorStatus  | setColor (const AcCmColor &color, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setColorIndex (Adesk::UInt16 color, Adesk::Boolean doSubents=true)
 void  | setDatabaseDefaults ()
 void  | setDatabaseDefaults (AcDbDatabase *pDb)
 virtual void  | setGsNode (AcGsNode *pNode)
 virtual Acad::ErrorStatus  | setLayer (const ACHAR *newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLayer (AcDbObjectId newVal, Adesk::Boolean doSubents=true, bool allowHiddenLayer=false)
 virtual Acad::ErrorStatus  | setLinetype (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetype (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLinetypeScale (double newval, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setLineWeight (AcDb::LineWeight newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (const ACHAR *newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterial (AcDbObjectId newVal, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setMaterialMapper (const AcGiMapper &mapper, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (const ACHAR *newName, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setPlotStyleName (AcDb::PlotStyleNameType, AcDbObjectId newId=AcDbObjectId::kNull, Adesk::Boolean doSubents=true)
 Acad::ErrorStatus  | setPropertiesFrom (const AcDbEntity *pEntity, Adesk::Boolean doSubents=true)
 virtual void  | setReceiveShadows (bool newVal)
 virtual Acad::ErrorStatus  | setTransparency (const AcCmTransparency &trans, Adesk::Boolean doSubents=true)
 virtual Acad::ErrorStatus  | setVisibility (AcDb::Visibility newVal, Adesk::Boolean doSubents=true)
 virtual void  | subentGripStatus (const AcDb::GripStat status, const AcDbFullSubentPath &subentity)
 virtual void  | subSetDatabaseDefaults (AcDbDatabase *pDb)
 virtual Acad::ErrorStatus  | transformBy (const AcGeMatrix3d &xform)
 virtual Acad::ErrorStatus  | transformBy (const AcGeFastTransform &xform)
 virtual Acad::ErrorStatus  | transformSubentPathsBy (const AcDbFullSubentPathArray &paths, const AcGeMatrix3d &xform)
 AcCmTransparency  | transparency () const
 virtual Acad::ErrorStatus  | unhighlight (const AcDbFullSubentPath &subId=kNullSubent, const Adesk::Boolean highlightAll=false) const
 AcDb::Visibility  | visibility () const
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcDbEntity
enum  | VisualStyleType { kFullVisualStyle, kFaceVisualStyle, kEdgeVisualStyle }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Member Function Documentation
 virtual void* AcDb3dSolid::body  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDb3dSolid::convertToBrepAtSubentPaths  |  ( |  const AcDbFullSubentPathArray &  |  paths | )
virtual
Warning
Not implemented!
 virtual AcDbSubentId AcDb3dSolid::internalSubentId  |  ( |  void *  |  ent | ) |   const
virtual
Warning
Not implemented!
 virtual void* AcDb3dSolid::internalSubentPtr  |  ( |  const AcDbSubentId &  |  id | ) |   const
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDb3dSolid::setBody  |  ( |  const void *  |  modelerBody | )
virtual
Warning
Not implemented!
 virtual Acad::ErrorStatus AcDb3dSolid::stlOut  |  ( |  const ACHAR *  |  fileName,
|  Adesk::Boolean  |  asciiFormat
) |   |  const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
dbsol3d.h