Public Types | Public Member Functions | List of all members
AcDbMentalRayRenderSettings Class Reference
AcDb Classes
  Inheritance diagram for AcDbMentalRayRenderSettings:
 Public Types
enum  | ShadowSamplingMultiplier {
 kSamplingMultiplierZero = 0, kSamplingMultiplierOneEighth, kSamplingMultiplierOneFourth, kSamplingMultiplierOneHalf,
 kSamplingMultiplierOne, kSamplingMultiplierTwo
 }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbMentalRayRenderSettings)
 Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 AcGiMrDiagnosticBSPMode  | diagnosticBSPMode () const
 void  | diagnosticGridMode (AcGiMrDiagnosticGridMode &eDiagnosticGridMode, float &fSize) const
 AcGiMrDiagnosticMode  | diagnosticMode () const
 AcGiMrDiagnosticPhotonMode  | diagnosticPhotonMode () const
 bool  | diagnosticSamplesMode () const
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 float  | energyMultiplier () const
 bool  | exportMIEnabled () const
 AcString  | exportMIFileName () const
 int  | fgRayCount () const
 void  | fgSampleRadius (double &fMin, double &fMax) const
 void  | fgSampleRadiusState (bool &bMin, bool &bMax, bool &bPixels) const
 bool  | finalGatheringEnabled () const
 AcGiMrFinalGatheringMode  | finalGatheringMode () const
 int  | giPhotonsPerLight () const
 int  | giSampleCount () const
 double  | giSampleRadius () const
 bool  | giSampleRadiusEnabled () const
 bool  | globalIlluminationEnabled () const
 double  | lightLuminanceScale () const
 int  | memoryLimit () const
 virtual bool  | operator== (const AcDbMentalRayRenderSettings &settings)
 void  | photonTraceDepth (int &iReflection, int &iRefraction, int &iSum) const
 void  | rayTraceDepth (int &iReflection, int &iRefraction, int &iSum) const
 bool  | rayTracingEnabled () const
 void  | sampling (int &iMin, int &iMax) const
 void  | samplingContrastColor (float &r, float &g, float &b, float &a) const
 void  | SamplingFilter (AcGiMrFilter &eFilter, double &fWidth, double &fHeight) const
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 void  | setDiagnosticBSPMode (AcGiMrDiagnosticBSPMode eDiagnosticBSPMode)
 Acad::ErrorStatus  | setDiagnosticGridMode (AcGiMrDiagnosticGridMode eDiagnosticGridMode, float fSize)
 void  | setDiagnosticMode (AcGiMrDiagnosticMode eDiagnosticMode)
 void  | setDiagnosticPhotonMode (AcGiMrDiagnosticPhotonMode eDiagnosticPhotonMode)
 void  | setDiagnosticSamplesMode (bool bDiagnosticSamplesMode)
 Acad::ErrorStatus  | setEnergyMultiplier (float fScale)
 void  | setExportMIEnabled (bool bEnabled)
 Acad::ErrorStatus  | setExportMIFileName (const AcString &strFileName)
 void  | setFGRadiusState (bool bMin, bool bMax, bool bPixels)
 Acad::ErrorStatus  | setFGRayCount (int iNum)
 Acad::ErrorStatus  | setFGSampleRadius (double fMin, double fMax)
 void  | setFinalGatheringEnabled (bool bEnabled)
 Acad::ErrorStatus  | setFinalGatheringMode (AcGiMrFinalGatheringMode mode)
 Acad::ErrorStatus  | setGIPhotonsPerLight (int iNum)
 Acad::ErrorStatus  | setGISampleCount (int iNum)
 Acad::ErrorStatus  | setGISampleRadius (double fRadius)
 void  | setGISampleRadiusEnabled (bool bEnabled)
 void  | setGlobalIlluminationEnabled (bool bEnabled)
 Acad::ErrorStatus  | setLightLuminanceScale (double fLuminance)
 Acad::ErrorStatus  | setMemoryLimit (int iMemoryLimit)
 Acad::ErrorStatus  | setPhotonTraceDepth (int iReflection, int iRefraction, int iSum)
 Acad::ErrorStatus  | setRayTraceDepth (int iReflection, int iRefraction, int iSum)
 void  | setRayTracingEnabled (bool bEnabled)
 Acad::ErrorStatus  | setSampling (int iMin, int iMax)
 Acad::ErrorStatus  | setSamplingContrastColor (float r, float g, float b, float a)
 Acad::ErrorStatus  | setSamplingFilter (AcGiMrFilter eFilter, double fWidth, double fHeight)
 void  | setShadowMapsEnabled (bool bEnabled)
 void  | setShadowMode (AcGiMrShadowMode eShadowMode)
 Acad::ErrorStatus  | setShadowSamplingMultiplier (AcDbMentalRayRenderSettings::ShadowSamplingMultiplier multiplier)
 void  | setTileOrder (AcGiMrTileOrder eTileOrder)
 Acad::ErrorStatus  | setTileSize (int iTileSize)
 bool  | shadowMapsEnabled () const
 AcGiMrShadowMode  | shadowMode () const
 AcDbMentalRayRenderSettings::ShadowSamplingMultiplier  | shadowSamplingMultiplier () const
 AcGiMrTileOrder  | tileOrder () const
 int  | tileSize () const
 Public Member Functions inherited from AcDbRenderSettings
AcDbRenderSettings ()
ACRX_DECLARE_MEMBERS (AcDbRenderSettings)
bool  | backFacesEnabled () const
AcString  | description () const
bool  | diagnosticBackgroundEnabled () const
int  | displayIndex () const
virtual AcGiDrawable *  | drawable ()
bool  | materialsEnabled () const
AcString  | name () const
virtual bool  | operator== (const AcDbRenderSettings &settings)
AcString  | previewImageFileName () const
void  | setBackFacesEnabled (bool bEnabled)
void  | setDescription (const AcString &strDes)
void  | setDiagnosticBackgroundEnabled (bool bEnabled)
void  | setDisplayIndex (int idx)
void  | setMaterialsEnabled (bool bEnabled)
Acad::ErrorStatus  | setName (const AcString &strName)
Acad::ErrorStatus  | setPreviewImageFileName (const AcString &strFileName)
void  | setShadowsEnabled (bool bEnabled)
void  | setTextureSampling (bool bSampling)
bool  | shadowsEnabled () const
bool  | textureSampling () const
virtual  | ~AcDbRenderSettings ()
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual AcGsNode *  | gsNode () const
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 virtual void  | setGsNode (AcGsNode *pNode)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual void  | viewportDraw (AcGiViewportDraw *pVd)
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 The documentation for this class was generated from the following file:
dbRender.h