Public Types | Public Member Functions | List of all members
AcGiViewportTraits Class Reference
AcGi Classes
  Inheritance diagram for AcGiViewportTraits:
 Public Types
enum  | DefaultLightingType { kOneDistantLight = 0, kTwoDistantLights, kBackLighting }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiViewportTraits)
 virtual AcCmColor  | ambientLightColor () const =0
 virtual AcDbObjectId  | background () const =0
 virtual double  | brightness () const =0
 virtual double  | contrast () const =0
 virtual DefaultLightingType  | defaultLightingType () const =0
 virtual bool  | isDefaultLightingOn () const =0
 virtual AcDbObjectId  | renderEnvironment () const =0
 virtual AcDbObjectId  | renderSettings () const =0
 virtual void  | setAmbientLightColor (const AcCmColor &clr)=0
 virtual void  | setBackground (const AcDbObjectId backgroundId)=0
 virtual void  | setBrightness (double brightness)=0
 virtual void  | setContrast (double contrast)=0
 virtual void  | setDefaultLightingOn (bool on)=0
 virtual void  | setDefaultLightingType (DefaultLightingType typ)=0
 virtual void  | setRenderEnvironment (const AcDbObjectId renderEnvId)=0
 virtual void  | setRenderSettings (const AcDbObjectId renderSettingsId)=0
 Public Member Functions inherited from AcGiDrawableTraits
ACRX_DECLARE_MEMBERS (AcGiDrawableTraits)
 virtual void  | addLight (const AcDbObjectId &lightId)
 virtual void  | setupForEntity (AcDbEntity *pEntity)
 Public Member Functions inherited from AcGiSubEntityTraits
ACRX_DECLARE_MEMBERS (AcGiSubEntityTraits)
 virtual Adesk::UInt16  | color (void) const =0
 virtual Adesk::UInt32  | drawFlags (void) const
 virtual Acad::ErrorStatus  | edgeStyleOverride (AcGiEdgeStyleMask &mask, AcGiEdgeStyle &edgeStyle) const
 virtual AcGiFillType  | fillType (void) const =0
 virtual AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &idResult) const
 virtual AcDbObjectId  | layerId (void) const =0
 virtual AcDbObjectId  | lineTypeId (void) const =0
 virtual double  | lineTypeScale (void) const =0
 virtual AcDb::LineWeight  | lineWeight (void) const =0
 virtual const AcGiMapper *  | mapper (void) const
 virtual AcDbObjectId  | materialId (void) const
 virtual bool  | sectionable (void) const
 virtual bool  | selectionGeom (void) const
 virtual void  | setColor (const Adesk::UInt16 color)=0
 virtual Acad::ErrorStatus  | setDrawFlags (Adesk::UInt32 flags)
 virtual Acad::ErrorStatus  | setEdgeStyleOverride (AcGiEdgeStyleMask mask, const AcGiEdgeStyle &edgeStyle)
 virtual void  | setFillType (const AcGiFillType)=0
 virtual void  | setLayer (const AcDbObjectId layerId)=0
 virtual void  | setLineType (const AcDbObjectId linetypeId)=0
 virtual void  | setLineTypeScale (double dScale=1.0)=0
 virtual void  | setLineWeight (const AcDb::LineWeight lw)=0
 virtual void  | setMapper (const AcGiMapper *mapper)
 virtual void  | setMaterial (const AcDbObjectId materialId)
 virtual void  | setPlotStyleName (AcDb::PlotStyleNameType type, const AcDbObjectId &id=AcDbObjectId::kNull)
 virtual void  | setSectionable (bool bSectionable)
 virtual void  | setSelectionGeom (bool bSelectionflag)
 virtual void  | setSelectionMarker (const Adesk::LongPtr markerId)=0
 virtual Acad::ErrorStatus  | setShadowFlags (ShadowFlags flags)
 virtual void  | setThickness (double dThickness)=0
 virtual void  | setTrueColor (const AcCmEntityColor &color)=0
 virtual void  | setVisualStyle (const AcDbObjectId visualStyleId)
 virtual ShadowFlags  | shadowFlags (void) const
 virtual double  | thickness (void) const =0
 virtual AcCmEntityColor  | trueColor (void) const =0
 virtual AcDbObjectId  | visualStyle (void) const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Protected Types inherited from AcGiDrawableTraits
enum  | LayerFlags { kNone = 0x00, kOff = 0x01, kFrozen = 0x02, kZero = 0x04 }
 Protected Member Functions inherited from AcGiDrawableTraits
 virtual void  | setLayerFlags (Adesk::UInt8 flags)
 The documentation for this class was generated from the following file:
acgiviewport.h