Public Member Functions | Protected Member Functions | Friends | List of all members
AcGiContext Class Reference
AcGi Classes
  Inheritance diagram for AcGiContext:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiContext)
 virtual AcDb::LineWeight  | byBlockLineWeight () const
 virtual AcDbObjectId  | byBlockMaterialId () const
 virtual AcDbObjectId  | byBlockPlotStyleNameId () const
 virtual AcDbDatabase *  | database () const =0
 virtual void  | disableFastMoveDrag () const
 virtual AcCmEntityColor  | effectiveColor () const
 virtual const AcGiContextImp *  | getConstImpPtr () const
 virtual AcGiContextImp *  | getImpPtr ()
 virtual bool  | isBoundaryClipping () const =0
 virtual bool  | isNesting () const
 virtual Adesk::Boolean  | isPlotGeneration () const =0
 virtual Adesk::Boolean  | isPsOut () const =0
 virtual bool  | supportsOwnerDraw ()
 virtual bool  | supportsTrueTypeText ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual void  | bypassHiddenLineRemoval ()
 virtual int  | drawTrueTypeText (const ACHAR *, double, int, bool, const TextParams &, unsigned int)
 virtual int  | getTrueTypeBoundingBox (AcGePoint3d const &location, const wchar_t *text, int length, TextParams const *tp, AcGePoint3d *bbox, float *char_widths)
 virtual int  | getTrueTypeTextExtents (ACHAR const *, unsigned int, double, int, int, int, short, short, double, double, AcGePoint2d &, AcGePoint2d &)
 virtual Adesk::LongPtr  | loadTrueTypeFont (const ACHAR *, bool, bool, int, int, FontInfo &)
 virtual int  | restoreTrueTypeTransform ()
 virtual int  | setTextStyle (int)
 virtual int  | setTrueTypeTransform (const AcGePoint3d &, const AcGeVector3d &, double, double, double, bool, bool)
 virtual AcGiWorldSegmentCallback  | wSegTaker () const
 Friends
 class  | AcDbImpText
 class  | AcGiTextHook
 class  | CShFont
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acgi.h