Public Member Functions | List of all members
AcGiDistantLightTraits2 Class Reference
AcGi Classes
  Inheritance diagram for AcGiDistantLightTraits2:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiDistantLightTraits2)
 virtual void  | lampColor (AcGiColorRGB &rgbColor) const =0
 virtual double  | physicalIntensity () const =0
 virtual void  | setLampColor (const AcGiColorRGB &rgbColor)=0
 virtual void  | setPhysicalIntensity (double physicalIntensity)=0
 virtual void  | setShadowParameters (const AcGiShadowParameters2 &params)=0
 virtual void  | setSkyParameters (const AcGiSkyParameters &params)=0
 virtual void  | shadowParameters (AcGiShadowParameters2 &params) const =0
 virtual void  | skyParameters (AcGiSkyParameters &params) const =0
 Public Member Functions inherited from AcGiDistantLightTraits
ACRX_DECLARE_MEMBERS (AcGiDistantLightTraits)
 virtual bool  | isSunlight () const =0
 virtual AcGeVector3d  | lightDirection () const =0
 virtual void  | setIsSunlight (bool isSunlight)=0
 virtual void  | setLightDirection (const AcGeVector3d &vec)=0
 Public Member Functions inherited from AcGiStandardLightTraits
ACRX_DECLARE_MEMBERS (AcGiStandardLightTraits)
 virtual double  | intensity () const =0
 virtual AcCmColor  | lightColor () const =0
 virtual void  | setIntensity (double inten)=0
 virtual void  | setLightColor (const AcCmColor &color)=0
 virtual void  | setShadowParameters (const AcGiShadowParameters &params)=0
 virtual void  | shadowParameters (AcGiShadowParameters &params) const =0
 Public Member Functions inherited from AcGiLightTraits
ACRX_DECLARE_MEMBERS (AcGiLightTraits)
 virtual bool  | isOn () const =0
 virtual void  | setOn (bool on)=0
 Public Member Functions inherited from AcGiNonEntityTraits
ACRX_DECLARE_MEMBERS (AcGiNonEntityTraits)
virtual void  | addLight (const AcDbObjectId &id)
virtual Adesk::UInt16  | color (void) const
virtual AcGiFillType  | fillType (void) const
virtual AcDbObjectId  | layerId (void) const
virtual AcDbObjectId  | lineTypeId (void) const
virtual double  | lineTypeScale (void) const
virtual AcDb::LineWeight  | lineWeight (void) const
virtual AcDbObjectId  | materialId (void) const
virtual bool  | selectionGeom (void) const
virtual void  | setColor (const Adesk::UInt16 color)
virtual void  | setFillType (const AcGiFillType fillType)
virtual void  | setLayer (const AcDbObjectId layerId)
virtual void  | setLineType (const AcDbObjectId linetypeId)
virtual void  | setLineTypeScale (double dScale)
virtual void  | setLineWeight (const AcDb::LineWeight lw)
virtual void  | setMaterial (const AcDbObjectId matId)
virtual void  | setSelectionGeom (bool bSelectionflag)
virtual void  | setSelectionMarker (const Adesk::LongPtr markerId)
virtual void  | setThickness (double thickness)
virtual void  | setTrueColor (const AcCmEntityColor &color)
virtual void  | setupForEntity (AcDbEntity *pEntity)
virtual double  | thickness (void) const
virtual AcCmEntityColor  | trueColor (void) const
 Public Member Functions inherited from AcGiDrawableTraits
ACRX_DECLARE_MEMBERS (AcGiDrawableTraits)
 Public Member Functions inherited from AcGiSubEntityTraits
ACRX_DECLARE_MEMBERS (AcGiSubEntityTraits)
 virtual Adesk::UInt32  | drawFlags (void) const
 virtual Acad::ErrorStatus  | edgeStyleOverride (AcGiEdgeStyleMask &mask, AcGiEdgeStyle &edgeStyle) const
 virtual AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &idResult) const
 virtual const AcGiMapper *  | mapper (void) const
 virtual bool  | sectionable (void) const
 virtual Acad::ErrorStatus  | setDrawFlags (Adesk::UInt32 flags)
 virtual Acad::ErrorStatus  | setEdgeStyleOverride (AcGiEdgeStyleMask mask, const AcGiEdgeStyle &edgeStyle)
 virtual void  | setMapper (const AcGiMapper *mapper)
 virtual void  | setPlotStyleName (AcDb::PlotStyleNameType type, const AcDbObjectId &id=AcDbObjectId::kNull)
 virtual void  | setSectionable (bool bSectionable)
 virtual Acad::ErrorStatus  | setShadowFlags (ShadowFlags flags)
 virtual void  | setVisualStyle (const AcDbObjectId visualStyleId)
 virtual ShadowFlags  | shadowFlags (void) const
 virtual AcDbObjectId  | visualStyle (void) const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcGiSubEntityTraits
enum  | DrawFlags { kNoDrawFlags = 0, kDrawBackfaces = 1, kDrawHatchGroup = 2 }
enum  | ShadowFlags { kShadowsCastAndReceive = 0x00, kShadowsDoesNotCast = 0x01, kShadowsDoesNotReceive = 0x02, kShadowsIgnore = kShadowsDoesNotCast | kShadowsDoesNotReceive }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Protected Types inherited from AcGiDrawableTraits
enum  | LayerFlags { kNone = 0x00, kOff = 0x01, kFrozen = 0x02, kZero = 0x04 }
 Protected Member Functions inherited from AcGiDrawableTraits
 virtual void  | setLayerFlags (Adesk::UInt8 flags)
 The documentation for this class was generated from the following file:
AcGiLightTraits.h