Public Member Functions | List of all members
AcDbObjectReactor Class Reference
AcDb Classes
  Inheritance diagram for AcDbObjectReactor:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbObjectReactor)
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 virtual void  | openedForModify (const AcDbObject *dbObj)
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual void  | unappended (const AcDbObject *dbObj)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbmain.h