Classes | Public Member Functions | List of all members
AcApDocManager Class Reference
AcAp Classes
  Inheritance diagram for AcApDocManager:
 Classes
struct  | DocOpenParams
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcApDocManager)
 virtual Acad::ErrorStatus  | activateDocument (AcApDocument *pAcTargetDocument, bool bPassScript=false)=0
 virtual void  | addReactor (AcApDocManagerReactor *)=0
 virtual Acad::ErrorStatus  | appContextNewDocument (const ACHAR *pszTemplateName)=0
 virtual Acad::ErrorStatus  | appContextOpenDocument (const ACHAR *pszDrawingName)=0
 virtual Acad::ErrorStatus  | closeDocument (AcApDocument *pAcTargetDocument)=0
 virtual AcApDocument *  | curDocument () const =0
 virtual Acad::ErrorStatus  | disableDocumentActivation ()=0
 virtual AcApDocument *  | document (const AcDbDatabase *) const =0
 virtual int  | documentCount () const =0
 virtual Acad::ErrorStatus  | enableDocumentActivation ()=0
 virtual void  | executeInApplicationContext (void(*procAddr)(void *), void *pData) const =0
 virtual int  | inputPending (AcApDocument *pAcTargetDocument)=0
 virtual bool  | isApplicationContext () const =0
 virtual bool  | isDocumentActivationEnabled ()=0
 virtual Acad::ErrorStatus  | lockDocument (AcApDocument *pDoc, AcAp::DocLockMode=AcAp::kWrite, const ACHAR *pGlobalCmdName=NULL, const ACHAR *pLocalCmdName=NULL, bool prompt=true)=0
 virtual AcApDocument *  | mdiActiveDocument () const =0
 virtual AcApDocumentIterator *  | newAcApDocumentIterator ()=0
 virtual Acad::ErrorStatus  | newDocument ()=0
 virtual Acad::ErrorStatus  | openDocument ()=0
 virtual void  | popResourceHandle ()=0
 virtual void  | pushAcadResourceHandle ()=0
 virtual void  | pushResourceHandle (HINSTANCE hNewResourceHandle)=0
 virtual void  | removeReactor (AcApDocManagerReactor *)=0
 virtual Acad::ErrorStatus  | sendModelessInterrupt (AcApDocument *pAcTargetDocument)=0
 virtual Acad::ErrorStatus  | sendStringToExecute (AcApDocument *pAcTargetDocument, const ACHAR *pszExecute, bool bActivate=true, bool bWrapUpInactiveDoc=false, bool bEchoString=true)=0
 virtual Acad::ErrorStatus  | setCurDocument (AcApDocument *pDoc, AcAp::DocLockMode=AcAp::kNone, bool activate=false)=0
 virtual Acad::ErrorStatus  | setDefaultFormatForSave (AcApDocument::SaveFormat format)=0
 virtual Acad::ErrorStatus  | unlockDocument (AcApDocument *pDoc)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acdocman.h