Public Types | Public Member Functions | Static Public Member Functions | List of all members
AcDbPointRef Class Reference
AcDb Classes
  Inheritance diagram for AcDbPointRef:
 Public Types
enum  | OsnapType {
 kOsnapNone = 0, kOsnapEnd = 1, kOsnapMid = 2, kOsnapCen = 3,
 kOsnapNode = 4, kOsnapQuad = 5, kOsnapInt = 6, kOsnapIns = 7,
 kOsnapPerp = 8, kOsnapTan = 9, kOsnapNear = 10, kOsnapApint = 11,
 kOsnapStart = 13
 }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbPointRef)
 virtual Acad::ErrorStatus  | deepClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=Adesk::kTrue) const
 virtual Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *filer, AcDbDatabase *pDb)=0
 virtual Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *filer, AcDbDatabase *pDb) const =0
 virtual Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *filer, AcDbDatabase *pDb)=0
 virtual Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *filer, AcDbDatabase *pDb) const =0
 virtual Acad::ErrorStatus  | evalPoint (AcGePoint3d &pnt_wcs)=0
 virtual Acad::ErrorStatus  | getEntities (AcDbFullSubentPathArray &ents, bool getLastPtRef=true) const =0
 virtual bool  | isGeomErased () const =0
 virtual bool  | isXrefObj (AcDbObjectIdArray &ids1, AcDbObjectIdArray &ids2, bool isMainObj=true) const =0
 virtual AcDbPointRef &  | operator= (const AcDbPointRef &src)
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual void  | updateDueToMirror (bool inMirror=false)=0
 virtual Acad::ErrorStatus  | updateSubentPath (AcDbIdMapping &idMap)=0
 virtual Acad::ErrorStatus  | updateXrefSubentPath ()=0
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=Adesk::kTrue) const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Static Public Member Functions
 static bool  | calcTransform (const AcDbObjectIdArray &ids, AcGeMatrix3d &A_Ecs2Wcs)
 static Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *filer, AcDbDatabase *pDb, AcDbPointRef *&pPointRef)
 static Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *filer, AcDbDatabase *pDb, const AcDbPointRef *pPointRef)
 static Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *filer, AcDbDatabase *pDb, AcDbPointRef *&pPointRef)
 static Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *filer, AcDbDatabase *pDb, const AcDbPointRef *pPointRef)
 static AcGeMatrix3d  | mswcsToPswcs (const AcDbViewport *pVPort)
 static AcDbEntity *  | subentPtr (const AcDbFullSubentPath &objPath, bool &isCloned, bool &reverseArc, bool &isStandAloneArc)
 static AcGeMatrix3d  | wcsToDcsMatrix (const AcDbViewport *pVPort)
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dbdimptref.h