Public Types | Public Member Functions | List of all members
AcGiToneOperatorParameters Class Reference
AcGi Classes
  Inheritance diagram for AcGiToneOperatorParameters:
 Public Types
enum  | ExteriorDaylightMode { kDaylightOff = 0, kDaylightOn, kDaylightAuto }
 Public Member Functions
AcGiToneOperatorParameters ()
ACRX_DECLARE_MEMBERS (AcGiToneOperatorParameters)
virtual double  | brightness () const
virtual bool  | chromaticAdaptation () const
virtual bool  | colorDifferentiation () const
virtual double  | contrast () const
virtual ExteriorDaylightMode  | exteriorDaylight () const
virtual bool  | isActive () const
virtual double  | midTones () const
bool  | operator== (const AcGiToneOperatorParameters &params) const
virtual bool  | processBackground () const
virtual bool  | setBrightness (double brightness)
virtual void  | setChromaticAdaptation (bool enable)
virtual void  | setColorDifferentiation (bool enable)
virtual bool  | setContrast (double contrast)
virtual bool  | setExteriorDaylight (ExteriorDaylightMode mode)
virtual void  | setIsActive (bool active)
virtual bool  | setMidTones (double midTones)
virtual void  | setProcessBackground (bool processBG)
virtual void  | setWhiteColor (const AcCmColor &color)
virtual AcCmColor  | whiteColor () const
virtual  | ~AcGiToneOperatorParameters ()
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiToneOperatorParameters::AcGiToneOperatorParameters  |  ( |   | )
Warning
Not implemented!
 virtual AcGiToneOperatorParameters::~AcGiToneOperatorParameters  |  ( |   | )
virtual
Warning
Not implemented!
Member Function Documentation
 virtual double AcGiToneOperatorParameters::brightness  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcGiToneOperatorParameters::chromaticAdaptation  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcGiToneOperatorParameters::colorDifferentiation  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual double AcGiToneOperatorParameters::contrast  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual ExteriorDaylightMode AcGiToneOperatorParameters::exteriorDaylight  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcGiToneOperatorParameters::isActive  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual double AcGiToneOperatorParameters::midTones  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 bool AcGiToneOperatorParameters::operator==  |  ( |  const AcGiToneOperatorParameters &  |  params | ) |   const
Warning
Not implemented!
 virtual bool AcGiToneOperatorParameters::processBackground  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 virtual bool AcGiToneOperatorParameters::setBrightness  |  ( |  double  |  brightness | )
virtual
Warning
Not implemented!
 virtual void AcGiToneOperatorParameters::setChromaticAdaptation  |  ( |  bool  |  enable | )
virtual
Warning
Not implemented!
 virtual void AcGiToneOperatorParameters::setColorDifferentiation  |  ( |  bool  |  enable | )
virtual
Warning
Not implemented!
 virtual bool AcGiToneOperatorParameters::setContrast  |  ( |  double  |  contrast | )
virtual
Warning
Not implemented!
 virtual bool AcGiToneOperatorParameters::setExteriorDaylight  |  ( |  ExteriorDaylightMode  |  mode | )
virtual
Warning
Not implemented!
 virtual void AcGiToneOperatorParameters::setIsActive  |  ( |  bool  |  active | )
virtual
Warning
Not implemented!
 virtual bool AcGiToneOperatorParameters::setMidTones  |  ( |  double  |  midTones | )
virtual
Warning
Not implemented!
 virtual void AcGiToneOperatorParameters::setProcessBackground  |  ( |  bool  |  processBG | )
virtual
Warning
Not implemented!
 virtual void AcGiToneOperatorParameters::setWhiteColor  |  ( |  const AcCmColor &  |  color | )
virtual
Warning
Not implemented!
 virtual AcCmColor AcGiToneOperatorParameters::whiteColor  |  ( |   | ) |   const
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcGiEnvironment.h