Public Member Functions | List of all members
AcEdSolidSubentitySelector Class Reference
AcEd Classes
 Public Member Functions
 Acad::ErrorStatus  | selectFaces (AcDbObjectId &selectedSolidId, AcArray< AcDbSubentId * > &faceSet)
 The documentation for this class was generated from the following file:
acedsel.h