Public Member Functions | Protected Attributes | List of all members
AcGiGenericTexture Class Reference
AcGi Classes
  Inheritance diagram for AcGiGenericTexture:
 Public Member Functions
AcGiGenericTexture (void)
AcGiGenericTexture (const AcGiGenericTexture &texture)
ACRX_DECLARE_MEMBERS (AcGiGenericTexture)
virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
AcGiVariant  | definition (void) const
void  | definition (AcGiVariant *&pDefinition)
AcGiGenericTexture &  | operator= (const AcGiGenericTexture &texture)
virtual bool  | operator== (const AcGiMaterialTexture &texture) const
void  | setDefinition (const AcGiVariant &definition)
virtual  | ~AcGiGenericTexture (void)
 Public Member Functions inherited from AcGiProceduralTexture
ACRX_DECLARE_MEMBERS (AcGiProceduralTexture)
 Public Member Functions inherited from AcGiMaterialTexture
ACRX_DECLARE_MEMBERS (AcGiMaterialTexture)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Attributes
 AcGiVariant  | m_definition
 Additional Inherited Members
 Public Types inherited from AcGiProceduralTexture
enum  | Type { kWood = 0, kMarble, kGeneric }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Constructor & Destructor Documentation
 AcGiGenericTexture::AcGiGenericTexture  |  ( |  void  |   | )
Warning
Not implemented!
 virtual AcGiGenericTexture::~AcGiGenericTexture  |  ( |  void  |   | )
virtual
Warning
Not implemented!
 AcGiGenericTexture::AcGiGenericTexture  |  ( |  const AcGiGenericTexture &  |  texture | )
Warning
Not implemented!
Member Function Documentation
 virtual Acad::ErrorStatus AcGiGenericTexture::copyFrom  |  ( |  const AcRxObject *  |  other | )
virtual
Warning
Not implemented!
Reimplemented from AcRxObject.
 AcGiVariant AcGiGenericTexture::definition  |  ( |  void  |   | ) |   const
Warning
Not implemented!
 void AcGiGenericTexture::definition  |  ( |  AcGiVariant *&  |  pDefinition | )
Warning
Not implemented!
 AcGiGenericTexture& AcGiGenericTexture::operator=  |  ( |  const AcGiGenericTexture &  |  texture | )
Warning
Not implemented!
 virtual bool AcGiGenericTexture::operator==  |  ( |  const AcGiMaterialTexture &  |  texture | ) |   const
virtual
Warning
Not implemented!
Reimplemented from AcGiMaterialTexture.
 void AcGiGenericTexture::setDefinition  |  ( |  const AcGiVariant &  |  definition | )
Warning
Not implemented!
 The documentation for this class was generated from the following file:
acgimaterial.h