Public Member Functions | List of all members
AcDbLinkedTableData Class Reference
AcDb Classes
  Inheritance diagram for AcDbLinkedTableData:
 Public Member Functions
ACDB_DECLARE_MEMBERS (AcDbLinkedTableData)
 virtual ACDB_PORT int  | appendColumn (int nNumCols)
 virtual ACDB_PORT int  | appendRow (int nNumRows)
 virtual ACDB_PORT bool  | canDelete (int nIndex, int nCount, bool bRow) const
 virtual ACDB_PORT bool  | canInsert (int nIndex, bool bRow) const
 virtual ACDB_PORT AcDb::CellState  | cellState (int nRow, int nCol) const
 virtual ACDB_PORT Acad::ErrorStatus  | clear (void)
 virtual ACDB_PORT
 AcDb::CellContentType  | contentType (int nRow, int nCol) const
 virtual ACDB_PORT
 AcDb::CellContentType  | contentType (int nRow, int nCol, int nContent) const
 virtual ACDB_PORT Acad::ErrorStatus  | copyFrom (const AcDbLinkedTableData *pSrc, AcDb::TableCopyOption nOption)
 virtual ACDB_PORT Acad::ErrorStatus  | copyFrom (const AcDbLinkedTableData *pSrc, AcDb::TableCopyOption nOption, const AcCellRange &srcRange, const AcCellRange &targetRange, AcCellRange *pNewTargetRange)
 virtual ACDB_PORT int  | createContent (int nRow, int nCol, int nIndex)
 virtual ACDB_PORT AcString  | dataFormat (int nRow, int nCol) const
 virtual ACDB_PORT AcString  | dataFormat (int nRow, int nCol, int nContent) const
 virtual ACDB_PORT Acad::ErrorStatus  | deleteColumn (int nIndex, int nNumColsToDelete)
 virtual ACDB_PORT Acad::ErrorStatus  | deleteContent (int nRow, int nCol, int nContent)
 virtual ACDB_PORT Acad::ErrorStatus  | deleteContent (int nRow, int nCol)
 virtual ACDB_PORT Acad::ErrorStatus  | deleteContent (const AcCellRange &range)
 virtual ACDB_PORT Acad::ErrorStatus  | deleteRow (int nIndex, int nNumRowsToDelete)
 virtual ACDB_PORT Acad::ErrorStatus  | dwgInFields (AcDbDwgFiler *pFiler)
 virtual ACDB_PORT Acad::ErrorStatus  | dwgOutFields (AcDbDwgFiler *pFiler) const
 virtual ACDB_PORT Acad::ErrorStatus  | dxfInFields (AcDbDxfFiler *pFiler)
 virtual ACDB_PORT Acad::ErrorStatus  | dxfOutFields (AcDbDxfFiler *pFiler) const
 virtual ACDB_PORT Acad::ErrorStatus  | evaluateFormula (void)
 virtual ACDB_PORT AcString  | getBlockAttributeValue (int nRow, int nCol, const AcDbObjectId &idAttDef) const
 virtual ACDB_PORT AcString  | getBlockAttributeValue (int nRow, int nCol, int nContent, const AcDbObjectId &idAttDef) const
 virtual ACDB_PORT AcDbObjectId  | getBlockTableRecordId (int nRow, int nCol) const
 virtual ACDB_PORT AcDbObjectId  | getBlockTableRecordId (int nRow, int nCol, int nContent) const
 virtual ACDB_PORT const ACHAR *  | getColumnName (int nIndex) const
 virtual ACDB_PORT int  | getCustomData (int nRow, int nCol) const
 virtual ACDB_PORT Acad::ErrorStatus  | getCustomData (int nRow, int nCol, const ACHAR *pszKey, AcValue *pData) const
 virtual ACDB_PORT AcDbObjectId  | getDataLink (int nRow, int nCol) const
 virtual ACDB_PORT Acad::ErrorStatus  | getDataLink (int nRow, int nCol, AcDbDataLink *&pDataLink, AcDb::OpenMode mode) const
 virtual ACDB_PORT int  | getDataLink (const AcCellRange *pRange, AcDbObjectIdArray &dataLinkIds) const
 virtual ACDB_PORT AcCellRange  | getDataLinkRange (int nRow, int nCol) const
 virtual ACDB_PORT Acad::ErrorStatus  | getDataType (int nRow, int nCol, AcValue::DataType &nDataType, AcValue::UnitType &nUnitType) const
 virtual ACDB_PORT Acad::ErrorStatus  | getDataType (int nRow, int nCol, int nContent, AcValue::DataType &nDataType, AcValue::UnitType &nUnitType) const
 virtual ACDB_PORT Acad::ErrorStatus  | getField (int nRow, int nCol, int nContent, AcDbField *&pField, AcDb::OpenMode mode) const
 virtual ACDB_PORT AcDbObjectId  | getFieldId (int nRow, int nCol) const
 virtual ACDB_PORT AcDbObjectId  | getFieldId (int nRow, int nCol, int nContent) const
 virtual ACDB_PORT AcString  | getFormula (int nRow, int nCol, int nContent) const
 ACDB_PORT AcDbTableIterator *  | getIterator (void) const
 ACDB_PORT AcDbTableIterator *  | getIterator (const AcCellRange *pRange, AcDb::TableIteratorOption nOption) const
 virtual ACDB_PORT AcString  | getText (int nRow, int nCol) const
 virtual ACDB_PORT AcString  | getText (int nRow, int nCol, int nContent) const
 virtual ACDB_PORT AcString  | getText (int nRow, int nCol, int nContent, AcValue::FormatOption nOption) const
 virtual ACDB_PORT AcString  | getToolTip (int nRow, int nCol) const
 virtual ACDB_PORT Acad::ErrorStatus  | getValue (int nRow, int nCol, AcValue &value) const
 virtual ACDB_PORT Acad::ErrorStatus  | getValue (int nRow, int nCol, int nContent, AcValue::FormatOption nOption, AcValue &value) const
 virtual ACDB_PORT bool  | hasFormula (int nRow, int nCol, int nContent) const
 virtual ACDB_PORT int  | insertColumn (int nIndex, int nNumCols)
 virtual ACDB_PORT int  | insertRow (int nIndex, int nNumRows)
 virtual ACDB_PORT bool  | isContentEditable (int nRow, int nCol) const
 virtual ACDB_PORT bool  | isLinked (int nRow, int nCol) const
 virtual ACDB_PORT Acad::ErrorStatus  | moveContent (int nRow, int nCol, int nFromIndex, int nToIndex)
 virtual ACDB_PORT int  | numColumns (void) const
 virtual ACDB_PORT int  | numContents (int nRow, int nCol) const
 virtual ACDB_PORT int  | numRows (void) const
 virtual ACDB_PORT Acad::ErrorStatus  | removeDataLink (int nRow, int nCol)
 virtual ACDB_PORT Acad::ErrorStatus  | removeDataLink (void)
 virtual ACDB_PORT Acad::ErrorStatus  | setBlockAttributeValue (int nRow, int nCol, const AcDbObjectId &idAttDef, const ACHAR *pszAttValue)
 virtual ACDB_PORT Acad::ErrorStatus  | setBlockAttributeValue (int nRow, int nCol, int nContent, const AcDbObjectId &idAttDef, const ACHAR *pszAttValue)
 virtual ACDB_PORT Acad::ErrorStatus  | setBlockTableRecordId (int nRow, int nCol, const AcDbObjectId &idBTR)
 virtual ACDB_PORT Acad::ErrorStatus  | setBlockTableRecordId (int nRow, int nCol, int nContent, const AcDbObjectId &idBTR)
 virtual ACDB_PORT Acad::ErrorStatus  | setCellState (int nRow, int nCol, AcDb::CellState nCellState)
 virtual ACDB_PORT Acad::ErrorStatus  | setColumnName (int nIndex, const ACHAR *pszName)
 virtual ACDB_PORT Acad::ErrorStatus  | setCustomData (int nRow, int nCol, int nData)
 virtual ACDB_PORT Acad::ErrorStatus  | setCustomData (int nRow, int nCol, const ACHAR *pszKey, const AcValue *pData)
 virtual ACDB_PORT Acad::ErrorStatus  | setDataFormat (int nRow, int nCol, const ACHAR *pszFormat)
 virtual ACDB_PORT Acad::ErrorStatus  | setDataFormat (int nRow, int nCol, int nContent, const ACHAR *pszFormat)
 virtual ACDB_PORT Acad::ErrorStatus  | setDataLink (int nRow, int nCol, const AcDbObjectId &idDataLink, bool bUpdate)
 virtual ACDB_PORT Acad::ErrorStatus  | setDataLink (const AcCellRange &range, const AcDbObjectId &idDataLink, bool bUpdate)
 virtual ACDB_PORT Acad::ErrorStatus  | setDataType (int nRow, int nCol, AcValue::DataType nDataType, AcValue::UnitType nUnitType)
 virtual ACDB_PORT Acad::ErrorStatus  | setDataType (int nRow, int nCol, int nContent, AcValue::DataType nDataType, AcValue::UnitType nUnitType)
 virtual ACDB_PORT Acad::ErrorStatus  | setFieldId (int nRow, int nCol, const AcDbObjectId &idField)
 virtual ACDB_PORT Acad::ErrorStatus  | setFieldId (int nRow, int nCol, int nContent, const AcDbObjectId &idField)
 virtual ACDB_PORT Acad::ErrorStatus  | setFormula (int nRow, int nCol, int nContent, const ACHAR *pszFormula)
 virtual ACDB_PORT Acad::ErrorStatus  | setSize (int nRows, int nCols)
 virtual ACDB_PORT Acad::ErrorStatus  | setText (int nRow, int nCol, const ACHAR *pszText)
 virtual ACDB_PORT Acad::ErrorStatus  | setText (int nRow, int nCol, int nContent, const ACHAR *pszText)
 virtual ACDB_PORT Acad::ErrorStatus  | setToolTip (int nRow, int nCol, const ACHAR *pszToolTip)
 virtual ACDB_PORT Acad::ErrorStatus  | setValue (int nRow, int nCol, const AcValue &value)
 virtual ACDB_PORT Acad::ErrorStatus  | setValue (int nRow, int nCol, int nContent, const AcValue &value)
 virtual ACDB_PORT Acad::ErrorStatus  | setValue (int nRow, int nCol, int nContent, const AcValue &value, AcValue::ParseOption nOption)
 virtual ACDB_PORT Acad::ErrorStatus  | updateDataLink (int nRow, int nCol, AcDb::UpdateDirection nDir, AcDb::UpdateOption nOption)
 virtual ACDB_PORT Acad::ErrorStatus  | updateDataLink (AcDb::UpdateDirection nDir, AcDb::UpdateOption nOption)
 Public Member Functions inherited from AcDbLinkedData
ACDB_DECLARE_MEMBERS (AcDbLinkedData)
 virtual ACDB_PORT const ACHAR *  | description (void) const
 virtual ACDB_PORT bool  | isEmpty (void) const
 virtual ACDB_PORT const ACHAR *  | name (void) const
 virtual ACDB_PORT Acad::ErrorStatus  | setDescription (const ACHAR *pszDescription)
 virtual ACDB_PORT Acad::ErrorStatus  | setName (const ACHAR *pszName)
 Public Member Functions inherited from AcDbObject
ACDB_DECLARE_MEMBERS (AcDbObject)
 virtual void  | addPersistentReactor (AcDbObjectId objId)
 void  | addReactor (AcDbObjectReactor *newObj) const
 virtual Acad::ErrorStatus  | applyPartialUndo (AcDbDwgFiler *undoFiler, AcRxClass *classObj)
 void  | assertNotifyEnabled () const
 void  | assertReadEnabled () const
 void  | assertWriteEnabled (Adesk::Boolean autoUndo=true, Adesk::Boolean recordModified=true)
 virtual Acad::ErrorStatus  | audit (AcDbAuditInfo *pAuditInfo)
 Acad::ErrorStatus  | cancel ()
 virtual void  | cancelled (const AcDbObject *dbObj)
 virtual AcRxObject *  | clone () const
 Acad::ErrorStatus  | close ()
 Acad::ErrorStatus  | closeAndPage (Adesk::Boolean onlyWhenClean=true)
 virtual void  | copied (const AcDbObject *dbObj, const AcDbObject *newObj)
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pSrc)
 Acad::ErrorStatus  | createExtensionDictionary ()
 AcDbDatabase *  | database () const
 virtual Acad::ErrorStatus  | decomposeForSave (AcDb::AcDbDwgVersion ver, AcDbObject *&replaceObj, AcDbObjectId &replaceId, Adesk::Boolean &exchangeXData)
 virtual Acad::ErrorStatus  | deepClone (AcDbObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 void  | disableUndoRecording (Adesk::Boolean disable)
 Acad::ErrorStatus  | downgradeOpen ()
 Acad::ErrorStatus  | downgradeToNotify (Adesk::Boolean wasWritable)
 virtual AcGiDrawable *  | drawable ()
 Acad::ErrorStatus  | dwgIn (AcDbDwgFiler *pFiler)
 Acad::ErrorStatus  | dwgOut (AcDbDwgFiler *pFiler) const
 Acad::ErrorStatus  | dxfIn (AcDbDxfFiler *pFiler)
 Acad::ErrorStatus  | dxfOut (AcDbDxfFiler *pFiler, Adesk::Boolean allXdFlag, Adesk::uchar *regAppTable) const
 Acad::ErrorStatus  | erase (Adesk::Boolean erasing=true)
 virtual void  | erased (const AcDbObject *dbObj, Adesk::Boolean pErasing=true)
 AcDbObjectId  | extensionDictionary () const
 void  | getAcDbHandle (AcDbHandle &handle) const
 Acad::ErrorStatus  | getBinaryData (const ACHAR *key, long &size, char *&data) const
 virtual Acad::ErrorStatus  | getClassID (CLSID *pClsid) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbObjectId &fieldId) const
 Acad::ErrorStatus  | getField (const ACHAR *pszPropName, AcDbField *&pField, AcDb::OpenMode mode) const
 AcDbObjectId  | getFieldDictionary (void) const
 Acad::ErrorStatus  | getFieldDictionary (AcDbDictionary *&pFieldDict, AcDb::OpenMode mode) const
 Acad::ErrorStatus  | getObjectBirthVersion (AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDwgFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual Acad::ErrorStatus  | getObjectSaveVersion (const AcDbDxfFiler *pFiler, AcDb::AcDbDwgVersion &ver, AcDb::MaintenanceReleaseVersion &maintVer)
 virtual void  | goodbye (const AcDbObject *dbObj)
 virtual AcGsNode *  | gsNode () const
 Acad::ErrorStatus  | handOverTo (AcDbObject *newObject, Adesk::Boolean keepXData=true, Adesk::Boolean keepExtDict=true)
 bool  | hasFields (void) const
 bool  | hasPersistentReactor (AcDbObjectId objId) const
 bool  | hasSaveVersionOverride ()
 virtual AcDbObjectId  | id () const
 Adesk::Boolean  | isAcDbObjectIdsInFlux () const
 Adesk::Boolean  | isAProxy () const
 Adesk::Boolean  | isCancelling () const
 Adesk::Boolean  | isErased () const
 Adesk::Boolean  | isEraseStatusToggled () const
 Adesk::Boolean  | isModified () const
 Adesk::Boolean  | isModifiedGraphics () const
 Adesk::Boolean  | isModifiedXData () const
 Adesk::Boolean  | isNewObject () const
 Adesk::Boolean  | isNotifyEnabled () const
 Adesk::Boolean  | isNotifying () const
 virtual Adesk::Boolean  | isPersistent () const
 Adesk::Boolean  | isReadEnabled () const
 Adesk::Boolean  | isReallyClosing () const
 Adesk::Boolean  | isTransactionResident () const
 Adesk::Boolean  | isUndoing () const
 Adesk::Boolean  | isWriteEnabled () const
 virtual
 AcDb::DuplicateRecordCloning  | mergeStyle () const
 virtual void  | modified (const AcDbObject *dbObj)
 virtual void  | modifiedGraphics (const AcDbEntity *dbEnt)
 virtual void  | modifiedXData (const AcDbObject *dbObj)
 virtual void  | modifyUndone (const AcDbObject *dbObj)
 virtual void  | objectClosed (const AcDbObjectId objId)
 AcDbObjectId  | objectId () const
 virtual void  | openedForModify (const AcDbObject *dbObj)
 AcDbObjectId  | ownerId () const
 AcDbVoidPtrArray *  | reactors ()
 const AcDbVoidPtrArray *  | reactors () const
 virtual void  | reappended (const AcDbObject *dbObj)
 virtual void  | recvPropagateModify (const AcDbObject *subObj)
 Acad::ErrorStatus  | releaseExtensionDictionary ()
 virtual Acad::ErrorStatus  | removeField (AcDbObjectId fieldId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName, AcDbObjectId &returnId)
 virtual Acad::ErrorStatus  | removeField (const ACHAR *pszPropName)
 virtual Acad::ErrorStatus  | removePersistentReactor (AcDbObjectId objId)
 void  | removeReactor (AcDbObjectReactor *newObj) const
 void  | setAcDbObjectIdsInFlux ()
 virtual Adesk::UInt32  | setAttributes (AcGiDrawableTraits *pTraits)
 Acad::ErrorStatus  | setBinaryData (const ACHAR *key, long size, const char *data)
 virtual Acad::ErrorStatus  | setField (const ACHAR *pszPropName, AcDbField *pField, AcDbObjectId &fieldId)
 virtual void  | setGsNode (AcGsNode *pNode)
 void  | setHasSaveVersionOverride (bool bSetIt)
 virtual Acad::ErrorStatus  | setOwnerId (AcDbObjectId objId)
 virtual Acad::ErrorStatus  | setXData (const resbuf *xdata)
 virtual Acad::ErrorStatus  | subCancel ()
 virtual Acad::ErrorStatus  | subClose ()
 virtual Acad::ErrorStatus  | subErase (Adesk::Boolean erasing)
 virtual Acad::ErrorStatus  | subHandOverTo (AcDbObject *newObject)
 virtual void  | subObjModified (const AcDbObject *dbObj, const AcDbObject *subObj)
 virtual Acad::ErrorStatus  | subOpen (AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | subSwapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 Acad::ErrorStatus  | swapIdWith (AcDbObjectId otherId, Adesk::Boolean swapXdata=false, Adesk::Boolean swapExtDict=false)
 virtual Acad::ErrorStatus  | swapReferences (const AcDbIdMapping &idMap)
 virtual void  | unappended (const AcDbObject *dbObj)
 AcDbDwgFiler *  | undoFiler ()
 Acad::ErrorStatus  | upgradeFromNotify (Adesk::Boolean &wasWritable)
 Acad::ErrorStatus  | upgradeOpen ()
 virtual void  | viewportDraw (AcGiViewportDraw *pVd)
 virtual Acad::ErrorStatus  | wblockClone (AcRxObject *pOwnerObject, AcDbObject *&pClonedObject, AcDbIdMapping &idMap, Adesk::Boolean isPrimary=true) const
 virtual Adesk::Boolean  | worldDraw (AcGiWorldDraw *pWd)
 virtual resbuf *  | xData (const ACHAR *regappName=NULL) const
 Acad::ErrorStatus  | xDataTransformBy (const AcGeMatrix3d &xform)
 virtual void  | xmitPropagateModify () const
 Public Member Functions inherited from AcGiDrawable
ACRX_DECLARE_MEMBERS (AcGiDrawable)
 virtual DrawableType  | drawableType () const
 virtual Adesk::Boolean  | RolloverHit (Adesk::ULongPtr nSubentId, Adesk::ULongPtr nMouseFlags, Adesk::Boolean bReset)
 virtual Adesk::UInt32  | viewportDrawLogicalFlags (AcGiViewportDraw *vd)
 Public Member Functions inherited from AcRxObject
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcGiDrawable
enum  | DrawableType {
 kGeometry = 0, kDistantLight, kPointLight, kSpotLight,
 kAmbientLight, kSolidBackground, kGradientBackground, kImageBackground,
 kGroundPlaneBackground, kViewport, kWebLight, kSkyBackground
 }
enum  | SetAttributesFlags {
 kDrawableNone = 0, kDrawableIsAnEntity = 1, kDrawableUsesNesting = 2, kDrawableIsCompoundObject = 4,
 kDrawableViewIndependentViewportDraw = 8, kDrawableIsInvisible = 16, kDrawableHasAttributes = 32, kDrawableRegenTypeDependantGeometry = 64,
 kDrawableIsDimension = (kDrawableIsAnEntity + kDrawableIsCompoundObject + 128), kDrawableRegenDraw = 256, kDrawableStandardDisplaySingleLOD = 512, kDrawableShadedDisplaySingleLOD = 1024,
 kDrawableViewDependentViewportDraw = 2048, kDrawableBlockDependentViewportDraw = 4096
 }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
 The documentation for this class was generated from the following file:
DbLinkedTableData.h