Public Member Functions | Protected Attributes | Friends | List of all members
AcFdFieldEvaluatorLoader Class Reference
AcFd Classes
  Inheritance diagram for AcFdFieldEvaluatorLoader:
 Public Member Functions
 ACDB_PORT  | AcFdFieldEvaluatorLoader (void *)
ACRX_DECLARE_MEMBERS (AcFdFieldEvaluatorLoader)
virtual ACDB_PORT
 AcFdFieldEvaluator *  | findEvaluator (AcDbField *pField, const ACHAR *&pszEvalId)
virtual ACDB_PORT
 AcFdFieldEvaluator *  | getEvaluator (const ACHAR *pszEvalId)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Attributes
 void *  | mpImpObj
 Friends
 class  | AcFdSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
Member Function Documentation
 virtual ACDB_PORT AcFdFieldEvaluator* AcFdFieldEvaluatorLoader::findEvaluator  |  ( |  AcDbField *  |  pField,
|  const ACHAR *&  |  pszEvalId
)
virtual
Warning
Not implemented!
 virtual ACDB_PORT AcFdFieldEvaluator* AcFdFieldEvaluatorLoader::getEvaluator  |  ( |  const ACHAR *  |  pszEvalId | )
virtual
Warning
Not implemented!
 The documentation for this class was generated from the following file:
AcField.h