Public Types | Public Member Functions | List of all members
AcGiSubEntityTraits Class Reference
AcGi Classes
  Inheritance diagram for AcGiSubEntityTraits:
 Public Types
enum  | DrawFlags { kNoDrawFlags = 0, kDrawBackfaces = 1, kDrawHatchGroup = 2 }
enum  | ShadowFlags { kShadowsCastAndReceive = 0x00, kShadowsDoesNotCast = 0x01, kShadowsDoesNotReceive = 0x02, kShadowsIgnore = kShadowsDoesNotCast | kShadowsDoesNotReceive }
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiSubEntityTraits)
 virtual Adesk::UInt16  | color (void) const =0
 virtual Adesk::UInt32  | drawFlags (void) const
 virtual Acad::ErrorStatus  | edgeStyleOverride (AcGiEdgeStyleMask &mask, AcGiEdgeStyle &edgeStyle) const
 virtual AcGiFillType  | fillType (void) const =0
 virtual AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &idResult) const
 virtual AcDbObjectId  | layerId (void) const =0
 virtual AcDbObjectId  | lineTypeId (void) const =0
 virtual double  | lineTypeScale (void) const =0
 virtual AcDb::LineWeight  | lineWeight (void) const =0
 virtual const AcGiMapper *  | mapper (void) const
 virtual AcDbObjectId  | materialId (void) const
 virtual bool  | sectionable (void) const
 virtual bool  | selectionGeom (void) const
 virtual void  | setColor (const Adesk::UInt16 color)=0
 virtual Acad::ErrorStatus  | setDrawFlags (Adesk::UInt32 flags)
 virtual Acad::ErrorStatus  | setEdgeStyleOverride (AcGiEdgeStyleMask mask, const AcGiEdgeStyle &edgeStyle)
 virtual void  | setFillType (const AcGiFillType)=0
 virtual void  | setLayer (const AcDbObjectId layerId)=0
 virtual void  | setLineType (const AcDbObjectId linetypeId)=0
 virtual void  | setLineTypeScale (double dScale=1.0)=0
 virtual void  | setLineWeight (const AcDb::LineWeight lw)=0
 virtual void  | setMapper (const AcGiMapper *mapper)
 virtual void  | setMaterial (const AcDbObjectId materialId)
 virtual void  | setPlotStyleName (AcDb::PlotStyleNameType type, const AcDbObjectId &id=AcDbObjectId::kNull)
 virtual void  | setSectionable (bool bSectionable)
 virtual void  | setSelectionGeom (bool bSelectionflag)
 virtual void  | setSelectionMarker (const Adesk::LongPtr markerId)=0
 virtual Acad::ErrorStatus  | setShadowFlags (ShadowFlags flags)
 virtual void  | setThickness (double dThickness)=0
 virtual void  | setTrueColor (const AcCmEntityColor &color)=0
 virtual void  | setVisualStyle (const AcDbObjectId visualStyleId)
 virtual ShadowFlags  | shadowFlags (void) const
 virtual double  | thickness (void) const =0
 virtual AcCmEntityColor  | trueColor (void) const =0
 virtual AcDbObjectId  | visualStyle (void) const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
acgi.h