Public Types | Public Member Functions | List of all members
AcPlPlotProgress Class Reference
AcPl Classes
  Inheritance diagram for AcPlPlotProgress:
 Public Types
enum  | PlotCancelStatus { kPlotContinue, kPlotCanceledByCaller, kPlotCanceledByCancelAllButton, kPlotCancelStatusCount }
enum  | SheetCancelStatus {
 kSheetContinue, kSheetCanceledByCancelButton, kSheetCanceledByCancelAllButton, kSheetCanceledByCaller,
 kSheetCancelStatusCount
 }
 Public Member Functions
 virtual void  | getPlotProgressRange (int &nLower, int &nUpper) const =0
 virtual void  | getSheetProgressRange (int &nLower, int &nUpper) const =0
 virtual bool  | getStatusMsgString (ACHAR *&pMsg) const =0
 virtual void  | heartbeat (void)=0
 virtual bool  | isPlotCancelled () const =0
 virtual bool  | isSheetCancelled () const =0
 virtual bool  | isVisible () const =0
 virtual PlotCancelStatus  | plotCancelStatus () const =0
 virtual int  | plotProgressPos () const =0
 virtual bool  | setIsVisible (bool bVisible)=0
 virtual void  | setPlotCancelStatus (PlotCancelStatus Cancel)=0
 virtual void  | setPlotProgressPos (int nPos)=0
 virtual void  | setPlotProgressRange (int nLower, int nUpper)=0
 virtual void  | setSheetCancelStatus (SheetCancelStatus Cancel)=0
 virtual void  | setSheetProgressPos (int nPos)=0
 virtual void  | setSheetProgressRange (int nLower, int nUpper)=0
 virtual bool  | setStatusMsgString (const ACHAR *pMsg)=0
 virtual SheetCancelStatus  | sheetCancelStatus () const =0
 virtual int  | sheetProgressPos () const =0
 The documentation for this class was generated from the following file:
acplplotprogress.h