Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
AcGeMatrix3d Class Reference
AcGe Classes
  Inheritance diagram for AcGeMatrix3d:
 Public Member Functions
AcGeMatrix3d (const AcGeMatrix3d &src)
 AcGeMatrix2d  | convertToLocal (AcGeVector3d &normal, double &elev) const
 double  | det () const
 void  | getCoordSystem (AcGePoint3d &origin, AcGeVector3d &xAxis, AcGeVector3d &yAxis, AcGeVector3d &zAxis) const
 AcGeMatrix3d  | inverse () const
 Adesk::Boolean  | inverse (AcGeMatrix3d &inv, double tol) const
 AcGeMatrix3d &  | invert ()
 bool  | isEqualTo (const AcGeMatrix3d &mat, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isScaledOrtho (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isSingular (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isUniScaledOrtho (const AcGeTol &tol=AcGeContext::gTol) const
 double  | norm () const
 bool  | operator!= (const AcGeMatrix3d &mat) const
 double  | operator() (unsigned int, unsigned int) const
 double &  | operator() (unsigned int, unsigned int)
 AcGeMatrix3d  | operator* (const AcGeMatrix3d &mat) const
 AcGeMatrix3d &  | operator*= (const AcGeMatrix3d &mat)
 bool  | operator== (const AcGeMatrix3d &mat) const
 AcGeMatrix3d &  | postMultBy (const AcGeMatrix3d &rightSide)
 AcGeMatrix3d &  | preMultBy (const AcGeMatrix3d &leftSide)
 double  | scale (void) const
 AcGeMatrix3d &  | setCoordSystem (const AcGePoint3d &origin, const AcGeVector3d &xAxis, const AcGeVector3d &yAxis, const AcGeVector3d &zAxis)
 AcGeMatrix3d &  | setToAlignCoordSys (const AcGePoint3d &fromOrigin, const AcGeVector3d &fromXAxis, const AcGeVector3d &fromYAxis, const AcGeVector3d &fromZAxis, const AcGePoint3d &toOrigin, const AcGeVector3d &toXAxis, const AcGeVector3d &toYAxis, const AcGeVector3d &toZAxis)
 AcGeMatrix3d &  | setToIdentity ()
 AcGeMatrix3d &  | setToMirroring (const AcGePlane &pln)
 AcGeMatrix3d &  | setToMirroring (const AcGePoint3d &pnt)
 AcGeMatrix3d &  | setToMirroring (const AcGeLine3d &line)
 AcGeMatrix3d &  | setToPlaneToWorld (const AcGeVector3d &normal)
 AcGeMatrix3d &  | setToPlaneToWorld (const AcGePlane &plane)
 AcGeMatrix3d &  | setToProduct (const AcGeMatrix3d &mat1, const AcGeMatrix3d &mat2)
 AcGeMatrix3d &  | setToProjection (const AcGePlane &projectionPlane, const AcGeVector3d &projectDir)
 AcGeMatrix3d &  | setToRotation (double angle, const AcGeVector3d &axis, const AcGePoint3d &center=AcGePoint3d::kOrigin)
 AcGeMatrix3d &  | setToScaling (double scaleAll, const AcGePoint3d &center=AcGePoint3d::kOrigin)
 AcGeMatrix3d &  | setToTranslation (const AcGeVector3d &vec)
 AcGeMatrix3d &  | setToWorldToPlane (const AcGeVector3d &normal)
 AcGeMatrix3d &  | setToWorldToPlane (const AcGePlane &plane)
 AcGeMatrix3d &  | setTranslation (const AcGeVector3d &vec)
 AcGeVector3d  | translation () const
 AcGeMatrix3d  | transpose () const
 AcGeMatrix3d &  | transposeIt ()
 Static Public Member Functions
 static AcGeMatrix3d  | alignCoordSys (const AcGePoint3d &fromOrigin, const AcGeVector3d &fromXAxis, const AcGeVector3d &fromYAxis, const AcGeVector3d &fromZAxis, const AcGePoint3d &toOrigin, const AcGeVector3d &toXAxis, const AcGeVector3d &toYAxis, const AcGeVector3d &toZAxis)
 static AcGeMatrix3d  | mirroring (const AcGePlane &pln)
 static AcGeMatrix3d  | mirroring (const AcGePoint3d &pnt)
 static AcGeMatrix3d  | mirroring (const AcGeLine3d &line)
 static AcGeMatrix3d  | planeToWorld (const AcGeVector3d &normal)
 static AcGeMatrix3d  | planeToWorld (const AcGePlane &)
 static AcGeMatrix3d  | projection (const AcGePlane &projectionPlane, const AcGeVector3d &projectDir)
 static AcGeMatrix3d  | rotation (double angle, const AcGeVector3d &axis, const AcGePoint3d &center=AcGePoint3d::kOrigin)
 static AcGeMatrix3d  | scaling (double scaleAll, const AcGePoint3d &center=AcGePoint3d::kOrigin)
 static AcGeMatrix3d  | translation (const AcGeVector3d &vec)
 static AcGeMatrix3d  | worldToPlane (const AcGeVector3d &normal)
 static AcGeMatrix3d  | worldToPlane (const AcGePlane &)
 Public Attributes
 double  | entry [4][4]
 Static Public Attributes
 static const AcGeMatrix3d  | kIdentity
 The documentation for this class was generated from the following file:
gemat3d.h