Public Types | Public Member Functions | List of all members
AcGsModel Class Reference
 Public Types
enum  | InvalidationHint {
 kInvalidateNone, kInvalidateIsolines, kInvalidateViewportCache, kInvalidateAll,
 kInvalidateAllStatic, kInvalidateFacets, kInvalidateFills, kInvalidateLinetypes,
 kInvalidateMaterials, kInvalidateLayers
 }
enum  | RenderType {
 kMain, kSprite, kDirect, kHighlight,
 kHighlightSelection, kCount
 }
 Public Member Functions
 virtual bool  | addSceneGraphRoot (AcGiDrawable *pRoot)=0
 virtual AcDbObjectId  | background (void) const =0
 virtual void  | enableLinetypes (bool bEnable)=0
 virtual bool  | eraseSceneGraphRoot (AcGiDrawable *pRoot)=0
 virtual void  | invalidate (InvalidationHint hint)=0
 virtual bool  | isSectioningEnabled (void) const =0
 virtual bool  | linetypesEnabled (void) const =0
 virtual void  | onAdded (AcGiDrawable *pAdded, AcGiDrawable *pParent)=0
 virtual void  | onAdded (AcGiDrawable *pAdded, LONG_PTR parentID)=0
 virtual void  | onErased (AcGiDrawable *pErased, AcGiDrawable *pParent)=0
 virtual void  | onErased (AcGiDrawable *pErased, LONG_PTR parentID)=0
 virtual void  | onModified (AcGiDrawable *pModified, AcGiDrawable *pParent)=0
 virtual void  | onModified (AcGiDrawable *pModified, LONG_PTR parentID)=0
 virtual void  | onPaletteModified (void)=0
 virtual RenderType  | renderType (void)=0
 virtual void  | setBackground (const AcDbObjectId backgroundId)=0
 virtual void  | setEnableSectioning (bool enable)=0
 virtual void  | setExtents (const AcGePoint3d &, const AcGePoint3d &)=0
 virtual void  | setRenderModeOverride (AcGsView::RenderMode mode=AcGsView::kNone)=0
 virtual bool  | setSectioning (const AcGePoint3dArray &pts, const AcGeVector3d &upVector)=0
 virtual bool  | setSectioning (const AcGePoint3dArray &pts, const AcGeVector3d &upVector, double top, double bottom)=0
 virtual void  | setSectioningVisualStyle (const AcDbObjectId visualStyleId)=0
 virtual void  | setShadowPlaneLocation (double planeLocationZ)=0
 virtual void  | setTransform (const AcGeMatrix3d &)=0
 virtual void  | setViewClippingOverride (bool bOverride)=0
 virtual void  | setVisualStyle (const AcDbObjectId visualStyleId)=0
 virtual void  | setVisualStyle (const AcGiVisualStyle &visualStyle)=0
 virtual double  | shadowPlaneLocation (void) const =0
 virtual AcGeMatrix3d  | transform (void) const =0
 virtual AcDbObjectId  | visualStyle (void) const =0
 virtual bool  | visualStyle (AcGiVisualStyle &visualStyle) const =0
 The documentation for this class was generated from the following file:
gs.h