Public Member Functions | List of all members
AcDbDatabaseSummaryInfo Class Reference
AcDb Classes
  Inheritance diagram for AcDbDatabaseSummaryInfo:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbDatabaseSummaryInfo)
 virtual Acad::ErrorStatus  | addCustomSummaryInfo (const ACHAR *key, const ACHAR *value)=0
 virtual AcDbDatabase *  | database () const =0
 virtual Acad::ErrorStatus  | deleteCustomSummaryInfo (const int index)=0
 virtual Acad::ErrorStatus  | deleteCustomSummaryInfo (const ACHAR *key)=0
 virtual Acad::ErrorStatus  | getAuthor (ACHAR *&author) const =0
 virtual Acad::ErrorStatus  | getComments (ACHAR *&comments) const =0
 virtual Acad::ErrorStatus  | getCustomSummaryInfo (const int index, ACHAR *&key, ACHAR *&value) const =0
 virtual Acad::ErrorStatus  | getCustomSummaryInfo (const ACHAR *customInfoKey, ACHAR *&value) const =0
 virtual Acad::ErrorStatus  | getHyperlinkBase (ACHAR *&HyperlinkBase) const =0
 virtual Acad::ErrorStatus  | getKeywords (ACHAR *&keywordlist) const =0
 virtual Acad::ErrorStatus  | getLastSavedBy (ACHAR *&lastSavedBy) const =0
 virtual Acad::ErrorStatus  | getRevisionNumber (ACHAR *&revisionNumber) const =0
 virtual Acad::ErrorStatus  | getSubject (ACHAR *&subject) const =0
 virtual Acad::ErrorStatus  | getTitle (ACHAR *&title) const =0
 virtual int  | numCustomInfo () const =0
 virtual Acad::ErrorStatus  | setAuthor (const ACHAR *author)=0
 virtual Acad::ErrorStatus  | setComments (const ACHAR *comments)=0
 virtual Acad::ErrorStatus  | setCustomSummaryInfo (const int index, const ACHAR *key, const ACHAR *value)=0
 virtual Acad::ErrorStatus  | setCustomSummaryInfo (const ACHAR *customInfoKey, const ACHAR *value)=0
 virtual void  | setDatabase (AcDbDatabase *pDb)=0
 virtual Acad::ErrorStatus  | setHyperlinkBase (const ACHAR *HyperlinkBase)=0
 virtual Acad::ErrorStatus  | setKeywords (const ACHAR *keywordlist)=0
 virtual Acad::ErrorStatus  | setLastSavedBy (const ACHAR *lastSavedBy)=0
 virtual Acad::ErrorStatus  | setRevisionNumber (const ACHAR *revisionNumber)=0
 virtual Acad::ErrorStatus  | setSubject (const ACHAR *subject)=0
 virtual Acad::ErrorStatus  | setTitle (const ACHAR *title)=0
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
summinfo.h