Public Types | Public Member Functions | Protected Member Functions | List of all members
AcDbEvalVariant Class Reference
AcDb Classes
  Inheritance diagram for AcDbEvalVariant:
 Public Types
enum  | Type {
 kNone = AcDb::kDxfInvalid, kShort = AcDb::kDxfInt16, kLong = AcDb::kDxfInt32, kDouble = AcDb::kDxfReal,
 kString = AcDb::kDxfText, kOldId = AcDb::kDxfInt32+1, kPoint2d = AcDb::kDxfXCoord, kPoint3d = AcDb::kDxfXCoord+1
 }
 Public Member Functions
AcDbEvalVariant (const AcDbEvalVariant &other)
AcDbEvalVariant (const AcDbEvalVariant *pOther)
AcDbEvalVariant (double dVal)
AcDbEvalVariant (short iVal)
AcDbEvalVariant (const ACHAR *szVal)
AcDbEvalVariant (long lVal)
AcDbEvalVariant (const AcDbObjectId &id)
AcDbEvalVariant (const AcGePoint2d &pt)
AcDbEvalVariant (const AcGePoint3d &pt)
ACRX_DECLARE_MEMBERS (AcDbEvalVariant)
 void  | clear ()
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pOther)
 AcDbEvalVariant &  | operator= (double dVal)
 AcDbEvalVariant &  | operator= (short iVal)
 AcDbEvalVariant &  | operator= (long lVal)
 AcDbEvalVariant &  | operator= (const ACHAR *szVal)
 AcDbEvalVariant &  | operator= (const AcDbEvalVariant &other)
 AcDbEvalVariant &  | operator= (const AcDbObjectId &id)
 AcDbEvalVariant &  | operator= (const AcGePoint2d &pt)
 AcDbEvalVariant &  | operator= (const AcGePoint3d &pt)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 void  | init ()
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Public Attributes inherited from resbuf
 struct resbuf *  | rbnext
 short  | restype
 union ads_u_val  | resval
 The documentation for this class was generated from the following file:
dbeval.h