Public Member Functions | List of all members
AcDbLayoutManagerReactor Class Reference
AcDb Classes
  Inheritance diagram for AcDbLayoutManagerReactor:
 Public Member Functions
 virtual void  | abortLayoutCopied (const ACHAR *layoutName, const AcDbObjectId &layoutId)
 virtual void  | abortLayoutRemoved (const ACHAR *layoutName, const AcDbObjectId &layoutId)
 virtual void  | abortLayoutRename (const ACHAR *oldName, const ACHAR *newName, const AcDbObjectId &layoutId)
ACRX_DECLARE_MEMBERS (AcDbLayoutManagerReactor)
 virtual void  | layoutCopied (const ACHAR *oldLayoutName, const AcDbObjectId &oldLayoutId, const ACHAR *newLayoutname, const AcDbObjectId &newLayoutId)
 virtual void  | layoutCreated (const ACHAR *newLayoutName, const AcDbObjectId &layoutId)
 virtual void  | layoutRemoved (const ACHAR *layoutName, const AcDbObjectId &layoutId)
 virtual void  | layoutRenamed (const ACHAR *oldName, const ACHAR *newName, const AcDbObjectId &layoutId)
 virtual void  | layoutsReordered ()
 virtual void  | layoutSwitched (const ACHAR *newLayoutname, const AcDbObjectId &newLayoutId)
 virtual void  | layoutToBeCopied (const ACHAR *layoutName, const AcDbObjectId &oldLayoutId)
 virtual void  | layoutToBeRemoved (const ACHAR *layoutName, const AcDbObjectId &layoutId)
 virtual void  | layoutToBeRenamed (const ACHAR *oldName, const ACHAR *newName, const AcDbObjectId &layoutId)
 virtual void  | plotStyleTableChanged (const ACHAR *newTableName, const AcDbObjectId &layoutId)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
dblaymgrrctr.h