Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
AcDbAnnotationScale Class Reference
AcDb Classes
  Inheritance diagram for AcDbAnnotationScale:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcDbAnnotationScale)
virtual AcString  | collectionName () const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *pOther)
 virtual Acad::ErrorStatus  | getDrawingUnits (double &dDrawingUnits) const
 virtual Acad::ErrorStatus  | getIsTemporaryScale (bool &bTemporary) const
virtual Acad::ErrorStatus  | getName (AcString &name) const
 virtual Acad::ErrorStatus  | getPaperUnits (double &dPaperUnits) const
 virtual Acad::ErrorStatus  | getScale (double &dScale) const
 virtual bool  | matchScaleId (Adesk::LongPtr id) const
 virtual Acad::ErrorStatus  | setDrawingUnits (const double dDrawingUnits)
virtual Acad::ErrorStatus  | setName (const AcString &name)
 virtual Acad::ErrorStatus  | setPaperUnits (double dPaperUnits)
 virtual Adesk::LongPtr  | uniqueIdentifier () const
 Public Member Functions inherited from AcDbObjectContext
ACRX_DECLARE_MEMBERS (AcDbObjectContext)
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
AcDbAnnotationScale (bool)
 Protected Attributes
 AcDbImpAnnotationScale *  | mpImp
 Friends
 class  | AcDbSystemInternals
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Static Public Member Functions inherited from AcHeapOperators
 static void  | operator delete (void *p)
 static void  | operator delete (void *p, const char *pFName, int nLine)
 static void  | operator delete[] (void *p)
 static void  | operator delete[] (void *p, const char *pFName, int nLine)
 static void *  | operator new (size_t size)
 static void *  | operator new (size_t size, const char *pFName, int nLine)
 static void *  | operator new[] (size_t size)
 static void *  | operator new[] (size_t size, const char *pFName, int nLine)
Member Function Documentation
 virtual AcString AcDbAnnotationScale::collectionName  |  ( |   | ) |   const
virtual
Warning
Not implemented!
Implements AcDbObjectContext.
 virtual Acad::ErrorStatus AcDbAnnotationScale::getName  |  ( |  AcString &  |  name | ) |   const
virtual
Warning
Not implemented!
Implements AcDbObjectContext.
 virtual Acad::ErrorStatus AcDbAnnotationScale::setName  |  ( |  const AcString &  |  name | )
virtual
Warning
Not implemented!
Implements AcDbObjectContext.
 The documentation for this class was generated from the following file:
dbAnnotationScale.h