Public Member Functions | List of all members
AcGiMentalRayRenderSettingsTraits Class Reference
AcGi Classes
  Inheritance diagram for AcGiMentalRayRenderSettingsTraits:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiMentalRayRenderSettingsTraits)
 virtual AcGiMrDiagnosticBSPMode  | diagnosticBSPMode () const =0
 virtual void  | diagnosticGridMode (AcGiMrDiagnosticGridMode &mode, float &fSize) const =0
 virtual AcGiMrDiagnosticMode  | diagnosticMode () const =0
 virtual AcGiMrDiagnosticPhotonMode  | diagnosticPhotonMode () const =0
 virtual float  | energyMultiplier () const =0
 virtual bool  | exportMIEnabled () const =0
 virtual const ACHAR *  | exportMIFileName () const =0
 virtual int  | fgRayCount () const =0
 virtual void  | fgSampleRadius (double &min, double &max) const =0
 virtual void  | fgSampleRadiusState (bool &bMin, bool &bMax, bool &bPixels)=0
 virtual bool  | finalGatheringEnabled () const =0
 virtual int  | giPhotonsPerLight () const =0
 virtual int  | giSampleCount () const =0
 virtual double  | giSampleRadius () const =0
 virtual bool  | giSampleRadiusEnabled () const =0
 virtual bool  | globalIlluminationEnabled () const =0
 virtual double  | lightLuminanceScale () const =0
 virtual int  | memoryLimit () const =0
 virtual void  | photonTraceDepth (int &reflection, int &refraction, int &sum) const =0
 virtual const void *  | progressMonitor (void) const =0
 virtual void  | rayTraceDepth (int &reflection, int &refraction, int &sum) const =0
 virtual bool  | rayTraceEnabled () const =0
 virtual void  | sampling (int &min, int &max) const =0
 virtual void  | samplingContrastColor (float &r, float &g, float &b, float &a) const =0
 virtual void  | SamplingFilter (AcGiMrFilter &filter, double &width, double &height) const =0
 virtual void  | setDiagnosticBSPMode (AcGiMrDiagnosticBSPMode mode)=0
 virtual void  | setDiagnosticGridMode (AcGiMrDiagnosticGridMode mode, float fSize)=0
 virtual void  | setDiagnosticMode (AcGiMrDiagnosticMode mode)=0
 virtual void  | setDiagnosticPhotonMode (AcGiMrDiagnosticPhotonMode mode)=0
 virtual void  | setEnergyMultiplier (float fScale)=0
 virtual void  | setExportMIEnabled (bool enabled)=0
 virtual void  | setExportMIFileName (const ACHAR *miName)=0
 virtual void  | setFGRadiusState (bool bMin, bool bMax, bool bPixels)=0
 virtual void  | setFGRayCount (int num)=0
 virtual void  | setFGSampleRadius (double min, double max)=0
 virtual void  | setFinalGatheringEnabled (bool enabled)=0
 virtual void  | setGIPhotonsPerLight (int num)=0
 virtual void  | setGISampleCount (int num)=0
 virtual void  | setGISampleRadius (double radius)=0
 virtual void  | setGISampleRadiusEnabled (bool enabled)=0
 virtual void  | setGlobalIlluminationEnabled (bool enabled)=0
 virtual void  | setLightLuminanceScale (double luminance)=0
 virtual void  | setMemoryLimit (int limit)=0
 virtual void  | setPhotonTraceDepth (int reflection, int refraction, int sum)=0
 virtual void  | setProgressMonitor (void *pMonitor)=0
 virtual void  | setRayTraceDepth (int reflection, int refraction, int sum)=0
 virtual void  | setRayTraceEnabled (bool enabled)=0
 virtual void  | setSampling (int min, int max)=0
 virtual void  | setSamplingContrastColor (float r, float g, float b, float a)=0
 virtual void  | setSamplingFilter (AcGiMrFilter filter, double width, double height)=0
 virtual void  | setShadowMapEnabled (bool enabled)=0
 virtual void  | setShadowMode (AcGiMrShadowMode mode)=0
 virtual void  | setTileOrder (AcGiMrTileOrder order)=0
 virtual void  | setTileSize (int size)=0
 virtual bool  | shadowMapEnabled () const =0
 virtual AcGiMrShadowMode  | shadowMode () const =0
 virtual AcGiMrTileOrder  | tileOrder () const =0
 virtual int  | tileSize () const =0
 Public Member Functions inherited from AcGiRenderSettingsTraits
ACRX_DECLARE_MEMBERS (AcGiRenderSettingsTraits)
 virtual bool  | backFacesEnabled () const =0
 virtual bool  | diagnosticBackgroundEnabled () const =0
 virtual bool  | materialEnabled () const =0
 virtual double  | modelScaleFactor (void) const =0
 virtual void  | setBackFacesEnabled (bool enabled)=0
 virtual void  | setDiagnosticBackgroundEnabled (bool enabled)=0
 virtual void  | setMaterialEnabled (bool enabled)=0
 virtual void  | setModelScaleFactor (double scaleFactor)=0
 virtual void  | setShadowsEnabled (bool enabled)=0
 virtual void  | setTextureSampling (bool enabled)=0
 virtual bool  | shadowsEnabled () const =0
 virtual bool  | textureSampling () const =0
 Public Member Functions inherited from AcGiNonEntityTraits
ACRX_DECLARE_MEMBERS (AcGiNonEntityTraits)
virtual void  | addLight (const AcDbObjectId &id)
virtual Adesk::UInt16  | color (void) const
virtual AcGiFillType  | fillType (void) const
virtual AcDbObjectId  | layerId (void) const
virtual AcDbObjectId  | lineTypeId (void) const
virtual double  | lineTypeScale (void) const
virtual AcDb::LineWeight  | lineWeight (void) const
virtual AcDbObjectId  | materialId (void) const
virtual bool  | selectionGeom (void) const
virtual void  | setColor (const Adesk::UInt16 color)
virtual void  | setFillType (const AcGiFillType fillType)
virtual void  | setLayer (const AcDbObjectId layerId)
virtual void  | setLineType (const AcDbObjectId linetypeId)
virtual void  | setLineTypeScale (double dScale)
virtual void  | setLineWeight (const AcDb::LineWeight lw)
virtual void  | setMaterial (const AcDbObjectId matId)
virtual void  | setSelectionGeom (bool bSelectionflag)
virtual void  | setSelectionMarker (const Adesk::LongPtr markerId)
virtual void  | setThickness (double thickness)
virtual void  | setTrueColor (const AcCmEntityColor &color)
virtual void  | setupForEntity (AcDbEntity *pEntity)
virtual double  | thickness (void) const
virtual AcCmEntityColor  | trueColor (void) const
 Public Member Functions inherited from AcGiDrawableTraits
ACRX_DECLARE_MEMBERS (AcGiDrawableTraits)
 Public Member Functions inherited from AcGiSubEntityTraits
ACRX_DECLARE_MEMBERS (AcGiSubEntityTraits)
 virtual Adesk::UInt32  | drawFlags (void) const
 virtual Acad::ErrorStatus  | edgeStyleOverride (AcGiEdgeStyleMask &mask, AcGiEdgeStyle &edgeStyle) const
 virtual AcDb::PlotStyleNameType  | getPlotStyleNameId (AcDbObjectId &idResult) const
 virtual const AcGiMapper *  | mapper (void) const
 virtual bool  | sectionable (void) const
 virtual Acad::ErrorStatus  | setDrawFlags (Adesk::UInt32 flags)
 virtual Acad::ErrorStatus  | setEdgeStyleOverride (AcGiEdgeStyleMask mask, const AcGiEdgeStyle &edgeStyle)
 virtual void  | setMapper (const AcGiMapper *mapper)
 virtual void  | setPlotStyleName (AcDb::PlotStyleNameType type, const AcDbObjectId &id=AcDbObjectId::kNull)
 virtual void  | setSectionable (bool bSectionable)
 virtual Acad::ErrorStatus  | setShadowFlags (ShadowFlags flags)
 virtual void  | setVisualStyle (const AcDbObjectId visualStyleId)
 virtual ShadowFlags  | shadowFlags (void) const
 virtual AcDbObjectId  | visualStyle (void) const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Additional Inherited Members
 Public Types inherited from AcGiSubEntityTraits
enum  | DrawFlags { kNoDrawFlags = 0, kDrawBackfaces = 1, kDrawHatchGroup = 2 }
enum  | ShadowFlags { kShadowsCastAndReceive = 0x00, kShadowsDoesNotCast = 0x01, kShadowsDoesNotReceive = 0x02, kShadowsIgnore = kShadowsDoesNotCast | kShadowsDoesNotReceive }
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 Protected Types inherited from AcGiDrawableTraits
enum  | LayerFlags { kNone = 0x00, kOff = 0x01, kFrozen = 0x02, kZero = 0x04 }
 Protected Member Functions inherited from AcGiDrawableTraits
 virtual void  | setLayerFlags (Adesk::UInt8 flags)
 The documentation for this class was generated from the following file:
AcGiEnvironment.h