Public Member Functions | Static Public Attributes | List of all members
AcGeLine3d Class Reference
AcGe Classes
  Inheritance diagram for AcGeLine3d:
 Public Member Functions
AcGeLine3d (const AcGeLine3d &line)
AcGeLine3d (const AcGePoint3d &pnt, const AcGeVector3d &vec)
AcGeLine3d (const AcGePoint3d &pnt1, const AcGePoint3d &pnt2)
 AcGeLine3d &  | operator= (const AcGeLine3d &line)
 AcGeLine3d &  | set (const AcGePoint3d &pnt, const AcGeVector3d &vec)
 AcGeLine3d &  | set (const AcGePoint3d &pnt1, const AcGePoint3d &pnt2)
 Public Member Functions inherited from AcGeLinearEnt3d
 AcGeVector3d  | direction () const
 void  | getLine (AcGeLine3d &) const
 void  | getPerpPlane (const AcGePoint3d &pnt, AcGePlane &plane) const
 Adesk::Boolean  | intersectWith (const AcGeLinearEnt3d &line, AcGePoint3d &intPt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | intersectWith (const AcGePlanarEnt &plane, AcGePoint3d &intPnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isColinearTo (const AcGeLinearEnt3d &line, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePoint3d &pnt, double &param, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (double param, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isOn (const AcGePlane &plane, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isParallelTo (const AcGeLinearEnt3d &line, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isParallelTo (const AcGePlanarEnt &plane, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isPerpendicularTo (const AcGeLinearEnt3d &line, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isPerpendicularTo (const AcGePlanarEnt &plane, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeLinearEnt3d &  | operator= (const AcGeLinearEnt3d &line)
 Adesk::Boolean  | overlap (const AcGeLinearEnt3d &line, AcGeLinearEnt3d *&overlap, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | pointOnLine () const
 Adesk::Boolean  | projIntersectWith (const AcGeLinearEnt3d &line, const AcGeVector3d &projDir, AcGePoint3d &pntOnThisLine, AcGePoint3d &pntOnOtherLine, const AcGeTol &tol=AcGeContext::gTol) const
 Public Member Functions inherited from AcGeCurve3d
 Adesk::Boolean  | area (double startParam, double endParam, double &value, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeBoundBlock3d  | boundBlock () const
 AcGeBoundBlock3d  | boundBlock (const AcGeInterval &range) const
 AcGePoint3d  | closestPointTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | closestPointTo (const AcGeCurve3d &curve3d, AcGePoint3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 double  | distanceTo (const AcGeCurve3d &curve, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | evalPoint (double param) const
 AcGePoint3d  | evalPoint (double param, int numDeriv, AcGeVector3dArray &derivArray) const
 Adesk::Boolean  | explode (AcGeVoidPointerArray &explodedCurves, AcGeIntArray &newExplodedCurves, const AcGeInterval *intrvl=NULL) const
 void  | getClosestPointTo (const AcGePoint3d &pnt, AcGePointOnCurve3d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getClosestPointTo (const AcGeCurve3d &curve3d, AcGePointOnCurve3d &pntOnThisCrv, AcGePointOnCurve3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getInterval (AcGeInterval &intrvl) const
 void  | getInterval (AcGeInterval &intrvl, AcGePoint3d &start, AcGePoint3d &end) const
 void  | getLocalClosestPoints (const AcGePoint3d &point, AcGePointOnCurve3d &approxPnt, const AcGeInterval *nbhd=0, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getLocalClosestPoints (const AcGeCurve3d &otherCurve, AcGePointOnCurve3d &approxPntOnThisCrv, AcGePointOnCurve3d &approxPntOnOtherCrv, const AcGeInterval *nbhd1=0, const AcGeInterval *nbhd2=0, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | getNormalPoint (const AcGePoint3d &pnt, AcGePointOnCurve3d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getProjClosestPointTo (const AcGePoint3d &pnt, const AcGeVector3d &projectDirection, AcGePointOnCurve3d &pntOnCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getProjClosestPointTo (const AcGeCurve3d &curve3d, const AcGeVector3d &projectDirection, AcGePointOnCurve3d &pntOnThisCrv, AcGePointOnCurve3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 void  | getSamplePoints (double fromParam, double toParam, double approxEps, AcGePoint3dArray &pointArray, AcGeDoubleArray &paramArray) const
 void  | getSamplePoints (int numSample, AcGePoint3dArray &pointArray) const
 void  | getSamplePoints (int numSample, AcGePoint3dArray &pointArray, AcGeDoubleArray &paramArray) const
 void  | getSplitCurves (double param, AcGeCurve3d *&piece1, AcGeCurve3d *&piece2) const
 void  | getTrimmedOffset (double distance, const AcGeVector3d &planeNormal, AcGeVoidPointerArray &offsetCurveList, AcGe::OffsetCrvExtType extensionType=AcGe::kFillet, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | hasEndPoint (AcGePoint3d &endPnt) const
 Adesk::Boolean  | hasStartPoint (AcGePoint3d &startPnt) const
 Adesk::Boolean  | isClosed (const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isCoplanarWith (const AcGeCurve3d &curve3d, AcGePlane &plane, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isDegenerate (AcGe::EntityId &degenerateType, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isDegenerate (AcGeEntity3d *&pConvertedEntity, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isLinear (AcGeLine3d &line, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isPeriodic (double &period) const
 Adesk::Boolean  | isPlanar (AcGePlane &plane, const AcGeTol &tol=AcGeContext::gTol) const
 double  | length (double fromParam, double toParam, double tol=AcGeContext::gTol.equalPoint()) const
 AcGeCurve3d &  | operator= (const AcGeCurve3d &curve)
 AcGeBoundBlock3d  | orthoBoundBlock () const
 AcGeBoundBlock3d  | orthoBoundBlock (const AcGeInterval &range) const
 AcGeEntity3d *  | orthoProject (const AcGePlane &projectionPlane, const AcGeTol &tol=AcGeContext::gTol) const
 double  | paramAtLength (double datumParam, double length, Adesk::Boolean posParamDir=Adesk::kTrue, double tol=AcGeContext::gTol.equalPoint()) const
 double  | paramOf (const AcGePoint3d &pnt, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | projClosestPointTo (const AcGePoint3d &pnt, const AcGeVector3d &projectDirection, const AcGeTol &tol=AcGeContext::gTol) const
 AcGePoint3d  | projClosestPointTo (const AcGeCurve3d &curve3d, const AcGeVector3d &projectDirection, AcGePoint3d &pntOnOtherCrv, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeEntity3d *  | project (const AcGePlane &projectionPlane, const AcGeVector3d &projectDirection, const AcGeTol &tol=AcGeContext::gTol) const
 AcGeCurve3d &  | reverseParam ()
 AcGeCurve3d &  | setInterval ()
 Adesk::Boolean  | setInterval (const AcGeInterval &intrvl)
 Public Member Functions inherited from AcGeEntity3d
 AcGeEntity3d *  | copy () const
 Adesk::Boolean  | isEqualTo (const AcGeEntity3d &ent, const AcGeTol &tol=AcGeContext::gTol) const
 Adesk::Boolean  | isKindOf (AcGe::EntityId entType) const
 AcGeEntity3d &  | mirror (const AcGePlane &plane)
 Adesk::Boolean  | operator!= (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | operator= (const AcGeEntity3d &entity)
 Adesk::Boolean  | operator== (const AcGeEntity3d &entity) const
 AcGeEntity3d &  | rotateBy (double angle, const AcGeVector3d &vec, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | scaleBy (double scaleFactor, const AcGePoint3d &wrtPoint=AcGePoint3d::kOrigin)
 AcGeEntity3d &  | transformBy (const AcGeMatrix3d &xfm)
 AcGeEntity3d &  | translateBy (const AcGeVector3d &translateVec)
 AcGe::EntityId  | type () const
 Static Public Attributes
 static const AcGeLine3d  | kXAxis
 static const AcGeLine3d  | kYAxis
 static const AcGeLine3d  | kZAxis
 Additional Inherited Members
 Protected Member Functions inherited from AcGeLinearEnt3d
AcGeLinearEnt3d (const AcGeLinearEnt3d &)
 Protected Attributes inherited from AcGeEntity3d
 int  | mDelEnt
 AcGeImpEntity3d *  | mpImpEnt
 The documentation for this class was generated from the following file:
geline3d.h