Public Member Functions | Protected Member Functions | List of all members
AcGiSkyParameters Class Reference
AcGi Classes
  Inheritance diagram for AcGiSkyParameters:
 Public Member Functions
ACRX_DECLARE_MEMBERS (AcGiSkyParameters)
 bool  | aerialPerspective () const
 double  | diskIntensity () const
 double  | diskScale () const
 double  | glowIntensity () const
 AcCmColor  | groundColor () const
 double  | haze () const
 double  | horizonBlur () const
 double  | horizonHeight () const
 bool  | illumination () const
 double  | intensityFactor () const
 AcCmColor  | nightColor () const
 bool  | operator== (const AcGiSkyParameters &params) const
 double  | redBlueShift (void) const
 double  | saturation (void) const
 void  | setAerialPerspective (bool apply)
 bool  | setDiskIntensity (double intensity)
 bool  | setDiskScale (double scale)
 bool  | setGlowIntensity (double intensity)
 void  | setGroundColor (const AcCmColor &color)
 bool  | setHaze (double haze)
 bool  | setHorizonBlur (double blur)
 bool  | setHorizonHeight (double height)
 void  | setIllumination (bool enable)
 bool  | setIntensityFactor (double intensity)
 void  | setNightColor (const AcCmColor &color)
 bool  | setRedBlueShift (double redBlueShift)
 bool  | setSaturation (double saturation)
 bool  | setSolarDiskSamples (Adesk::UInt16 samples)
 bool  | setSunDirection (const AcGeVector3d &sundir)
 bool  | setVisibilityDistance (double distance)
 Adesk::UInt16  | solarDiskSamples () const
 const AcGeVector3d &  | sunDirection () const
 double  | visibilityDistance () const
 Public Member Functions inherited from AcRxObject
 virtual AcRxObject *  | clone () const
 virtual AcRx::Ordering  | comparedTo (const AcRxObject *other) const
 virtual Acad::ErrorStatus  | copyFrom (const AcRxObject *other)
 virtual AcRxClass *  | isA () const
 virtual Adesk::Boolean  | isEqualTo (const AcRxObject *other) const
 bool  | isKindOf (const AcRxClass *aClass) const
 AcRxObject *  | queryX (const AcRxClass *protocolClass) const
 AcRxObject *  | x (const AcRxClass *protocolClass) const
 Protected Member Functions
 virtual bool  | aerialPerspectiveImp () const
 virtual double  | diskIntensityImp () const
 virtual double  | diskScaleImp () const
 virtual double  | glowIntensityImp () const
 virtual AcCmColor  | groundColorImp () const
 virtual double  | hazeImp (void) const
 virtual double  | horizonBlurImp () const
 virtual double  | horizonHeightImp (void) const
 virtual bool  | illuminationImp (void) const
 virtual double  | intensityFactorImp () const
 virtual AcCmColor  | nightColorImp () const
 virtual double  | redBlueShiftImp (void) const
 virtual double  | saturationImp (void) const
 virtual void  | setAerialPerspectiveImp (bool apply)
 virtual bool  | setDiskIntensityImp (double intensity)
 virtual bool  | setDiskScaleImp (double scale)
 virtual bool  | setGlowIntensityImp (double intensity)
 virtual void  | setGroundColorImp (const AcCmColor &color)
 virtual bool  | setHazeImp (double haze)
 virtual bool  | setHorizonBlurImp (double blur)
 virtual bool  | setHorizonHeightImp (double height)
 virtual void  | setIlluminationImp (bool enable)
 virtual bool  | setIntensityFactorImp (double intensity)
 virtual void  | setNightColorImp (const AcCmColor &color)
 virtual bool  | setRedBlueShiftImp (double redBlueShift)
 virtual bool  | setSaturationImp (double saturation)
 virtual bool  | setSolarDiskSamplesImp (Adesk::UInt16 samples)
 virtual bool  | setSunDirectionImp (const AcGeVector3d &sundir)
 virtual bool  | setVisibilityDistanceImp (double distance)
 virtual Adesk::UInt16  | solarDiskSamplesImp (void) const
 virtual const AcGeVector3d &  | sunDirectionImp (void) const
 virtual double  | visibilityDistanceImp () const
 Additional Inherited Members
 Static Public Member Functions inherited from AcRxObject
 static AcRxObject *  | cast (const AcRxObject *inPtr)
 static AcRxClass *  | desc ()
 The documentation for this class was generated from the following file:
AcGiLightTraits.h