Classes | Macros | Typedefs | Functions | Variables
AcDb Classes
 Classes
class  | AcDb2dPolyline
class  | AcDb2dVertex
class  | AcDb2LineAngularDimension
class  | AcDb3dPolyline
class  | AcDb3dPolylineVertex
class  | AcDb3dSolid
class  | AcDb3PointAngularDimension
class  | AcDbAbstractViewTable
class  | AcDbAbstractViewTableIterator
class  | AcDbAbstractViewTableRecord
class  | AcDbAlignedDimension
class  | AcDbAlignment
class  | AcDbAnnotationScale
class  | AcDbAnnotativeObjectPE
class  | AcDbAppEntityGrips
class  | AcDbAppSystemVariables
class  | AcDbArc
class  | AcDbArcDimension
class  | AcDbAttribute
class  | AcDbAttributeDefinition
class  | AcDbAuditInfo
class  | AcDbAuditRecreatePE
class  | AcDbBackground
class  | AcDbBlockBegin
class  | AcDbBlockChangeIterator
class  | AcDbBlockEnd
class  | AcDbBlockInsertionPoints
class  | AcDbBlockReference
class  | AcDbBlockReferenceIdIterator
class  | AcDbBlockTable
class  | AcDbBlockTableIterator
class  | AcDbBlockTableRecord
class  | AcDbBlockTableRecordIterator
class  | AcDbBody
class  | AcDbBreakData
class  | AcDbBreakPointRef
class  | AcDbCamera
class  | AcDbCircle
class  | AcDbColor
class  | AcDbCompositeFilteredBlockIterator
class  | AcDbCurve
class  | AcDbCurvePath
class  | AcDbCustomOsnapInfo
class  | AcDbCustomOsnapManager
class  | AcDbCustomOsnapMode
class  | AcDbDatabase
class  | AcDbDatabaseReactor
class  | AcDbDatabaseSummaryInfo
class  | AcDbDataCell
class  | AcDbDataColumn
class  | AcDbDataLink
class  | AcDbDataLinkManager
class  | AcDbDataTable
class  | AcDbDate
class  | AcDbDeepCloneFiler
class  | AcDbDgnDefinition
class  | AcDbDgnReference
class  | AcDbDgnUnderlayItem
class  | AcDbDiametricDimension
class  | AcDbDictionary
class  | AcDbDictionaryIterator
class  | AcDbDictionaryWithDefault
class  | AcDbDimAssoc
class  | AcDbDimData
class  | AcDbDimension
class  | AcDbDimStyleTable
class  | AcDbDimStyleTableIterator
class  | AcDbDimStyleTableRecord
class  | AcDbDwfDefinition
class  | AcDbDwfReference
class  | AcDbDwgFiler
class  | AcDbDxfFiler
class  | AcDbDynamicUCSPE
class  | AcDbDynBlockReference
class  | AcDbDynBlockReferenceProperty
class  | AcDbEllipse
class  | AcDbEntity
class  | AcDbEntityHyperlinkPE
class  | AcDbEntityReactor
class  | AcDbEvalConnectable
class  | AcDbEvalContext
class  | AcDbEvalContextIterator
class  | AcDbEvalContextPair
class  | AcDbEvalEdgeInfo
class  | AcDbEvalExpr
class  | AcDbEvalGraph
class  | AcDbEvalIdMap
class  | AcDbEvalVariant
class  | AcDbExtents
class  | AcDbExtrudedSurface
class  | AcDbFace
class  | AcDbFaceRecord
class  | AcDbFcf
class  | AcDbField
class  | AcDbFilter
class  | AcDbFilteredBlockIterator
class  | AcDbFormattedTableData
class  | AcDbFrame
class  | AcDbFullSubentPath
class  | AcDbGradientBackground
class  | AcDbGraph
class  | AcDbGraphNode
class  | AcDbGraphStack
class  | AcDbGripData
class  | AcDbGroundPlaneBackground
class  | AcDbGroup
class  | AcDbGroupIterator
class  | AcDbHandle
class  | AcDbHardOwnershipId
class  | AcDbHardPointerId
class  | AcDbHatch
class  | AcDbHelix
class  | AcDbHostApplicationProgressMeter
class  | AcDbHostApplicationServices
class  | AcDbHyperlink
class  | AcDbHyperlinkCollection
class  | AcDbIdMapping
class  | AcDbIdMappingIter
class  | AcDbIdPair
class  | AcDbImage
class  | AcDbImageBackground
class  | AcDbIndex
class  | AcDbIndexUpdateData
class  | AcDbIndexUpdateDataIterator
class  | AcDbInterferencePE
class  | AcDbLayerFilter
class  | AcDbLayerIndex
class  | AcDbLayerIndexIterator
class  | AcDbLayerStateManager
class  | AcDbLayerStateManagerReactor
class  | AcDbLayerTable
class  | AcDbLayerTableIterator
class  | AcDbLayerTableRecord
class  | AcDbLayout
class  | AcDbLayoutManager
class  | AcDbLayoutManagerReactor
class  | AcDbLeader
class  | AcDbLight
class  | AcDbLine
class  | AcDbLinetypeTable
class  | AcDbLinetypeTableIterator
class  | AcDbLinetypeTableRecord
class  | AcDbLinkedData
class  | AcDbLinkedTableData
class  | AcDbLoftedSurface
class  | AcDbLoftOptions
class  | AcDbLongTransaction
class  | AcDbLongTransWorkSetIterator
class  | AcDbMatchProperties
class  | AcDbMaterial
class  | AcDbMentalRayRenderSettings
class  | AcDbMInsertBlock
class  | AcDbMLeader
class  | AcDbMLeaderStyle
class  | AcDbMline
class  | AcDbMlineStyle
class  | AcDbMotionPath
class  | AcDbMPolygon
class  | AcDbMPolygonCrossing
class  | AcDbMPolygonCrossingArray
class  | AcDbMpolygonLoops
class  | AcDbMPolygonNode
class  | AcDbMText
class  | AcDbNamedPath
class  | AcDbObject
class  | AcDbObjectContext
class  | AcDbObjectContextCollection
class  | AcDbObjectContextCollectionIterator
class  | AcDbObjectContextInterface
class  | AcDbObjectContextManager
class  | AcDbObjectId
class  | AcDbObjectIterator
class  | AcDbObjectPointer< T_OBJECT >
class  | AcDbObjectPointerBase< T_OBJECT >
class  | AcDbObjectReactor
class  | AcDbOle2Frame
class  | AcDbOleFrame
class  | AcDbOrdinateDimension
class  | AcDbOsnapPointRef
class  | AcDbPaperOrientationPE
class  | AcDbPasswordedFile
class  | AcDbPlaceHolder
class  | AcDbPlaneSurface
class  | AcDbPlotSettings
class  | AcDbPlotSettingsValidator
class  | AcDbPoint
class  | AcDbPointPath
class  | AcDbPointRef
class  | AcDbPolyFaceMesh
class  | AcDbPolyFaceMeshVertex
class  | AcDbPolygonMesh
class  | AcDbPolygonMeshVertex
class  | AcDbPolyline
class  | AcDbProxyEntity
class  | AcDbProxyObject
class  | AcDbR13ObjectId
class  | AcDbRadialDimension
class  | AcDbRadialDimensionLarge
class  | AcDbRasterImage
class  | AcDbRasterImageDef
class  | AcDbRasterImageDefFileAccessReactor
class  | AcDbRasterImageDefReactor
class  | AcDbRasterImageDefTransReactor
class  | AcDbRasterVariables
class  | AcDbRay
class  | AcDbRecover
class  | AcDbRecoverCallBack
class  | AcDbRegAppTable
class  | AcDbRegAppTableIterator
class  | AcDbRegAppTableRecord
class  | AcDbRegion
class  | AcDbRenderEnvironment
class  | AcDbRenderGlobal
class  | AcDbRenderSettings
class  | AcDbRevolvedSurface
class  | AcDbRevolveOptions
class  | AcDbRotatedDimension
class  | AcDbSection
class  | AcDbSectionManager
class  | AcDbSectionManagerIterator
class  | AcDbSectionSettings
class  | AcDbSelectGrip
class  | AcDbSequenceEnd
class  | AcDbServices
class  | AcDbShape
class  | AcDbSkyBackground
class  | AcDbSoftOwnershipId
class  | AcDbSoftPointerId
class  | AcDbSolid
class  | AcDbSolidBackground
class  | AcDbSpatialFilter
class  | AcDbSpatialIndex
class  | AcDbSpatialIndexIterator
class  | AcDbSpline
class  | AcDbSubentId
class  | AcDbSummaryInfoManager
class  | AcDbSummaryInfoReactor
class  | AcDbSun
class  | AcDbSurface
class  | AcDbSweepOptions
class  | AcDbSweptSurface
class  | AcDbSymbolTable
class  | AcDbSymbolTableIterator
class  | AcDbSymbolTablePointer< T_OBJECT >
class  | AcDbSymbolTableRecord
class  | AcDbSymbolTableRecordPointer< T_OBJECT >
class  | AcDbTable
class  | AcDbTableContent
class  | AcDbTableIterator
class  | AcDbTableStyle
class  | AcDbTableTemplate
class  | AcDbText
class  | AcDbTextStyleTable
class  | AcDbTextStyleTableIterator
class  | AcDbTextStyleTableRecord
class  | AcDbTrace
class  | AcDbTransactionManager
class  | AcDbUCSTable
class  | AcDbUCSTableIterator
class  | AcDbUCSTableRecord
class  | AcDbUnderlayDefinition
class  | AcDbUnderlayFile
class  | AcDbUnderlayHost
class  | AcDbUnderlayItem
class  | AcDbUnderlayReference
class  | AcDbVertex
class  | AcDbViewport
class  | AcDbViewportTable
class  | AcDbViewportTableIterator
class  | AcDbViewportTableRecord
class  | AcDbViewTable
class  | AcDbViewTableIterator
class  | AcDbViewTableRecord
class  | AcDbVisualStyle
class  | AcDbWblockCloneFiler
class  | AcDbWipeout
class  | AcDbXline
class  | AcDbXObject
class  | AcDbXrecord
class  | AcDbXrecordIterator
class  | AcDbXrefGraph
class  | AcDbXrefGraphNode
class  | AcDbXrefObjectId
class  | AcGiGlyph
class  | AcGiLineAttrUtils
class  | AcGiStyleAttributes
class  | AcTransaction
class  | AcTransactionReactor
 Macros
 #define  | DBCURVE_METHODS
 Typedefs
 typedef AcDbSymbolTablePointer
 < AcDbBlockTable >  | AcDbBlockTablePointer
 typedef
 AcDbSymbolTableRecordPointer
 < AcDbBlockTableRecord >  | AcDbBlockTableRecordPointer
 typedef AcArray< AcDbDataCell,
 AcArrayObjectCopyReallocator
 < AcDbDataCell > >  | AcDbDataCellArray
 typedef AcArray< AcDbDataLink * >  | AcDbDataLinkArray
 typedef AcDbObjectPointer
 < AcDbDictionary >  | AcDbDictionaryPointer
 typedef AcDbSymbolTablePointer
 < AcDbDimStyleTable >  | AcDbDimStyleTablePointer
 typedef
 AcDbSymbolTableRecordPointer
 < AcDbDimStyleTableRecord >  | AcDbDimStyleTableRecordPointer
 typedef AcArray
 < AcDbDynBlockReferenceProperty,
 AcArrayObjectCopyReallocator
 < AcDbDynBlockReferenceProperty > >  | AcDbDynBlockReferencePropertyArray
 typedef AcDbObjectPointer
 < AcDbEntity >  | AcDbEntityPointer
 typedef AcArray< AcDbGripData >  | AcDbGripDataArray
 typedef AcArray< AcDbGripData * >  | AcDbGripDataPtrArray
 typedef AcDbSymbolTablePointer
 < AcDbLayerTable >  | AcDbLayerTablePointer
 typedef
 AcDbSymbolTableRecordPointer
 < AcDbLayerTableRecord >  | AcDbLayerTableRecordPointer
 typedef AcDbSymbolTablePointer
 < AcDbLinetypeTable >  | AcDbLinetypeTablePointer
 typedef
 AcDbSymbolTableRecordPointer
 < AcDbLinetypeTableRecord >  | AcDbLinetypeTableRecordPointer
 typedef AcDbSymbolTablePointer
 < AcDbRegAppTable >  | AcDbRegAppTablePointer
 typedef
 AcDbSymbolTableRecordPointer
 < AcDbRegAppTableRecord >  | AcDbRegAppTableRecordPointer
 typedef AcDbSymbolTablePointer
 < AcDbTextStyleTable >  | AcDbTextStyleTablePointer
 typedef
 AcDbSymbolTableRecordPointer
 < AcDbTextStyleTableRecord >  | AcDbTextStyleTableRecordPointer
 typedef AcDbSymbolTablePointer
 < AcDbUCSTable >  | AcDbUCSTablePointer
 typedef
 AcDbSymbolTableRecordPointer
 < AcDbUCSTableRecord >  | AcDbUCSTableRecordPointer
 typedef AcDbSymbolTablePointer
 < AcDbViewportTable >  | AcDbViewportTablePointer
 typedef
 AcDbSymbolTableRecordPointer
 < AcDbViewportTableRecord >  | AcDbViewportTableRecordPointer
 typedef AcDbSymbolTablePointer
 < AcDbViewTable >  | AcDbViewTablePointer
 typedef
 AcDbSymbolTableRecordPointer
 < AcDbViewTableRecord >  | AcDbViewTableRecordPointer
 typedef void(*  | ContextMenuItemIndexPtr )(unsigned int itemIndex)
 typedef void(*  | GripDimensionPtr )(AcDbGripData *pThis, const AcDbObjectId &entId, double dimScale, AcDbDimDataPtrArray &dimData)
 typedef
 AcDbGripOperations::ReturnValue(*  | GripInputPointPtr )(AcDbGripData *pThis, const AcDbObjectId &entId, bool &changedPoint, AcGePoint3d &newPoint, const AcGiViewport &viewContext, const AcDbObjectId &viewportId, bool pointComputed, int history, const AcGePoint3d &lastPoint, const AcGePoint3d &rawPoint, const AcGePoint3d &grippedPoint, const AcGePoint3d &cartesianSnappedPoint, const AcGePoint3d &osnappedPoint, AcDb::OsnapMask osnapMask, const AcArray< AcDbCustomOsnapMode * > &customOsnapModes, AcDb::OsnapMask osnapOverrides, const AcArray< AcDbCustomOsnapMode * > &customOsnapOverrides, const AcArray< AcDbObjectId > &pickedEntities, const AcArray< AcDbObjectIdArray, AcArrayObjectCopyReallocator< AcDbObjectIdArray > > &nestedPickedEntities, const AcArray< Adesk::GsMarker > &gsSelectionMark, const AcArray< AcDbObjectId > &keyPointEntities, const AcArray< AcDbObjectIdArray, AcArrayObjectCopyReallocator< AcDbObjectIdArray > > &nestedKeyPointEntities, const AcArray< Adesk::GsMarker > &keyPointGsSelectionMark, const AcArray< AcGeCurve3d * > &alignmentPaths, const AcGePoint3d &computedPoint)
 typedef
 AcDbGripOperations::ReturnValue(*  | GripOperationPtr )(AcDbGripData *pThis, const AcDbObjectId &entId, int contextFlags)
 typedef void(*  | GripOpStatusPtr )(AcDbGripData *pThis, const AcDbObjectId &entId, AcDbGripOperations::GripStatus stat)
 typedef
 AcDbGripOperations::ReturnValue(*  | GripRtClkHandler )(AcDbGripDataArray &hotGrips, const AcDbObjectIdArray &ents, ACHAR *&menuName, HMENU &menu, ContextMenuItemIndexPtr &cb)
 typedef const ACHAR *(*  | GripToolTipPtr )(AcDbGripData *pThis)
 typedef void(*  | GripViewportDrawPtr )(AcDbGripData *pThis, AcGiViewportDraw *pWd, const AcDbObjectId &entId, AcDbGripOperations::DrawType type, AcGePoint3d *imageGripPoint, int gripSize)
 typedef bool(*  | GripWorldDrawPtr )(AcDbGripData *pThis, AcGiWorldDraw *pWd, const AcDbObjectId &entId, AcDbGripOperations::DrawType type, AcGePoint3d *imageGripPoint, double dGripSize)
 typedef void(*  | MAPFILENOTIFYPROC )(const ACHAR *filename, const ACHAR *newName, int context, void *pReserved)
 typedef Acad::ErrorStatus(*  | REMAPPROC )(ACHAR *&newName, const ACHAR *filename, int context, void *pReserved)
 typedef Acad::ErrorStatus(*  | SELECTFILEPROC )(short *userCancel, ACHAR *&chosenPath, void *h, const int nFlags, const ACHAR *prompt, const ACHAR *dir, const ACHAR *name, const ACHAR *type, int *pnChoice, bool *pbReadOnly, const ACHAR *pszWSTags, void *pReserved)
 Functions
AcDbDimData::AcDbDimData (AcDbDimension *pDim, DimDataSetValueFuncPtr setDimFunc=NULL, unsigned int bitFlags=0, void *appData=NULL, DimDataSetCustomStringFuncPtr setCustomStringFunc=NULL)
AcDbDimData::AcDbDimData (const AcDbDimData &)
AcDbFullSubentPath::AcDbFullSubentPath (AcDb::SubentType type, Adesk::GsMarker index)
Acad::ErrorStatus  | acdbGetBreakSubentIndex (AcDbEntity *pEnt, const AcGePoint3d &pickPt, const AcGeVector3d &viewDir, int &subentIndex, AcGePoint3d &ptOnEnt, const AcGeTol &tol=AcGeContext::gTol)
 Acad::ErrorStatus ADESK_STDCALL  | acdbGetSummaryInfo (AcDbDatabase *pDb, AcDbDatabaseSummaryInfo *&pInfo)
AcDbGripData::AcDbGripData (const AcGePoint3d &, void *, GripOperationPtr hotGrip=NULL, GripOperationPtr hoverGrip=NULL, GripRtClkHandler RtClk=NULL, GripWorldDrawPtr wd=NULL, GripViewportDrawPtr vd=NULL, GripOpStatusPtr stat=NULL, GripToolTipPtr tt=NULL, GripDimensionPtr hoverDim=NULL, GripDimensionPtr hotGripDim=NULL, unsigned int bitFlags=0, AcGePoint3d *altBasePt=NULL, GripInputPointPtr inputPointFunc=NULL)
AcDbGripData::AcDbGripData (const AcGePoint3d &, void *, AcRxClass *, GripOperationPtr hotGrip=NULL, GripOperationPtr hoverGrip=NULL, GripRtClkHandler RtClk=NULL, GripWorldDrawPtr wd=NULL, GripViewportDrawPtr vd=NULL, GripOpStatusPtr stat=NULL, GripToolTipPtr tt=NULL, GripDimensionPtr hoverDim=NULL, GripDimensionPtr hotGripDim=NULL, unsigned int bitFlags=0, AcGePoint3d *altBasePt=NULL, GripInputPointPtr inputPointFunc=NULL)
AcDbGripData::AcDbGripData (const AcDbGripData &)
AcDbHandle::AcDbHandle (int lo, int hi)
AcDbHandle::AcDbHandle (const Adesk::UInt64 &)
AcDbHardOwnershipId::AcDbHardOwnershipId (const AcDbObjectId &)
AcDbHardOwnershipId::AcDbHardOwnershipId (const AcDbStub *)
AcDbHardPointerId::AcDbHardPointerId (const AcDbObjectId &)
AcDbHardPointerId::AcDbHardPointerId (const AcDbStub *)
AcDbMpolygonLoops::AcDbMpolygonLoops (int lindex, int gindex=0, int gcnt=0)
AcDbObjectId::AcDbObjectId (const AcDbStub *)
AcDbObjectPointer< T_OBJECT >::AcDbObjectPointer (AcDbObjectId objId, AcDb::OpenMode mode, bool openErased=false)
AcDbObjectPointerBase< T_OBJECT >::AcDbObjectPointerBase (AcDbObjectId objId, AcDb::OpenMode mode, bool openErased)
 Acad::ErrorStatus ADESK_STDCALL  | acdbPutSummaryInfo (const AcDbDatabaseSummaryInfo *pInfo, AcDbDatabase *pDb)
 Acad::ErrorStatus  | acdbPutSummaryInfo (const AcDbDatabaseSummaryInfo *pInfo)
AcDbSoftOwnershipId::AcDbSoftOwnershipId (const AcDbObjectId &)
AcDbSoftOwnershipId::AcDbSoftOwnershipId (const AcDbStub *)
AcDbSoftPointerId::AcDbSoftPointerId (const AcDbObjectId &)
AcDbSoftPointerId::AcDbSoftPointerId (const AcDbStub *)
AcDbSubentId::AcDbSubentId (AcDb::SubentType type, Adesk::GsMarker index)
AcDbSubentId::AcDbSubentId (AcRxClass *pTypeClass, Adesk::GsMarker index)
AcDbSymbolTablePointer< T_OBJECT >::AcDbSymbolTablePointer (AcDbObjectId objId, AcDb::OpenMode mode)
AcDbSymbolTablePointer< T_OBJECT >::AcDbSymbolTablePointer (AcDbDatabase *pDb, AcDb::OpenMode mode)
AcDbSymbolTableRecordPointer< T_OBJECT >::AcDbSymbolTableRecordPointer (AcDbObjectId objId, AcDb::OpenMode mode, bool openErased=false)
AcDbSymbolTableRecordPointer< T_OBJECT >::AcDbSymbolTableRecordPointer (const ACHAR *name, AcDbDatabase *pDb, AcDb::OpenMode mode, bool openErased=false)
 Acad::ErrorStatus  | acedGetCurDwgXrefGraph (AcDbXrefGraph &, Adesk::Boolean includeGhosts=Adesk::kFalse)
AcGiStyleAttributes::AcGiStyleAttributes (const AcGiStyleAttributes &source)
 Acad::ErrorStatus  | AcDbObjectPointerBase< T_OBJECT >::acquire (T_OBJECT *&pObjToAcquire)
 const AcDbDate &  | AcDbDate::add (const AcDbDate &date)
 AcGePoint3d *  | AcDbGripData::alternateBasePoint () const
 void *  | AcDbDimData::appData () const
 void *  | AcDbGripData::appData () const
 AcRxClass *  | AcDbGripData::appDataAcRxClass () const
 Acad::ErrorStatus  | applyCurDwgLayerTableChanges ()
 bool  | AcDbGripData::areModeKeywordsDisabled () const
 Adesk::IntDbId  | AcDbObjectId::asOldId () const
 bool  | AcDbAppSystemVariables::attdia () const
 bool  | AcDbAppSystemVariables::attreq () const
 unsigned int  | AcDbDimData::bitFlags () const
 unsigned int  | AcDbGripData::bitFlags () const
 bool  | AcDbAppSystemVariables::blipmode () const
 AcDbObjectId  | AcDbXrefGraphNode::btrId () const
 int  | AcDbHandle::byte (Adesk::UInt32 i) const
 static ClassVersion  | AcDbRasterVariables::classVersion ()
 static ClassVersion  | AcDbRasterImageDef::classVersion ()
 static ClassVersion  | AcDbRasterImage::classVersion ()
 static ClassVersion  | AcDbRasterImageDefReactor::classVersion ()
 Acad::ErrorStatus  | AcDbObjectPointerBase< T_OBJECT >::close ()
 int  | AcDbHandle::compare (const AcDbHandle &) const
 Adesk::Int16  | AcDbAppSystemVariables::coords () const
 Acad::ErrorStatus  | AcDbObjectPointerBase< T_OBJECT >::create ()
 DimDataSetCustomStringFuncPtr  | AcDbDimData::customStringFunc () const
 AcDbGraphNode *  | AcDbGraphNode::cycleIn (int) const
 AcDbGraphNode *  | AcDbGraphNode::cycleOut (int) const
 void *  | AcDbGraphNode::data () const
 AcDbDatabase *  | AcDbXrefGraphNode::database () const
 void  | AcDbHandle::decrement (void)
 Adesk::Int16  | AcDbAppSystemVariables::delUsedObj () const
 AcDbDimension *  | AcDbDimData::dimension () const
 DimDataSetValueFuncPtr  | AcDbDimData::dimValueFunc () const
 void  | AcDbGripData::disableModeKeywords (bool disable)
 void  | AcDbGripData::disableRubberBandLine (bool disable)
 Adesk::Int16  | AcDbAppSystemVariables::dragmode () const
 bool  | AcDbGripData::drawAtDragImageGripPoint () const
 virtual const long  | AcDbHyperlink::flags () const
 bool  | AcDbGripData::forcedPickOn () const
 Acad::ErrorStatus  | AcDbDatabase::getBlockTable (AcDbBlockTable *&pTable, AcDb::OpenMode mode)
 AcCmEntityColor &  | AcGiStyleAttributes::getColorAttribute ()
 const AcCmEntityColor &  | AcGiStyleAttributes::getColorAttribute () const
 Acad::ErrorStatus  | AcDbDatabase::getDimStyleTable (AcDbDimStyleTable *&pTable, AcDb::OpenMode mode)
 Acad::ErrorStatus  | AcDbDatabase::getLayerTable (AcDbLayerTable *&pTable, AcDb::OpenMode mode)
 Acad::ErrorStatus  | AcDbDatabase::getLinetypeTable (AcDbLinetypeTable *&pTable, AcDb::OpenMode mode)
 Acad::ErrorStatus  | AcDbDatabase::getRegAppTable (AcDbRegAppTable *&pTable, AcDb::OpenMode mode)
 virtual Acad::ErrorStatus  | AcDbPolyline::getSpline (AcDbSpline *&spline) const
 virtual Acad::ErrorStatus  | AcDbPolyline::getStartParam (double &startParam) const
 Acad::ErrorStatus  | AcDbDatabase::getTextStyleTable (AcDbTextStyleTable *&pTable, AcDb::OpenMode mode)
 Acad::ErrorStatus  | AcDbDatabase::getUCSTable (AcDbUCSTable *&pTable, AcDb::OpenMode mode)
 Acad::ErrorStatus  | AcDbDatabase::getViewportTable (AcDbViewportTable *&pTable, AcDb::OpenMode mode)
 Acad::ErrorStatus  | AcDbDatabase::getViewTable (AcDbViewTable *&pTable, AcDb::OpenMode mode)
 bool  | AcDbGripData::gizmosEnabled () const
 bool  | AcDbGripData::gripIsPerViewport () const
 GripOpStatusPtr  | AcDbGripData::gripOpStatFunc () const
 const AcGePoint3d &  | AcDbGripData::gripPoint () const
 Adesk::UInt32  | AcDbHandle::high () const
 AcDbXrefGraphNode *  | AcDbXrefGraph::hostDwg () const
 GripDimensionPtr  | AcDbGripData::hotGripDimensionFunc () const
 GripOperationPtr  | AcDbGripData::hotGripFunc () const
 GripDimensionPtr  | AcDbGripData::hoverDimensionFunc () const
 GripOperationPtr  | AcDbGripData::hoverFunc () const
 bool  | AcDbAppSystemVariables::hpassoc () const
 AcDbGraphNode *  | AcDbGraphNode::in (int) const
 void  | AcDbHandle::increment (void)
 Adesk::GsMarker  | AcDbSubentId::index () const
 GripInputPointPtr  | AcDbGripData::inputPointFunc () const
 bool  | AcDbIdPair::isCloned () const
 bool  | AcDbDimData::isConstrained () const
 bool  | AcDbDimData::isCustomDimValue () const
 bool  | AcDbDimData::isCustomString () const
 bool  | AcDbGraphNode::isCycleNode () const
 bool  | AcDbDimData::isDimDeltaAngle () const
 bool  | AcDbDimData::isDimDeltaLength () const
 bool  | AcDbDimData::isDimEditable () const
 bool  | AcDbDimData::isDimFocal () const
 bool  | AcDbDimData::isDimHideIfValueIsZero () const
 bool  | AcDbDimData::isDimInvisible () const
 bool  | AcDbDimData::isDimRadius () const
 bool  | AcDbDimData::isDimResultantAngle () const
 bool  | AcDbDimData::isDimResultantLength () const
 bool  | AcDbGraph::isEmpty () const
 bool  | AcDbGraphStack::isEmpty () const
 bool  | AcDbGraphNode::isMarkedAs (Adesk::UInt8 flags) const
 bool  | AcDbXrefGraphNode::isNested () const
 bool  | AcDbObjectId::isNull () const
 bool  | AcDbHandle::isNull () const
 bool  | AcDbHandle::isOne (void) const
 bool  | AcDbIdPair::isOwnerXlated () const
 virtual Adesk::Boolean  | AcDbPolyline::isPlanar () const
 bool  | AcDbIdPair::isPrimary () const
 bool  | AcDbGripData::isRubberBandLineDisabled () const
 AcDbObjectId  | AcDbIdPair::key () const
 AcDbObjectId  | AcGiStyleAttributes::linetypeObjectId () const
 Adesk::UInt32  | AcDbHandle::low () const
 AcDb::LineWeight  | AcDbAppSystemVariables::lwdefault () const
 bool  | AcDbGripData::mapGripHotToRtClk () const
 void  | modelToPixel (const AcGeMatrix3d &modToPix, const AcGePoint3d &modPt, AcGePoint2d &pixPt)
 void  | modelToPixel (const AcGeVector3d &viewDir, const AcGeMatrix3d &modToPix, const AcGePlane &plane, const AcGePoint3d &modPt, AcGePoint2d &pixPt)
 const ACHAR *  | AcDbXrefGraphNode::name () const
 AcDbGraphNode *  | AcDbGraphNode::nextCycleNode () const
 AcDbGraphNode *  | AcDbGraph::node (int index) const
 int  | AcDbGraphNode::numCycleIn () const
 int  | AcDbGraphNode::numCycleOut () const
 int  | AcDbGraphNode::numIn () const
 int  | AcDbGraph::numNodes () const
 int  | AcDbGraphNode::numOut () const
 const T_OBJECT *  | AcDbObjectPointerBase< T_OBJECT >::object () const
 T_OBJECT *  | AcDbObjectPointerBase< T_OBJECT >::object ()
 void  | AcDbFullSubentPath::objectIds (AcDbObjectIdArray &objectIds) const
 AcDbObjectIdArray &  | AcDbFullSubentPath::objectIds ()
 const AcDbObjectIdArray &  | AcDbFullSubentPath::objectIds () const
 Acad::ErrorStatus  | AcDbObjectPointerBase< T_OBJECT >::open (AcDbObjectId objId, AcDb::OpenMode mode, bool openErased=false)
 Acad::ErrorStatus  | AcDbObjectPointer< T_OBJECT >::open (AcDbObjectId objId, AcDb::OpenMode mode, bool openErased=false)
 Acad::ErrorStatus  | AcDbSymbolTablePointer< T_OBJECT >::open (AcDbObjectId objId, AcDb::OpenMode mode)
 Acad::ErrorStatus  | AcDbSymbolTablePointer< T_OBJECT >::open (AcDbDatabase *pDb, AcDb::OpenMode mode)
 Acad::ErrorStatus  | AcDbSymbolTableRecordPointer< T_OBJECT >::open (AcDbObjectId objId, AcDb::OpenMode mode, bool openErased=false)
 Acad::ErrorStatus  | AcDbSymbolTableRecordPointer< T_OBJECT >::open (const ACHAR *name, AcDbDatabase *pDb, AcDb::OpenMode mode, bool openErased=false)
 Acad::ErrorStatus  | AcDbObjectPointerBase< T_OBJECT >::openStatus () const
AcDbObjectId::operator AcDbStub * () const
AcDbHardOwnershipId::operator AcDbStub * () const
AcDbSoftOwnershipId::operator AcDbStub * () const
AcDbHardPointerId::operator AcDbStub * () const
AcDbSoftPointerId::operator AcDbStub * () const
AcDbHandle::operator Adesk::UInt32 () const
AcDbObjectPointerBase< T_OBJECT >::operator const T_OBJECT * () const
AcDbObjectPointerBase< T_OBJECT >::operator T_OBJECT * ()
 bool  | AcDbSubentId::operator!= (const AcDbSubentId &id) const
 bool  | AcDbHandle::operator!= (const AcDbHandle &) const
 bool  | AcDbR13ObjectId::operator!= (const AcDbR13ObjectId &id) const
 bool  | AcDbR13ObjectId::operator!= (const AcDbStub *pStub) const
 bool  | AcDbHardOwnershipId::operator!= (const AcDbObjectId &) const
 bool  | AcDbHardOwnershipId::operator!= (const AcDbStub *) const
 bool  | AcDbSoftOwnershipId::operator!= (const AcDbObjectId &) const
 bool  | AcDbSoftOwnershipId::operator!= (const AcDbStub *) const
 bool  | AcDbHardPointerId::operator!= (const AcDbObjectId &) const
 bool  | AcDbHardPointerId::operator!= (const AcDbStub *) const
 bool  | AcDbSoftPointerId::operator!= (const AcDbObjectId &) const
 bool  | AcDbSoftPointerId::operator!= (const AcDbStub *) const
 AcDbHandle  | AcDbHandle::operator+ (const AcDbHandle &) const
 AcDbHandle  | AcDbHandle::operator+ (Adesk::ULongPtr) const
 const AcDbDate  | AcDbDate::operator+ (const AcDbDate &date) const
 AcDbHandle &  | AcDbHandle::operator++ ()
 AcDbHandle  | AcDbHandle::operator++ (int)
 const AcDbDate  | AcDbDate::operator- (const AcDbDate &date) const
 const T_OBJECT *  | AcDbObjectPointerBase< T_OBJECT >::operator-> () const
 T_OBJECT *  | AcDbObjectPointerBase< T_OBJECT >::operator-> ()
 bool  | AcDbHandle::operator< (const AcDbHandle &) const
 bool  | AcDbR13ObjectId::operator< (const AcDbR13ObjectId &id) const
 bool  | AcDbDate::operator< (const AcDbDate &) const
 bool  | AcDbR13ObjectId::operator< (const AcDbStub *pStub) const
 bool  | AcDbR13ObjectId::operator<= (const AcDbR13ObjectId &id) const
 bool  | AcDbDate::operator<= (const AcDbDate &) const
 bool  | AcDbR13ObjectId::operator<= (const AcDbStub *pStub) const
 AcDbHandle &  | AcDbHandle::operator= (const AcDbHandle &)
 AcDbObjectId &  | AcDbObjectId::operator= (const AcDbObjectId &)
 AcDbObjectId &  | AcDbObjectId::operator= (const AcDbStub *)
 AcDbDimData &  | AcDbDimData::operator= (const AcDbDimData &)
 AcDbHandle &  | AcDbHandle::operator= (Adesk::UInt32)
 AcDbHardOwnershipId &  | AcDbHardOwnershipId::operator= (const AcDbHardOwnershipId &)
 AcDbHardOwnershipId &  | AcDbHardOwnershipId::operator= (const AcDbObjectId &)
 AcDbHardOwnershipId &  | AcDbHardOwnershipId::operator= (const AcDbStub *)
 AcDbSoftOwnershipId &  | AcDbSoftOwnershipId::operator= (const AcDbSoftOwnershipId &)
 AcDbSoftOwnershipId &  | AcDbSoftOwnershipId::operator= (const AcDbObjectId &)
 AcDbSoftOwnershipId &  | AcDbSoftOwnershipId::operator= (const AcDbStub *)
 AcDbHardPointerId &  | AcDbHardPointerId::operator= (const AcDbHardPointerId &)
 AcDbHardPointerId &  | AcDbHardPointerId::operator= (const AcDbObjectId &)
 AcDbHardPointerId &  | AcDbHardPointerId::operator= (const AcDbStub *)
 AcDbSoftPointerId &  | AcDbSoftPointerId::operator= (const AcDbSoftPointerId &)
 AcDbSoftPointerId &  | AcDbSoftPointerId::operator= (const AcDbObjectId &)
 AcDbSoftPointerId &  | AcDbSoftPointerId::operator= (const AcDbStub *)
 AcDbGripData &  | AcDbGripData::operator= (const AcDbGripData &)
 bool  | AcDbSubentId::operator== (const AcDbSubentId &id) const
 bool  | AcDbHandle::operator== (const AcDbHandle &) const
 bool  | AcDbR13ObjectId::operator== (const AcDbR13ObjectId &id) const
 bool  | AcDbR13ObjectId::operator== (const AcDbStub *pStub) const
 bool  | AcDbHardOwnershipId::operator== (const AcDbObjectId &) const
 bool  | AcDbHardOwnershipId::operator== (const AcDbStub *) const
 bool  | AcDbSoftOwnershipId::operator== (const AcDbObjectId &) const
 bool  | AcDbSoftOwnershipId::operator== (const AcDbStub *) const
 bool  | AcDbHardPointerId::operator== (const AcDbObjectId &) const
 bool  | AcDbHardPointerId::operator== (const AcDbStub *) const
 bool  | AcDbSoftPointerId::operator== (const AcDbObjectId &) const
 bool  | AcDbSoftPointerId::operator== (const AcDbStub *) const
 bool  | AcDbHandle::operator> (const AcDbHandle &) const
 bool  | AcDbR13ObjectId::operator> (const AcDbR13ObjectId &id) const
 bool  | AcDbR13ObjectId::operator> (const AcDbStub *pStub) const
 bool  | AcDbR13ObjectId::operator>= (const AcDbR13ObjectId &id) const
 bool  | AcDbR13ObjectId::operator>= (const AcDbStub *pStub) const
 Adesk::Int16  | AcDbAppSystemVariables::osmode () const
 AcDbGraphNode *  | AcDbGraphNode::out (int) const
 AcDbGraph *  | AcDbGraphNode::owner () const
 AcDbObjectId  | AcDbDimData::ownerId () const
 Adesk::Int16  | AcDbAppSystemVariables::pickstyle () const
 void  | pixelToModel (const AcGeMatrix3d &pixToMod, const AcGePoint2d &pixPt, AcGePoint3d &modPt)
 AcDbObjectId  | AcGiStyleAttributes::plotStyleNameId () const
 RasterImageDefImp *  | AcDbRasterImageDef::ptrImp () const
 RasterImageImp *  | AcDbRasterImage::ptrImp () const
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (AcDbHardOwnershipId *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (AcDbSoftOwnershipId *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (AcDbHardPointerId *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (AcDbSoftPointerId *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (ACHAR **)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (ads_binary *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (AcDbHandle *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (Adesk::Int32 *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (Adesk::Int16 *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (Adesk::Int8 *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (Adesk::UInt32 *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (Adesk::UInt16 *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (Adesk::UInt8 *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (Adesk::Boolean *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (bool *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (double *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (AcGePoint2d *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (AcGePoint3d *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (AcGeVector2d *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (AcGeVector3d *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (AcGeScale3d *)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (void *, Adesk::UInt32)
 Acad::ErrorStatus  | AcDbDwgFiler::readItem (void **)
 Acad::ErrorStatus  | AcDbDxfFiler::readItem (resbuf *pItem)
 Acad::ErrorStatus  | AcDbObjectPointerBase< T_OBJECT >::release (T_OBJECT *&pReleasedObj)
 int  | AcDbHandle::restZeros (int i) const
 AcDbGraphNode *  | AcDbGraph::rootNode () const
 GripRtClkHandler  | AcDbGripData::rtClk () const
 void  | AcDbGripData::setAllData (const AcGePoint3d &, void *, GripOperationPtr hotGrip=NULL, GripOperationPtr hoverGrip=NULL, GripRtClkHandler RtClk=NULL, GripWorldDrawPtr wd=NULL, GripViewportDrawPtr vd=NULL, GripOpStatusPtr stat=NULL, GripToolTipPtr tt=NULL, GripDimensionPtr hoverDim=NULL, GripDimensionPtr hotGripDim=NULL, unsigned int bitFlags=0, AcGePoint3d *altBasePt=NULL, GripInputPointPtr inputPointFunc=NULL, AcRxClass *appDataAcRxClass=NULL)
 void  | AcDbGripData::setAlternateBasePoint (AcGePoint3d *altBasePt)
 Acad::ErrorStatus  | AcDbDimData::setAppData (void *appData)
 void  | AcDbGripData::setAppData (void *appData)
 void  | AcDbGripData::setAppDataAcRxClass (AcRxClass *pClass)
 Acad::ErrorStatus  | AcDbDimData::setBitFlags (unsigned int flags)
 void  | AcDbGripData::setBitFlags (unsigned int flags)
 void  | AcDbXrefGraphNode::setBtrId (const AcDbObjectId &id)
 void  | AcGiStyleAttributes::setColorAttribute (const AcCmEntityColor &color)
 Acad::ErrorStatus  | AcDbDimData::setConstrain (bool bValue)
 Acad::ErrorStatus  | AcDbDimData::setCustomDimValue (bool custom)
 Acad::ErrorStatus  | AcDbDimData::setCustomString (bool bValue)
 Acad::ErrorStatus  | AcDbDimData::setCustomStringFunc (DimDataSetCustomStringFuncPtr funcPtr)
 void  | AcDbGraphNode::setData (void *)
 void  | AcDbXrefGraphNode::setDatabase (AcDbDatabase *pDb)
 Acad::ErrorStatus  | AcDbDimData::setDimDeltaAngle (bool bValue)
 Acad::ErrorStatus  | AcDbDimData::setDimDeltaLength (bool bValue)
 Acad::ErrorStatus  | AcDbDimData::setDimEditable (bool editable)
 Acad::ErrorStatus  | AcDbDimData::setDimension (AcDbDimension *pDim)
 Acad::ErrorStatus  | AcDbDimData::setDimFocal (bool focal)
 Acad::ErrorStatus  | AcDbDimData::setDimHideIfValueIsZero (bool hide)
 Acad::ErrorStatus  | AcDbDimData::setDimInvisible (bool invisible)
 Acad::ErrorStatus  | AcDbDimData::setDimRadius (bool bValue)
 Acad::ErrorStatus  | AcDbDimData::setDimResultantAngle (bool bValue)
 Acad::ErrorStatus  | AcDbDimData::setDimResultantLength (bool bValue)
 Acad::ErrorStatus  | AcDbDimData::setDimValueFunc (DimDataSetValueFuncPtr funcPtr)
 void  | AcDbGripData::setDrawAtDragImageGripPoint (bool atDragPoint)
 virtual void  | AcDbHyperlink::setFlags (const long lFlags)
 void  | AcDbGripData::setForcedPickOn (bool on)
 AcDbObjectId &  | AcDbObjectId::setFromOldId (Adesk::IntDbId oldId)
 void  | AcDbGripData::setGizmosEnabled (bool on)
 void  | AcDbGripData::setGripIsPerViewport (bool on)
 void  | AcDbGripData::setGripOpStatFunc (GripOpStatusPtr pFunc)
 void  | AcDbGripData::setGripPoint (const AcGePoint3d &pt)
 void  | AcDbHandle::setHigh (Adesk::UInt32 high)
 void  | AcDbGripData::setHotGripDimensionFunc (GripDimensionPtr pFunc)
 void  | AcDbGripData::setHotGripFunc (GripOperationPtr pFunc)
 void  | AcDbGripData::setHoverDimensionFunc (GripDimensionPtr pFunc)
 void  | AcDbGripData::setHoverFunc (GripOperationPtr pFunc)
 void  | AcDbSubentId::setIndex (Adesk::GsMarker)
 void  | AcDbGripData::setInputPointFunc (GripInputPointPtr pFunc)
 void  | AcDbIdPair::setIsCloned (bool isCloned)
 void  | AcDbIdPair::setIsOwnerXlated (bool isOwnerXlated)
 void  | AcDbIdPair::setIsPrimary (bool isPrimary)
 void  | AcDbIdPair::setKey (AcDbObjectId)
 void  | AcGiStyleAttributes::setLinetypeObjectId (const AcDbObjectId &newId)
 void  | AcDbHandle::setLow (Adesk::UInt32 low)
 void  | AcDbGripData::setMapGripHotToRtClk (bool on)
 void  | AcDbObjectId::setNull ()
 void  | AcDbHandle::setNull ()
 Acad::ErrorStatus  | AcDbDimData::setOwnerId (const AcDbObjectId &objId)
 void  | AcGiStyleAttributes::setPlotStyleName (const AcDbObjectId &newId)
 RasterImageDefImp *  | AcDbRasterImageDef::setPtrImp (RasterImageDefImp *pImp)
 RasterImageImp *  | AcDbRasterImage::setPtrImp (RasterImageImp *pImp)
 void  | AcDbGripData::setRtClk (GripRtClkHandler pFunc)
 void  | AcDbGripData::setSkipWhenShared (bool skip)
 void  | AcDbGripData::setToolTipFunc (GripToolTipPtr pFunc)
 void  | AcDbGripData::setTriggerGrip (bool trigger)
 void  | AcDbSubentId::setType (AcDb::SubentType)
 void  | AcDbSubentId::setTypeClass (AcRxClass *pClass)
 void  | AcDbIdPair::setValue (AcDbObjectId)
 void  | AcDbGripData::setViewportDraw (GripViewportDrawPtr pFunc)
 void  | AcDbGripData::setWorldDraw (GripWorldDrawPtr pFunc)
 void  | AcDbXrefGraphNode::setXrefNotificationStatus (AcDb::XrefNotificationStatus stat)
 void  | AcDbXrefGraphNode::setXrefStatus (AcDb::XrefStatus stat)
 bool  | AcDbGripData::skipWhenShared () const
 const AcDbSubentId  | AcDbFullSubentPath::subentId () const
 AcDbSubentId &  | AcDbFullSubentPath::subentId ()
 const AcDbDate &  | AcDbDate::subtract (const AcDbDate &date)
 GripToolTipPtr  | AcDbGripData::toolTipFunc () const
 AcDbGraphNode *  | AcDbGraphStack::top () const
 bool  | AcDbGripData::triggerGrip () const
 AcDb::SubentType  | AcDbSubentId::type () const
 AcRxClass *  | AcDbSubentId::typeClass () const
 AcDbObjectId  | AcDbIdPair::value () const
 GripViewportDrawPtr  | AcDbGripData::viewportDraw () const
 GripWorldDrawPtr  | AcDbGripData::worldDraw () const
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const AcDbHardOwnershipId &)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const AcDbSoftOwnershipId &)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const AcDbHardPointerId &)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const AcDbSoftPointerId &)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const ACHAR *)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const ads_binary &)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const AcDbHandle &)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (Adesk::Int32)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (Adesk::Int16)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (Adesk::Int8)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (Adesk::UInt32)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (Adesk::UInt16)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (Adesk::UInt8)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (Adesk::Boolean)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (bool)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (double)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const AcGePoint2d &)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const AcGePoint3d &)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const AcGeVector2d &)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const AcGeVector3d &)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const AcGeScale3d &)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const void *, Adesk::UInt32)
 Acad::ErrorStatus  | AcDbDwgFiler::writeItem (const void *)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (const resbuf &pItem)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, const AcDbObjectId &)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, const ACHAR *)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, const ads_binary &)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, const AcDbHandle &)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, Adesk::Int64)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, Adesk::Int32)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, Adesk::Int16)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, Adesk::Int8)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, Adesk::UInt64)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, Adesk::UInt32)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, Adesk::UInt16)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, Adesk::UInt8)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, Adesk::Boolean)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, bool)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, double, int=kDfltPrec)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, const AcGePoint2d &, int=kDfltPrec)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, const AcGePoint3d &, int=kDfltPrec)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, const AcGeVector2d &, int=kDfltPrec)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, const AcGeVector3d &, int=kDfltPrec)
 Acad::ErrorStatus  | AcDbDxfFiler::writeItem (AcDb::DxfCode, const AcGeScale3d &, int=kDfltPrec)
 AcDbXrefGraphNode *  | AcDbXrefGraph::xrefNode (int idx) const
 AcDb::XrefNotificationStatus  | AcDbXrefGraphNode::xrefNotificationStatus () const
 AcDb::XrefStatus  | AcDbXrefGraphNode::xrefStatus () const
 Variables
 const Adesk::UInt32  | kBadUInt32Handle = 0xFFFFFFFF
 ZRX_DB_EXPORT_GLOBAL const
 AcDbSubentId  | kNullSubentId
 const Adesk::GsMarker  | kNullSubentIndex = 0
 T_OBJECT *  | AcDbObjectPointerBase< T_OBJECT >::m_ptr
 Acad::ErrorStatus  | AcDbObjectPointerBase< T_OBJECT >::m_status
Detailed Description
Function Documentation
 Acad::ErrorStatus acdbGetBreakSubentIndex  |  ( |  AcDbEntity *  |  pEnt,
|  const AcGePoint3d &  |  pickPt,
|  const AcGeVector3d &  |  viewDir,
|  int &  |  subentIndex,
|  AcGePoint3d &  |  ptOnEnt,
|  const AcGeTol &  |  tol = AcGeContext::gTol
)
Warning
Not implemented!