Macros | Typedefs | Enumerations | Functions
Global Functions
 Macros
 #define  | acdbRestoreAcisEntityFromDwgFiler acdbAcisRestoreEntityFromDwgFiler
 #define  | acdbSaveAcisEntityToDwgFiler acdbAcisSaveEntityToDwgFiler
 #define  | acdbTransactionManager acdbTransactionManagerPtr()
 #define  | acDocManager acDocManagerPtr()
 #define  | acedGetIDispatch ZwcadGetIDispatch
 #define  | acedServices AcEdServices::cast(acrxServiceDictionary->at(ACED_SERVICES))
 #define  | acProfileManager acProfileManagerPtr()
 #define  | actrTransactionManager acTransactionManagerPtr()
 #define  | DISABLE_CSTRING_PLUS_ACSTRING 1
 #define  | HELP_CONTENTS 0x0003L
 #define  | HELP_HELPONHELP 0x0004L
 #define  | HELP_PARTIALKEY 0x0105L
 Typedefs
 typedef
 AcDbSymbolUtilities::Services  | AcDbSymUtilServices
 typedef void(WINAPI *  | AcEdColorDialogCallbackFunction )(void *pCallbackData, const AcCmColor &newColor)
 typedef double  | acedDwgPoint [3]
 typedef BOOL(*  | AcedFilterWinMsgFn )(MSG *)
 typedef void(*  | AcedOnIdleMsgFn )()
 typedef void(*  | AcedWatchWinMsgFn )(const MSG *)
 typedef void(*  | acgsCustomUpdateMethod )(void *pParm, int left, int right, int bottom, int top)
 typedef HRESULT  | ADUI_LOADFN (IUnknown **ppZdUiRootNode)
 typedef HRESULT  | ADUI_SAVEFN (IUnknown *pZdUiRootNode)
 typedef AcArray
 < AcFdFieldReactor * >  | FieldReactors
 Enumerations
enum  | AcEdDrawOrderCmdType {
 kDrawOrderNone = 0, kDrawOrderBottom, kDrawOrderTop, kDrawOrderBelow,
 kDrawOrderAbove
 }
enum  | path_category { DRIVE_TYPE, UNC_TYPE, ROOT_TYPE, RELATIVE_TYPE }
enum  | path_type {
 NO_PATH = 0, NEW_PATH, WC_PATH, FILE_PATH,
 DIR_PATH, DEV_PATH
 }
enum  | PathErr {
 PATH_NOERR = 0, PATH_INVALID, PATH_BADOP, PATH_REFUSED,
 PATH_ERR
 }
 Functions
 void  | acad__assert (const ACHAR *, const ACHAR *, int)
 size_t  | acad__msize (void *p)
 ACHAR *  | acad__strdup (const ACHAR *p)
 void *  | acad_calloc (size_t num, size_t size)
 void  | acad_free (void *p)
 void *  | acad_malloc (size_t size)
 void *  | acad_realloc (void *p, size_t size)
 const ACHAR *  | acadErrorStatusText (Acad::ErrorStatus)
 AcDbDatabase *  | AcApGetDatabase (CView *pView)
 HRESULT AXAUTOEXP  | AcAxArrayPolar (AcDbObjectId &objId, LPDISPATCH pAppDisp, int numObjs, double fillAngle, VARIANT basePoint, VARIANT *pArrayObjs)
 HRESULT AXAUTOEXP  | AcAxArrayPolar (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, int numObjs, double fillAngle, VARIANT basePoint, VARIANT *pArrayObjs)
 HRESULT AXAUTOEXP  | AcAxArrayRectangular (AcDbObjectId &objId, LPDISPATCH pAppDisp, int numRows, int numCols, int numLvls, double disRows, double disCols, double disLvls, VARIANT *pArrayObjs)
 HRESULT AXAUTOEXP  | AcAxArrayRectangular (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, int numRows, int numCols, int numLvls, double disRows, double disCols, double disLvls, VARIANT *pArrayObjs)
 HRESULT AXAUTOEXP  | AcAxCopy (AcDbObjectId &objId, LPDISPATCH pAppDisp, LPDISPATCH *pCopyObj, AcDbObjectId ownerId=AcDbObjectId::kNull)
 HRESULT AXAUTOEXP  | AcAxCopy (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, LPDISPATCH *pCopyObj, AcDbObjectId ownerId=AcDbObjectId::kNull)
HRESULT AXAUTOEXP  | AcAxEnableShadowDisplay (AcDbObjectId &objId, bool *pEnabled)
HRESULT AXAUTOEXP  | AcAxEnableShadowDisplay (AcAxObjectRef &objRef, bool *pEnabled)
 HRESULT AXAUTOEXP  | AcAxErase (AcDbObjectId &objId)
 HRESULT AXAUTOEXP  | AcAxErase (AcAxObjectRef &objRef)
 HRESULT AXAUTOEXP  | AcAxGetBoundingBox (AcDbObjectId &objId, VARIANT *minPoint, VARIANT *maxPoint)
 HRESULT AXAUTOEXP  | AcAxGetBoundingBox (AcAxObjectRef &objRef, VARIANT *minPoint, VARIANT *maxPoint)
 HRESULT AXAUTOEXP  | AcAxGetColor (AcDbObjectId &objId, AcColor *pColor)
 HRESULT AXAUTOEXP  | AcAxGetColor (AcAxObjectRef &objRef, AcColor *pColor)
 HRESULT AXAUTOEXP  | AcAxGetDatabase (AcDbDatabase *pDb, LPDISPATCH pAppDisp, LPDISPATCH *pDisp)
 HRESULT AXAUTOEXP  | AcAxGetExtensionDictionary (AcDbObjectId &objId, LPDISPATCH pAppDisp, IAcadDictionary **pExtDictionary)
 HRESULT AXAUTOEXP  | AcAxGetExtensionDictionary (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, IAcadDictionary **pExtDictionary)
 HRESULT AXAUTOEXP  | AcAxGetHandle (AcDbObjectId &objId, BSTR *pHandle)
 HRESULT AXAUTOEXP  | AcAxGetHandle (AcAxObjectRef &objRef, BSTR *pHandle)
 HRESULT AXAUTOEXP  | AcAxGetHyperlinks (AcDbObjectId &objId, LPDISPATCH pAppDisp, IAcadHyperlinks **pHyperlinks)
 HRESULT AXAUTOEXP  | AcAxGetHyperlinks (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, IAcadHyperlinks **pHyperlinks)
 HRESULT AXAUTOEXP  | AcAxGetIUnknownOfObject (LPUNKNOWN *ppUnk, AcDbObjectId &objId, LPDISPATCH pApp)
 HRESULT AXAUTOEXP  | AcAxGetIUnknownOfObject (LPUNKNOWN *ppUnk, AcDbObject *pObj, LPDISPATCH pApp)
 HRESULT AXAUTOEXP  | AcAxGetLayer (AcDbObjectId &objId, BSTR *pLayer)
 HRESULT AXAUTOEXP  | AcAxGetLayer (AcAxObjectRef &objRef, BSTR *pLayer)
 HRESULT AXAUTOEXP  | AcAxGetLinetype (AcDbObjectId &objId, BSTR *pLinetype)
 HRESULT AXAUTOEXP  | AcAxGetLinetype (AcAxObjectRef &objRef, BSTR *pLinetype)
 HRESULT AXAUTOEXP  | AcAxGetLinetypeScale (AcDbObjectId &objId, double *pLinetypeScale)
 HRESULT AXAUTOEXP  | AcAxGetLinetypeScale (AcAxObjectRef &objRef, double *pLinetypeScale)
 HRESULT AXAUTOEXP  | AcAxGetLineWeight (AcDbObjectId &objId, ACAD_LWEIGHT *lineWeight)
 HRESULT AXAUTOEXP  | AcAxGetLineWeight (AcAxObjectRef &objRef, ACAD_LWEIGHT *lineWeight)
HRESULT AXAUTOEXP  | AcAxGetMaterial (AcDbObjectId &objId, BSTR *pMaterial)
HRESULT AXAUTOEXP  | AcAxGetMaterial (AcAxObjectRef &objRef, BSTR *pMaterial)
 HRESULT AXAUTOEXP  | AcAxGetObjectName (AcDbObjectId &objId, BSTR *pName)
 HRESULT AXAUTOEXP  | AcAxGetObjectName (AcAxObjectRef &objRef, BSTR *pName)
 HRESULT AXAUTOEXP  | AcAxGetOwnerId (AcDbObjectId &objId, Adesk::IntDbId *pOwnerId)
 HRESULT AXAUTOEXP  | AcAxGetOwnerId (AcAxObjectRef &objRef, Adesk::IntDbId *pOwnerId)
 HRESULT AXAUTOEXP  | AcAxGetPlotStyleName (AcDbObjectId &objId, BSTR *plotStyleName)
 HRESULT AXAUTOEXP  | AcAxGetPlotStyleName (AcAxObjectRef &objRef, BSTR *plotStyleName)
HRESULT AXAUTOEXP  | AcAxGetShadowDisplay (AcDbObjectId &objId, AcShadowDisplayType *pShadowDisplay)
HRESULT AXAUTOEXP  | AcAxGetShadowDisplay (AcAxObjectRef &objRef, AcShadowDisplayType *pShadowDisplay)
 HRESULT AXAUTOEXP  | AcAxGetTrueColor (AcDbObjectId &objId, IAcadAcCmColor **pColor)
 HRESULT AXAUTOEXP  | AcAxGetTrueColor (AcAxObjectRef &objRef, IAcadAcCmColor **pColor)
 HRESULT AXAUTOEXP  | AcAxGetVisible (AcDbObjectId &objId, VARIANT_BOOL *pVisible)
 HRESULT AXAUTOEXP  | AcAxGetVisible (AcAxObjectRef &objRef, VARIANT_BOOL *pVisible)
 HRESULT AXAUTOEXP  | AcAxGetXData (AcDbObjectId &objId, BSTR bstrName, VARIANT *type, VARIANT *data)
 HRESULT AXAUTOEXP  | AcAxGetXData (AcAxObjectRef &objRef, BSTR bstrName, VARIANT *type, VARIANT *data)
 HRESULT AXAUTOEXP  | AcAxHasExtensionDictionary (AcDbObjectId &objId, VARIANT_BOOL *bHasDictionary)
 HRESULT AXAUTOEXP  | AcAxHasExtensionDictionary (AcAxObjectRef &objRef, VARIANT_BOOL *bHasDictionary)
 HRESULT AXAUTOEXP  | AcAxHighlight (AcDbObjectId &objId, VARIANT_BOOL bHighlight)
 HRESULT AXAUTOEXP  | AcAxHighlight (AcAxObjectRef &objRef, VARIANT_BOOL bHighlight)
 HRESULT AXAUTOEXP  | AcAxIntersectWith (AcDbObjectId &objId, LPDISPATCH pEntity, AcExtendOption option, VARIANT *intPoints)
 HRESULT AXAUTOEXP  | AcAxIntersectWith (AcAxObjectRef &objRef, LPDISPATCH pEntity, AcExtendOption option, VARIANT *intPoints)
 HRESULT AXAUTOEXP  | AcAxMirror (AcDbObjectId &objId, LPDISPATCH pAppDisp, VARIANT point1, VARIANT point2, LPDISPATCH *pMirrorObj)
 HRESULT AXAUTOEXP  | AcAxMirror (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, VARIANT point1, VARIANT point2, LPDISPATCH *pMirrorObj)
 HRESULT AXAUTOEXP  | AcAxMirror3D (AcDbObjectId &objId, LPDISPATCH pAppDisp, VARIANT point1, VARIANT point2, VARIANT point3, LPDISPATCH *pMirrorObj)
 HRESULT AXAUTOEXP  | AcAxMirror3D (AcAxObjectRef &objRef, LPDISPATCH pAppDisp, VARIANT point1, VARIANT point2, VARIANT point3, LPDISPATCH *pMirrorObj)
 HRESULT AXAUTOEXP  | AcAxMove (AcDbObjectId &objId, VARIANT fromPoint, VARIANT toPoint)
 HRESULT AXAUTOEXP  | AcAxMove (AcAxObjectRef &objRef, VARIANT fromPoint, VARIANT toPoint)
 HRESULT AXAUTOEXP  | AcAxPutColor (AcDbObjectId &objId, AcColor color)
 HRESULT AXAUTOEXP  | AcAxPutColor (AcAxObjectRef &objRef, AcColor color)
 HRESULT AXAUTOEXP  | AcAxPutLayer (AcDbObjectId &objId, BSTR layer)
 HRESULT AXAUTOEXP  | AcAxPutLayer (AcAxObjectRef &objRef, BSTR layer)
 HRESULT AXAUTOEXP  | AcAxPutLinetype (AcDbObjectId &objId, BSTR linetype)
 HRESULT AXAUTOEXP  | AcAxPutLinetype (AcAxObjectRef &objRef, BSTR linetype)
 HRESULT AXAUTOEXP  | AcAxPutLinetypeScale (AcDbObjectId &objId, double linetypeScale)
 HRESULT AXAUTOEXP  | AcAxPutLinetypeScale (AcAxObjectRef &objRef, double linetypeScale)
 HRESULT AXAUTOEXP  | AcAxPutLineWeight (AcDbObjectId &objId, ACAD_LWEIGHT lineWeight)
 HRESULT AXAUTOEXP  | AcAxPutLineWeight (AcAxObjectRef &objRef, ACAD_LWEIGHT lineWeight)
HRESULT AXAUTOEXP  | AcAxPutMaterial (AcDbObjectId &objId, BSTR material)
HRESULT AXAUTOEXP  | AcAxPutMaterial (AcAxObjectRef &objRef, BSTR material)
 HRESULT AXAUTOEXP  | AcAxPutPlotStyleName (AcDbObjectId &objId, BSTR plotStyleName)
 HRESULT AXAUTOEXP  | AcAxPutPlotStyleName (AcAxObjectRef &objRef, BSTR plotStyleName)
HRESULT AXAUTOEXP  | AcAxPutShadowDisplay (AcDbObjectId &objId, AcShadowDisplayType shadowDisplay)
HRESULT AXAUTOEXP  | AcAxPutShadowDisplay (AcAxObjectRef &objRef, AcShadowDisplayType shadowDisplay)
 HRESULT AXAUTOEXP  | AcAxPutTrueColor (AcDbObjectId &objId, IAcadAcCmColor *color)
 HRESULT AXAUTOEXP  | AcAxPutTrueColor (AcAxObjectRef &objRef, IAcadAcCmColor *color)
 HRESULT AXAUTOEXP  | AcAxPutVisible (AcDbObjectId &objId, VARIANT_BOOL visible)
 HRESULT AXAUTOEXP  | AcAxPutVisible (AcAxObjectRef &objRef, VARIANT_BOOL visible)
 HRESULT AXAUTOEXP  | AcAxRotate (AcDbObjectId &objId, VARIANT basePoint, double rotationAngle)
 HRESULT AXAUTOEXP  | AcAxRotate (AcAxObjectRef &objRef, VARIANT basePoint, double rotationAngle)
 HRESULT AXAUTOEXP  | AcAxRotate3D (AcDbObjectId &objId, VARIANT point1, VARIANT point2, double rotationAngle)
 HRESULT AXAUTOEXP  | AcAxRotate3D (AcAxObjectRef &objRef, VARIANT point1, VARIANT point2, double rotationAngle)
 HRESULT AXAUTOEXP  | AcAxScaleEntity (AcDbObjectId &objId, VARIANT basePoint, double scaleFactor)
 HRESULT AXAUTOEXP  | AcAxScaleEntity (AcAxObjectRef &objRef, VARIANT basePoint, double scaleFactor)
 HRESULT AXAUTOEXP  | AcAxSetXData (AcDbObjectId &objId, VARIANT type, VARIANT data)
 HRESULT AXAUTOEXP  | AcAxSetXData (AcAxObjectRef &objRef, VARIANT type, VARIANT data)
 HRESULT AXAUTOEXP  | AcAxTransformBy (AcDbObjectId &objId, VARIANT transMatrix)
 HRESULT AXAUTOEXP  | AcAxTransformBy (AcAxObjectRef &objRef, VARIANT transMatrix)
 HRESULT AXAUTOEXP  | AcAxUpdate (AcDbObjectId &objId)
 HRESULT AXAUTOEXP  | AcAxUpdate (AcAxObjectRef &objRef)
void  | acByteSwap (wchar_t &wch)
 Acad::ErrorStatus  | accmGetColorFromACIName (AcCmColor &clr, const ACHAR *pInput)
 Acad::ErrorStatus  | accmGetColorFromColorBookName (AcCmColor &clr, const ACHAR *pBookName, const ACHAR *pColorName)
 Acad::ErrorStatus  | accmGetColorFromRGBName (AcCmColor &clr, const ACHAR *pInput)
 void  | accmGetLocalizedColorNames (const ACHAR *colors[9])
 void  | acdbAcisDeleteModelerBulletins (void)
 Adesk::Boolean  | acdbAcisGetDeleteBulletins ()
 Acad::ErrorStatus  | acdbAcisRestoreEntityFromDwgFiler (AcDbDwgFiler *filer, ENTITY *&ent)
 Acad::ErrorStatus  | acdbAcisRestoreEntityFromDxfFiler (AcDbDxfFiler *filer, ENTITY *&ent)
 Acad::ErrorStatus  | acdbAcisSaveEntityToDwgFiler (AcDbDwgFiler *filer, ENTITY *ent)
 Acad::ErrorStatus  | acdbAcisSaveEntityToDxfFiler (AcDbDxfFiler *filer, ENTITY *ent)
 void  | acdbAcisSetDeleteBulletins (Adesk::Boolean onOff)
 AcDbVoidPtrArray *  | acdbActiveDatabaseArray ()
 Acad::ErrorStatus  | acdbAddFieldReactor (AcFdFieldReactor *pReactor)
 void *  | acdbAlloc (size_t)
 int  | acdbAngToF (const ACHAR *str, int unit, ads_real *v)
 int  | acdbAngToS (ads_real v, int unit, int prec, ACHAR *str)
 Acad::ErrorStatus  | acdbAttachXref (AcDbDatabase *pHostDb, const ACHAR *pFilename, const ACHAR *pBlockName, AcDbObjectId &xrefBlkId)
Acad::ErrorStatus  | acdbBindXrefs (AcDbDatabase *pHostDb, const AcDbObjectIdArray &xrefBlkIds, const bool bInsertBind, const bool bAllowUnresolved=false, const bool bQuiet=true)
 bool  | acdbCanonicalToSystemRange (int eUnits, const AcString &strIn, AcString &strOut)
 Acad::ErrorStatus  | acdbCleanUp ()
 Acad::ErrorStatus  | acdbClearSetupForLayouts (unsigned int contextHandle)
ACDB_PORT Acad::ErrorStatus  | acdbConvertFieldsToText (AcDbDatabase *pDb, const AcStringArray *pEvalIds, AcFd::ConvertFieldToText nOption)
ACDB_PORT Acad::ErrorStatus  | acdbConvertFieldsToText (const AcDbObjectIdArray &objIds, const AcStringArray *pEvalIds, AcFd::ConvertFieldToText nOption)
ACDB_PORT void  | acdbConvertHslToRgb (const AcGeVector3d &hsl, AcGeVector3d &rgb)
ACDB_PORT void  | acdbConvertRgbToHsl (const AcGeVector3d &rgb, AcGeVector3d &hsl)
Acad::ErrorStatus  | acdbCopyLayout (const ACHAR *copyname, const ACHAR *newname, AcDbDatabase *pDb=NULL)
 Acad::ErrorStatus  | acdbCreateViewByViewport (AcDbDatabase *pDb, AcDbObjectId viewportId, const ACHAR *name, const ACHAR *categoryName, AcDbObjectId labelBlockId, AcDbObjectId &view)
 AcDbCustomOsnapManager *  | acdbCustomOsnapManager ()
Acad::ErrorStatus  | acdbDeleteLayout (const ACHAR *delname, AcDbDatabase *pDb=NULL)
 Acad::ErrorStatus  | acdbDetachXref (AcDbDatabase *pHostDb, const AcDbObjectId &xrefBlkId)
 int  | acdbDictAdd (const ads_name dictname, const ACHAR *symname, const ads_name newobj)
 struct resbuf *  | acdbDictNext (const ads_name dict, int rewind)
 int  | acdbDictRemove (const ads_name dictname, const ACHAR *symname)
 int  | acdbDictRename (const ads_name dictname, const ACHAR *oldsym, const ACHAR *newsym)
 struct resbuf *  | acdbDictSearch (const ads_name dict, const ACHAR *sym, int setnext)
 bool  | acdbDisplayPreviewFromDwg (const ACHAR *pszDwgfilename, void *pPreviewWnd, const Adesk::UInt32 *pBgColor=NULL)
 int  | acdbDisToF (const ACHAR *str, int unit, ads_real *v)
 Acad::ErrorStatus  | acdbDoSetupForLayouts (AcDbDatabase *pDatabase, unsigned int &contextHandle)
 bool ADESK_STDCALL  | acdbDwkFileExists (const ACHAR *pszFileName)
 Acad::ErrorStatus  | acdbDxfOutAs2000 (AcDbDatabase *pDb, const ACHAR *fileName, const int precision=16)
Acad::ErrorStatus  | acdbDxfOutAs2004 (AcDbDatabase *pDb, const ACHAR *fileName, const int precision=16)
 Acad::ErrorStatus  | acdbDxfOutAsR12 (AcDbDatabase *pDb, const ACHAR *fileName, const int precision=16)
 bool  | acdbEcs2Ucs (ads_point p, ads_point q, ads_point norm, bool vec)
 bool  | acdbEcs2Wcs (ads_point p, ads_point q, ads_point norm, bool vec)
 int  | acdbEntDel (const ads_name ent)
 struct resbuf *  | acdbEntGet (const ads_name ent)
 struct resbuf *  | acdbEntGetX (const ads_name ent, const struct resbuf *args)
 int  | acdbEntLast (ads_name result)
 int  | acdbEntMake (const struct resbuf *ent)
 int  | acdbEntMakeX (const struct resbuf *entm, ads_name result)
 int  | acdbEntMod (const struct resbuf *ent)
 int  | acdbEntNext (const ads_name ent, ads_name result)
 int  | acdbEntUpd (const ads_name ent)
 ACDB_PORT Acad::ErrorStatus  | acdbEvaluateFields (const AcDbObjectId &objId, int nContext, const ACHAR *pszPropName=NULL, AcDbDatabase *pDb=NULL, AcFd::EvalFields nEvalFlag=AcFd::kEvalRecursive, int *pNumFound=NULL, int *pNumEvaluated=NULL)
 ACDB_PORT Acad::ErrorStatus  | acdbEvaluateFields (const AcDbObjectId &objId, int nContext, const AcDbObjectIdArray *pFieldsToEvaluate, const ACHAR *pszEvaluatorId, AcDbDatabase *pDb, AcFd::EvalFields nEvalFlag, int *pNumFound, int *pNumEvaluated)
 ACDB_PORT Acad::ErrorStatus  | acdbEvaluateFields (const AcDbObjectIdArray &objIds, int nContext, const ACHAR *pszPropName=NULL, AcDbDatabase *pDb=NULL, AcFd::EvalFields nEvalFlag=AcFd::kEvalRecursive, int *pNumFound=NULL, int *pNumEvaluated=NULL)
 ACDB_PORT Acad::ErrorStatus  | acdbEvaluateFields (const AcDbObjectIdArray &objIds, int nContext, const AcDbObjectIdArray *pFieldsToEvaluate, const ACHAR *pszEvaluatorId, AcDbDatabase *pDb, AcFd::EvalFields nEvalFlag, int *pNumFound, int *pNumEvaluated)
 void  | acdbFail (const ACHAR *str)
 ACDB_PORT bool  | acdbFindField (const ACHAR *pszText, int iSearchFrom, int &nStartPos, int &nEndPos)
 Acad::ErrorStatus  | acdbForceTextAdjust (const AcDbObjectIdArray &objIds)
 void  | acdbFree (void *)
 void  | acdbFreeResBufContents (resbuf *pField)
 Acad::ErrorStatus  | acdbGetAdsName (ads_name &objName, AcDbObjectId objId)
bool  | acdbGetArcLengthSymbolPlacement (AcDbObject *pObj, int &nValue)
ACDB_PORT AcDbUnderlayHost *  | acdbGetCurrentDgnDocHost ()
ACDB_PORT AcDbUnderlayHost *  | acdbGetCurrentDgnHost ()
ACDB_PORT AcDbUnderlayHost *  | acdbGetCurrentDwfHost ()
 AcDbObjectId  | acdbGetCurVportId (AcDbDatabase *pDb)
AcDbObjectId  | acdbGetCurVportTableRecordId (AcDbDatabase *pDb)
 bool  | acdbGetDimAngExtOn (AcDbObject *pObj, int &dimExtFlag)
 Acad::ErrorStatus  | acdbGetDimAssocId (AcDbObjectId dimId, AcDbObjectId &dimAssocId)
 Acad::ErrorStatus  | acdbGetDimAssocIds (AcDbObjectId entId, AcDbObjectIdArray &dimAssocIds)
bool  | acdbGetDimBreakSize (AcDbObject *pObj, double &dimBreakSize)
bool  | acdbGetDimExt1Linetype (AcDbObject *pObj, AcDbObjectId &oidValue)
bool  | acdbGetDimExt2Linetype (AcDbObject *pObj, AcDbObjectId &oidValue)
bool  | acdbGetDimExtensionLength (AcDbObject *pObj, double &fValue)
bool  | acdbGetDimFlipArrow (AcDbObject *pObj, int &nValue)
bool  | acdbGetDimFlipArrowWhich (AcDbObject *pObj, int &nValue)
 bool  | acdbGetDimJogSymbolPosition (AcDbObject *pObj, int &dimJagFlag, AcGePoint3d &pos)
bool  | acdbGetDimJogSymbolSize (AcDbObject *pObj, int &dimJagFlag, double &dimJagSize)
bool  | acdbGetDimLineLinetype (AcDbObject *pObj, AcDbObjectId &oidValue)
 bool  | acdbGetDimTextBackground (AcDbObject *pObj, int &bgFlag, AcCmColor &bgColor)
bool  | acdbGetDimTolAlign (AcDbObject *pObj, int &dimTolAlignFlag)
 AcDbObjectId  | acdbGetDynDimStyleId (AcDbDatabase *pDb=NULL)
bool  | acdbGetExemptCheckFlag (AcDbObject *pObj, int &bitFlags)
 Acad::ErrorStatus  | acdbGetExtnames (bool &value, AcDbDatabase *pDb)
 ACDB_PORT AcFdFieldEngine *  | acdbGetFieldEngine (void)
 ACDB_PORT bool  | acdbGetFieldMarkers (const ACHAR *&pszPrefix, const ACHAR *&pszSuffix)
bool  | acdbGetFixedLengthExtLineEnabled (AcDbObject *pObj, int &nValue)
 Acad::ErrorStatus  | acdbGetHostDwgXrefGraph (AcDbDatabase *pHostDb, AcDbXrefGraph &graph, Adesk::Boolean includeGhosts=Adesk::kFalse)
bool  | acdbGetLargeRadDimJogAngle (AcDbObject *pObj, double &fJogAngle)
Acad::ErrorStatus SCENEDLLIMPEXP  | acdbGetMotionPathDictionary (AcDbDatabase *pDb, AcDbDictionary *&pDict, AcDb::OpenMode mode, bool createIfNonExist)
Acad::ErrorStatus SCENEDLLIMPEXP  | acdbGetMotionPathDictionary (AcDbDatabase *pDb, AcDbDictionary *&pDict, AcDb::OpenMode mode)
Acad::ErrorStatus SCENEDLLIMPEXP  | acdbGetNamedPathDictionary (AcDbDatabase *pDb, AcDbDictionary *&pDict, AcDb::OpenMode mode, bool createIfNonExist)
Acad::ErrorStatus SCENEDLLIMPEXP  | acdbGetNamedPathDictionary (AcDbDatabase *pDb, AcDbDictionary *&pDict, AcDb::OpenMode mode)
 Acad::ErrorStatus  | acdbGetObjectId (AcDbObjectId &objId, const ads_name objName)
 bool  | acdbGetPreviewBitmapFromDwg (const ACHAR *pszDwgfilename, HBITMAP *pPreviewBmp, HPALETTE *pRetPal)
 Acad::ErrorStatus  | acdbGetProxyInfo (AcDbObject *pObj, ACHAR *&dxfName, ACHAR *&className, ACHAR *&appName)
 bool  | acdbGetRadialExtensionAngles (AcDbObject *pObj, int &dimExtFlag, double &dimExtAng1, double &dimExtAng2)
 const ACHAR *  | acdbGetReservedString (AcDb::reservedStringEnumType reservedType, bool bGetLocalized=true)
 Acad::ErrorStatus  | acdbGetThumbnailBitmapFromDxfFile (const ACHAR *filename, void *&pBitmap)
 Acad::ErrorStatus  | acdbGetUnitsConversion (AcDb::UnitsValue from, AcDb::UnitsValue to, double &conversionFactor)
AcDbObjectId  | acdbGetViewportVisualStyle ()
 AcDb::DwgDataType  | acdbGroupCodeToType (AcDb::DxfCode pCode)
 int  | acdbHandEnt (const ACHAR *handle, ads_name entres)
 ACDB_PORT bool  | acdbHasFields (const ACHAR *pszText)
 AcDbHostApplicationServices *  | acdbHostApplicationServices ()
 int  | acdbHostAppMinorVersion ()
 int  | acdbInters (const ads_point from1, const ads_point to1, const ads_point from2, const ads_point to2, int teston, ads_point result)
 bool  | acdbIsCustomObject (const AcDbObjectId &id)
bool  | acdbIsInLongTransaction (AcDbObjectId id)
 Adesk::Boolean  | acdbIsModelerStarted ()
 bool  | acdbIsPersistentReactor (void *pSomething)
 bool  | acdbIsReservedString (const ACHAR *strString, AcDb::reservedStringEnumType reservedType)
 bool  | acdbIsTransSpatial (const AcDbFullSubentPath &idPath)
 Acad::ErrorStatus  | acdbLoadLineTypeFile (const ACHAR *ltname, const ACHAR *fname, AcDbDatabase *pDb)
 Acad::ErrorStatus  | acdbLoadMlineStyleFile (const ACHAR *sname, const ACHAR *fname)
ACDB_PORT Acad::ErrorStatus  | acdbMakeFieldCode (const ACHAR *pszFieldExpr, ACHAR *&pszFieldCode)
ACDB_PORT Acad::ErrorStatus  | acdbMakeFieldCode (const ACHAR *pszFieldExpr, ACHAR *&pszFieldCode, const ACHAR *pszEvalId, const ACHAR *pszFormat, const AcHyperlink *pHyperlink)
 void  | acdbModelerEnd ()
 void  | acdbModelerStart ()
 int  | acdbNamedObjDict (ads_name result)
 Acad::ErrorStatus  | acdbOleGetOriginalSelectedFontName (const AcDbOle2Frame *pOleEnt, ACHAR *&fontName)
 Acad::ErrorStatus  | acdbOleGetOriginalSelectedFontPointSize (const AcDbOle2Frame *pOleEnt, int &pointSize)
 Acad::ErrorStatus  | acdbOleGetOriginalSelectedTextSizeInAcadUnits (const AcDbOle2Frame *pOleEnt, double &sizeInZcadUnits)
 Acad::ErrorStatus  | acdbOleGetOriginalWidthHeight (const AcDbOle2Frame *pOleEnt, double &width, double &height)
 Acad::ErrorStatus  | acdbOleGetRotationMatrix (const AcDbOle2Frame *pOleEnt, AcGeMatrix3d &rotMat)
 Acad::ErrorStatus  | acdbOleGetSelectedFontName (const AcDbOle2Frame *pOleEnt, ACHAR *&fontName)
 Acad::ErrorStatus  | acdbOleGetSelectedFontPointSize (const AcDbOle2Frame *pOleEnt, int &pointSize)
 Acad::ErrorStatus  | acdbOleGetSelectedTextSizeInAcadUnits (const AcDbOle2Frame *pOleEnt, double &sizeInZcadUnits)
 Acad::ErrorStatus  | acdbOleHitTest (const AcDbOle2Frame *pOleEnt, const AcGePoint3d &wvpt, const AcGeVector3d &wvwdir)
 Acad::ErrorStatus  | acdbOleSetOriginalSelectedFontName (const AcDbOle2Frame *pOleEnt, const ACHAR *fontName)
 Acad::ErrorStatus  | acdbOleSetOriginalSelectedFontPointSize (const AcDbOle2Frame *pOleEnt, const int pointSize)
 Acad::ErrorStatus  | acdbOleSetOriginalSelectedTextSizeInAcadUnits (const AcDbOle2Frame *pOleEnt, const double sizeInZcadUnits)
 Acad::ErrorStatus  | acdbOleSetOriginalWidthHeight (const AcDbOle2Frame *pOleEnt, const double width, const double height)
 Acad::ErrorStatus  | acdbOleSetSelectedFontName (const AcDbOle2Frame *pOleEnt, const ACHAR *fontName)
 Acad::ErrorStatus  | acdbOleSetSelectedFontPointSize (const AcDbOle2Frame *pOleEnt, const int pointSize)
 Acad::ErrorStatus  | acdbOleSetSelectedTextSizeInAcadUnits (const AcDbOle2Frame *pOleEnt, const double sizeInZcadUnits)
 Acad::ErrorStatus  | acdbOpenAcDbEntity (AcDbEntity *&pEnt, AcDbObjectId id, AcDb::OpenMode mode, bool openErasedEntity=false)
 Acad::ErrorStatus  | acdbOpenAcDbObject (AcDbObject *&pObj, AcDbObjectId id, AcDb::OpenMode mode, bool openErasedObject=false)
 Acad::ErrorStatus ADESK_STDCALL  | acdbOpenAcDbObject (AcDbObject *&pObj, AcDbObjectId id, AcDb::OpenMode mode, const AcRxClass *pClass, bool openErasedObject=false)
 template<class T_OBJECT >
Acad::ErrorStatus  | acdbOpenObject (T_OBJECT *&pObj, AcDbObjectId id, AcDb::OpenMode mode, bool openErased=false)
 Acad::ErrorStatus  | acdbOpenObject (AcDbObject *&pObj, AcDbObjectId id, AcDb::OpenMode mode)
 Acad::ErrorStatus  | acdbOpenObject (AcDbEntity *&pEnt, AcDbObjectId id, AcDb::OpenMode mode)
 Acad::ErrorStatus  | acdbOpenObject (AcDbObject *&pObj, AcDbObjectId id, AcDb::OpenMode mode, bool openErased)
 Acad::ErrorStatus  | acdbOpenObject (AcDbEntity *&pEnt, AcDbObjectId id, AcDb::OpenMode mode, bool openErased)
 const ACHAR *  | acdbOriginalXrefFullPathFor (const AcDbDatabase *)
 Acad::ErrorStatus  | acdbOverlayXref (AcDbDatabase *pHostDb, const ACHAR *pFilename, const ACHAR *pBlockName, AcDbObjectId &xrefBlkId)
 AcDbObjectId  | acdbPersistentReactorObjectId (void *pSomething)
 Acad::ErrorStatus  | acdbPostDimAssoc (AcDbObjectId dimId, AcDbDimAssoc *pDimAssoc, AcDbObjectId &dimAssocId, bool isActive=true)
 int ADESK_STDCALL  | acdbQueueForRegen (const AcDbObjectId *pIdArray, int nNumIds)
 int  | acdbRawAngToF (const ACHAR *str, int unit, ads_real *v)
 int  | acdbRawAngToS (ads_real v, int unit, int prec, ACHAR *str)
 void *  | acdbRealloc (void *, size_t)
 int  | acdbRegApp (const ACHAR *appname)
 void  | acdbReleaseHostDwg (AcDbDatabase *pHostDb)
Acad::ErrorStatus  | acdbReloadXrefs (AcDbDatabase *pHostDb, const AcDbObjectIdArray &xrefBlkIds, bool bQuiet=true)
 Acad::ErrorStatus  | acdbRemoveFieldReactor (AcFdFieldReactor *pReactor)
Acad::ErrorStatus  | acdbRenameLayout (const ACHAR *oldname, const ACHAR *newname, AcDbDatabase *pDb=NULL)
 Acad::ErrorStatus  | acdbResolveCurrentXRefs (AcDbDatabase *pHostDb, bool useThreadEngine=true, bool doNewOnly=false)
 Acad::ErrorStatus  | acdbResurrectMeNow (const AcDbObjectId &id)
 int  | acdbRToS (ads_real val, int unit, int prec, ACHAR *str)
 Acad::ErrorStatus  | acdbSaveAs2000 (AcDbDatabase *pDb, const ACHAR *fileName)
 Acad::ErrorStatus  | acdbSaveAs2004 (AcDbDatabase *pDb, const ACHAR *fileName)
 Acad::ErrorStatus  | acdbSaveAsR14 (AcDbDatabase *pDb, const ACHAR *fileName)
 Acad::ErrorStatus  | acdbSendInitialDwgFileOpenComplete (AcDbDatabase *pDb)
 AcDbServices *  | acdbServices ()
 Adesk::Boolean  | acdbSetAcisDwgVer (int version)
bool  | acdbSetArcLengthSymbolPlacement (AcDbObject *pObj, int nValue, bool autoClearOverride=true)
Acad::ErrorStatus  | acdbSetBreak3dQueueForRegen (bool)
ACDB_PORT AcDbUnderlayHost *  | acdbSetCurrentDgnDocHost (AcDbUnderlayHost *pHost)
ACDB_PORT AcDbUnderlayHost *  | acdbSetCurrentDgnHost (AcDbUnderlayHost *pHost)
ACDB_PORT AcDbUnderlayHost *  | acdbSetCurrentDwfHost (AcDbUnderlayHost *pHost)
 AcGiContext *  | acdbSetDefaultAcGiContext (AcGiContext *)
 bool  | acdbSetDimAngExtOn (AcDbObject *pObj, int dimExtFlag)
bool  | acdbSetDimBreakSize (AcDbObject *pObj, double dimBreakSize, bool autoClearOverride=true)
bool  | acdbSetDimExt1Linetype (AcDbObject *pObj, AcDbObjectId oidValue, bool autoClearOverride=true)
bool  | acdbSetDimExt2Linetype (AcDbObject *pObj, AcDbObjectId oidValue, bool autoClearOverride=true)
bool  | acdbSetDimExtensionLength (AcDbObject *pObj, double fValue, bool autoClearOverride=true)
bool  | acdbSetDimFlipArrow (AcDbObject *pObj, int nValue, bool autoClearOverride=true)
bool  | acdbSetDimFlipArrowWhich (AcDbObject *pObj, int nValue, bool autoClearOverride=true)
 bool  | acdbSetDimJogSymbolPosition (AcDbObject *pObj, int &dimJagFlag, const AcGePoint3d &pos, bool autoClearOverride=true)
bool  | acdbSetDimJogSymbolSize (AcDbObject *pObj, int dimJagFlag, const double dimJagSize, bool autoClearOverride=true)
bool  | acdbSetDimLineLinetype (AcDbObject *pObj, AcDbObjectId oidValue, bool autoClearOverride=true)
 bool  | acdbSetDimTextBackground (AcDbObject *pObj, int bgFlag, AcCmColor *pBgColor, bool autoClearOverride=true)
bool  | acdbSetDimTolAlign (AcDbObject *pObj, int dimTolAlignFlag, bool autoClearOverride=true)
bool  | acdbSetExemptCheckFlag (AcDbObject *pObj, int bitFlags)
 Acad::ErrorStatus  | acdbSetExtnames (AcDbDatabase *pDb, bool value)
bool  | acdbSetFixedLengthExtLineEnabled (AcDbObject *pObj, int nValue, bool autoClearOverride=true)
 Acad::ErrorStatus  | acdbSetHostApplicationServices (AcDbHostApplicationServices *pServices)
bool  | acdbSetLargeRadDimJogAngle (AcDbObject *pObj, double fJogAngle, bool autoClearOverride=true)
 bool  | acdbSetRadialExtensionAngles (AcDbObject *pObj, int dimExtFlag, double dimExtAng1, double dimExtAng2)
 Acad::ErrorStatus  | acdbSetReferenced (AcDbObjectId objId)
Acad::ErrorStatus  | acdbSetViewportVisualStyle (AcDbObjectId visualStyleId)
 int  | acdbSNValid (const ACHAR *tbstr, int pipetest)
 AcDbSummaryInfoManager
 *ADESK_STDCALL  | acdbSummaryInfoManager ()
 const AcDbSymUtilServices *  | acdbSymUtil ()
bool  | acdbSystemRangeToCanonical (int eUnits, const AcString &strIn, AcString &strOut)
 struct resbuf *  | acdbTblNext (const ACHAR *tblname, int rewind)
 int  | acdbTblObjName (const ACHAR *tblname, const ACHAR *sym, ads_name result)
 struct resbuf *  | acdbTblSearch (const ACHAR *tblname, const ACHAR *sym, int setnext)
 bool  | acdbTextFind (AcDbDatabase *pDatabase, AcDbObjectIdArray &resultSet, const ACHAR *findString, const ACHAR *replaceString=NULL, Adesk::UInt8 searchOptions=AC_SRCH_DEFAULT, const AcDbObjectIdArray &selSet=0)
 AcDbTransactionManager *  | acdbTransactionManagerPtr ()
void  | acdbTriggerAcadOctTreeReclassification ()
 bool  | acdbUcs2Ecs (ads_point p, ads_point q, ads_point norm, bool vec)
 bool  | acdbUcs2Wcs (ads_point p, ads_point q, bool vec)
 bool  | acdbUcsMatrix (AcGeMatrix3d &mat, AcDbDatabase *pDb=NULL)
Acad::ErrorStatus  | acdbUnloadXrefs (AcDbDatabase *pHostDb, const AcDbObjectIdArray &xrefBlkIds, const bool bQuiet=true)
Acad::ErrorStatus  | acdbUpdateAllDimensions (AcDbDatabase *pDb)
 Acad::ErrorStatus  | acdbUpdateDimension (AcDbObjectId dimId)
 Acad::ErrorStatus  | acdbValidateSetup (long lcid)
 bool  | acdbWcs2Ecs (ads_point p, ads_point q, ads_point norm, bool vec)
 bool  | acdbWcs2Ucs (ads_point p, ads_point q, bool vec)
Acad::ErrorStatus  | acdbXBindXrefs (AcDbDatabase *pHostDb, const AcDbObjectIdArray xrefSymbolIds, const bool bInsertBind, const bool bQuiet=true)
 int  | acdbXdRoom (const ads_name ent, long *result)
 int  | acdbXdSize (const struct resbuf *rb, long *result)
 const ACHAR *  | acdbXlateReservedString (const ACHAR *strSource, bool bGetLocalized=true)
 int  | acdbXStrCase (ACHAR *str)
 ACHAR *  | acdbXStrSave (ACHAR *pSource, ACHAR **pDest)
 AcApDocManager *  | acDocManagerPtr ()
 AcDbObjectId  | acedActiveViewportId ()
 Adesk::Boolean  | acedAddDefaultContextMenu (AcEdUIContext *pContext, const void *appId, const ACHAR *appName=NULL)
 BOOL  | acedAddDropTarget (COleDropTarget *pTarget)
 Adesk::Boolean  | acedAddObjectContextMenu (const AcRxClass *pClass, AcEdUIContext *pContext, const void *appId)
 int  | acedAlert (const ACHAR *str)
 int  | acedArxLoad (const ACHAR *app)
 struct resbuf *  | acedArxLoaded (void)
 int  | acedArxUnload (const ACHAR *app)
 Adesk::Boolean  | acedClearOLELock (int handle)
 int  | acedCmd (const struct resbuf *rbp)
 int  | acedCmdLookup (const ACHAR *cmdStr, int globalLookup, AcEdCommandStruc *retStruc, int skipUndef=FALSE)
int  | acedCmdLookup2 (const ACHAR *cmdStr, int globalLookup, AcEdCommandStruc *retStruc, int sf=ACRX_CMD_DEFUN)
 int  | acedCmdUndefine (const ACHAR *cmdStr, int undefIt)
 int  | acedCommand (int rtype,...)
 Acad::ErrorStatus  | acedConvertEntityToHatch (AcDbHatch *pHatch, AcDbEntity *&pEnt, bool transferId)
 void  | acedCoordFromPixelToWorld (const CPoint &ptIn, acedDwgPoint ptOut)
 BOOL  | acedCoordFromPixelToWorld (int windnum, CPoint ptIn, acedDwgPoint ptOut)
 BOOL  | acedCoordFromWorldToPixel (int windnum, const acedDwgPoint ptIn, CPoint &ptOut)
 Acad::ErrorStatus  | acedCreateEnhancedViewportOnDrop (const ACHAR *filename, const ACHAR *viewName, const AcGePoint2d location, double scale, AcDbObjectId labelBlockId, AcDbObjectId &sheetViewId, AcDbObjectId &viewportId)
 Acad::ErrorStatus  | acedCreateEnhancedViewportOnDropDWG (const ACHAR *filename, AcDbExtents *extents, const AcGePoint2d location, double scale, AcDbObjectId labelBlockId, AcDbObjectId &sheetViewId, AcDbObjectId &viewportId)
Adesk::Boolean  | acedCreateInternetShortcut (const ACHAR *szURL, const ACHAR *szShortcutPath)
Adesk::Boolean  | acedCreateShortcut (void *pvHwndParent, const ACHAR *szLinkPath, const ACHAR *szObjectPath, const ACHAR *szDesc)
 Acad::ErrorStatus  | acedCreateViewportByView (AcDbDatabase *pDb, const AcDbObjectId &view, const AcGePoint2d &location, double scale, AcDbObjectId &viewportId)
 int  | acedDefun (const ACHAR *sname, short funcno)
 void  | acedDisableDefaultARXExceptionHandler (Adesk::Boolean disable=Adesk::kTrue)
 int  | acedDragGen (const ads_name ss, const ACHAR *pmt, int cursor, int(*scnf)(ads_point pt, ads_matrix mt), ads_point p)
 BOOL  | acedDrawingStatusBarsVisible ()
 Acad::ErrorStatus  | acedDrawOrderInherit (AcDbObjectId parent, AcDbObjectIdArray &childArray, AcEdDrawOrderCmdType cmd)
int  | acedEatCommandThroat (void)
 int  | acedEditMTextInteractive (AcDbMText *pMText, bool useNewUI=false, bool allowTabs=false)
 void  | acedEditToleranceInteractive (AcDbFcf *pTol)
 BOOL  | acedEndOverrideDropTarget (COleDropTarget *pTarget)
 int  | acedEntSel (const ACHAR *str, ads_name entres, ads_point ptres)
 int  | acedFindFile (const ACHAR *fname, ACHAR *result)
 int  | acedFNSplit (const ACHAR *pathToSplit, ACHAR *prebuf, ACHAR *namebuf, ACHAR *extbuf)
 CDocument *  | acedGetAcadDoc ()
 CWnd *  | acedGetAcadDockCmdLine ()
 CView *  | acedGetAcadDwgView ()
 CMDIFrameWnd *  | acedGetAcadFrame ()
 HINSTANCE  | acedGetAcadResourceInstance ()
 CWnd *  | acedGetAcadTextCmdLine ()
 CWinApp *  | acedGetAcadWinApp ()
 int  | acedGetAngle (const ads_point pt, const ACHAR *prompt, ads_real *result)
 AcApStatusBar *  | acedGetApplicationStatusBar ()
 ACHAR *  | acedGetAppName ()
 struct resbuf *  | acedGetArgs (void)
 int  | acedGetCfg (const ACHAR *sym, ACHAR *var, int len)
BOOL  | acedGetChildFrameSettings (AcChildFrmSettings *pChildFrmSettings, CMDIChildWnd *pWnd)
 LPCTSTR  | acedGetCMBaseAlias (AcadContextMenuMode mode)
 int  | acedGetCName (const ACHAR *cmd, ACHAR **result)
 Acad::ErrorStatus  | acedGetCommandForDocument (AcApDocument *pDoc, ACHAR *&pGlobalCmdName)
 int  | acedGetCorner (const ads_point pt, const ACHAR *prompt, ads_point result)
 BOOL  | acedGetCurrentColors (AcColorSettings *pColorSettings)
BOOL  | acedGetCurrentColorsEx (AcColorSettings *pColorSettings, AcColorSettingsEx *pColorSettingsEx)
 Acad::ErrorStatus  | acedGetCurrentSelectionSet (AcDbObjectIdArray &sset)
 Acad::ErrorStatus  | acedGetCurrentUCS (AcGeMatrix3d &mat)
 AcDbObjectId  | acedGetCurViewportObjectId ()
 int  | acedGetDist (const ads_point pt, const ACHAR *prompt, ads_real *result)
 int  | acedGetEnv (const ACHAR *sym, ACHAR *var)
 int  | acedGetFileD (const ACHAR *title, const ACHAR *defawlt, const ACHAR *ext, int flags, struct resbuf *result)
 int  | acedGetFileNavDialog (const ACHAR *title, const ACHAR *defawlt, const ACHAR *ext, const ACHAR *dlgname, int flags, struct resbuf **result)
 int  | acedGetFullInput (ACHAR *&pStr)
 int  | acedGetFullKword (const ACHAR *pString, ACHAR *&pStr)
 int  | acedGetFullString (int cronly, const ACHAR *pString, ACHAR *&pResult)
Acad::ErrorStatus  | acedGetFullSubentPathsForCurrentSelection (const AcDbObjectId &selectedObject, AcDbFullSubentPathArray &selectedSubentities)
 int  | acedGetFunCode (void)
IDispatch *  | acedGetIDispatch (BOOL bAddRef)
 int  | acedGetInput (ACHAR *str)
 int  | acedGetInt (const ACHAR *prompt, int *result)
 BOOL  | acedGetIUnknownForCurrentCommand (LPUNKNOWN &pUnk)
 int  | acedGetKword (const ACHAR *prompt, ACHAR *result)
HMENU  | acedGetMenu (LPCTSTR pszAlias)
 int  | acedGetOrient (const ads_point pt, const ACHAR *prompt, ads_real *result)
 int  | acedGetPoint (const ads_point pt, const ACHAR *prompt, ads_point result)
 int  | acedGetReal (const ACHAR *prompt, ads_real *result)
 const CString &  | acedGetRegistryCompany ()
 unsigned long  | acedGetRGB (int color)
 int  | acedGetString (int cronly, const ACHAR *prompt, ACHAR *result)
 int  | acedGetStringB (int cronly, const ACHAR *prompt, ACHAR *result, int bufsize)
 int  | acedGetSym (const ACHAR *sname, struct resbuf **value)
BOOL  | acedGetSystemColors (AcColorSettings *pColorSettings)
BOOL  | acedGetSystemColorsEx (AcColorSettings *pColorSettings, AcColorSettingsEx *pColorSettingsEx)
 const AcString *  | acedGetUnitsValueString (AcDb::UnitsValue units)
Adesk::Boolean  | acedGetUserFavoritesDir (ACHAR *szFavoritesDir)
 int  | acedGetVar (const ACHAR *sym, struct resbuf *result)
 int  | acedGetWinNum (int ptx, int pty)
 int  | acedGraphScr (void)
 int  | acedGrDraw (const ads_point from, const ads_point to, int color, int hl)
 int  | acedGrRead (int track, int *type, struct resbuf *result)
 int  | acedGrText (int box, const ACHAR *text, int hl)
 int  | acedGrVecs (const struct resbuf *vlist, ads_matrix mat)
 int  | acedHelp (const ACHAR *szFilename, const ACHAR *szTopic, int iCmd)
 Adesk::Boolean  | acedInitDialog (Adesk::Boolean useDialog=Adesk::kTrue)
 int  | acedInitGet (int val, const ACHAR *kwl)
 int  | acedInvoke (const struct resbuf *args, struct resbuf **result)
 int  | acedIsDragging (void)
 BOOL  | acedIsInputPending ()
 Adesk::Boolean  | acedIsMenuGroupLoaded (const ACHAR *pszGroupName)
 bool  | acedIsUpdateDisplayPaused (void)
 bool  | acedLoadPartialMenu (const TCHAR *pszMenuFile)
 int  | acedMenuCmd (const ACHAR *str)
 Acad::ErrorStatus  | acedMspace ()
 int  | acedNEntSel (const ACHAR *str, ads_name entres, ads_point ptres, ads_point xformres[4], struct resbuf **refstkres)
 int  | acedNEntSelP (const ACHAR *str, ads_name entres, ads_point ptres, int pickflag, ads_matrix xformres, struct resbuf **refstkres)
int  | acedNumberOfViewports ()
 int  | acedOsnap (const ads_point pt, const ACHAR *mode, ads_point result)
 int  | acedPopCommandDirectory (const ACHAR *cmdDirName)
 void  | acedPostCommandPrompt ()
 int  | acedPrompt (const ACHAR *str)
 Acad::ErrorStatus  | acedPspace ()
 int  | acedPutSym (const ACHAR *sname, struct resbuf *value)
 int  | acedRedraw (const ads_name ent, int mode)
 int  | acedRegFunc (int(*fhdl)(void), int fcode)
 BOOL  | acedRegisterCustomDropTarget (IDropTarget *pItarget)
 BOOL  | acedRegisterExtendedTab (LPCTSTR szAppName, LPCTSTR szDialogName)
 BOOL  | acedRegisterFilterWinMsg (const AcedFilterWinMsgFn pfn)
Acad::ErrorStatus  | acedRegisterGripService (AcApDocument *pDoc, AcEdAppGripService *pSvc)
 BOOL  | acedRegisterOnIdleWinMsg (const AcedOnIdleMsgFn pfn)
 BOOL  | acedRegisterStatusBarMenuItem (AcStatusBarMenuItem *pItem, AcStatusBarMenuItem::AcStatusBarType nType)
 BOOL  | acedRegisterWatchWinMsg (const AcedWatchWinMsgFn pfn)
 Adesk::Boolean  | acedRemoveDefaultContextMenu (AcEdUIContext *pContext)
 BOOL  | acedRemoveDropTarget (COleDropTarget *pTarget)
 BOOL  | acedRemoveFilterWinMsg (const AcedFilterWinMsgFn pfn)
Acad::ErrorStatus  | acedRemoveGripService (AcApDocument *pDoc, AcEdAppGripService *pSvc)
 Adesk::Boolean  | acedRemoveObjectContextMenu (const AcRxClass *pClass, AcEdUIContext *pContext)
 BOOL  | acedRemoveOnIdleWinMsg (const AcedOnIdleMsgFn pfn)
 BOOL  | acedRemoveWatchWinMsg (const AcedWatchWinMsgFn pfn)
Adesk::Boolean  | acedResolveInternetShortcut (const ACHAR *szLinkFile, ACHAR *szUrl)
Adesk::Boolean  | acedResolveShortcut (void *pvHwndParent, const ACHAR *szLinkPath, ACHAR *szObjectPath)
Acad::ErrorStatus  | acedRestoreCurrentView (const AcDbObjectId &namedViewId)
 Acad::ErrorStatus  | acedRestorePreviousUCS ()
 void  | acedRestoreStatusBar ()
 int  | acedRetInt (int ival)
 int  | acedRetList (const struct resbuf *rbuf)
 int  | acedRetName (const ads_name aname, int type)
 int  | acedRetNil (void)
 int  | acedRetPoint (const ads_point pt)
 int  | acedRetReal (ads_real rval)
 int  | acedRetStr (const ACHAR *s)
 int  | acedRetT (void)
 int  | acedRetVal (const struct resbuf *rbuf)
 int  | acedRetVoid (void)
 BOOL  | acedRevokeCustomDropTarget ()
 void  | acedSendModelessOperationEnded (const ACHAR *strContext)
 void  | acedSendModelessOperationStart (const ACHAR *strContext)
 int  | acedSetCfg (const ACHAR *sym, const ACHAR *val)
BOOL  | acedSetChildFrameSettings (AcChildFrmSettings *pChildFrmSettings, CMDIChildWnd *pWnd)
 bool  | acedSetCMBaseAlias (LPCTSTR strAlias, AcadContextMenuMode mode)
 Adesk::Boolean  | acedSetColorDialog (int &nColor, Adesk::Boolean bAllowMetaColor, int nCurLayerColor)
 Adesk::Boolean  | acedSetColorDialogTrueColor (AcCmColor &color, Adesk::Boolean bAllowMetaColor, const AcCmColor &curLayerColor, AcCm::DialogTabs tabs=(AcCm::DialogTabs)(AcCm::kACITab|AcCm::kTrueColorTab|AcCm::kColorBookTab))
Adesk::Boolean  | acedSetColorDialogTrueColorWithCallback (AcCmColor &color, Adesk::Boolean bAllowMetaColor, const AcCmColor &curLayerColor, AcCm::DialogTabs tabs=(AcCm::DialogTabs)(AcCm::kACITab|AcCm::kTrueColorTab|AcCm::kColorBookTab), AcEdColorDialogCallbackFunction callback=NULL, void *pCallbackData=NULL)
 Adesk::Boolean  | acedSetColorPrompt (ACHAR *promptString, AcCmColor &color, Adesk::Boolean bAllowMetaColor)
 BOOL  | acedSetCurrentColors (AcColorSettings *pColorSettings)
BOOL  | acedSetCurrentColorsEx (AcColorSettings *pColorSettings, AcColorSettingsEx *pColorSettingsEx)
 Acad::ErrorStatus  | acedSetCurrentUCS (const AcGeMatrix3d &mat)
 Acad::ErrorStatus  | acedSetCurrentView (AcDbViewTableRecord *pVwRec, AcDbViewport *pVP)
 Acad::ErrorStatus  | acedSetCurrentVPort (int vpnumber)
 Acad::ErrorStatus  | acedSetCurrentVPort (const AcDbViewport *pVp)
 int  | acedSetEnv (const ACHAR *sym, const ACHAR *val)
 int  | acedSetFunHelp (const ACHAR *pszFunctionName, const ACHAR *pszHelpfile, const ACHAR *pszTopic, int iCmd)
 BOOL  | acedSetIUnknownForCurrentCommand (const LPUNKNOWN)
 Adesk::Boolean  | acedSetOLELock (int handle, int flags=0)
 BOOL  | acedSetStatusBarPaneID (AcPane *pPane, AcStatusBarMenuItem::AcStatusBarType nType, int nID)
 int  | acedSetStatusBarProgressMeter (const ACHAR *pszLabel, int nMinPos, int nMaxPos)
 int  | acedSetStatusBarProgressMeterPos (int nPos)
 int  | acedSetVar (const ACHAR *sym, const struct resbuf *val)
 int  | acedSetView (const struct resbuf *view, int vport)
 BOOL  | acedShowDrawingStatusBars (BOOL bShow=TRUE)
 int  | acedSSAdd (const ads_name ename, const ads_name sname, ads_name result)
 int  | acedSSDel (const ads_name ename, const ads_name ss)
 int  | acedSSFree (const ads_name sname)
 int  | acedSSGet (const ACHAR *str, const void *pt1, const void *pt2, const struct resbuf *filter, ads_name ss)
 int  | acedSSGetFirst (struct resbuf **gset, struct resbuf **pset)
 int  | acedSSGetKwordCallbackPtr (struct resbuf *(**pFunc)(const ACHAR *))
 int  | acedSSGetOtherCallbackPtr (struct resbuf *(**pFunc)(const ACHAR *))
 int  | acedSSLength (const ads_name sname, long *len)
 int  | acedSSMemb (const ads_name ename, const ads_name ss)
 int  | acedSSName (const ads_name ss, long i, ads_name entres)
 int  | acedSSNameX (struct resbuf **rbpp, const ads_name ss, const long i)
 int  | acedSSNameXEx (struct resbuf **rbpp, const ads_name ss, const long i, unsigned int flags=0)
 int  | acedSSSetFirst (const ads_name pset, const ads_name unused)
 int  | acedSSSetKwordCallbackPtr (struct resbuf *(*pFunc)(const ACHAR *))
 int  | acedSSSetOtherCallbackPtr (struct resbuf *(*pFunc)(const ACHAR *))
int  | acedSSSetSubentTypes (const AcArray< AcDb::SubentType > &types)
int  | acedSSSubentAdd (const AcDbFullSubentPath &subentity, const ads_name sname, ads_name result)
int  | acedSSSubentDel (const AcDbFullSubentPath &subentity, const ads_name ss)
int  | acedSSSubentLength (const ads_name sname, long index, long *len)
int  | acedSSSubentMemb (const AcDbFullSubentPath &subentity, const ads_name ss)
int  | acedSSSubentName (const ads_name ss, long entIndex, long subentIndex, AcDbFullSubentPath &subentity)
int  | acedSSSubentNameX (struct resbuf **rbpp, const ads_name ss, const long entIndex, const long subentIndex, unsigned int flags)
 BOOL  | acedStartOverrideDropTarget (COleDropTarget *pTarget)
 Acad::ErrorStatus  | acedSyncFileOpen (const ACHAR *pszFileToOpen, const wchar_t *wszPassword=NULL)
 int  | acedTablet (const struct resbuf *args, struct resbuf **result)
 int  | acedTextBox (const struct resbuf *args, ads_point pt1, ads_point pt2)
 int  | acedTextPage (void)
 int  | acedTextScr (void)
 Acad::ErrorStatus  | acedTraceBoundary (const AcGePoint3d &seedPoint, bool detectIslands, AcDbVoidPtrArray &resultingBoundarySet)
 int  | acedTrans (const ads_point pt, const struct resbuf *from, const struct resbuf *to, int disp, ads_point result)
 int  | acedUndef (const ACHAR *sname, short funcno)
 bool  | acedUnloadPartialMenu (const TCHAR *pszMenuFile)
 BOOL  | acedUnregisterStatusBarMenuItem (AcStatusBarMenuItem *pItem, AcStatusBarMenuItem::AcStatusBarType nType)
 int  | acedUpdate (int vport, ads_point p1, ads_point p2)
 void  | acedUpdateDisplay ()
 void  | acedUpdateDisplayPause (bool bEnable)
 int  | acedUsrBrk (void)
AcDbObjectId  | acedViewportIdFromNumber (int nVpNum)
 Acad::ErrorStatus  | acedVPLayer (const AcDbObjectId &vpId, const AcDbObjectIdArray &layerIds, AcDb::VpFreezeOps operation)
 int  | acedVports (struct resbuf **vlist)
 Acad::ErrorStatus  | acedVports2VportTableRecords ()
 Acad::ErrorStatus  | acedVportTableRecords2Vports ()
 int  | acedXformSS (const ads_name ssname, ads_matrix genmat)
 Acad::ErrorStatus  | acedXrefAttach (const ACHAR *XrefPathname, const ACHAR *XrefBlockname, AcDbObjectId *pXrefBTRid=NULL, AcDbObjectId *pXrefRefid=NULL, const AcGePoint3d *pXrefInsertPt=NULL, const AcGeScale3d *pXrefScale=NULL, const double *pXrefRotateAngle=NULL, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL, const wchar_t *wszPassword=NULL)
 Acad::ErrorStatus  | acedXrefBind (const ACHAR *XrefBlockname, const bool bInsertBind=false, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL)
 Acad::ErrorStatus  | acedXrefCreateBlockname (const ACHAR *XrefPathname, ACHAR *&XrefBlockname)
 Acad::ErrorStatus  | acedXrefDetach (const ACHAR *XrefBlockname, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL)
 Acad::ErrorStatus  | acedXrefOverlay (const ACHAR *XrefPathname, const ACHAR *XrefBlockname, AcDbObjectId *pXrefBTRid=NULL, AcDbObjectId *pXrefRefid=NULL, const AcGePoint3d *pXrefInsertPt=NULL, const AcGeScale3d *pXrefScale=NULL, const double *pXrefRotateAngle=NULL, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL, const wchar_t *wszPassword=NULL)
 Acad::ErrorStatus  | acedXrefReload (const ACHAR *XrefBlockname, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL)
 Acad::ErrorStatus  | acedXrefReload (const AcDbObjectIdArray &XrefBTRids, bool bQuiet=true, AcDbDatabase *pHostDb=NULL)
 Acad::ErrorStatus  | acedXrefResolve (AcDbDatabase *pHostDb, const bool bQuiet=true)
 Acad::ErrorStatus  | acedXrefUnload (const ACHAR *XrefBlockname, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL)
 Acad::ErrorStatus  | acedXrefXBind (const AcDbObjectIdArray symbolIds, const bool bQuiet=true, AcDbDatabase *pHostDb=NULL)
ACFD_PORT BOOL  | AcFdExtractData (AcDbField *pField, ACHAR *&pszSheetSetFile, ACHAR *&pszSheetSetId, ACHAR *&pszCompName, ACHAR *&pszCompId, ACHAR *&pszPropName)
ACFD_PORT BOOL  | AcFdExtractData (AcDbField *pField, AcDbObjectId &objId, ACHAR *&pszPropName)
ACFD_PORT BOOL  | AcFdMakeFieldCode (const AcDbObjectId &objId, AcDbEvalNodeId blockParamId, const ACHAR *pszPropOrCoectionName, AcFdEval::ObjectFieldOption nOption, const ACHAR *pszFormat, AcHyperlink *pHyperlink, ACHAR *&pszFieldCode)
ACFD_PORT BOOL  | AcFdMakeFieldCode (IZcSmDatabase *pSmDb, IZcSmSheetSet *pSmSheetSet, IZcSmComponent *pSmComp, const ACHAR *pszCompName, const ACHAR *pszPropName, AcFdEval::SheetSetFieldOption nOption, const ACHAR *pszFormat, ACHAR *&pszFieldCode)
ACFD_PORT BOOL  | AcFdMakeFieldCode (const AcDbObjectId &tableId, const AcDbObjectId &targetTableId, AcFdEval::ExpressionFieldOption nOption, const AcCellRangeArray &cellRanges, const ACHAR *pszFormat, AcHyperlink *pHyperlink, ACHAR *&pszFieldCode)
ACFDUI_PORT CAcFdUiFieldManager *  | AcFdUiGetFieldManager (void)
 ACFDUI_PORT int  | AcFdUiInvokeFieldDialog (AcDbField *&pNewField, BOOL bEdit, AcDbDatabase *pDb, CWnd *pParent=NULL)
 std::locale  | AcFStream_curLocale ()
 int  | AcFStream_wideToMulti (const wchar_t *pSrc, int nSrcSize, char *pDest, int nDestSize)
bool  | acgiIsValidClipBoundary (const AcGePoint2dArray &pts)
 AcGs2DViewLimitManager *  | acgsCreate2DViewLimitManager (int viewportNumber)
 void  | acgsDestroy2DViewLimitManager (AcGs2DViewLimitManager *pLimitManager)
Adesk::Boolean  | acgsDisplayImage (int viewportNumber, long originLeft, long originTop, int imageWidth, int imageHeight, void const *imageData, int hasTransparency)
Adesk::Boolean  | acgsGetDisplayInfo (int &drawingWidth, int &drawingHeight, int &aspectWidth, int &aspectHeight)
 AcGsManager *  | acgsGetGsManager (CView *pView=NULL)
 AcGsView *  | acgsGetGsView (int viewportNumber, bool bCreateIfNone)
 Adesk::UInt16  | acgsGetHighlightColor (void)
 AcGs::LinePattern  | acgsGetHighlightLinePattern (void)
 Adesk::UInt16  | acgsGetHighlightLineWeight (void)
 Adesk::Boolean  | acgsGetLensLength (int viewportNumber, double &lensLength)
 Adesk::Boolean  | acgsGetOrthoViewParameters (int viewportNumber, AcDb::OrthographicView view, AcGeVector3d *pViewDir, AcGeVector3d *pUpVector)
 AcGsScreenShot *  | acgsGetScreenShot (int viewportNumber)
 Adesk::Boolean  | acgsGetViewParameters (int viewportNumber, AcGsView *pView)
 Adesk::Boolean  | acgsGetViewportInfo (int viewportNumber, int &left, int &bottom, int &right, int &top)
 void  | acgsRedrawShortTermGraphics (short minx, short miny, short maxx, short maxy)
 Adesk::Boolean  | acgsRemoveAnonymousGraphics (int viewportNumber)
 Adesk::Boolean  | acgsSetCustomUpdateMethod (acgsCustomUpdateMethod custom_update_method, void *pParm)
 void  | acgsSetHighlightColor (Adesk::UInt16 colorIndex)
 void  | acgsSetHighlightLinePattern (AcGs::LinePattern pattern)
 void  | acgsSetHighlightLineWeight (Adesk::UInt16 weight)
 Adesk::Boolean  | acgsSetLensLength (int viewportNumber, const double &lensLength)
 Adesk::Boolean  | acgsSetView2D (int viewportNumber)
 Adesk::Boolean  | acgsSetViewParameters (int viewportNumber, const AcGsView *pView, bool bRegenRequired, bool bRescaleRequired, bool bSyncRequired=false)
 void  | acgsSetViewportRenderFlag (int viewportNumber)
 void  | acgsWriteViewToUndoController (int viewportNumber)
 AcLyLayerFilterManager *  | aclyGetLayerFilterManager (AcDbDatabase *pDb)
 ACPL_PORT
 AcPlPlotProgressDialog
 *__stdcall  | acplCreatePlotProgressDialog (HWND hParent, bool bPreview=false, int nSheets=1, ACPLPLTPRGHELPPROC hlpProc=NULL, bool bShowCancelSheetButton=true)
 ACPL_PORT AcPlHostAppServices *  | AcPlGetHostAppServices ()
 ACPL_PORT
 AcPlPlotConfigManager
 *__stdcall  | acplPlotConfigManagerPtr ()
 ACPL_PORT AcPlPlotReactorMgr
 *__stdcall  | acplPlotReactorMgrPtr ()
 ACPL_PORT ProcessPlotState
 __stdcall  | acplProcessPlotState ()
 void  | acplPublishExecute (AcPlDSDData dsdDataObj, AcPlPlotConfig *pConfig, bool bShowPlotProgress)
 ACPL_PORT Acad::ErrorStatus  | AcPlSetHostAppServices (AcPlHostAppServices *pHostServices)
 AcApProfileManager *  | acProfileManagerPtr ()
bool  | acReadAnsiCharFromCFile (CFile *pCFile, wchar_t &wch, AdCharFormatter *pChFmtr)
bool  | acReadCIFFromCFile (CFile *pCFile, wchar_t &wch)
bool  | acReadUtf16CharFromCFile (CFile *pCFile, wchar_t &wch, AdCharFormatter *pChFmtr)
bool  | acReadUtf8CharFromCFile (CFile *pCFile, wchar_t &wch, AdCharFormatter *pChFmtr)
 void  | acrx_abort (const ACHAR *format,...)
 bool ADESK_STDCALL  | acrxAppIsLoaded (const ACHAR *pAppName)
bool  | acrxApplicationIsLocked (const ACHAR *modulename)
 void *  | acrxGetServiceSymbolAddr (const ACHAR *serviceName, const ACHAR *symbol)
bool  | acrxIsAppMDIAware (const ACHAR *moduleName)
 bool  | acrxLoadApp (const ACHAR *appname, bool asCmd=false)
 void *  | acrxLoadedApps ()
 bool  | acrxLoadModule (const ACHAR *moduleName, bool printit, bool asCmd=false)
 bool  | acrxLockApplication (void *appId)
 const ACHAR *  | acrxObjectDBXRegistryKey ()
 const ACHAR *  | acrxProductKey ()
 unsigned long  | acrxProductLCID ()
 AcadApp::ErrorStatus  | acrxRegisterApp (AcadApp::LoadReasons alr, const ACHAR *logicalName, bool bDwgU=false)
 bool  | acrxRegisterAppMDIAware (void *appId)
 bool  | acrxRegisterAppNotMDIAware (void *appId)
 void *  | acrxRegisterService (const ACHAR *serviceName)
 bool  | acrxServiceIsRegistered (const ACHAR *serviceName)
 bool  | acrxUnloadApp (const ACHAR *appName, bool asCmd=false)
 bool  | acrxUnloadModule (const ACHAR *moduleName, bool asCmd=false)
 bool  | acrxUnlockApplication (void *appId)
 AcadApp::ErrorStatus  | acrxUnregisterApp (const ACHAR *logicalname, bool bDwgU=false)
AcString::AcString (const CStringW &csw)
 ads_real  | acutAngle (const ads_point pt1, const ads_point pt2)
 void  | acutAssertMessage (const ACHAR *condition, const ACHAR *filename, int lineNumber, const ACHAR *status)
 struct resbuf *  | acutBuildList (int rtype,...)
 int  | acutCvUnit (ads_real value, const ACHAR *oldunit, const ACHAR *newunit, ads_real *result)
 void  | acutDelBuffer (void *&pBuffer)
 void  | acutDelBuffer (char *&pString)
 void  | acutDelString (char *&pString)
 void  | acutDelString (wchar_t *&pString)
 ads_real  | acutDistance (const ads_point pt1, const ads_point pt2)
 int  | acutIsAlNum (int c)
 int  | acutIsAlpha (int c)
 int  | acutIsCntrl (int c)
 int  | acutIsDigit (int c)
 int  | acutIsGraph (int c)
 int  | acutIsLower (int c)
 int  | acutIsPrint (int c)
 int  | acutIsPunct (int c)
 int  | acutIsSpace (int c)
 int  | acutIsUpper (int c)
 int  | acutIsXDigit (int c)
 Acad::ErrorStatus  | acutNewBuffer (void *&pOutput, size_t size)
 Acad::ErrorStatus  | acutNewBuffer (char *&pOutput, size_t size)
 struct resbuf *  | acutNewRb (int v)
 Acad::ErrorStatus  | acutNewString (ACHAR *&pOutput, int nNumChars)
 Acad::ErrorStatus  | acutNewString (const ACHAR *pInput, ACHAR *&pOutput)
 void  | acutPolar (const ads_point pt, ads_real angle, ads_real dist, ads_point ptres)
 int  | acutPrintf (const ACHAR *format,...)
 int  | acutRelRb (struct resbuf *rb)
 bool  | acutSplitString (size_t &numLeftBytes, const ACHAR *&pRight, const ACHAR *source, unsigned int delimiter)
 int  | acutSPrintf (ACHAR *buffer, const ACHAR *format,...)
 int  | acutToLower (int c)
 int  | acutToUpper (int c)
 void  | acutTrimWhiteSpace (ACHAR *pStr)
 Acad::ErrorStatus  | acutUpdString (const ACHAR *pInput, ACHAR *&pOutput)
 int  | acutWcMatch (const ACHAR *string, const ACHAR *pattern)
 bool  | acutWcMatchEx (const ACHAR *string, const ACHAR *pattern, bool ignoreCase)
 size_t  | acutXStrLength (const ACHAR *str)
 Acad::ErrorStatus  | acutXStrNormalize (ACHAR *&pStr, bool preserveCase)
 Acad::ErrorStatus  | acutXStrUppercase (ACHAR *&pStr)
void  | acWriteWCharToCFile (wchar_t wch, CFile *pFile, unsigned nFmt, bool bUseCIF)
 Acad::ErrorStatus  | addSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetFilter *pFilter)
 Acad::ErrorStatus  | addSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetSubSelectFilter *pFilter)
 int  | ads_action_tile (ads_hdlg hdlg, const ACHAR *key, CLIENTFUNC tilefunc)
 int  | ads_add_list (const ACHAR *item)
 int  | ads_client_data_tile (ads_hdlg hdlg, const ACHAR *key, void *clientdata)
 int  | ads_dimensions_tile (ads_hdlg hdlg, const ACHAR *key, short *cx, short *cy)
 int  | ads_done_dialog (ads_hdlg hdlg, int status)
 int  | ads_done_positioned_dialog (ads_hdlg hdlg, int status, int *x_result, int *y_result)
 int  | ads_end_image (void)
 int  | ads_end_list (void)
 int  | ads_fill_image (short x1, short y1, short x2, short y2, short color)
 int  | ads_get_attr (ads_hdlg hdlg, const ACHAR *key, ACHAR *attr, ACHAR *value, int len)
 int  | ads_get_attr_string (ads_htile tile, ACHAR *attr, ACHAR *value, int len)
 int  | ads_get_tile (ads_hdlg hdlg, const ACHAR *key, ACHAR *value, int maxlen)
 int  | ads_load_dialog (const ACHAR *dclfile, int *dcl_id)
 int  | ads_mode_tile (ads_hdlg hdlg, const ACHAR *key, short mode)
 int  | ads_new_dialog (const ACHAR *dlgname, int dcl_id, CLIENTFUNC def_callback, ads_hdlg *hdlg)
 int  | ads_new_positioned_dialog (const ACHAR *dlgname, int dcl_id, CLIENTFUNC def_callback, int x, int y, ads_hdlg *hdlg)
 int  | ads_queueexpr (ACHAR *pchString)
 int  | ads_set_tile (ads_hdlg hdlg, const ACHAR *key, const ACHAR *value)
 int  | ads_slide_image (short x1, short y1, short x2, short y2, const ACHAR *slnam)
 int  | ads_start_dialog (ads_hdlg hdlg, int *status)
 int  | ads_start_image (ads_hdlg hdlg, const ACHAR *key)
 int  | ads_start_list (ads_hdlg hdlg, const ACHAR *key, short operation, short index)
 int  | ads_term_dialog (void)
 int  | ads_unload_dialog (int dcl_id)
 int  | ads_vector_image (short x1, short y1, short x2, short y2, short color)
 int ADUI_PORT  | AdUiAlertDialog (LPCTSTR captionText, LPCTSTR msg0Text, LPCTSTR button0Text, LPCTSTR button1Text, UINT defButton=0)
 int ADUI_PORT  | AdUiDataValidationLevel ()
void ADUI_PORT  | AdUiEnableDockControlBars (BOOL bEnable, CStringArray *pToolIds=NULL)
For internal use only.
 void ADUI_PORT  | AdUiEnableDocking (CFrameWnd *pFrame, DWORD dwDockStyle, ADUI_LOADFN *pLoadFcn, ADUI_SAVEFN *pSaveFcn)
 BOOL ADUI_PORT  | AdUiFindContextHelpFullPath (LPCTSTR fileName, CString &fullPath)
 ADUI_PORT CRuntimeClass *  | AdUiGetRegisteredPaletteSetFloatingFrameClass (void)
 CAdUiThemeManager ADUI_PORT *  | AdUiGetThemeManager ()
 void ADUI_PORT  | AdUiHideBalloonTip (CWnd *control)
 const UINT ADUI_PORT  | AdUiMessage ()
 ADUI_NOTIFY ADUI_PORT  | AdUiNotification (WPARAM wp)
 ADUI_REPLY ADUI_PORT  | AdUiNotify (CWnd &w, UINT id, ADUI_NOTIFY n, DWORD_PTR lParam)
 ADUI_REPLY ADUI_PORT  | AdUiNotify (CWnd *w, UINT id, ADUI_NOTIFY n, DWORD_PTR lParam)
 UINT ADUI_PORT  | AdUiNotifyId (WPARAM wp)
 BOOL ADUI_PORT  | AdUiPostNotify (CWnd &w, UINT id, ADUI_NOTIFY n, DWORD_PTR lParam)
 BOOL ADUI_PORT  | AdUiPostNotify (CWnd *w, UINT id, ADUI_NOTIFY n, DWORD_PTR lParam)
 bool ADUI_PORT  | AdUiRegisterDockingTool (LPCTSTR lpszToolName, LPCTSTR lpszCommand, UINT nToolbarID)
 ADUI_PORT void  | AdUiRegisterFloatingFrameClassAddress (CRuntimeClass **pClass)
 ADUI_PORT void  | AdUiRegisterPaletteSetFloatingFrameClass (CRuntimeClass *pClass)
 bool ADUI_PORT  | AdUiRegisterTool (LPCTSTR lpszToolName, LPCTSTR lpszCommand, CLSID *pID)
 void ADUI_PORT  | AdUiSaveDockingToolPositions ()
 ADUI_PORT CRuntimeClass *  | AdUiSetFloatingFrameClass (CRuntimeClass *pNewClass)
 BOOL ADUI_PORT  | AdUiShowBalloonTip (CWnd *owner, CWnd *control, LPCTSTR text, BOOL beep)
 BOOL ADUI_PORT  | AdUiShowBalloonTip (CWnd *owner, CWnd *control, CRect &rect, LPCTSTR text, BOOL beep)
 void ADUI_PORT  | AdUiShowDockControlBars (bool bShow)
 void ADUI_PORT  | AdUiSubstituteShellFont (CWnd &dlg, CFont &font)
 double *  | asDblArray (const AcGePoint2d &pnt)
 double *  | asDblArray (const AcGeVector2d &vec)
 double *  | asDblArray (const AcGePoint3d &pnt)
 double *  | asDblArray (const AcGeVector3d &vec)
 AcGePoint2d &  | asPnt2d (const double *pnt)
 AcGePoint3d &  | asPnt3d (const double *pnt)
 AcGeVector2d &  | asVec2d (const double *vec)
 AcGeVector3d &  | asVec3d (const double *vec)
 bool  | c4ObjIdGreaterThanOrEqual (Adesk::ULongPtr lhs, Adesk::ULongPtr rhs)
 bool  | c4ObjIdIsEqualTo (Adesk::ULongPtr lhs, Adesk::ULongPtr rhs)
 bool  | c4ObjIdIsGreaterThan (Adesk::ULongPtr lhs, Adesk::ULongPtr rhs)
 bool  | c4ObjIdIsLessThan (Adesk::ULongPtr lhs, Adesk::ULongPtr rhs)
 bool  | c4ObjIdLessThanOrEqual (Adesk::ULongPtr lhs, Adesk::ULongPtr rhs)
 bool  | c4ObjIdNotEqualTo (Adesk::ULongPtr lhs, Adesk::ULongPtr rhs)
 bool  | c5ObjIdGreaterThanOrEqual (const AcDbStub *lhs, const AcDbStub *rhs)
 bool  | c5ObjIdIsEqualTo (const AcDbStub *lhs, const AcDbStub *rhs)
 bool  | c5ObjIdIsGreaterThan (const AcDbStub *lhs, const AcDbStub *rhs)
 bool  | c5ObjIdIsLessThan (const AcDbStub *lhs, const AcDbStub *rhs)
 bool  | c5ObjIdLessThanOrEqual (const AcDbStub *lhs, const AcDbStub *rhs)
 bool ADUI_PORT  | CanStealFocusFromDockedWindow ()
 int  | AcString::compare (const CStringW &csw) const
 int  | AcString::compareNoCase (const CStringW &csw) const
const wchar_t *  | AcString::constPtr () const
 CAcGradientThumbnailEngine *  | createGradientThumbnailEngine ()
 AcApDocument *  | curDoc ()
 void  | delBuffer (char *&pString)
void  | deleteAcDbSummaryInfoManager ()
 void  | delString (ACHAR *&pString)
 bool  | duplicateSelectionsAllowed (AcApDocument *pDoc)
 Acad::ErrorStatus  | fromAcDbTextStyle (AcGiTextStyle &, const AcDbObjectId &AcDbStyleId)
 Acad::ErrorStatus  | fromAcDbTextStyle (AcGiTextStyle &, const ACHAR *AcDbStyleName)
AdHostImageAppServices *  | getAdHostImageAppServices ()
Acad::ErrorStatus SCENEDLLIMPEXP  | getBackgroundDictionary (AcDbDatabase *pDb, AcDbDictionary *&pDict, AcDb::OpenMode mode, bool createIfNonExist)
Acad::ErrorStatus SCENEDLLIMPEXP  | getBackgroundDictionary (AcDbDatabase *pDb, AcDbDictionary *&pDict, AcDb::OpenMode mode)
 void ADUI_PORT  | GetSystemVirtualScreen (RECT &rect)
Acad::ErrorStatus  | getTableStyleNameFromDbById (const AcDbObjectId &objId, ACHAR *&pName)
void  | initAcDbSummaryInfoManager ()
 void ADUI_PORT  | InitAdUiDLL ()
 const ACHAR *  | AcString::kACharPtr () const
 const wchar_t *  | AcString::kTCharPtr () const
 int  | AcString::match (const CStringW &csw) const
 int  | AcString::matchNoCase (const CStringW &csw) const
 AcString  | AcString::mid (int nStart, int nNumChars) const
 Acad::ErrorStatus  | newBuffer (char *&pOutput, size_t size)
 Acad::ErrorStatus  | newString (const ACHAR *pInput, ACHAR *&pOutput)
 Acad::ErrorStatus  | newString (ACHAR *&pOutput, int nNumChars)
AcString::operator const char * () const
AcString::operator const wchar_t * () const
 bool  | AcString::operator!= (wchar_t wch) const
 bool  | AcString::operator!= (const char *psz) const
 bool  | AcString::operator!= (const wchar_t *pwsz) const
 bool  | AcString::operator!= (const AcString &acs) const
 bool  | AcString::operator!= (const CStringW &) const
bool  | operator!= (wchar_t wch, const AcString &acs)
 bool  | operator!= (const char *psz, const AcString &acs)
 bool  | operator!= (const wchar_t *pwsz, const AcString &acs)
bool  | operator!= (const CStringW &csw, const AcString &acs)
 AcString  | AcString::operator+ (char ch) const
 AcString  | AcString::operator+ (wchar_t wch) const
 AcString  | AcString::operator+ (const char *psz) const
 AcString  | AcString::operator+ (const wchar_t *pwsz) const
 AcString  | AcString::operator+ (const AcString &acs) const
AcString  | operator+ (wchar_t wch, const AcString &acs)
 AcString  | operator+ (const char *psz, const AcString &acs)
AcString  | operator+ (const wchar_t *pwsz, const AcString &acs)
 AcString &  | AcString::operator+= (char ch)
 AcString &  | AcString::operator+= (wchar_t wch)
 AcString &  | AcString::operator+= (const char *psz)
 AcString &  | AcString::operator+= (const wchar_t *pwsz)
 AcString &  | AcString::operator+= (const AcString &acs)
 AcString &  | AcString::operator+= (const CStringW &csw)
 bool  | AcString::operator< (wchar_t wch) const
 bool  | AcString::operator< (const char *psz) const
 bool  | AcString::operator< (const wchar_t *pwsz) const
 bool  | AcString::operator< (const AcString &acs) const
 bool  | AcString::operator< (const CStringW &) const
bool  | operator< (wchar_t wch, const AcString &acs)
 bool  | operator< (const char *psz, const AcString &acs)
bool  | operator< (const wchar_t *pwsz, const AcString &acs)
bool  | operator< (const CStringW &csw, const AcString &acs)
 bool  | AcString::operator<= (const wchar_t wch) const
 bool  | AcString::operator<= (const char *psz) const
 bool  | AcString::operator<= (const wchar_t *pwsz) const
 bool  | AcString::operator<= (const AcString &acs) const
 bool  | AcString::operator<= (const CStringW &) const
bool  | operator<= (wchar_t wch, const AcString &acs)
 bool  | operator<= (const char *psz, const AcString &acs)
bool  | operator<= (const wchar_t *pwsz, const AcString &acs)
bool  | operator<= (const CStringW &csw, const AcString &acs)
 AcString &  | AcString::operator= (char ch)
 AcString &  | AcString::operator= (wchar_t wch)
 AcString &  | AcString::operator= (const char *psz)
 AcString &  | AcString::operator= (const wchar_t *pwsz)
 AcString &  | AcString::operator= (const AcString &acs)
 AcString &  | AcString::operator= (const AcDbHandle &h)
 AcString &  | AcString::operator= (const CStringW &csw)
 bool  | AcString::operator== (wchar_t wch) const
 bool  | AcString::operator== (const char *psz) const
 bool  | AcString::operator== (const wchar_t *pwsz) const
 bool  | AcString::operator== (const AcString &acs) const
 bool  | AcString::operator== (const CStringW &) const
bool  | operator== (wchar_t wch, const AcString &acs)
 bool  | operator== (const char *psz, const AcString &acs)
bool  | operator== (const wchar_t *pwsz, const AcString &acs)
bool  | operator== (const CStringW &csw, const AcString &acs)
 bool  | AcString::operator> (wchar_t wch) const
 bool  | AcString::operator> (const char *psz) const
 bool  | AcString::operator> (const wchar_t *pwsz) const
 bool  | AcString::operator> (const AcString &acs) const
 bool  | AcString::operator> (const CStringW &) const
bool  | operator> (wchar_t wch, const AcString &acs)
 bool  | operator> (const char *psz, const AcString &acs)
bool  | operator> (const wchar_t *pwsz, const AcString &acs)
bool  | operator> (const CStringW &csw, const AcString &acs)
 bool  | AcString::operator>= (wchar_t wch) const
 bool  | AcString::operator>= (const char *psz) const
 bool  | AcString::operator>= (const wchar_t *pwsz) const
 bool  | AcString::operator>= (const AcString &acs) const
 bool  | AcString::operator>= (const CStringW &) const
bool  | operator>= (wchar_t wch, const AcString &acs)
 bool  | operator>= (const char *psz, const AcString &acs)
bool  | operator>= (const wchar_t *pwsz, const AcString &acs)
bool  | operator>= (const CStringW &csw, const AcString &acs)
 HRESULT AXAUTOEXP  | RaiseAcAXException (REFGUID iid, HRESULT hRes, DWORD dwException,...)
 HRESULT AXAUTOEXP  | RaiseArxException (REFGUID iid, HRESULT hRes, Acad::ErrorStatus es)
Acad::ErrorStatus  | removeSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetFilter *pFilter)
 Acad::ErrorStatus  | removeSSgetFilterInputContextReactor (AcApDocument *pDoc, AcEdSSGetSubSelectFilter *pFilter)
 Acad::ErrorStatus  | setAllowDuplicateSelection (AcApDocument *pDoc, boolean flag)
 virtual Acad::ErrorStatus  | setDimarcsym (int v)
 virtual Acad::ErrorStatus  | setDimfxlen (double v)
 virtual Acad::ErrorStatus  | setDimfxlenOn (bool v)
 virtual Acad::ErrorStatus  | setDimjogang (double v)
 virtual Acad::ErrorStatus  | setDimltex1 (AcDbObjectId v)
 virtual Acad::ErrorStatus  | setDimltex2 (AcDbObjectId v)
 virtual Acad::ErrorStatus  | setDimltype (AcDbObjectId v)
 virtual Acad::ErrorStatus  | setDimtfill (int v)
 virtual Acad::ErrorStatus  | setDimtfillclr (const AcCmColor &v)
 unsigned  | AcString::tcharLength () const
 Acad::ErrorStatus  | toAcDbTextStyle (AcGiTextStyle &)
 Acad::ErrorStatus  | toAcDbTextStyle (AcGiTextStyle &, AcDbObjectId &AcDbStyleId)
 Acad::ErrorStatus  | toAcDbTextStyle (const AcDbObjectId AcDbStyleId, AcGiTextStyle &)
 Acad::ErrorStatus  | toAcDbTextStyle (AcGiTextStyle &, const ACHAR *AcDbStyleName)
 Acad::ErrorStatus  | toAcDbTextStyle (AcGiTextStyle &, const ACHAR *AcDbStyleName, AcDbObjectId &AcDbStyleId)
void  | ucsNormalVector (AcGeVector3d &ucsNormalVec)
AcGeVector3d  | ucsXDir ()
AcGeVector3d  | ucsYDir ()
 Acad::ErrorStatus  | updString (const ACHAR *pInput, ACHAR *&pOutput)
Detailed Description
Function Documentation
 HRESULT AXAUTOEXP AcAxEnableShadowDisplay  |  ( |  AcDbObjectId &  |  objId,
|  bool *  |  pEnabled
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxEnableShadowDisplay  |  ( |  AcAxObjectRef &  |  objRef,
|  bool *  |  pEnabled
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGetMaterial  |  ( |  AcDbObjectId &  |  objId,
|  BSTR *  |  pMaterial
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGetMaterial  |  ( |  AcAxObjectRef &  |  objRef,
|  BSTR *  |  pMaterial
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGetShadowDisplay  |  ( |  AcDbObjectId &  |  objId,
|  AcShadowDisplayType *  |  pShadowDisplay
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxGetShadowDisplay  |  ( |  AcAxObjectRef &  |  objRef,
|  AcShadowDisplayType *  |  pShadowDisplay
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPutMaterial  |  ( |  AcDbObjectId &  |  objId,
|  BSTR  |  material
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPutMaterial  |  ( |  AcAxObjectRef &  |  objRef,
|  BSTR  |  material
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPutShadowDisplay  |  ( |  AcDbObjectId &  |  objId,
|  AcShadowDisplayType  |  shadowDisplay
)
Warning
Not implemented!
 HRESULT AXAUTOEXP AcAxPutShadowDisplay  |  ( |  AcAxObjectRef &  |  objRef,
|  AcShadowDisplayType  |  shadowDisplay
)
Warning
Not implemented!
 void acByteSwap  |  ( |  wchar_t &  |  wch | )
inline
Warning
Not implemented!
 Acad::ErrorStatus acdbBindXrefs  |  ( |  AcDbDatabase *  |  pHostDb,
|  const AcDbObjectIdArray &  |  xrefBlkIds,
|  const bool  |  bInsertBind,
|  const bool  |  bAllowUnresolved = false,
|  const bool  |  bQuiet = true
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbConvertFieldsToText  |  ( |  AcDbDatabase *  |  pDb,
|  const AcStringArray *  |  pEvalIds,
|  AcFd::ConvertFieldToText  |  nOption
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbConvertFieldsToText  |  ( |  const AcDbObjectIdArray &  |  objIds,
|  const AcStringArray *  |  pEvalIds,
|  AcFd::ConvertFieldToText  |  nOption
)
Warning
Not implemented!
 ACDB_PORT void acdbConvertHslToRgb  |  ( |  const AcGeVector3d &  |  hsl,
|  AcGeVector3d &  |  rgb
)
Warning
Not implemented!
 ACDB_PORT void acdbConvertRgbToHsl  |  ( |  const AcGeVector3d &  |  rgb,
|  AcGeVector3d &  |  hsl
)
Warning
Not implemented!
 Acad::ErrorStatus acdbCopyLayout  |  ( |  const ACHAR *  |  copyname,
|  const ACHAR *  |  newname,
|  AcDbDatabase *  |  pDb = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus acdbDeleteLayout  |  ( |  const ACHAR *  |  delname,
|  AcDbDatabase *  |  pDb = NULL
)
Warning
Not implemented!
 Acad::ErrorStatus acdbDxfOutAs2004  |  ( |  AcDbDatabase *  |  pDb,
|  const ACHAR *  |  fileName,
|  const int  |  precision = 16
)
Warning
Not implemented!
 bool acdbGetArcLengthSymbolPlacement  |  ( |  AcDbObject *  |  pObj,
|  int &  |  nValue
)
Warning
Not implemented!
 ACDB_PORT AcDbUnderlayHost* acdbGetCurrentDgnDocHost  |  ( |   | )
Warning
Not implemented!
 ACDB_PORT AcDbUnderlayHost* acdbGetCurrentDgnHost  |  ( |   | )
Warning
Not implemented!
 ACDB_PORT AcDbUnderlayHost* acdbGetCurrentDwfHost  |  ( |   | )
Warning
Not implemented!
 AcDbObjectId acdbGetCurVportTableRecordId  |  ( |  AcDbDatabase *  |  pDb | )
Warning
Not implemented!
 bool acdbGetDimBreakSize  |  ( |  AcDbObject *  |  pObj,
|  double &  |  dimBreakSize
)
Warning
Not implemented!
 bool acdbGetDimExt1Linetype  |  ( |  AcDbObject *  |  pObj,
|  AcDbObjectId &  |  oidValue
)
Warning
Not implemented!
 bool acdbGetDimExt2Linetype  |  ( |  AcDbObject *  |  pObj,
|  AcDbObjectId &  |  oidValue
)
Warning
Not implemented!
 bool acdbGetDimExtensionLength  |  ( |  AcDbObject *  |  pObj,
|  double &  |  fValue
)
Warning
Not implemented!
 bool acdbGetDimFlipArrow  |  ( |  AcDbObject *  |  pObj,
|  int &  |  nValue
)
Warning
Not implemented!
 bool acdbGetDimFlipArrowWhich  |  ( |  AcDbObject *  |  pObj,
|  int &  |  nValue
)
Warning
Not implemented!
 bool acdbGetDimJogSymbolSize  |  ( |  AcDbObject *  |  pObj,
|  int &  |  dimJagFlag,
|  double &  |  dimJagSize
)
Warning
Not implemented!
 bool acdbGetDimLineLinetype  |  ( |  AcDbObject *  |  pObj,
|  AcDbObjectId &  |  oidValue
)
Warning
Not implemented!
 bool acdbGetDimTolAlign  |  ( |  AcDbObject *  |  pObj,
|  int &  |  dimTolAlignFlag
)
Warning
Not implemented!
 bool acdbGetExemptCheckFlag  |  ( |  AcDbObject *  |  pObj,
|  int &  |  bitFlags
)
Warning
Not implemented!
 bool acdbGetFixedLengthExtLineEnabled  |  ( |  AcDbObject *  |  pObj,
|  int &  |  nValue
)
Warning
Not implemented!
 bool acdbGetLargeRadDimJogAngle  |  ( |  AcDbObject *  |  pObj,
|  double &  |  fJogAngle
)
Warning
Not implemented!
 Acad::ErrorStatus SCENEDLLIMPEXP acdbGetMotionPathDictionary  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode,
|  bool  |  createIfNonExist
)
Warning
Not implemented!
 Acad::ErrorStatus SCENEDLLIMPEXP acdbGetMotionPathDictionary  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode
)
Warning
Not implemented!
 Acad::ErrorStatus SCENEDLLIMPEXP acdbGetNamedPathDictionary  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode,
|  bool  |  createIfNonExist
)
Warning
Not implemented!
 Acad::ErrorStatus SCENEDLLIMPEXP acdbGetNamedPathDictionary  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode
)
Warning
Not implemented!
 AcDbObjectId acdbGetViewportVisualStyle  |  ( |   | )
Warning
Not implemented!
 bool acdbIsInLongTransaction  |  ( |  AcDbObjectId  |  id | )
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbMakeFieldCode  |  ( |  const ACHAR *  |  pszFieldExpr,
|  ACHAR *&  |  pszFieldCode
)
Warning
Not implemented!
 ACDB_PORT Acad::ErrorStatus acdbMakeFieldCode  |  ( |  const ACHAR *  |  pszFieldExpr,
|  ACHAR *&  |  pszFieldCode,
|  const ACHAR *  |  pszEvalId,
|  const ACHAR *  |  pszFormat,
|  const AcHyperlink *  |  pHyperlink
)
Warning
Not implemented!
 Acad::ErrorStatus acdbReloadXrefs  |  ( |  AcDbDatabase *  |  pHostDb,
|  const AcDbObjectIdArray &  |  xrefBlkIds,
|  bool  |  bQuiet = true
)
Warning
Not implemented!
 Acad::ErrorStatus acdbRenameLayout  |  ( |  const ACHAR *  |  oldname,
|  const ACHAR *  |  newname,
|  AcDbDatabase *  |  pDb = NULL
)
Warning
Not implemented!
 bool acdbSetArcLengthSymbolPlacement  |  ( |  AcDbObject *  |  pObj,
|  int  |  nValue,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 Acad::ErrorStatus acdbSetBreak3dQueueForRegen  |  ( |  bool  |   | )
Warning
Not implemented!
 ACDB_PORT AcDbUnderlayHost* acdbSetCurrentDgnDocHost  |  ( |  AcDbUnderlayHost *  |  pHost | )
Warning
Not implemented!
 ACDB_PORT AcDbUnderlayHost* acdbSetCurrentDgnHost  |  ( |  AcDbUnderlayHost *  |  pHost | )
Warning
Not implemented!
 ACDB_PORT AcDbUnderlayHost* acdbSetCurrentDwfHost  |  ( |  AcDbUnderlayHost *  |  pHost | )
Warning
Not implemented!
 bool acdbSetDimBreakSize  |  ( |  AcDbObject *  |  pObj,
|  double  |  dimBreakSize,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetDimExt1Linetype  |  ( |  AcDbObject *  |  pObj,
|  AcDbObjectId  |  oidValue,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetDimExt2Linetype  |  ( |  AcDbObject *  |  pObj,
|  AcDbObjectId  |  oidValue,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetDimExtensionLength  |  ( |  AcDbObject *  |  pObj,
|  double  |  fValue,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetDimFlipArrow  |  ( |  AcDbObject *  |  pObj,
|  int  |  nValue,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetDimFlipArrowWhich  |  ( |  AcDbObject *  |  pObj,
|  int  |  nValue,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetDimJogSymbolSize  |  ( |  AcDbObject *  |  pObj,
|  int  |  dimJagFlag,
|  const double  |  dimJagSize,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetDimLineLinetype  |  ( |  AcDbObject *  |  pObj,
|  AcDbObjectId  |  oidValue,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetDimTolAlign  |  ( |  AcDbObject *  |  pObj,
|  int  |  dimTolAlignFlag,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetExemptCheckFlag  |  ( |  AcDbObject *  |  pObj,
|  int  |  bitFlags
)
Warning
Not implemented!
 bool acdbSetFixedLengthExtLineEnabled  |  ( |  AcDbObject *  |  pObj,
|  int  |  nValue,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 bool acdbSetLargeRadDimJogAngle  |  ( |  AcDbObject *  |  pObj,
|  double  |  fJogAngle,
|  bool  |  autoClearOverride = true
)
Warning
Not implemented!
 Acad::ErrorStatus acdbSetViewportVisualStyle  |  ( |  AcDbObjectId  |  visualStyleId | )
Warning
Not implemented!
 bool acdbSystemRangeToCanonical  |  ( |  int  |  eUnits,
|  const AcString &  |  strIn,
|  AcString &  |  strOut
)
Warning
Not implemented!
 void acdbTriggerAcadOctTreeReclassification  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus acdbUnloadXrefs  |  ( |  AcDbDatabase *  |  pHostDb,
|  const AcDbObjectIdArray &  |  xrefBlkIds,
|  const bool  |  bQuiet = true
)
Warning
Not implemented!
 Acad::ErrorStatus acdbUpdateAllDimensions  |  ( |  AcDbDatabase *  |  pDb | )
Warning
Not implemented!
 Acad::ErrorStatus acdbXBindXrefs  |  ( |  AcDbDatabase *  |  pHostDb,
|  const AcDbObjectIdArray  |  xrefSymbolIds,
|  const bool  |  bInsertBind,
|  const bool  |  bQuiet = true
)
Warning
Not implemented!
 int acedCmdLookup2  |  ( |  const ACHAR *  |  cmdStr,
|  int  |  globalLookup,
|  AcEdCommandStruc *  |  retStruc,
|  int  |  sf = ACRX_CMD_DEFUN
)
Warning
Not implemented!
 Adesk::Boolean acedCreateInternetShortcut  |  ( |  const ACHAR *  |  szURL,
|  const ACHAR *  |  szShortcutPath
)
Warning
Not implemented!
 Adesk::Boolean acedCreateShortcut  |  ( |  void *  |  pvHwndParent,
|  const ACHAR *  |  szLinkPath,
|  const ACHAR *  |  szObjectPath,
|  const ACHAR *  |  szDesc
)
Warning
Not implemented!
 int acedEatCommandThroat  |  ( |  void  |   | )
Warning
Not implemented!
 BOOL acedGetChildFrameSettings  |  ( |  AcChildFrmSettings *  |  pChildFrmSettings,
|  CMDIChildWnd *  |  pWnd
)
Warning
Not implemented!
 BOOL acedGetCurrentColorsEx  |  ( |  AcColorSettings *  |  pColorSettings,
|  AcColorSettingsEx *  |  pColorSettingsEx
)
Warning
Not implemented!
 Acad::ErrorStatus acedGetFullSubentPathsForCurrentSelection  |  ( |  const AcDbObjectId &  |  selectedObject,
|  AcDbFullSubentPathArray &  |  selectedSubentities
)
Warning
Not implemented!
 IDispatch* acedGetIDispatch  |  ( |  BOOL  |  bAddRef | )
Warning
Not implemented!
 HMENU acedGetMenu  |  ( |  LPCTSTR  |  pszAlias | )
Warning
Not implemented!
 BOOL acedGetSystemColors  |  ( |  AcColorSettings *  |  pColorSettings | )
Warning
Not implemented!
 BOOL acedGetSystemColorsEx  |  ( |  AcColorSettings *  |  pColorSettings,
|  AcColorSettingsEx *  |  pColorSettingsEx
)
Warning
Not implemented!
 Adesk::Boolean acedGetUserFavoritesDir  |  ( |  ACHAR *  |  szFavoritesDir | )
Warning
Not implemented!
 int acedNumberOfViewports  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus acedRegisterGripService  |  ( |  AcApDocument *  |  pDoc,
|  AcEdAppGripService *  |  pSvc
)
Warning
Not implemented!
 Acad::ErrorStatus acedRemoveGripService  |  ( |  AcApDocument *  |  pDoc,
|  AcEdAppGripService *  |  pSvc
)
Warning
Not implemented!
 Adesk::Boolean acedResolveInternetShortcut  |  ( |  const ACHAR *  |  szLinkFile,
|  ACHAR *  |  szUrl
)
Warning
Not implemented!
 Adesk::Boolean acedResolveShortcut  |  ( |  void *  |  pvHwndParent,
|  const ACHAR *  |  szLinkPath,
|  ACHAR *  |  szObjectPath
)
Warning
Not implemented!
 Acad::ErrorStatus acedRestoreCurrentView  |  ( |  const AcDbObjectId &  |  namedViewId | )
Warning
Not implemented!
 BOOL acedSetChildFrameSettings  |  ( |  AcChildFrmSettings *  |  pChildFrmSettings,
|  CMDIChildWnd *  |  pWnd
)
Warning
Not implemented!
 Adesk::Boolean acedSetColorDialogTrueColorWithCallback  |  ( |  AcCmColor &  |  color,
|  Adesk::Boolean  |  bAllowMetaColor,
|  const AcCmColor &  |  curLayerColor,
|  AcCm::DialogTabs  |  tabs = (AcCm::DialogTabs)(AcCm::kACITab|AcCm::kTrueColorTab|AcCm::kColorBookTab),
|  AcEdColorDialogCallbackFunction  |  callback = NULL,
|  void *  |  pCallbackData = NULL
)
Warning
Not implemented!
 BOOL acedSetCurrentColorsEx  |  ( |  AcColorSettings *  |  pColorSettings,
|  AcColorSettingsEx *  |  pColorSettingsEx
)
Warning
Not implemented!
 int acedSSSetSubentTypes  |  ( |  const AcArray< AcDb::SubentType > &  |  types | )
Warning
Not implemented!
 int acedSSSubentAdd  |  ( |  const AcDbFullSubentPath &  |  subentity,
|  const ads_name  |  sname,
|  ads_name  |  result
)
Warning
Not implemented!
 int acedSSSubentDel  |  ( |  const AcDbFullSubentPath &  |  subentity,
|  const ads_name  |  ss
)
Warning
Not implemented!
 int acedSSSubentLength  |  ( |  const ads_name  |  sname,
|  long  |  index,
|  long *  |  len
)
Warning
Not implemented!
 int acedSSSubentMemb  |  ( |  const AcDbFullSubentPath &  |  subentity,
|  const ads_name  |  ss
)
Warning
Not implemented!
 int acedSSSubentName  |  ( |  const ads_name  |  ss,
|  long  |  entIndex,
|  long  |  subentIndex,
|  AcDbFullSubentPath &  |  subentity
)
Warning
Not implemented!
 int acedSSSubentNameX  |  ( |  struct resbuf **  |  rbpp,
|  const ads_name  |  ss,
|  const long  |  entIndex,
|  const long  |  subentIndex,
|  unsigned int  |  flags
)
Warning
Not implemented!
 AcDbObjectId acedViewportIdFromNumber  |  ( |  int  |  nVpNum | )
Warning
Not implemented!
 ACFD_PORT BOOL AcFdExtractData  |  ( |  AcDbField *  |  pField,
|  ACHAR *&  |  pszSheetSetFile,
|  ACHAR *&  |  pszSheetSetId,
|  ACHAR *&  |  pszCompName,
|  ACHAR *&  |  pszCompId,
|  ACHAR *&  |  pszPropName
)
Warning
Not implemented!
 ACFD_PORT BOOL AcFdExtractData  |  ( |  AcDbField *  |  pField,
|  AcDbObjectId &  |  objId,
|  ACHAR *&  |  pszPropName
)
Warning
Not implemented!
 ACFD_PORT BOOL AcFdMakeFieldCode  |  ( |  const AcDbObjectId &  |  objId,
|  AcDbEvalNodeId  |  blockParamId,
|  const ACHAR *  |  pszPropOrCoectionName,
|  AcFdEval::ObjectFieldOption  |  nOption,
|  const ACHAR *  |  pszFormat,
|  AcHyperlink *  |  pHyperlink,
|  ACHAR *&  |  pszFieldCode
)
Warning
Not implemented!
 ACFD_PORT BOOL AcFdMakeFieldCode  |  ( |  IZcSmDatabase *  |  pSmDb,
|  IZcSmSheetSet *  |  pSmSheetSet,
|  IZcSmComponent *  |  pSmComp,
|  const ACHAR *  |  pszCompName,
|  const ACHAR *  |  pszPropName,
|  AcFdEval::SheetSetFieldOption  |  nOption,
|  const ACHAR *  |  pszFormat,
|  ACHAR *&  |  pszFieldCode
)
Warning
Not implemented!
 ACFD_PORT BOOL AcFdMakeFieldCode  |  ( |  const AcDbObjectId &  |  tableId,
|  const AcDbObjectId &  |  targetTableId,
|  AcFdEval::ExpressionFieldOption  |  nOption,
|  const AcCellRangeArray &  |  cellRanges,
|  const ACHAR *  |  pszFormat,
|  AcHyperlink *  |  pHyperlink,
|  ACHAR *&  |  pszFieldCode
)
Warning
Not implemented!
 ACFDUI_PORT CAcFdUiFieldManager* AcFdUiGetFieldManager  |  ( |  void  |   | )
Warning
Not implemented!
 bool acgiIsValidClipBoundary  |  ( |  const AcGePoint2dArray &  |  pts | )
Warning
Not implemented!
 Adesk::Boolean acgsDisplayImage  |  ( |  int  |  viewportNumber,
|  long  |  originLeft,
|  long  |  originTop,
|  int  |  imageWidth,
|  int  |  imageHeight,
|  void const *  |  imageData,
|  int  |  hasTransparency
)
Warning
Not implemented!
 Adesk::Boolean acgsGetDisplayInfo  |  ( |  int &  |  drawingWidth,
|  int &  |  drawingHeight,
|  int &  |  aspectWidth,
|  int &  |  aspectHeight
)
Warning
Not implemented!
 bool acReadAnsiCharFromCFile  |  ( |  CFile *  |  pCFile,
|  wchar_t &  |  wch,
|  AdCharFormatter *  |  pChFmtr
)
inline
Warning
Not implemented!
 bool acReadCIFFromCFile  |  ( |  CFile *  |  pCFile,
|  wchar_t &  |  wch
)
inline
Warning
Not implemented!
 bool acReadUtf16CharFromCFile  |  ( |  CFile *  |  pCFile,
|  wchar_t &  |  wch,
|  AdCharFormatter *  |  pChFmtr
)
inline
Warning
Not implemented!
 bool acReadUtf8CharFromCFile  |  ( |  CFile *  |  pCFile,
|  wchar_t &  |  wch,
|  AdCharFormatter *  |  pChFmtr
)
inline
Warning
Not implemented!
 bool acrxApplicationIsLocked  |  ( |  const ACHAR *  |  modulename | )
Warning
Not implemented!
 bool acrxIsAppMDIAware  |  ( |  const ACHAR *  |  moduleName | )
Warning
Not implemented!
 void acWriteWCharToCFile  |  ( |  wchar_t  |  wch,
|  CFile *  |  pFile,
|  unsigned  |  nFmt,
|  bool  |  bUseCIF
)
Warning
Not implemented!
 void ADUI_PORT AdUiEnableDockControlBars  |  ( |  BOOL  |  bEnable,
|  CStringArray *  |  pToolIds = NULL
)
For internal use only.
 const wchar_t * AcString::constPtr  |  ( |   | ) |   const
inline
Warning
Not implemented!
 void deleteAcDbSummaryInfoManager  |  ( |   | )
inline
Warning
Not implemented!
 AdHostImageAppServices* getAdHostImageAppServices  |  ( |   | )
Warning
Not implemented!
 Acad::ErrorStatus SCENEDLLIMPEXP getBackgroundDictionary  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode,
|  bool  |  createIfNonExist
)
Warning
Not implemented!
 Acad::ErrorStatus SCENEDLLIMPEXP getBackgroundDictionary  |  ( |  AcDbDatabase *  |  pDb,
|  AcDbDictionary *&  |  pDict,
|  AcDb::OpenMode  |  mode
)
Warning
Not implemented!
 Acad::ErrorStatus getTableStyleNameFromDbById  |  ( |  const AcDbObjectId &  |  objId,
|  ACHAR *&  |  pName
)
Warning
Not implemented!
 void initAcDbSummaryInfoManager  |  ( |   | )
inline
Warning
Not implemented!
 bool operator!=  |  ( |  wchar_t  |  wch,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator!=  |  ( |  const CStringW &  |  csw,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 AcString operator+  |  ( |  wchar_t  |  wch,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 AcString operator+  |  ( |  const wchar_t *  |  pwsz,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator<  |  ( |  wchar_t  |  wch,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator<  |  ( |  const wchar_t *  |  pwsz,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator<  |  ( |  const CStringW &  |  csw,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator<=  |  ( |  wchar_t  |  wch,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator<=  |  ( |  const wchar_t *  |  pwsz,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator<=  |  ( |  const CStringW &  |  csw,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator==  |  ( |  wchar_t  |  wch,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator==  |  ( |  const wchar_t *  |  pwsz,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator==  |  ( |  const CStringW &  |  csw,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator>  |  ( |  wchar_t  |  wch,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator>  |  ( |  const wchar_t *  |  pwsz,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator>  |  ( |  const CStringW &  |  csw,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator>=  |  ( |  wchar_t  |  wch,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator>=  |  ( |  const wchar_t *  |  pwsz,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 bool operator>=  |  ( |  const CStringW &  |  csw,
|  const AcString &  |  acs
)
inline
Warning
Not implemented!
 Acad::ErrorStatus removeSSgetFilterInputContextReactor  |  ( |  AcApDocument *  |  pDoc,
|  AcEdSSGetFilter *  |  pFilter
)
Warning
Not implemented!
 void ucsNormalVector  |  ( |  AcGeVector3d &  |  ucsNormalVec | )
Warning
Not implemented!
 AcGeVector3d ucsXDir  |  ( |   | )
Warning
Not implemented!
 AcGeVector3d ucsYDir  |  ( |   | )
Warning
Not implemented!