Classes | Macros | Functions
AcGi Classes
 Classes
class  | AcGiColorRGB
class  | AcGiColorRGBA
class  | AcGiCommonDraw
class  | AcGiContext
class  | AcGiContextualColors
class  | AcGiContextualColors2
class  | AcGiDisplayStyle
class  | AcGiDistantLightTraits
class  | AcGiDistantLightTraits2
class  | AcGiDrawable
class  | AcGiDrawableTraits
class  | AcGiEdgeData
class  | AcGiEdgeStyle
class  | AcGiFaceData
class  | AcGiFaceStyle
class  | AcGiGenericTexture
class  | AcGiGeometry
class  | AcGiGradientBackgroundTraits
class  | AcGiGroundPlaneBackgroundTraits
class  | AcGiImageBackgroundTraits
class  | AcGiImageFileTexture
class  | AcGiImageTexture
class  | AcGiLightAttenuation
class  | AcGiLightTraits
class  | AcGiLineAttributes
class  | AcGiLinetypeEngine
class  | AcGiMapper
class  | AcGiMarbleTexture
class  | AcGiMaterialColor
class  | AcGiMaterialMap
class  | AcGiMaterialTexture
class  | AcGiMaterialTraits
class  | AcGiMaterialTraits2
class  | AcGiMentalRayRenderSettingsTraits
class  | AcGiMentalRayRenderSettingsTraits2
class  | AcGiNonEntityTraits
class  | AcGiPointLightTraits
class  | AcGiPointLightTraits2
class  | AcGiProceduralTexture
class  | AcGiRenderEnvironmentTraits
class  | AcGiRenderSettingsTraits
class  | AcGiShadowParameters
class  | AcGiShadowParameters2
class  | AcGiSkyBackgroundTraits
class  | AcGiSkyParameters
class  | AcGiSolidBackgroundTraits
class  | AcGiSpotLightTraits
class  | AcGiSpotLightTraits2
class  | AcGiStandardLightTraits
class  | AcGiSubEntityTraits
class  | AcGiTextEngine
class  | AcGiTextStyle
class  | AcGiToneOperatorParameters
class  | AcGiVariant
class  | AcGiVertexData
class  | AcGiViewport
class  | AcGiViewportDraw
class  | AcGiViewportGeometry
class  | AcGiViewportTraits
class  | AcGiViewportTraits2
class  | AcGiVisualStyle
class  | AcGiVisualStyleTraits
class  | AcGiWebLightTraits
class  | AcGiWoodTexture
class  | AcGiWorldDraw
class  | AcGiWorldGeometry
class  | AcGsManager
 Macros
 #define  | AcGiSelectionMarkerACADReserveEnd (AcGiSelectionMarkerACADReserveStart + 65535)
 #define  | AcGiSelectionMarkerACADReserveStart (-2147483647 - 1)
 #define  | AcGiSelectionMarkerACADSelectionPreviewOff (AcGiSelectionMarkerACADReserveStart + 1)
 #define  | AcGiSelectionMarkerACADSelectionPreviewOn (AcGiSelectionMarkerACADReserveStart + 2)
 Functions
 virtual void  | AcGiDrawableTraits::addLight (const AcDbObjectId &lightId)
virtual void  | AcGiNonEntityTraits::addLight (const AcDbObjectId &id)
virtual Adesk::UInt16  | AcGiNonEntityTraits::color (void) const
 virtual Adesk::UInt32  | AcGiSubEntityTraits::drawFlags (void) const
 virtual Acad::ErrorStatus  | AcGiSubEntityTraits::edgeStyleOverride (AcGiEdgeStyleMask &mask, AcGiEdgeStyle &edgeStyle) const
virtual AcGiFillType  | AcGiNonEntityTraits::fillType (void) const
virtual AcDbObjectId  | AcGiNonEntityTraits::layerId (void) const
virtual AcDbObjectId  | AcGiNonEntityTraits::lineTypeId (void) const
virtual double  | AcGiNonEntityTraits::lineTypeScale (void) const
virtual AcDb::LineWeight  | AcGiNonEntityTraits::lineWeight (void) const
 virtual const AcGiMapper *  | AcGiSubEntityTraits::mapper (void) const
 virtual AcDbObjectId  | AcGiSubEntityTraits::materialId (void) const
virtual AcDbObjectId  | AcGiNonEntityTraits::materialId (void) const
 AcGiColorRGB  | operator* (const AcGiColorRGB &c1, const AcGiColorRGB &c2)
 AcGiColorRGB  | operator* (const AcGiColorRGB &c, double s)
 AcGiColorRGB  | operator* (double s, const AcGiColorRGB &c)
 AcGiColorRGBA  | operator* (const AcGiColorRGBA &c1, const AcGiColorRGBA &c2)
 AcGiColorRGBA  | operator* (const AcGiColorRGBA &c, double s)
 AcGiColorRGBA  | operator* (double s, const AcGiColorRGBA &c)
 AcGiColorRGB  | operator+ (const AcGiColorRGB &c1, const AcGiColorRGB &c2)
 AcGiColorRGBA  | operator+ (const AcGiColorRGBA &c1, const AcGiColorRGBA &c2)
 virtual bool  | AcGiMaterialTexture::operator== (const AcGiMaterialTexture &texture) const
 virtual bool  | AcGiSubEntityTraits::sectionable (void) const
 virtual bool  | AcGiSubEntityTraits::selectionGeom (void) const
virtual bool  | AcGiNonEntityTraits::selectionGeom (void) const
virtual void  | AcGiNonEntityTraits::setColor (const Adesk::UInt16 color)
 virtual Acad::ErrorStatus  | AcGiSubEntityTraits::setDrawFlags (Adesk::UInt32 flags)
 virtual Acad::ErrorStatus  | AcGiSubEntityTraits::setEdgeStyleOverride (AcGiEdgeStyleMask mask, const AcGiEdgeStyle &edgeStyle)
virtual void  | AcGiNonEntityTraits::setFillType (const AcGiFillType fillType)
virtual void  | AcGiNonEntityTraits::setLayer (const AcDbObjectId layerId)
virtual void  | AcGiNonEntityTraits::setLineType (const AcDbObjectId linetypeId)
virtual void  | AcGiNonEntityTraits::setLineTypeScale (double dScale)
virtual void  | AcGiNonEntityTraits::setLineWeight (const AcDb::LineWeight lw)
 virtual void  | AcGiSubEntityTraits::setMapper (const AcGiMapper *mapper)
 virtual void  | AcGiSubEntityTraits::setMaterial (const AcDbObjectId materialId)
virtual void  | AcGiNonEntityTraits::setMaterial (const AcDbObjectId matId)
 virtual void  | AcGiSubEntityTraits::setSectionable (bool bSectionable)
 virtual void  | AcGiSubEntityTraits::setSelectionGeom (bool bSelectionflag)
virtual void  | AcGiNonEntityTraits::setSelectionGeom (bool bSelectionflag)
virtual void  | AcGiNonEntityTraits::setSelectionMarker (const Adesk::LongPtr markerId)
 virtual Acad::ErrorStatus  | AcGiSubEntityTraits::setShadowFlags (ShadowFlags flags)
virtual void  | AcGiNonEntityTraits::setThickness (double thickness)
virtual void  | AcGiNonEntityTraits::setTrueColor (const AcCmEntityColor &color)
virtual void  | AcGiNonEntityTraits::setupForEntity (AcDbEntity *pEntity)
 virtual void  | AcGiSubEntityTraits::setVisualStyle (const AcDbObjectId visualStyleId)
 virtual ShadowFlags  | AcGiSubEntityTraits::shadowFlags (void) const
virtual double  | AcGiNonEntityTraits::thickness (void) const
virtual AcCmEntityColor  | AcGiNonEntityTraits::trueColor (void) const
 virtual AcDbObjectId  | AcGiSubEntityTraits::visualStyle (void) const
Detailed Description
Function Documentation
 void AcGiNonEntityTraits::addLight  |  ( |  const AcDbObjectId &  |  id | )
inlinevirtual
Warning
Not implemented!
Reimplemented from AcGiDrawableTraits.
 Adesk::UInt16 AcGiNonEntityTraits::color  |  ( |  void  |   | ) |   const
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 AcGiFillType AcGiNonEntityTraits::fillType  |  ( |  void  |   | ) |   const
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 AcDbObjectId AcGiNonEntityTraits::layerId  |  ( |  void  |   | ) |   const
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 AcDbObjectId AcGiNonEntityTraits::lineTypeId  |  ( |  void  |   | ) |   const
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 double AcGiNonEntityTraits::lineTypeScale  |  ( |  void  |   | ) |   const
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 AcDb::LineWeight AcGiNonEntityTraits::lineWeight  |  ( |  void  |   | ) |   const
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 AcDbObjectId AcGiNonEntityTraits::materialId  |  ( |  void  |   | ) |   const
inlinevirtual
Warning
Not implemented!
Reimplemented from AcGiSubEntityTraits.
 bool AcGiNonEntityTraits::selectionGeom  |  ( |  void  |   | ) |   const
inlinevirtual
Warning
Not implemented!
Reimplemented from AcGiSubEntityTraits.
 void AcGiNonEntityTraits::setColor  |  ( |  const Adesk::UInt16  |  color | )
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 void AcGiNonEntityTraits::setFillType  |  ( |  const AcGiFillType  |  fillType | )
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 void AcGiNonEntityTraits::setLayer  |  ( |  const AcDbObjectId  |  layerId | )
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 void AcGiNonEntityTraits::setLineType  |  ( |  const AcDbObjectId  |  linetypeId | )
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 void AcGiNonEntityTraits::setLineTypeScale  |  ( |  double  |  dScale | )
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 void AcGiNonEntityTraits::setLineWeight  |  ( |  const AcDb::LineWeight  |  lw | )
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 void AcGiNonEntityTraits::setMaterial  |  ( |  const AcDbObjectId  |  matId | )
inlinevirtual
Warning
Not implemented!
Reimplemented from AcGiSubEntityTraits.
 void AcGiNonEntityTraits::setSelectionGeom  |  ( |  bool  |  bSelectionflag | )
inlinevirtual
Warning
Not implemented!
Reimplemented from AcGiSubEntityTraits.
 void AcGiNonEntityTraits::setSelectionMarker  |  ( |  const Adesk::LongPtr  |  markerId | )
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 void AcGiNonEntityTraits::setThickness  |  ( |  double  |  thickness | )
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 void AcGiNonEntityTraits::setTrueColor  |  ( |  const AcCmEntityColor &  |  color | )
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 void AcGiNonEntityTraits::setupForEntity  |  ( |  AcDbEntity *  |  pEntity | )
inlinevirtual
Warning
Not implemented!
Reimplemented from AcGiDrawableTraits.
 double AcGiNonEntityTraits::thickness  |  ( |  void  |   | ) |   const
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.
 AcCmEntityColor AcGiNonEntityTraits::trueColor  |  ( |  void  |   | ) |   const
inlinevirtual
Warning
Not implemented!
Implements AcGiSubEntityTraits.