Public Types | Public Attributes | List of all members
AcApDocManager::DocOpenParams Struct Reference
 Public Types
enum  | {
 kDisallowReadOnly = 0x01, kRequireReadOnly = 0x02, kFileNameArgIsUnicode = 0x04, kViewNameArgIsUnicode = 0x08,
 kUseUIOnErrors = 0x10
 }
enum  | {
 kUnknown = 0, kDefaultView = 1, kLayoutName = 2, kViewName = 3,
 kLayoutHandle = 4, kViewHandle = 5, kViewWorldCoords = 6
 }
 Public Attributes
 union {
 const ACHAR * mpszFileName
 const wchar_t * mpwszFileName
};
 union {
 const double * mpCoords
 const ACHAR * mpszViewName
 const wchar_t * mpwszViewName
};
 int  | mnFlags
 BYTE  | mnInitialViewType
 int  | mnUnused
 void *  | mpUnused
 const wchar_t *  | mpwszPassword
 The documentation for this struct was generated from the following file:
acdocman.h