Public Attributes | List of all members
AcDbMTextFragment Struct Reference
Structs
 Public Attributes
 ACHAR *  | bigfont
 bool  | bold
 double  | capsHeight
 AcCmEntityColor  | color
 AcGeVector3d  | direction
 AcGePoint2d  | extents
 ACHAR *  | font
 ACHAR *  | fontname
 bool  | italic
 bool  | lineBreak
 AcGePoint3d  | location
 AcGeVector3d  | normal
 double  | obliqueAngle
 unsigned  | overlined:1
 AcGePoint3d  | overPoints [2]
 unsigned  | stackBottom:1
 unsigned  | stackTop:1
 AcGePoint3d  | strikePoints [2]
 unsigned  | strikethrough:1
 ACHAR *  | text
 double  | trackingFactor
 unsigned  | underlined:1
 AcGePoint3d  | underPoints [2]
 double  | widthFactor
 The documentation for this struct was generated from the following file:
dbmtext.h