Public Attributes | List of all members
AcGiClipBoundary Struct Reference
Structs
 Public Attributes
 AcGePoint2dArray  | m_aptPoints
 Adesk::Boolean  | m_bClippingBack
 Adesk::Boolean  | m_bClippingFront
 Adesk::Boolean  | m_bDrawBoundary
 double  | m_dBackClipZ
 double  | m_dFrontClipZ
 AcGePoint3d  | m_ptPoint
 AcGeVector3d  | m_vNormal
 AcGeMatrix3d  | m_xInverseBlockRefXForm
 AcGeMatrix3d  | m_xToClipSpace
 The documentation for this struct was generated from the following file:
acgi.h