Public Attributes | List of all members
AcEdCommandStruc Struct Reference
Structs
 Public Attributes
 void *  | app
 AcEdCommand *  | cmd
 AcRxFunctionPtr  | fcnAddr
 long  | flags
 HINSTANCE  | hResHandle
 The documentation for this struct was generated from the following file:
accmd.h