Public Attributes | List of all members
AcGsClientViewInfo Struct Reference
 Public Attributes
 LONG_PTR  | acadWindowId
 AcGiContextualColors *  | contextColors
 LONG_PTR  | viewportId
 LONG_PTR  | viewportObjectId
 The documentation for this struct was generated from the following file:
gs.h