Public Attributes | List of all members
_ARXCOMMAND_ENTRY Struct Reference
 Public Attributes
 Adesk::Int32  | commandFlags
 UINT  | localNameID
 AcRxFunctionPtr  | pCmdFct
 const ACHAR *  | pszCmdGlobalName
 const ACHAR *  | pszCmdGroupName
 const ACHAR *  | pszCmdLocalName
 AcEdUIContext *  | pUIContext
 The documentation for this struct was generated from the following file:
arxEntryPoint.h