Public Types | Public Attributes | List of all members
AcGiRequestScanLines Struct Reference
Structs
 Public Types
enum  | IEColorSystem { kBitonal, kCMY, kCMYK, kRGB }
enum  | IEDitherMethod { kIEAnyPalette, kCustomDithering, kCustomDitheringMethod }
enum  | ImagePaletteType { kFromDevice, kFromIeWholeImage }
 Public Attributes
 union {
 Adesk::Int16 mBackgroundIndex
 Adesk::Int8 mBackgroundRGB [3]
}  | mBackgroundColor
 Adesk::Int16  | mColorDepth
 union {
 Adesk::Int16 mEntityIndex
 Adesk::Int8 mEntityRGB [3]
}  | mEntityColor
 AcGiImageOrg  | mImageOrg
 AcGiImageOrient  | mImageOrient
 Adesk::Int16  | mIsDisplay
 AcGePoint2d  | mLowerLeft
 Adesk::Int32  | mLowerRightPt [2]
 Adesk::UInt32  | mnContours
 short  | mnThisChunk
 short  | mnTotalChunks
 Adesk::Int32  | mNumRows
 Adesk::Int32  | mOrigin [2]
 Adesk::Int32  | mPaletteIncarnation
 ImagePaletteType  | mPaletteType
 Adesk::Int32 const *  | mpBoundaryPoints
 Adesk::Int32 const *  | mpCounts
 void *  | mpDataBuffer
 void *  | mpImageId
 Adesk::UInt32  | mPixelMaxX
 Adesk::UInt32  | mPixelMaxY
 Adesk::UInt32  | mPixelMinX
 Adesk::UInt32  | mPixelMinY
 AcGeMatrix2d  | mPixelToDc
 Adesk::Int8 *  | mpPalette
 double  | mRasterRatio
 AcGiRotationFilterType  | mRotationFilterType
 Adesk::Int32  | mRowWidth
 AcGiScaleFilterType  | mScaleFilterType
 AcGiScaleType  | mScalingType
 union {
 Adesk::Int16 mTransparentIndex
 Adesk::Int8 mTransparentRGB [3]
}  | mTransparentColor
 Adesk::Int32  | mUpperLeftPt [2]
 AcGePoint2d  | mUpperRight
 Adesk::Int16  | mWindowId
 The documentation for this struct was generated from the following file:
acgi.h