Public Attributes | List of all members
AcCmEntityColor::RGBM Union Reference
 Public Attributes
 struct {
 Adesk::UInt8 blue
 Adesk::UInt8 colorMethod
 Adesk::UInt8 green
 Adesk::UInt8 red
};
 Adesk::Int16  | indirect
 Adesk::UInt32  | whole
 The documentation for this union was generated from the following file:
dbcolor.h