中望CAD 2026 ZRX移植指南
内部接口使用
和其他CAD平台一样，中望CAD导出了一些内部使用的接口，开发者可以通过技术手段使用这些内部接口，中望CAD对常用的内部接口进行了兼容性处理，通常仅需包含udocapi.h即可使用其中的内部函数(如下)。
#include "udocapi.h"
void test()
{
	extern Adesk::Boolean acedPostCommand(const ACHAR * cmd);
	Adesk::Boolean retValue = acedPostCommand(_T("about\n"));
}
ARX中的内部接口
常用ARX内部函数原型对比(ObjectARX2024和ZRX2026)
 ARX函数名 |  ARX函数原型 |  ARX库文件 |  ZRX函数原型 |  ZRX库文件
 acedPostCommand |  Adesk::Boolean acedPostCommand(const ACHAR* cmd); |  accore.lib |  ZSoft::Boolean zcedPostCommand(const ZTCHAR* cmd); |  ZWCAD.lib
 acedGetCurrentView |  Acad::ErrorStatus acedGetCurrentView(AcDbViewTableRecord& acVTRecord); |  accore.lib |  Zcad::ErrorStatus zcedGetCurrentView(ZcDbViewTableRecord& zcVTRecord); |  ZWCAD.lib
 acedLineWeightDialog |  bool acedLineWeightDialog(AcDb::LineWeight curlweight, bool bIncludeByLyerByBlk, AcDb::LineWeight& selectedlweight); |  acad.lib |  bool zcedLineWeightDialog(ZcDb::LineWeight curlweight, bool bIncludeByLyerByBlk, ZcDb::LineWeight& selectedlweight); |  ZWCAD.lib
 acedLineWeightDialog |  bool acedLineWeightDialog(AcDb::LineWeight curlweight, bool bIncludeByLyerByBlk, AcDb::LineWeight& selectedlweight, AcDbDatabase* pDb, HWND hParentWindow); |  acad.lib |  bool zcedLineWeightDialog(ZcDb::LineWeight curlweight, bool bIncludeByLyerByBlk, ZcDb::LineWeight& selectedlweight, ZcDbDatabase* pDb, HWND hParentWindow); |  ZWCAD.lib
 acedPlotStyleDialog |  bool acedPlotStyleDialog(BOOL bIsSelectPlotStyle, BOOL bByLayerBlock, ACHAR*& szPlotStyle); |  acad.lib |  bool zcedPlotStyleDialog(BOOL bIsSelectPlotStyle, BOOL bByLayerBlock, ZTCHAR*& szPlotStyle); |  ZWCAD.lib
 acedGetPredefinedPattens |  bool acedGetPredefinedPattens(AcStringArray& arrPredefinedPattern); |  acad.lib |  bool zcedGetPredefinedPattens(ZcStringArray& arrPredefinedPattern); |  ZWCAD.lib
 acedGetRecentRedoHistory |  extern "C" int acedGetRecentRedoHistory(AcStringArray&); |  accore.lib |  extern "C" int zcedGetRecentRedoHistory(ZcStringArray&); |  ZWCAD.lib
 acedGetRecentUndoHistory |  extern "C" int acedGetRecentUndoHistory(AcStringArray&); |  accore.lib |  extern "C" int zcedGetRecentUndoHistory(ZcStringArray&); |  ZWCAD.lib
 acedHatchPalletteDialog |  bool acedHatchPalletteDialog(const ACHAR* pszCurrentPattern, bool bIsShowCustomPattern, ACHAR*& prefchNewSelectedPattern); |  acad.lib |  bool zcedHatchPalletteDialog(const ZTCHAR* pszCurrentPattern, bool bIsShowCustomPattern, ZTCHAR*& prefchNewSelectedPattern); |  ZWCAD.lib
 acedNEntSelPEx |  int acedNEntSelPEx(const ACHAR* str, ads_name entres, ads_point ptres, int pickflag, ads_matrix xformres, struct resbuf** refstkres, unsigned int uTransSpaceFlag, Adesk::GsMarker* gsmarker); |  accore.lib |  int zcedNEntSelPEx(const ZTCHAR* str, zds_name entres, zds_point ptres, int pickflag, zds_matrix xformres, struct resbuf** refstkres, unsigned int uTransSpaceFlag, ZSoft::GsMarker* gsmarker); |  ZWCAD.lib
 acedRegenLayers |  void acedRegenLayers(const AcDbObjectIdArray& layerIds, int nParam1, int nParam2); |  accore.lib |  void zcedRegenLayers(const ZcDbObjectIdArray& layerIds, int nParam1, int nParam2); |  ZWCAD.lib
 acgsSetLineWeightDisplay |  void acgsSetLineWeightDisplay(AcGsDevice* gsDevice, bool val); |  accore.lib |  void zcgsSetLineWeightDisplay(ZcGsDevice* gsDevice, bool val); |  ZWCAD.lib
 OPMxemark |  void OPMxemark(LONG_PTR** pseg); |  accore.lib |  void ZwOPMxemark(LONG_PTR** pseg); |  ZWCAD.lib
 OPMxmark |  void OPMxmark(double x, double y, double z, LONG_PTR** pseg); |  accore.lib |  void ZwOPMxmark(double x, double y, double z, LONG_PTR** pseg); |  ZWCAD.lib
 ExtensionLoader_IsLoaded |  bool ExtensionLoader_IsLoaded(const ACHAR * fname); |  acdbmgd.lib |  bool ExtensionLoader_IsLoaded(const ACHAR * fname); |  ZwManaged.lib
 LoadManagedDll |  Acad::ErrorStatus LoadManagedDll(const ACHAR * fname); |  acdbmgd.lib |  Zcad::ErrorStatus LoadManagedDll(const ZTCHAR * fname); |  ZwManaged.lib
 purgeDatabase |  Acad::ErrorStatus purgeDatabase(AcDbDatabase* pDb); |  accore.lib |  Zcad::ErrorStatus purgeDatabase(ZcDbDatabase* pDb); |  ZwDatabase.lib
ZRX中特有的内部接口
常用ZRX内部函数及其说明
 ZRX函数名 |  ZRX函数原型 |  ZRX库文件 |  ZRX函数说明
 zcmdRecordCRAddCallBack |  void zcmdRecordCRAddCallBack(void (*cbfunc)(const ZTCHAR*)); |  ZWCAD.lib |  添加CR回调(回调函数参数为生成dmp后的文件路径)
 zcmdRecordCRRemoveCallBack |  void zcmdRecordCRRemoveCallBack(void (*cbfunc)(const ZTCHAR*)); |  ZWCAD.lib |  移除CR回调(回调函数参数为生成dmp后的文件路径)
 zwGetMainFrameCaptionTitle |  ZTCHAR* zwGetMainFrameCaptionTitle(); |  ZWCAD.lib |  获取主框架标题文本
 zwSetMainFrameCaptionTitle |  void zwSetMainFrameCaptionTitle(ZTCHAR const* pszCaptionTitle); |  ZWCAD.lib |  设置主框架标题文本
 GetViewImage |  HBITMAP GetViewImage(ZcGsView* pView, int width, int height); |  ZWCAD.lib |  获取视图图像
 zwExportLayout |  ZcString zwExportLayout(ZcDbDatabase*& pDb, bool bUsedForDotNet, ZTCHAR* DeFaultPath); |  ZWCAD.lib |  布局导模型